[
    {
        "1": {
            "1": {
                "hadithNumber": "Hadith #1",
                "title": "Al-Kafi - Volume 8: Letter of Abi Abdillah (a.s) to a group of Shia",
                "arabicText": "مُحَمَّدُ بْنُ يَعْقُوبَ الْكُلَيْنِيُّ قَالَ حَدَّثَنِي عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ فَضَّالٍ عَنْ حَفْصٍ الْمُؤَذِّنِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ إِسْمَاعِيلَ بْنِ جَابِرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ كَتَبَ بِهَذِهِ الرِّسَالَةِ إِلَى أَصْحَابِهِ وَ أَمَرَهُمْ بِمُدَارَسَتِهَا وَ النَّظَرِ فِيهَا وَ تَعَاهُدِهَا وَ الْعَمَلِ بِهَا فَكَانُوا يَضَعُونَهَا فِي مَسَاجِدِ بُيُوتِهِمْ فَإِذَا فَرَغُوا مِنَ الصَّلَاةِ نَظَرُوا فِيهَا قَالَ وَ حَدَّثَنِي الْحَسَنُ بْنُ مُحَمَّدٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدِ بْنِ مَالِكٍ الْكُوفِيِّ عَنِ الْقَاسِمِ بْنِ الرَّبِيعِ الصَّحَّافِ عَنْ إِسْمَاعِيلَ بْنِ مَخْلَدٍ السَّرَّاجِ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ خَرَجَتْ هَذِهِ الرِّسَالَةُ مِنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) إِلَى أَصْحَابِهِ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ أَمَّا بَعْدُ فَاسْأَلُوا رَبَّكُمُ الْعَافِيَةَ وَ عَلَيْكُمْ بِالدَّعَةِ وَ الْوَقَارِ وَ السَّكِينَةِ وَ عَلَيْكُمْ بِالْحَيَاءِ وَ التَّنَزُّهِ عَمَّا تَنَزَّهَ عَنْهُ الصَّالِحُونَ قَبْلَكُمْ وَ عَلَيْكُمْ بِمُجَامَلَةِ أَهْلِ الْبَاطِلِ تَحَمَّلُوا الضَّيْمَ مِنْهُمْ وَ إِيَّاكُمْ وَ مُمَاظَّتَهُمْ دِينُوا فِيمَا بَيْنَكُمْ وَ بَيْنَهُمْ إِذَا أَنْتُمْ جَالَسْتُمُوهُمْ وَ خَالَطْتُمُوهُمْ وَ نَازَعْتُمُوهُمُ الْكَلَامَ فَإِنَّهُ لَا بُدَّ لَكُمْ مِنْ مُجَالَسَتِهِمْ وَ مُخَالَطَتِهِمْ وَ مُنَازَعَتِهِمُ الْكَلَامَ بِالتَّقِيَّةِ الَّتِي أَمَرَكُمُ اللَّهُ أَنْ تَأْخُذُوا بِهَا فِيمَا بَيْنَكُمْ وَ بَيْنَهُمْ فَإِذَا ابْتُلِيتُمْ بِذَلِكَ مِنْهُمْ فَإِنَّهُمْ سَيُؤْذُونَكُمْ وَ تَعْرِفُونَ فِي وُجُوهِهِمُ الْمُنْكَرَ وَ لَوْ لَا أَنَّ اللَّهَ تَعَالَى يَدْفَعُهُمْ عَنْكُمْ لَسَطَوْا بِكُمْ وَ مَا فِي صُدُورِهِمْ مِنَ الْعَدَاوَةِ وَ الْبَغْضَاءِ أَكْثَرُ مِمَّا يُبْدُونَ لَكُمْ مَجَالِسُكُمْ وَ مَجَالِسُهُمْ وَاحِدَةٌ وَ أَرْوَاحُكُمْ وَ أَرْوَاحُهُمْ مُخْتَلِفَةٌ لَا تَأْتَلِفُ لَا تُحِبُّونَهُمْ أَبَداً وَ لَا يُحِبُّونَكُمْ غَيْرَ أَنَّ اللَّهَ تَعَالَى أَكْرَمَكُمْ بِالْحَقِّ وَ بَصَّرَكُمُوهُ وَ لَمْ يَجْعَلْهُمْ مِنْ أَهْلِهِ فَتُجَامِلُونَهُمْ وَ تَصْبِرُونَ عَلَيْهِمْ وَ هُمْ لَا مُجَامَلَةَ لَهُمْ وَ لَا صَبْرَ لَهُمْ عَلَى شَيْ‏ءٍ وَ حِيَلُهُمْ وَسْوَاسُ بَعْضِهِمْ إِلَى بَعْضٍ فَإِنَّ أَعْدَاءَ اللَّهِ إِنِ اسْتَطَاعُوا صَدُّوكُمْ عَنِ الْحَقِّ فَيَعْصِمُكُمْ اللَّهُ مِنْ ذَلِكَ فَاتَّقُوا اللَّهَ وَ كُفُّوا أَلْسِنَتَكُمْ إِلَّا مِنْ خَيْرٍ وَ إِيَّاكُمْ أَنْ تُزْلِقُوا أَلْسِنَتَكُمْ بِقَوْلِ الزُّورِ وَ الْبُهْتَانِ وَ الْإِثْمِ وَ الْعُدْوَانِ فَإِنَّكُمْ إِنْ كَفَفْتُمْ أَلْسِنَتَكُمْ عَمَّا يَكْرَهُهُ اللَّهُ مِمَّا نَهَاكُمْ عَنْهُ كَانَ خَيْراً لَكُمْ عِنْدَ رَبِّكُمْ مِنْ أَنْ تُزْلِقُوا أَلْسِنَتَكُمْ بِهِ فَإِنَّ زَلَقَ اللِّسَانِ فِيمَا يَكْرَهُ اللَّهُ وَ مَا يَنْهَى عَنْهُ مَرْدَاةٌ لِلْعَبْدِ عِنْدَ اللَّهِ وَ مَقْتٌ مِنَ اللَّهِ وَ صَمٌّ وَ عَمًى وَ بَكَمٌ يُورِثُهُ اللَّهُ إِيَّاهُ يَوْمَ الْقِيَامَةِ فَتَصِيرُوا كَمَا قَالَ اللَّهُ صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لا يَرْجِعُونَ يَعْنِي لَا يَنْطِقُونَ وَ لا يُؤْذَنُ لَهُمْ فَيَعْتَذِرُونَ وَ إِيَّاكُمْ وَ مَا نَهَاكُمُ اللَّهُ عَنْهُ أَنْ تَرْكَبُوهُ وَ عَلَيْكُمْ بِالصَّمْتِ إِلَّا فِيمَا يَنْفَعُكُمُ اللَّهُ بِهِ مِنْ أَمْرِ آخِرَتِكُمْ وَ يَأْجُرُكُمْ عَلَيْهِ وَ أَكْثِرُوا مِنَ التَّهْلِيلِ وَ التَّقْدِيسِ وَ التَّسْبِيحِ وَ الثَّنَاءِ عَلَى اللَّهِ وَ التَّضَرُّعِ إِلَيْهِ وَ الرَّغْبَةِ فِيمَا عِنْدَهُ مِنَ الْخَيْرِ الَّذِي لَا يَقْدِرُ قَدْرَهُ وَ لَا يَبْلُغُ كُنْهَهُ أَحَدٌ فَاشْغَلُوا أَلْسِنَتَكُمْ بِذَلِكَ عَمَّا نَهَى اللَّهُ عَنْهُ مِنْ أَقَاوِيلِ الْبَاطِلِ الَّتِي تُعْقِبُ أَهْلَهَا خُلُوداً فِي النَّارِ مَنْ مَاتَ عَلَيْهَا وَ لَمْ يَتُبْ إِلَى اللَّهِ وَ لَمْ يَنْزِعْ عَنْهَا وَ عَلَيْكُمْ بِالدُّعَاءِ فَإِنَّ الْمُسْلِمِينَ لَمْ يُدْرِكُوا نَجَاحَ الْحَوَائِجِ عِنْدَ رَبِّهِمْ بِأَفْضَلَ مِنَ الدُّعَاءِ وَ الرَّغْبَةِ إِلَيْهِ وَ التَّضَرُّعِ إِلَى اللَّهِ وَ الْمَسْأَلَةِ لَهُ فَارْغَبُوا فِيمَا رَغَّبَكُمُ اللَّهُ فِيهِ وَ أَجِيبُوا اللَّهَ إِلَى مَا دَعَاكُمْ إِلَيْهِ لِتُفْلِحُوا وَ تَنْجُوا مِنْ عَذَابِ اللَّهِ وَ إِيَّاكُمْ أَنْ تَشْرَهَ أَنْفُسُكُمْ إِلَى شَيْ‏ءٍ مِمَّا حَرَّمَ اللَّهُ عَلَيْكُمْ فَإِنَّهُ مَنِ انْتَهَكَ مَا حَرَّمَ اللَّهُ عَلَيْهِ هَاهُنَا فِي الدُّنْيَا حَالَ اللَّهُ بَيْنَهُ وَ بَيْنَ الْجَنَّةِ وَ نَعِيمِهَا وَ لَذَّتِهَا وَ كَرَامَتِهَا الْقَائِمَةِ الدَّائِمَةِ لِأَهْلِ الْجَنَّةِ أَبَدَ الْآبِدِينَ وَ اعْلَمُوا أَنَّهُ بِئْسَ الْحَظُّ الْخَطَرُ لِمَنْ خَاطَرَ اللَّهَ بِتَرْكِ طَاعَةِ اللَّهِ وَ رُكُوبِ مَعْصِيَتِهِ فَاخْتَارَ أَنْ يَنْتَهِكَ مَحَارِمَ اللَّهِ فِي لَذَّاتِ دُنْيَا مُنْقَطِعَةٍ زَائِلَةٍ عَنْ أَهْلِهَا عَلَى خُلُودِ نَعِيمٍ فِي الْجَنَّةِ وَ لَذَّاتِهَا وَ كَرَامَةِ أَهْلِهَا وَيْلٌ لِأُولَئِكَ مَا أَخْيَبَ حَظَّهُمْ وَ أَخْسَرَ كَرَّتَهُمْ وَ أَسْوَأَ حَالَهُمْ عِنْدَ رَبِّهِمْ يَوْمَ الْقِيَامَةِ اسْتَجِيرُوا اللَّهَ أَنْ يُجِيرَكُمْ فِي مِثَالِهِمْ أَبَداً وَ أَنْ يَبْتَلِيَكُمْ بِمَا ابْتَلَاهُمْ بِهِ وَ لَا قُوَّةَ لَنَا وَ لَكُمْ إِلَّا بِهِ فَاتَّقُوا اللَّهَ أَيَّتُهَا الْعِصَابَةُ النَّاجِيَةُ إِنْ أَتَمَّ اللَّهُ لَكُمْ مَا أَعْطَاكُمْ بِهِ فَإِنَّهُ لَا يَتِمُّ الْأَمْرُ حَتَّى يَدْخُلَ عَلَيْكُمْ مِثْلُ الَّذِي دَخَلَ عَلَى الصَّالِحِينَ قَبْلَكُمْ وَ حَتَّى تُبْتَلَوْا فِي أَنْفُسِكُمْ وَ أَمْوَالِكُمْ وَ حَتَّى تَسْمَعُوا مِنْ أَعْدَاءِ اللَّهِ أَذًى كَثِيراً فَتَصْبِرُوا وَ تَعْرُكُوا بِجُنُوبِكُمْ وَ حَتَّى يَسْتَذِلُّوكُمْ وَ يُبْغِضُوكُمْ وَ حَتَّى يُحَمِّلُوا عَلَيْكُمُ الضَّيْمَ فَتَحَمَّلُوا مِنْهُمْ تَلْتَمِسُونَ بِذَلِكَ وَجْهَ اللَّهِ وَ الدَّارَ الْآخِرَةَ وَ حَتَّى تَكْظِمُوا الْغَيْظَ الشَّدِيدَ فِي الْأَذَى فِي اللَّهِ عَزَّ وَ جَلَّ يَجْتَرِمُونَهُ إِلَيْكُمْ وَ حَتَّى يُكَذِّبُوكُمْ بِالْحَقِّ وَ يُعَادُوكُمْ فِيهِ وَ يُبْغِضُوكُمْ عَلَيْهِ فَتَصْبِرُوا عَلَى ذَلِكَ مِنْهُمْ وَ مِصْدَاقُ ذَلِكَ كُلِّهِ فِي كِتَابِ اللَّهِ الَّذِي أَنْزَلَهُ جَبْرَئِيلُ ( عليه السلام ) عَلَى نَبِيِّكُمْ ( صلى الله عليه وآله ) سَمِعْتُمْ قَوْلَ اللَّهِ عَزَّ وَ جَلَّ لِنَبِيِّكُمْ ( صلى الله عليه وآله ) فَاصْبِرْ كَما صَبَرَ أُولُوا الْعَزْمِ مِنَ الرُّسُلِ وَ لا تَسْتَعْجِلْ لَهُمْ ثُمَّ قَالَ وَ إِنْ يُكَذِّبُوكَ فَقَدْ كُذِّبَتْ رُسُلٌ مِنْ قَبْلِكَ فَصَبَرُوا عَلى ما كُذِّبُوا وَ أُوذُوا فَقَدْ كُذِّبَ نَبِيُّ اللَّهِ وَ الرُّسُلُ مِنْ قَبْلِهِ وَ أُوذُوا مَعَ التَّكْذِيبِ بِالْحَقِّ فَإِنْ سَرَّكُمْ أَمْرُ اللَّهِ فِيهِمُ الَّذِي خَلَقَهُمْ لَهُ فِي الْأَصْلِ [أَصْلِ الْخَلْقِ] مِنَ الْكُفْرِ الَّذِي سَبَقَ فِي عِلْمِ اللَّهِ أَنْ يَخْلُقَهُمْ لَهُ فِي الْأَصْلِ وَ مِنَ الَّذِينَ سَمَّاهُمُ اللَّهُ فِي كِتَابِهِ فِي قَوْلِهِ وَ جَعَلْنَا مِنْهُمْ أَئِمَّةً يَدْعُونَ إِلَى النَّارِ فَتَدَبَّرُوا هَذَا وَ اعْقِلُوهُ وَ لَا تَجْهَلُوهُ فَإِنَّهُ مَنْ يَجْهَلْ هَذَا وَ أَشْبَاهَهُ مِمَّا افْتَرَضَ اللَّهُ عَلَيْهِ فِي كِتَابِهِ مِمَّا أَمَرَ اللَّهُ بِهِ وَ نَهَى عَنْهُ تَرَكَ دِينَ اللَّهِ وَ رَكِبَ مَعَاصِيَهُ فَاسْتَوْجَبَ سَخَطَ اللَّهِ فَأَكَبَّهُ اللَّهُ عَلَى وَجْهِهِ فِي النَّارِ وَ قَالَ أَيَّتُهَا الْعِصَابَةُ الْمَرْحُومَةُ الْمُفْلِحَةُ إِنَّ اللَّهَ أَتَمَّ لَكُمْ مَا آتَاكُمْ مِنَ الْخَيْرِ وَ اعْلَمُوا أَنَّهُ لَيْسَ مِنْ عِلْمِ اللَّهِ وَ لَا مِنْ أَمْرِهِ أَنْ يَأْخُذَ أَحَدٌ مِنْ خَلْقِ اللَّهِ فِي دِينِهِ بِهَوًى وَ لَا رَأْيٍ وَ لَا مَقَايِيسَ قَدْ أَنْزَلَ اللَّهُ الْقُرْآنَ وَ جَعَلَ فِيهِ تِبْيَانَ كُلِّ شَيْ‏ءٍ وَ جَعَلَ لِلْقُرْآنِ وَ لِتَعَلُّمِ الْقُرْآنِ أَهْلًا لَا يَسَعُ أَهْلَ عِلْمِ الْقُرْآنِ الَّذِينَ آتَاهُمُ اللَّهُ عِلْمَهُ أَنْ يَأْخُذُوا فِيهِ بِهَوًى وَ لَا رَأْيٍ وَ لَا مَقَايِيسَ أَغْنَاهُمُ اللَّهُ عَنْ ذَلِكَ بِمَا آتَاهُمْ مِنْ عِلْمِهِ وَ خَصَّهُمْ بِهِ وَ وَضَعَهُ عِنْدَهُمْ كَرَامَةً مِنَ اللَّهِ أَكْرَمَهُمْ بِهَا وَ هُمْ أَهْلُ الذِّكْرِ الَّذِينَ أَمَرَ اللَّهُ هَذِهِ الْأُمَّةَ بِسُؤَالِهِمْ وَ هُمُ الَّذِينَ مَنْ سَأَلَهُمْ وَ قَدْ سَبَقَ فِي عِلْمِ اللَّهِ أَنْ يُصَدِّقَهُمْ وَ يَتَّبِعَ أَثَرَهُمْ أَرْشَدُوهُ وَ أَعْطَوْهُ مِنْ عِلْمِ الْقُرْآنِ مَا يَهْتَدِي بِهِ إِلَى اللَّهِ بِإِذْنِهِ وَ إِلَى جَمِيعِ سُبُلِ الْحَقِّ وَ هُمُ الَّذِينَ لَا يَرْغَبُ عَنْهُمْ وَ عَنْ مَسْأَلَتِهِمْ وَ عَنْ عِلْمِهِمُ الَّذِي أَكْرَمَهُمُ اللَّهُ بِهِ وَ جَعَلَهُ عِنْدَهُمْ إِلَّا مَنْ سَبَقَ عَلَيْهِ فِي عِلْمِ اللَّهِ الشَّقَاءُ فِي أَصْلِ الْخَلْقِ تَحْتَ الْأَظِلَّةِ فَأُولَئِكَ الَّذِينَ يَرْغَبُونَ عَنْ سُؤَالِ أَهْلِ الذِّكْرِ وَ الَّذِينَ آتَاهُمُ اللَّهُ عِلْمَ الْقُرْآنِ وَ وَضَعَهُ عِنْدَهُمْ وَ أَمَرَ بِسُؤَالِهِمْ وَ أُولَئِكَ الَّذِينَ يَأْخُذُونَ بِأَهْوَائِهِمْ وَ آرَائِهِمْ وَ مَقَايِيسِهِمْ حَتَّى دَخَلَهُمُ الشَّيْطَانُ لِأَنَّهُمْ جَعَلُوا أَهْلَ الْإِيمَانِ فِي عِلْمِ الْقُرْآنِ عِنْدَ اللَّهِ كَافِرِينَ وَ جَعَلُوا أَهْلَ الضَّلَالَةِ فِي عِلْمِ الْقُرْآنِ عِنْدَ اللَّهِ مُؤْمِنِينَ وَ حَتَّى جَعَلُوا مَا أَحَلَّ اللَّهُ فِي كَثِيرٍ مِنَ الْأَمْرِ حَرَاماً وَ جَعَلُوا مَا حَرَّمَ اللَّهُ فِي كَثِيرٍ مِنَ الْأَمْرِ حَلَالًا فَذَلِكَ أَصْلُ ثَمَرَةِ أَهْوَائِهِمْ وَ قَدْ عَهِدَ إِلَيْهِمْ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) قَبْلَ مَوْتِهِ فَقَالُوا نَحْنُ بَعْدَ مَا قَبَضَ اللَّهُ عَزَّ وَ جَلَّ رَسُولَهُ يَسَعُنَا أَنْ نَأْخُذَ بِمَا اجْتَمَعَ عَلَيْهِ رَأْيُ النَّاسِ بَعْدَ مَا قَبَضَ اللَّهُ عَزَّ وَ جَلَّ رَسُولَهُ ( صلى الله عليه وآله ) وَ بَعْدَ عَهْدِهِ الَّذِي عَهِدَهُ إِلَيْنَا وَ أَمَرَنَا بِهِ مُخَالِفاً لِلَّهِ وَ لِرَسُولِهِ ( صلى الله عليه وآله) فَمَا أَحَدٌ أَجْرَأَ عَلَى اللَّهِ وَ لَا أَبْيَنَ ضَلَالَةً مِمَّنْ أَخَذَ بِذَلِكَ وَ زَعَمَ أَنَّ ذَلِكَ يَسَعُهُ وَ اللَّهِ إِنَّ لِلَّهِ عَلَى خَلْقِهِ أَنْ يُطِيعُوهُ وَ يَتَّبِعُوا أَمْرَهُ فِي حَيَاةِ مُحَمَّدٍ ( صلى الله عليه وآله ) وَ بَعْدَ مَوْتِهِ هَلْ يَسْتَطِيعُ أُولَئِكَ أَعْدَاءُ اللَّهِ أَنْ يَزْعُمُوا أَنَّ أَحَداً مِمَّنْ أَسْلَمَ مَعَ مُحَمَّدٍ ( صلى الله عليه وآله ) أَخَذَ بِقَوْلِهِ وَ رَأْيِهِ وَ مَقَايِيسِهِ فَإِنْ قَالَ نَعَمْ فَقَدْ كَذَبَ عَلَى اللَّهِ وَ ضَلَّ ضَلَالًا بَعِيداً وَ إِنْ قَالَ لَا لَمْ يَكُنْ لِأَحَدٍ أَنْ يَأْخُذَ بِرَأْيِهِ وَ هَوَاهُ وَ مَقَايِيسِهِ فَقَدْ أَقَرَّ بِالْحُجَّةِ عَلَى نَفْسِهِ وَ هُوَ مِمَّنْ يَزْعُمُ أَنَّ اللَّهَ يُطَاعُ وَ يُتَّبَعُ أَمْرُهُ بَعْدَ قَبْضِ رَسُولِ اللَّهِ (صلى الله عليه وآله) وَ قَدْ قَالَ اللَّهُ وَ قَوْلُهُ الْحَقُّ وَ ما مُحَمَّدٌ إِلَّا رَسُولٌ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ أَ فَإِنْ ماتَ أَوْ قُتِلَ انْقَلَبْتُمْ عَلى أَعْقابِكُمْ وَ مَنْ يَنْقَلِبْ عَلى عَقِبَيْهِ فَلَنْ يَضُرَّ اللَّهَ شَيْئاً وَ سَيَجْزِي اللَّهُ الشَّاكِرِينَ وَ ذَلِكَ لِتَعْلَمُوا أَنَّ اللَّهَ يُطَاعُ وَ يُتَّبَعُ أَمْرُهُ فِي حَيَاةِ مُحَمَّدٍ ( صلى الله عليه وآله ) وَ بَعْدَ قَبْضِ اللَّهِ مُحَمَّداً ( صلى الله عليه وآله ) وَ كَمَا لَمْ يَكُنْ لِأَحَدٍ مِنَ النَّاسِ مَعَ مُحَمَّدٍ ( صلى الله عليه وآله ) أَنْ يَأْخُذَ بِهَوَاهُ وَ لَا رَأْيِهِ وَ لَا مَقَايِيسِهِ خِلَافاً لِأَمْرِ مُحَمَّدٍ ( صلى الله عليه وآله ) فَكَذَلِكَ لَمْ يَكُنْ لِأَحَدٍ مِنَ النَّاسِ بَعْدَ مُحَمَّدٍ ( صلى الله عليه وآله ) أَنْ يَأْخُذَ بِهَوَاهُ وَ لَا رَأْيِهِ وَ لَا مَقَايِيسِهِ وَ قَالَ دَعُوا رَفْعَ أَيْدِيكُمْ فِي الصَّلَاةِ إِلَّا مَرَّةً وَاحِدَةً حِينَ تُفْتَتَحُ الصَّلَاةُ فَإِنَّ النَّاسَ قَدْ شَهَرُوكُمْ بِذَلِكَ وَ اللَّهُ الْمُسْتَعَانُ وَ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ وَ قَالَ أَكْثِرُوا مِنْ أَنْ تَدْعُوا اللَّهَ فَإِنَّ اللَّهَ يُحِبُّ مِنْ عِبَادِهِ الْمُؤْمِنِينَ أَنْ يَدْعُوهُ وَ قَدْ وَعَدَ اللَّهُ عِبَادَهُ الْمُؤْمِنِينَ بِالِاسْتِجَابَةِ وَ اللَّهُ مُصَيِّرٌ دُعَاءَ الْمُؤْمِنِينَ يَوْمَ الْقِيَامَةِ لَهُمْ عَمَلًا يَزِيدُهُمْ بِهِ فِي الْجَنَّةِ فَأَكْثِرُوا ذِكْرَ اللَّهِ مَا اسْتَطَعْتُمْ فِي كُلِّ سَاعَةٍ مِنْ سَاعَاتِ اللَّيْلِ وَ النَّهَارِ فَإِنَّ اللَّهَ أَمَرَ بِكَثْرَةِ الذِّكْرِ لَهُ وَ اللَّهُ ذَاكِرٌ لِمَنْ ذَكَرَهُ مِنَ الْمُؤْمِنِينَ وَ اعْلَمُوا أَنَّ اللَّهَ لَمْ يَذْكُرْهُ أَحَدٌ مِنْ عِبَادِهِ الْمُؤْمِنِينَ إِلَّا ذَكَرَهُ بِخَيْرٍ فَأَعْطُوا اللَّهَ مِنْ أَنْفُسِكُمُ الِاجْتِهَادَ فِي طَاعَتِهِ فَإِنَّ اللَّهَ لَا يُدْرَكُ شَيْ‏ءٌ مِنَ الْخَيْرِ عِنْدَهُ إِلَّا بِطَاعَتِهِ وَ اجْتِنَابِ مَحَارِمِهِ الَّتِي حَرَّمَ اللَّهُ فِي ظَاهِرِ الْقُرْآنِ وَ بَاطِنِهِ فَإِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى قَالَ فِي كِتَابِهِ وَ قَوْلُهُ الْحَقُّ وَ ذَرُوا ظاهِرَ الْإِثْمِ وَ باطِنَهُ وَ اعْلَمُوا أَنَّ مَا أَمَرَ اللَّهُ بِهِ أَنْ تَجْتَنِبُوهُ فَقَدْ حَرَّمَهُ وَ اتَّبِعُوا آثَارَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ سُنَّتَهُ فَخُذُوا بِهَا وَ لَا تَتَّبِعُوا أَهْوَاءَكُمْ وَ آرَاءَكُمْ فَتَضِلُّوا فَإِنَّ أَضَلَّ النَّاسِ عِنْدَ اللَّهِ مَنِ اتَّبَعَ هَوَاهُ وَ رَأْيَهُ بِغَيْرِ هُدًى مِنَ اللَّهِ وَ أَحْسِنُوا إِلَى أَنْفُسِكُمْ مَا اسْتَطَعْتُمْ فَ إِنْ أَحْسَنْتُمْ أَحْسَنْتُمْ لِأَنْفُسِكُمْ وَ إِنْ أَسَأْتُمْ فَلَها وَ جَامِلُوا النَّاسَ وَ لَا تَحْمِلُوهُمْ عَلَى رِقَابِكُمْ تَجْمَعُوا مَعَ ذَلِكَ طَاعَةَ رَبِّكُمْ وَ إِيَّاكُمْ وَ سَبَّ أَعْدَاءِ اللَّهِ حَيْثُ يَسْمَعُونَكُمْ فَيَسُبُّوا اللَّهَ عَدْواً بِغَيْرِ عِلْمٍ وَ قَدْ يَنْبَغِي لَكُمْ أَنْ تَعْلَمُوا حَدَّ سَبِّهِمْ لِلَّهِ كَيْفَ هُوَ إِنَّهُ مَنْ سَبَّ أَوْلِيَاءَ اللَّهِ فَقَدِ انْتَهَكَ سَبَّ اللَّهِ وَ مَنْ أَظْلَمُ عِنْدَ اللَّهِ مِمَّنِ اسْتَسَبَّ لِلَّهِ وَ لِأَوْلِيَاءِ اللَّهِ فَمَهْلًا مَهْلًا فَاتَّبِعُوا أَمْرَ اللَّهِ وَ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ وَ قَالَ أَيَّتُهَا الْعِصَابَةُ الْحَافِظُ اللَّهُ لَهُمْ أَمْرَهُمْ عَلَيْكُمْ بِآثَارِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ سُنَّتِهِ وَ آثَارِ الْأَئِمَّةِ الْهُدَاةِ مِنْ أَهْلِ بَيْتِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) مِنْ بَعْدِهِ وَ سُنَّتِهِمْ فَإِنَّهُ مَنْ أَخَذَ بِذَلِكَ فَقَدِ اهْتَدَى وَ مَنْ تَرَكَ ذَلِكَ وَ رَغِبَ عَنْهُ ضَلَّ لِأَنَّهُمْ هُمُ الَّذِينَ أَمَرَ اللَّهُ بِطَاعَتِهِمْ وَ وَلَايَتِهِمْ وَ قَدْ قَالَ أَبُونَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْمُدَاوَمَةُ عَلَى الْعَمَلِ فِي اتِّبَاعِ الْآثَارِ وَ السُّنَنِ وَ إِنْ قَلَّ أَرْضَى لِلَّهِ وَ أَنْفَعُ عِنْدَهُ فِي الْعَاقِبَةِ مِنَ الِاجْتِهَادِ فِي الْبِدَعِ وَ اتِّبَاعِ الْأَهْوَاءِ أَلَا إِنَّ اتِّبَاعَ الْأَهْوَاءِ وَ اتِّبَاعَ الْبِدَعِ بِغَيْرِ هُدًى مِنَ اللَّهِ ضَلَالٌ وَ كُلُّ ضَلَالَةٍ بِدْعَةٌ وَ كُلُّ بِدْعَةٍ فِي النَّارِ وَ لَنْ يُنَالَ شَيْ‏ءٌ مِنَ الْخَيْرِ عِنْدَ اللَّهِ إِلَّا بِطَاعَتِهِ وَ الصَّبْرِ وَ الرِّضَا لِأَنَّ الصَّبْرَ وَ الرِّضَا مِنْ طَاعَةِ اللَّهِ وَ اعْلَمُوا أَنَّهُ لَنْ يُؤْمِنَ عَبْدٌ مِنْ عَبِيدِهِ حَتَّى يَرْضَى عَنِ اللَّهِ فِيمَا صَنَعَ اللَّهُ إِلَيْهِ وَ صَنَعَ بِهِ عَلَى مَا أَحَبَّ وَ كَرِهَ وَ لَنْ يَصْنَعَ اللَّهُ بِمَنْ صَبَرَ وَ رَضِيَ عَنِ اللَّهِ إِلَّا مَا هُوَ أَهْلُهُ وَ هُوَ خَيْرٌ لَهُ مِمَّا أَحَبَّ وَ كَرِهَ وَ عَلَيْكُمْ بِالْمُحَافَظَةِ عَلَى الصَّلَوَاتِ وَ الصَّلَاةِ الْوُسْطَى وَ قُومُوا لِلَّهِ قانِتِينَ كَمَا أَمَرَ اللَّهُ بِهِ الْمُؤْمِنِينَ فِي كِتَابِهِ مِنْ قَبْلِكُمْ وَ إِيَّاكُمْ وَ عَلَيْكُمْ بِحُبِّ الْمَسَاكِينِ الْمُسْلِمِينَ فَإِنَّهُ مَنْ حَقَّرَهُمْ وَ تَكَبَّرَ عَلَيْهِمْ فَقَدْ زَلَّ عَنْ دِينِ اللَّهِ وَ اللَّهُ لَهُ حَاقِرٌ مَاقِتٌ وَ قَدْ قَالَ أَبُونَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَمَرَنِي رَبِّي بِحُبِّ الْمَسَاكِينِ الْمُسْلِمِينَ مِنْهُمْ وَ اعْلَمُوا أَنَّ مَنْ حَقَّرَ أَحَداً مِنَ الْمُسْلِمِينَ أَلْقَى اللَّهُ عَلَيْهِ الْمَقْتَ مِنْهُ وَ الْمَحْقَرَةَ حَتَّى يَمْقُتَهُ النَّاسُ وَ اللَّهُ لَهُ أَشَدُّ مَقْتاً فَاتَّقُوا اللَّهَ فِي إِخْوَانِكُمُ الْمُسْلِمِينَ الْمَسَاكِينِ فَإِنَّ لَهُمْ عَلَيْكُمْ حَقّاً أَنْ تُحِبُّوهُمْ فَإِنَّ اللَّهَ أَمَرَ رَسُولَهُ ( صلى الله عليه وآله ) بِحُبِّهِمْ فَمَنْ لَمْ يُحِبَّ مَنْ أَمَرَ اللَّهُ بِحُبِّهِ فَقَدْ عَصَى اللَّهَ وَ رَسُولَهُ وَ مَنْ عَصَى اللَّهَ وَ رَسُولَهُ وَ مَاتَ عَلَى ذَلِكَ مَاتَ وَ هُوَ مِنَ الْغَاوِينَ وَ إِيَّاكُمْ وَ الْعَظَمَةَ وَ الْكِبْرَ فَإِنَّ الْكِبْرَ رِدَاءُ اللَّهِ عَزَّ وَ جَلَّ فَمَنْ نَازَعَ اللَّهَ رِدَاءَهُ خَصَمَهُ اللَّهُ وَ أَذَلَّهُ يَوْمَ الْقِيَامَةِ وَ إِيَّاكُمْ أَنْ يَبْغِيَ بَعْضُكُمْ عَلَى بَعْضٍ فَإِنَّهَا لَيْسَتْ مِنْ خِصَالِ الصَّالِحِينَ فَإِنَّهُ مَنْ بَغَى صَيَّرَ اللَّهُ بَغْيَهُ عَلَى نَفْسِهِ وَ صَارَتْ نُصْرَةُ اللَّهِ لِمَنْ بُغِيَ عَلَيْهِ وَ مَنْ نَصَرَهُ اللَّهُ غَلَبَ وَ أَصَابَ الظَّفَرَ مِنَ اللَّهِ وَ إِيَّاكُمْ أَنْ يَحْسُدَ بَعْضُكُمْ بَعْضاً فَإِنَّ الْكُفْرَ أَصْلُهُ الْحَسَدُ وَ إِيَّاكُمْ أَنْ تُعِينُوا عَلَى مُسْلِمٍ مَظْلُومٍ فَيَدْعُوَ اللَّهَ عَلَيْكُمْ وَ يُسْتَجَابَ لَهُ فِيكُمْ فَإِنَّ أَبَانَا رَسُولَ اللَّهِ ( صلى الله عليه وآله ) كَانَ يَقُولُ إِنَّ دَعْوَةَ الْمُسْلِمِ الْمَظْلُومِ مُسْتَجَابَةٌ وَ لْيُعِنْ بَعْضُكُمْ بَعْضاً فَإِنَّ أَبَانَا رَسُولَ اللَّهِ ( صلى الله عليه وآله ) كَانَ يَقُولُ إِنَّ مَعُونَةَ الْمُسْلِمِ خَيْرٌ وَ أَعْظَمُ أَجْراً مِنْ صِيَامِ شَهْرٍ وَ اعْتِكَافِهِ فِي الْمَسْجِدِ الْحَرَامِ وَ إِيَّاكُمْ وَ إِعْسَارَ أَحَدٍ مِنْ إِخْوَانِكُمُ الْمُسْلِمِينَ أَنْ تُعْسِرُوهُ بِالشَّيْ‏ءِ يَكُونُ لَكُمْ قِبَلَهُ وَ هُوَ مُعْسِرٌ فَإِنَّ أَبَانَا رَسُولَ اللَّهِ ( صلى الله عليه وآله ) كَانَ يَقُولُ لَيْسَ لِمُسْلِمٍ أَنْ يُعْسِرَ مُسْلِماً وَ مَنْ أَنْظَرَ مُعْسِراً أَظَلَّهُ اللَّهُ بِظِلِّهِ يَوْمَ لَا ظِلَّ إِلَّا ظِلُّهُ وَ إِيَّاكُمْ أَيَّتُهَا الْعِصَابَةُ الْمَرْحُومَةُ الْمُفَضَّلَةُ عَلَى مَنْ سِوَاهَا وَ حَبْسَ حُقُوقِ اللَّهِ قِبَلَكُمْ يَوْماً بَعْدَ يَوْمٍ وَ سَاعَةً بَعْدَ سَاعَةٍ فَإِنَّهُ مَنْ عَجَّلَ حُقُوقَ اللَّهِ قِبَلَهُ كَانَ اللَّهُ أَقْدَرَ عَلَى التَّعْجِيلِ لَهُ إِلَى مُضَاعَفَةِ الْخَيْرِ فِي الْعَاجِلِ وَ الْآجِلِ وَ إِنَّهُ مَنْ أَخَّرَ حُقُوقَ اللَّهِ قِبَلَهُ كَانَ اللَّهُ أَقْدَرَ عَلَى تَأْخِيرِ رِزْقِهِ وَ مَنْ حَبَسَ اللَّهُ رِزْقَهُ لَمْ يَقْدِرْ أَنْ يَرْزُقَ نَفْسَهُ فَأَدُّوا إِلَى اللَّهِ حَقَّ مَا رَزَقَكُمْ يُطَيِّبِ اللَّهُ لَكُمْ بَقِيَّتَهُ وَ يُنْجِزْ لَكُمْ مَا وَعَدَكُمْ مِنْ مُضَاعَفَتِهِ لَكُمُ الْأَضْعَافَ الْكَثِيرَةَ الَّتِي لَا يَعْلَمُ عَدَدَهَا وَ لَا كُنْهَ فَضْلِهَا إِلَّا اللَّهُ رَبُّ الْعَالَمِينَ وَ قَالَ اتَّقُوا اللَّهَ أَيَّتُهَا الْعِصَابَةُ وَ إِنِ اسْتَطَعْتُمْ أَنْ لَا يَكُونَ مِنْكُمْ مُحْرِجُ الْإِمَامِ فَإِنَّ مُحْرِجَ الْإِمَامِ هُوَ الَّذِي يَسْعَى بِأَهْلِ الصَّلَاحِ مِنْ أَتْبَاعِ الْإِمَامِ الْمُسَلِّمِينَ لِفَضْلِهِ الصَّابِرِينَ عَلَى أَدَاءِ حَقِّهِ الْعَارِفِينَ لِحُرْمَتِهِ وَ اعْلَمُوا أَنَّهُ مَنْ نَزَلَ بِذَلِكَ الْمَنْزِلِ عِنْدَ الْإِمَامِ فَهُوَ مُحْرِجُ الْإِمَامِ فَإِذَا فَعَلَ ذَلِكَ عِنْدَ الْإِمَامِ أَحْرَجَ الْإِمَامَ إِلَى أَنْ يَلْعَنَ أَهْلَ الصَّلَاحِ مِنْ أَتْبَاعِهِ الْمُسَلِّمِينَ لِفَضْلِهِ الصَّابِرِينَ عَلَى أَدَاءِ حَقِّهِ الْعَارِفِينَ بِحُرْمَتِهِ فَإِذَا لَعَنَهُمْ لِإِحْرَاجِ أَعْدَاءِ اللَّهِ الْإِمَامَ صَارَتْ لَعْنَتُهُ رَحْمَةً مِنَ اللَّهِ عَلَيْهِمْ وَ صَارَتِ اللَّعْنَةُ مِنَ اللَّهِ وَ مِنَ الْمَلَائِكَةِ وَ رُسُلِهِ عَلَى أُولَئِكَ وَ اعْلَمُوا أَيَّتُهَا الْعِصَابَةُ أَنَّ السُّنَّةَ مِنَ اللَّهِ قَدْ جَرَتْ فِي الصَّالِحِينَ قَبْلُ وَ قَالَ مَنْ سَرَّهُ أَنْ يَلْقَى اللَّهَ وَ هُوَ مُؤْمِنٌ حَقّاً حَقّاً فَلْيَتَوَلَّ اللَّهَ وَ رَسُولَهُ وَ الَّذِينَ آمَنُوا وَ لْيَبْرَأْ إِلَى اللَّهِ مِنْ عَدُوِّهِمْ وَ يُسَلِّمُ لِمَا انْتَهَى إِلَيْهِ مِنْ فَضْلِهِمْ لِأَنَّ فَضْلَهُمْ لَا يَبْلُغُهُ مَلَكٌ مُقَرَّبٌ وَ لَا نَبِيٌّ مُرْسَلٌ وَ لَا مَنْ دُونَ ذَلِكَ أَ لَمْ تَسْمَعُوا مَا ذَكَرَ اللَّهُ مِنْ فَضْلِ أَتْبَاعِ الْأَئِمَّةِ الْهُدَاةِ وَ هُمُ الْمُؤْمِنُونَ قَالَ فَأُولئِكَ مَعَ الَّذِينَ أَنْعَمَ اللَّهُ عَلَيْهِمْ مِنَ النَّبِيِّينَ وَ الصِّدِّيقِينَ وَ الشُّهَداءِ وَ الصَّالِحِينَ وَ حَسُنَ أُولئِكَ رَفِيقاً فَهَذَا وَجْهٌ مِنْ وُجُوهِ فَضْلِ أَتْبَاعِ الْأَئِمَّةِ فَكَيْفَ بِهِمْ وَ فَضْلِهِمْ وَ مَنْ سَرَّهُ أَنْ يُتِمَّ اللَّهُ لَهُ إِيمَانَهُ حَتَّى يَكُونَ مُؤْمِناً حَقّاً حَقّاً فَلْيَفِ لِلَّهِ بِشُرُوطِهِ الَّتِي اشْتَرَطَهَا عَلَى الْمُؤْمِنِينَ فَإِنَّهُ قَدِ اشْتَرَطَ مَعَ وَلَايَتِهِ وَ وَلَايَةِ رَسُولِهِ وَ وَلَايَةِ أَئِمَّةِ الْمُؤْمِنِينَ إِقَامَ الصَّلَاةِ وَ إِيتَاءَ الزَّكَاةِ وَ إِقْرَاضَ اللَّهِ قَرْضاً حَسَناً وَ اجْتِنَابَ الْفَوَاحِشِ مَا ظَهَرَ مِنْهَا وَ مَا بَطَنَ فَلَمْ يَبْقَ شَيْ‏ءٌ مِمَّا فُسِّرَ مِمَّا حَرَّمَ اللَّهُ إِلَّا وَ قَدْ دَخَلَ فِي جُمْلَةِ قَوْلِهِ فَمَنْ دَانَ اللَّهَ فِيمَا بَيْنَهُ وَ بَيْنَ اللَّهِ مُخْلِصاً لِلَّهِ وَ لَمْ يُرَخِّصْ لِنَفْسِهِ فِي تَرْكِ شَيْ‏ءٍ مِنْ هَذَا فَهُوَ عِنْدَ اللَّهِ فِي حِزْبِهِ الْغَالِبِينَ وَ هُوَ مِنَ الْمُؤْمِنِينَ حَقّاً وَ إِيَّاكُمْ وَ الْإِصْرَارَ عَلَى شَيْ‏ءٍ مِمَّا حَرَّمَ اللَّهُ فِي ظَهْرِ الْقُرْآنِ وَ بَطْنِهِ وَ قَدْ قَالَ اللَّهُ تَعَالَى وَ لَمْ يُصِرُّوا عَلى ما فَعَلُوا وَ هُمْ يَعْلَمُونَ إِلَى هَاهُنَا رِوَايَةُ الْقَاسِمِ بْنِ رَبِيعٍ يَعْنِي الْمُؤْمِنِينَ قَبْلَكُمْ إِذَا نَسُوا شَيْئاً مِمَّا اشْتَرَطَ اللَّهُ فِي كِتَابِهِ عَرَفُوا أَنَّهُمْ قَدْ عَصَوُا اللَّهَ فِي تَرْكِهِمْ ذَلِكَ الشَّيْ‏ءَ فَاسْتَغْفَرُوا وَ لَمْ يَعُودُوا إِلَى تَرْكِهِ فَذَلِكَ مَعْنَى قَوْلِ اللَّهِ وَ لَمْ يُصِرُّوا عَلى ما فَعَلُوا وَ هُمْ يَعْلَمُونَ وَ اعْلَمُوا أَنَّهُ إِنَّمَا أَمَرَ وَ نَهَى لِيُطَاعَ فِيمَا أَمَرَ بِهِ وَ لِيُنْتَهَى عَمَّا نَهَى عَنْهُ فَمَنِ اتَّبَعَ أَمْرَهُ فَقَدْ أَطَاعَهُ وَ قَدْ أَدْرَكَ كُلَّ شَيْ‏ءٍ مِنَ الْخَيْرِ عِنْدَهُ وَ مَنْ لَمْ يَنْتَهِ عَمَّا نَهَى اللَّهُ عَنْهُ فَقَدْ عَصَاهُ فَإِنْ مَاتَ عَلَى مَعْصِيَتِهِ أَكَبَّهُ اللَّهُ عَلَى وَجْهِهِ فِي النَّارِ وَ اعْلَمُوا أَنَّهُ لَيْسَ بَيْنَ اللَّهِ وَ بَيْنَ أَحَدٍ مِنْ خَلْقِهِ مَلَكٌ مُقَرَّبٌ وَ لَا نَبِيٌّ مُرْسَلٌ وَ لَا مَنْ دُونَ ذَلِكَ مِنْ خَلْقِهِ كُلِّهِمْ إِلَّا طَاعَتُهُمْ لَهُ فَاجْتَهِدُوا فِي طَاعَةِ اللَّهِ إِنْ سَرَّكُمْ أَنْ تَكُونُوا مُؤْمِنِينَ حَقّاً حَقّاً وَ لَا قُوَّةَ إِلَّا بِاللَّهِ وَ قَالَ وَ عَلَيْكُمْ بِطَاعَةِ رَبِّكُمْ مَا اسْتَطَعْتُمْ فَإِنَّ اللَّهَ رَبُّكُمْ وَ اعْلَمُوا أَنَّ الْإِسْلَامَ هُوَ التَّسْلِيمُ وَ التَّسْلِيمَ هُوَ الْإِسْلَامُ فَمَنْ سَلَّمَ فَقَدْ أَسْلَمَ وَ مَنْ لَمْ يُسَلِّمْ فَلَا إِسْلَامَ لَهُ وَ مَنْ سَرَّهُ أَنْ يُبْلِغَ إِلَى نَفْسِهِ فِي الْإِحْسَانِ فَلْيُطِعِ اللَّهَ فَإِنَّهُ مَنْ أَطَاعَ اللَّهَ فَقَدْ أَبْلَغَ إِلَى نَفْسِهِ فِي الْإِحْسَانِ وَ إِيَّاكُمْ وَ مَعَاصِيَ اللَّهِ أَنْ تَرْكَبُوهَا فَإِنَّهُ مَنِ انْتَهَكَ مَعَاصِيَ اللَّهِ فَرَكِبَهَا فَقَدْ أَبْلَغَ فِي الْإِسَاءَةِ إِلَى نَفْسِهِ وَ لَيْسَ بَيْنَ الْإِحْسَانِ وَ الْإِسَاءَةِ مَنْزِلَةٌ فَلِأَهْلِ الْإِحْسَانِ عِنْدَ رَبِّهِمُ الْجَنَّةُ وَ لِأَهْلِ الْإِسَاءَةِ عِنْدَ رَبِّهِمُ النَّارُ فَاعْمَلُوا بِطَاعَةِ اللَّهِ وَ اجْتَنِبُوا مَعَاصِيَهُ وَ اعْلَمُوا أَنَّهُ لَيْسَ يُغْنِي عَنْكُمْ مِنَ اللَّهِ أَحَدٌ مِنْ خَلْقِهِ شَيْئاً لَا مَلَكٌ مُقَرَّبٌ وَ لَا نَبِيٌّ مُرْسَلٌ وَ لَا مَنْ دُونَ ذَلِكَ فَمَنْ سَرَّهُ أَنْ تَنْفَعَهُ شَفَاعَةُ الشَّافِعِينَ عِنْدَ اللَّهِ فَلْيَطْلُبْ إِلَى اللَّهِ أَنْ يَرْضَى عَنْهُ وَ اعْلَمُوا أَنَّ أَحَداً مِنْ خَلْقِ اللَّهِ لَمْ يُصِبْ رِضَا اللَّهِ إِلَّا بِطَاعَتِهِ وَ طَاعَةِ رَسُولِهِ وَ طَاعَةِ وُلَاةِ أَمْرِهِ مِنْ آلِ مُحَمَّدٍ ( صلى الله عليه وآله ) وَ مَعْصِيَتُهُمْ مِنْ مَعْصِيَةِ اللَّهِ وَ لَمْ يُنْكِرْ لَهُمْ فَضْلًا عَظُمَ أَوْ صَغُرَ وَ اعْلَمُوا أَنَّ الْمُنْكِرِينَ هُمُ الْمُكَذِّبُونَ وَ أَنَّ الْمُكَذِّبِينَ هُمُ الْمُنَافِقُونَ وَ أَنَّ اللَّهَ عَزَّ وَ جَلَّ قَالَ لِلْمُنَافِقِينَ وَ قَوْلُهُ الْحَقُّ إِنَّ الْمُنافِقِينَ فِي الدَّرْكِ الْأَسْفَلِ مِنَ النَّارِ وَ لَنْ تَجِدَ لَهُمْ نَصِيراً وَ لَا يَفْرَقَنَّ أَحَدٌ مِنْكُمْ أَلْزَمَ اللَّهُ قَلْبَهُ طَاعَتَهُ وَ خَشْيَتَهُ مِنْ أَحَدٍ مِنَ النَّاسِ مِمَّنْ أَخْرَجَهُ اللَّهُ مِنْ صِفَةِ الْحَقِّ وَ لَمْ يَجْعَلْهُ مِنْ أَهْلِهَا فَإِنَّ مَنْ لَمْ يَجْعَلِ اللَّهُ مِنْ أَهْلِ صِفَةِ الْحَقِّ فَأُولَئِكَ هُمْ شَيَاطِينُ الْإِنْسِ وَ الْجِنِّ وَ إِنَّ لِشَيَاطِينِ الْإِنْسِ حِيلَةً وَ مَكْراً وَ خَدَائِعَ وَ وَسْوَسَةً بَعْضِهِمْ إِلَى بَعْضٍ يُرِيدُونَ إِنِ اسْتَطَاعُوا أَنْ يَرُدُّوا أَهْلَ الْحَقِّ عَمَّا أَكْرَمَهُمُ اللَّهُ بِهِ مِنَ النَّظَرِ فِي دِينِ اللَّهِ الَّذِي لَمْ يَجْعَلِ اللَّهُ شَيَاطِينَ الْإِنْسِ مِنْ أَهْلِهِ إِرَادَةَ أَنْ يَسْتَوِيَ أَعْدَاءُ اللَّهِ وَ أَهْلُ الْحَقِّ فِي الشَّكِّ وَ الْإِنْكَارِ وَ التَّكْذِيبِ فَيَكُونُونَ سَوَاءً كَمَا وَصَفَ اللَّهُ تَعَالَى فِي كِتَابِهِ مِنْ قَوْلِهِ وَدُّوا لَوْ تَكْفُرُونَ كَما كَفَرُوا فَتَكُونُونَ سَواءً ثُمَّ نَهَى اللَّهُ أَهْلَ النَّصْرِ بِالْحَقِّ أَنْ يَتَّخِذُوا مِنْ أَعْدَاءِ اللَّهِ وَلِيّاً وَ لَا نَصِيراً فَلَا يُهَوِّلَنَّكُمْ وَ لَا يَرُدَّنَّكُمْ عَنِ النَّصْرِ بِالْحَقِّ الَّذِي خَصَّكُمُ اللَّهُ بِهِ مِنْ حِيلَةِ شَيَاطِينِ الْإِنْسِ وَ مَكْرِهِمْ مِنْ أُمُورِكُمْ تَدْفَعُونَ أَنْتُمُ السَّيِّئَةَ بِالَّتِي هِيَ أَحْسَنُ فِيمَا بَيْنَكُمْ وَ بَيْنَهُمْ تَلْتَمِسُونَ بِذَلِكَ وَجْهَ رَبِّكُمْ بِطَاعَتِهِ وَ هُمْ لَا خَيْرَ عِنْدَهُمْ لَا يَحِلُّ لَكُمْ أَنْ تُظْهِرُوهُمْ عَلَى أُصُولِ دِينِ اللَّهِ فَإِنَّهُمْ إِنْ سَمِعُوا مِنْكُمْ فِيهِ شَيْئاً عَادَوْكُمْ عَلَيْهِ وَ رَفَعُوهُ عَلَيْكُمْ وَ جَهَدُوا عَلَى هَلَاكِكُمْ وَ اسْتَقْبَلُوكُمْ بِمَا تَكْرَهُونَ وَ لَمْ يَكُنْ لَكُمُ النَّصَفَةُ مِنْهُمْ فِي دُوَلِ الْفُجَّارِ فَاعْرِفُوا مَنْزِلَتَكُمْ فِيمَا بَيْنَكُمْ وَ بَيْنَ أَهْلِ الْبَاطِلِ فَإِنَّهُ لَا يَنْبَغِي لِأَهْلِ الْحَقِّ أَنْ يُنْزِلُوا أَنْفُسَهُمْ مَنْزِلَةَ أَهْلِ الْبَاطِلِ لِأَنَّ اللَّهَ لَمْ يَجْعَلْ أَهْلَ الْحَقِّ عِنْدَهُ بِمَنْزِلَةِ أَهْلِ الْبَاطِلِ أَ لَمْ يَعْرِفُوا وَجْهَ قَوْلِ اللَّهِ فِي كِتَابِهِ إِذْ يَقُولُ أَمْ نَجْعَلُ الَّذِينَ آمَنُوا وَ عَمِلُوا الصَّالِحاتِ كَالْمُفْسِدِينَ فِي الْأَرْضِ أَمْ نَجْعَلُ الْمُتَّقِينَ كَالْفُجَّارِ أَكْرِمُوا أَنْفُسَكُمْ عَنْ أَهْلِ الْبَاطِلِ وَ لَا تَجْعَلُوا اللَّهَ تَبَارَكَ وَ تَعَالَى وَ لَهُ الْمَثَلُ الْأَعْلَى وَ إِمَامَكُمْ وَ دِينَكُمُ الَّذِي تَدِينُونَ بِهِ عُرْضَةً لِأَهْلِ الْبَاطِلِ فَتُغْضِبُوا اللَّهَ عَلَيْكُمْ فَتَهْلِكُوا فَمَهْلًا مَهْلًا يَا أَهْلَ الصَّلَاحِ لَا تَتْرُكُوا أَمْرَ اللَّهِ وَ أَمْرَ مَنْ أَمَرَكُمْ بِطَاعَتِهِ فَيُغَيِّرَ اللَّهُ مَا بِكُمْ مِنْ نِعْمَةٍ أَحِبُّوا فِي اللَّهِ مَنْ وَصَفَ صِفَتَكُمْ وَ أَبْغِضُوا فِي اللَّهِ مَنْ خَالَفَكُمْ وَ ابْذُلُوا مَوَدَّتَكُمْ وَ نَصِيحَتَكُمْ [لِمَنْ وَصَفَ صِفَتَكُمْ] وَ لَا تَبْتَذِلُوهَا لِمَنْ رَغِبَ عَنْ صِفَتِكُمْ وَ عَادَاكُمْ عَلَيْهَا وَ بَغَى لَكُمُ الْغَوَائِلَ هَذَا أَدَبُنَا أَدَبُ اللَّهِ فَخُذُوا بِهِ وَ تَفَهَّمُوهُ وَ اعْقِلُوهُ وَ لَا تَنْبِذُوهُ وَرَاءَ ظُهُورِكُمْ مَا وَافَقَ هُدَاكُمْ أَخَذْتُمْ بِهِ وَ مَا وَافَقَ هَوَاكُمْ طَرَحْتُمُوهُ وَ لَمْ تَأْخُذُوا بِهِ وَ إِيَّاكُمْ وَ التَّجَبُّرَ عَلَى اللَّهِ وَ اعْلَمُوا أَنَّ عَبْداً لَمْ يُبْتَلَ بِالتَّجَبُّرِ عَلَى اللَّهِ إِلَّا تَجَبَّرَ عَلَى دِينِ اللَّهِ فَاسْتَقِيمُوا لِلَّهِ وَ لَا تَرْتَدُّوا عَلَى أَعْقَابِكُمْ فَتَنْقَلِبُوا خَاسِرِينَ أَجَارَنَا اللَّهُ وَ إِيَّاكُمْ مِنَ التَّجَبُّرِ عَلَى اللَّهِ وَ لَا قُوَّةَ لَنَا وَ لَكُمْ إِلَّا بِاللَّهِ وَ قَالَ ( عليه السلام ) إِنَّ الْعَبْدَ إِذَا كَانَ خَلَقَهُ اللَّهُ فِي الْأَصْلِ أَصْلِ الْخَلْقِ مُؤْمِناً لَمْ يَمُتْ حَتَّى يُكَرِّهَ اللَّهُ إِلَيْهِ الشَّرَّ وَ يُبَاعِدَهُ عَنْهُ وَ مَنْ كَرَّهَ اللَّهُ إِلَيْهِ الشَّرَّ وَ بَاعَدَهُ عَنْهُ عَافَاهُ اللَّهُ مِنَ الْكِبْرِ أَنْ يَدْخُلَهُ وَ الْجَبْرِيَّةِ فَلَانَتْ عَرِيكَتُهُ وَ حَسُنَ خُلُقُهُ وَ طَلُقَ وَجْهُهُ وَ صَارَ عَلَيْهِ وَقَارُ الْإِسْلَامِ وَ سَكِينَتُهُ وَ تَخَشُّعُهُ وَ وَرِعَ عَنْ مَحَارِمِ اللَّهِ وَ اجْتَنَبَ مَسَاخِطَهُ وَ رَزَقَهُ اللَّهُ مَوَدَّةَ النَّاسِ وَ مُجَامَلَتَهُمْ وَ تَرْكَ مُقَاطَعَةِ النَّاسِ وَ الْخُصُومَاتِ وَ لَمْ يَكُنْ مِنْهَا وَ لَا مِنْ أَهْلِهَا فِي شَيْ‏ءٍ وَ إِنَّ الْعَبْدَ إِذَا كَانَ اللَّهُ خَلَقَهُ فِي الْأَصْلِ [أَصْلِ الْخَلْقِ] كَافِراً لَمْ يَمُتْ حَتَّى يُحَبِّبَ إِلَيْهِ الشَّرَّ وَ يُقَرِّبَهُ مِنْهُ فَإِذَا حَبَّبَ إِلَيْهِ الشَّرَّ وَ قَرَّبَهُ مِنْهُ ابْتُلِيَ بِالْكِبْرِ وَ الْجَبْرِيَّةِ فَقَسَا قَلْبُهُ وَ سَاءَ خُلُقُهُ وَ غَلُظَ وَجْهُهُ وَ ظَهَرَ فُحْشُهُ وَ قَلَّ حَيَاؤُهُ وَ كَشَفَ اللَّهُ سِتْرَهُ وَ رَكِبَ الْمَحَارِمَ فَلَمْ يَنْزِعْ عَنْهَا وَ رَكِبَ مَعَاصِيَ اللَّهِ وَ أَبْغَضَ طَاعَتَهُ وَ أَهْلَهَا فَبُعْدٌ مَا بَيْنَ حَالِ الْمُؤْمِنِ وَ حَالِ الْكَافِرِ سَلُوا اللَّهَ الْعَافِيَةَ وَ اطْلُبُوهَا إِلَيْهِ وَ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ صَبِّرُوا النَّفْسَ عَلَى الْبَلَاءِ فِي الدُّنْيَا فَإِنَّ تَتَابُعَ الْبَلَاءِ فِيهَا وَ الشِّدَّةَ فِي طَاعَةِ اللَّهِ وَ وَلَايَتِهِ وَ وَلَايَةِ مَنْ أَمَرَ بِوَلَايَتِهِ خَيْرٌ عَاقِبَةً عِنْدَ اللَّهِ فِي الْآخِرَةِ مِنْ مُلْكِ الدُّنْيَا وَ إِنْ طَالَ تَتَابُعُ نَعِيمِهَا وَ زَهْرَتِهَا وَ غَضَارَةُ عَيْشِهَا فِي مَعْصِيَةِ اللَّهِ وَ وَلَايَةِ مَنْ نَهَى اللَّهُ عَنْ وَلَايَتِهِ وَ طَاعَتِهِ فَإِنَّ اللَّهَ أَمَرَ بِوَلَايَةِ الْأَئِمَّةِ الَّذِينَ سَمَّاهُمُ اللَّهُ فِي كِتَابِهِ فِي قَوْلِهِ وَ جَعَلْناهُمْ أَئِمَّةً يَهْدُونَ بِأَمْرِنا وَ هُمُ الَّذِينَ أَمَرَ اللَّهُ بِوَلَايَتِهِمْ وَ طَاعَتِهِمْ وَ الَّذِينَ نَهَى اللَّهُ عَنْ وَلَايَتِهِمْ وَ طَاعَتِهِمْ وَ هُمْ أَئِمَّةُ الضَّلَالَةِ الَّذِينَ قَضَى اللَّهُ أَنْ يَكُونَ لَهُمْ دُوَلٌ فِي الدُّنْيَا عَلَى أَوْلِيَاءِ اللَّهِ الْأَئِمَّةِ مِنْ آلِ مُحَمَّدٍ يَعْمَلُونَ فِي دُولَتِهِمْ بِمَعْصِيَةِ اللَّهِ وَ مَعْصِيَةِ رَسُولِهِ ( صلى الله عليه وآله ) لِيَحِقَّ عَلَيْهِمْ كَلِمَةُ الْعَذَابِ وَ لِيَتِمَّ أَنْ تَكُونُوا مَعَ نَبِيِّ اللَّهِ مُحَمَّدٍ ( صلى الله عليه وآله ) وَ الرُّسُلِ مِنْ قَبْلِهِ فَتَدَبَّرُوا مَا قَصَّ اللَّهُ عَلَيْكُمْ فِي كِتَابِهِ مِمَّا ابْتَلَى بِهِ أَنْبِيَاءَهُ وَ أَتْبَاعَهُمُ الْمُؤْمِنِينَ ثُمَّ سَلُوا اللَّهَ أَنْ يُعْطِيَكُمُ الصَّبْرَ عَلَى الْبَلَاءِ فِي السَّرَّاءِ وَ الضَّرَّاءِ وَ الشِّدَّةِ وَ الرَّخَاءِ مِثْلَ الَّذِي أَعْطَاهُمْ وَ إِيَّاكُمْ وَ مُمَاظَّةَ أَهْلِ الْبَاطِلِ وَ عَلَيْكُمْ بِهُدَى الصَّالِحِينَ وَ وَقَارِهِمْ وَ سَكِينَتِهِمْ وَ حِلْمِهِمْ وَ تَخَشُّعِهِمْ وَ وَرَعِهِمْ عَنْ مَحَارِمِ اللَّهِ وَ صِدْقِهِمْ وَ وَفَائِهِمْ وَ اجْتِهَادِهِمْ لِلَّهِ فِي الْعَمَلِ بِطَاعَتِهِ فَإِنَّكُمْ إِنْ لَمْ تَفْعَلُوا ذَلِكَ لَمْ تُنْزَلُوا عِنْدَ رَبِّكُمْ مَنْزِلَةَ الصَّالِحِينَ قَبْلَكُمْ وَ اعْلَمُوا أَنَّ اللَّهَ إِذَا أَرَادَ بِعَبْدٍ خَيْراً شَرَحَ صَدْرَهُ لِلْإِسْلَامِ فَإِذَا أَعْطَاهُ ذَلِكَ أَنْطَقَ لِسَانَهُ بِالْحَقِّ وَ عَقَدَ قَلْبَهُ عَلَيْهِ فَعَمِلَ بِهِ فَإِذَا جَمَعَ اللَّهُ لَهُ ذَلِكَ تَمَّ لَهُ إِسْلَامُهُ وَ كَانَ عِنْدَ اللَّهِ إِنْ مَاتَ عَلَى ذَلِكَ الْحَالِ مِنَ الْمُسْلِمِينَ حَقّاً وَ إِذَا لَمْ يُرِدِ اللَّهُ بِعَبْدٍ خَيْراً وَكَلَهُ إِلَى نَفْسِهِ وَ كَانَ صَدْرُهُ ضَيِّقاً حَرَجاً فَإِنْ جَرَى عَلَى لِسَانِهِ حَقٌّ لَمْ يُعْقَدْ قَلْبُهُ عَلَيْهِ وَ إِذَا لَمْ يُعْقَدْ قَلْبُهُ عَلَيْهِ لَمْ يُعْطِهِ اللَّهُ الْعَمَلَ بِهِ فَإِذَا اجْتَمَعَ ذَلِكَ عَلَيْهِ حَتَّى يَمُوتَ وَ هُوَ عَلَى تِلْكَ الْحَالِ كَانَ عِنْدَ اللَّهِ مِنَ الْمُنَافِقِينَ وَ صَارَ مَا جَرَى عَلَى لِسَانِهِ مِنَ الْحَقِّ الَّذِي لَمْ يُعْطِهِ اللَّهُ أَنْ يُعْقَدَ قَلْبُهُ عَلَيْهِ وَ لَمْ يُعْطِهِ الْعَمَلَ بِهِ حُجَّةً عَلَيْهِ يَوْمَ الْقِيَامَةِ فَاتَّقُوا اللَّهَ وَ سَلُوهُ أَنْ يَشْرَحَ صُدُورَكُمْ لِلْإِسْلَامِ وَ أَنْ يَجْعَلَ أَلْسِنَتَكُمْ تَنْطِقُ بِالْحَقِّ حَتَّى يَتَوَفَّيكُمْ وَ أَنْتُمْ عَلَى ذَلِكَ وَ أَنْ يَجْعَلَ مُنْقَلَبَكُمْ مُنْقَلَبَ الصَّالِحِينَ قَبْلَكُمْ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ وَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ وَ مَنْ سَرَّهُ أَنْ يَعْلَمَ أَنَّ اللَّهَ يُحِبُّهُ فَلْيَعْمَلْ بِطَاعَةِ اللَّهِ وَ لْيَتَّبِعْنَا أَ لَمْ يَسْمَعْ قَوْلَ اللَّهِ عَزَّ وَ جَلَّ لِنَبِيِّهِ ( صلى الله عليه وآله ) قُلْ إِنْ كُنْتُمْ تُحِبُّونَ اللَّهَ فَاتَّبِعُونِي يُحْبِبْكُمُ اللَّهُ وَ يَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَ اللَّهِ لَا يُطِيعُ اللَّهَ عَبْدٌ أَبَداً إِلَّا أَدْخَلَ اللَّهُ عَلَيْهِ فِي طَاعَتِهِ اتِّبَاعَنَا وَ لَا وَ اللَّهِ لَا يَتَّبِعُنَا عَبْدٌ أَبَداً إِلَّا أَحَبَّهُ اللَّهُ وَ لَا وَ اللَّهِ لَا يَدَعُ أَحَدٌ اتِّبَاعَنَا أَبَداً إِلَّا أَبْغَضَنَا وَ لَا وَ اللَّهِ لَا يُبْغِضُنَا أَحَدٌ أَبَداً إِلَّا عَصَى اللَّهَ وَ مَنْ مَاتَ عَاصِياً لِلَّهِ أَخْزَاهُ اللَّهُ وَ أَكَبَّهُ عَلَى وَجْهِهِ فِي النَّارِ وَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ .",
                "englishText": "1. Muhammad Ibn Yaqub Al-Kulayni has narrated that, ‘Narrated to me Ali Ibn Ibrahim from his father from Ibn FaddAl-from Hafs al-Mu’Adhdhin from Abu Abdullah  as well as Muhammad Ibn ’Ismail Ibn Bazi’ from Muhammad Ibn Sinan from ’Ismail Ibn Jabir that - ‘Abu Abdullah , wrote this letter to his  companions and commanded them to study it, ponder over it, and make a pact by it, and act in accordance with. They used to keep it in their places of Prayer in their homes. So when they were free from their Prayers, they would look into it’. He said, ‘Narrated to me A-Hassan Ibn Muhammad, from Ja’far Ibn Muhammad Ibn Malik al-Kufiy from al-Qasim Ibn Al-Rabi’ Al-Sahhaf from ’Ismail Ibn Mukhallad Al-Sarraj from Abu Abd Allah . He said that, ‘I brought out this letter of Abu Abdullah  to his  companions – ‘In the Name of Allah (azwj), the Beneficent, the Merciful. Having said that, I  ask your Lord (azwj) to grant you all good health. It is for you all to have tenderness, dignity and tranquility, and it is for you to be bashful and keep yourselves clear, just as the righteous people before you have done. It is for you to be courteous with the people of falsehood. You will bear injustices from them, and beware of disputing with them in what is between you and them. When you sit with them, and are alone with them and argue your differences with them, there is no way out for you but to sit with them and be alone with them, and argue with them by the dissimulation which Allah (azwj) has Ordered you for, that you should take to it regarding what is between you and them. So if you are tested with that from them, that they wish to harm you and you can recognise abhorrence in their faces, and if Allah (azwj), the High does not Dispel them away from you, they would rob you. And what is in their chests of enmity and hatred is much more than what they display to you. Your gatherings and their gatherings are one and the same, but your spirits and their spirits are different. You will not reconcile with them and you will never lover them, ever, and they will never love you as well. Surely Allah (azwj) the High has Honoured you all with the truth and Made you to visualise it, and did not Make them to be deserving of it. Be courteous to them and be patient with them, for they have no courtesy to you nor do they have patience over anything, and some of them are obsessed with tricking the others, for the enemies of Allah (azwj) have the ability to keep you from the truth. Allah (azwj) Protects you from that, so fear Allah (azwj) and hold back your tongues except from the good, and beware of letting your tongues to slip into speaking that which is false, and the slanderous, and the sinful, and the violation. So if you were to hold back your tongues from what is disliked by Allah (azwj), from what He (azwj) has Forbidden you from, it would be better for you with your Lord (azwj) than letting your tongues slip into what is disliked by Him (azwj) and what He (azwj) has Prohibited you from. There is destruction for the servant, with Allah (azwj), and Repugnance from Allah (azwj), and there will be deafness, and blindness, and muteness which Allah (azwj) will Make him to inherit on the Day of Judgement. So they will become just as Allah (azwj) has said: “[2:18] Deaf, dumb (and) blind, so they will not turn back”, it means that they will not be speaking and will not have the Permission to present their excuses. And beware from what Allah (azwj) has Prohibited you from doing, and it is for you to remain silent except with regards to what Allah (azwj) has Benefited you by from the matters of your Hereafter and be Rewarded by Him (azwj). And be frequent in Extolling His (azwj) Holiness, and Glorification, and the Praising to Allah (azwj), and the desires for what is with Him (azwj) from the Good which cannot be estimated, nor can anyone reach it (imagine), so occupy your tongues with that in order to avoid the false speech which would lead its owners to an eternity in the Fire for the one who dies upon it and does not repent to Allah (azwj), and does not keep away from it. And it is for you to supplicate, for the Muslims cannot be successful in the fulfilment of their wishes with their Lord (azwj) by any means higher than supplication and desiring from Him (azwj), and appealing to Allah (azwj), and the asking from Him (azwj). So be desirous in what you request to Allah (azwj) so that He (azwj) would Answer you to what you have supplicated to Him (azwj) in order to be successful and be saved from the Punishment of Allah (azwj). And beware of being greedy for yourselves to something from what Allah (azwj) has Prohibited to you. For the one who violates what Allah (azwj) has Prohibited to him here in the world, Allah (azwj) would Place a block between him and the Paradise, and its Bounties, and its enjoyments, and its Prestige which will stand for all eternity for the inhabitants of the Paradise, for ever and ever. And know that it is an evil misfortune for the one who takes the risk of endangering the obedience to Allah (azwj) the Blessed, and to be disobedient to Him (azwj). So the choosing to violate what Allah (azwj) has Prohibited from the pleasures of the world would cut its people off from the eternal-Bliss in the Paradise, and its pleasures, and the prestige of its inhabitants. Woe be unto those! What a frustration they will face when they lose, and evil would be their condition with their Lord (azwj) on the Day of Judgement. Seek Refuge with Allah (azwj) that He (azwj) would Protect you from being in a situation similar to theirs forever, and be in afflictions like their afflictions. And there is no Might with us  or with you except by Him (azwj). So, fear Allah (azwj), O group of saved people, that Allah (azwj) will Complete for you what He (azwj) has Granted you with, for the matter will not be complete until He (azwj) Makes you to enter into similar of what came upon the righteous ones before you, and until you face tribulation with regards to yourselves and your wealth, and until you hear from the enemies of Allah (azwj), a lot of painful words. So, observe patience and take it in your stride, and even if they humiliate you, and hate you, and even if they burden you with injustices. So bear these from them, seeking by that the Face of Allah (azwj) and the House of the Hereafter, and until you control your intense anger in the suffering for the sake of Allah (azwj) Mighty and Majestic. They will incriminate you, and even belie you about the truth, and be inimical towards you with regards to it, and be hateful towards you. So, observe patience on that from them, and all that has been Ratified in the Book of Allah (azwj) which Jibraeel  Descended with upon your Prophet ﷺ, getting your Prophet ﷺ to hear the Words of Allah (azwj) Mighty and Majestic: “[46:35] Therefore bear up patiently as did the messengers endowed with constancy bear up with patience and do not seek to hasten for them (their doom).” Then He (azwj) Said: “[35:4] And if they call you a liar, truly messengers before you were called liars”. So observe patience on what they lie about and hurt you with, for they had belied the Prophet ﷺ of Allah (azwj), and the Messengers  from before him ﷺ, and hurt them along with the denial of the truth. And if you are happy with the Commands of Allah (azwj) regarding them  whom Allah (azwj) Created for Himself (zwj) in the Beginning (beginning of the creation), from the infidelity which has preceded in the Knowledge of Allah (azwj) that He (azwj) Created them in the origin and the ones whom Allah (azwj) has Named in His (azwj) book in His (azwj) Words: “[28:41] And We made them Imams who call to the fire”. So, ponder over this and hold on to it, and do not be ignorant of it, for the one who is ignorant of this and the like of this which Allah (azwj) has Made to be Obligatory in His (azwj) Book from what Allah (azwj) has Ordered for and Prohibited from, has disregarded the Religion of Allah (azwj) and became disobedient to Him (azwj). Therefore he has necessitated (upon himself) the Outrage of Allah (azwj), and Allah (azwj) will Fling him into the Fire upon his face’. And he  said: ‘O you group of Blessed ones, the victorious ones! Surely, Allah (azwj) Completed for you what He (azwj) Granted you all from the good, and know that it is not from the Knowledge of Allah (azwj), nor from His (azwj) Commands that any one from the creatures of Allah (azwj), should take to opinions or analogies regarding his Religion. Allah (azwj) Has Sent down the Quran and Made to be in it an explanation of all things, and Assigned for the Quran and the teaching of the Quran, its People . There is no leeway for the People  of knowledge of the Quran whom  Allah (azwj) had Given to them of its Knowledge, that they  should take to desires, or opinions, or analogies with regards to it. Allah (azwj) has Made them  to be needless from that by what He (azwj) has Given them  from His (azwj) Knowledge, and Specialised them  by it, and Placed in it Prestige from Allah (azwj) to Honour them  by. And they  are the People  of the Remembrance (Ahl Al-Zikr) whom Allah (azwj) has Ordered the people to ask them , and they  are the ones  to be asked. And it has preceded in the Knowledge of Allah (azwj) that they should ratify them , and follow their  footsteps. He (azwj) Guided them , and Gave them  from the Knowledge of the Quran with which they  guide (others) to Allah (azwj) by His (azwj) Permission, and to all the ways of the truth. And they  are the ones  that He (azwj) does not Want them to be released from, and from asking them , and from being taught by them  which Allah (azwj) has Honoured them  with and Made it to be with them , except for the one who has preceded in the Knowledge of Allah (azwj), as being the miserable one in the origin of the creation underneath the shadow. So these are the ones who turn away from asking the People  of the Remembrance (Ahl Al-Zikr) and the ones  to whom Allah (azwj) has Granted the Knowledge of the Quran and Placed it in their  possession, and Ordered for asking them . These are the ones who act on their desires, and their opinions, and their analogies to the extent that Satan (la) enters them, (as a result) they (try) to revert the believing people, in the Knowledge of the Quran with Allah (azwj), as disbelievers, and try to make the misguided people, in the Knowledge of the Quran with Allah (azwj), as believer, but to the extent that they declare what Allah (azwj) has Made Permissible, in many matters as being prohibited, and pronounce what Allah (azwj) has Prohibited, in many matters as being permissible. So this is the origin of the fruit of their desires. And the Messenger ﷺ of Allah (azwj) had taken an oath from them before his ﷺ passing away. So they said, ‘After Allah (azwj) Captures His (azwj) Messenger ﷺ, we have the leeway of taking to the consensus of the opinions of the people. After Allah (azwj) Mighty and Majestic Captured His (azwj) Messenger ﷺ, and after his ﷺ oath which he ﷺ took from us , and ordered us  by, they opposed Allah (azwj) and His (azwj) Messenger ﷺ. So what is more audacious to Allah (azwj), nor any clear misguidance from the one who takes to that, and alleges that it gives him the leeway to do it? By Allah (azwj), surely Allah (azwj) has Obligated His (azwj) creatures that they should obey Him (azwj), and follow His (azwj) Commands during the lifetime of Muhammad ﷺ, and after his ﷺ passing away. Can those enemies of Allah (azwj) who are alleging that anyone who became a Muslim with Muhammad ﷺ, can take to his own words, and his own opinions, and his own analogies? But if he says, ‘Yes, then, surely, he has lied to Allah (azwj) and has strayed a far straying, and if he says, ‘No, it is not for anyone that he should take to his opinions, and his desires, and his analogies’, so he has argued against himself, and he is from the ones who allege that Allah (azwj) has to be Obeyed, and His (azwj) Orders to be followed after the passing away of the Messenger ﷺ of Allah (azwj). Allah (azwj) has said, and His (azwj) words are true: “[3:144] And Muhammad is no more than a messenger; the messengers have already passed away before him; if then he dies or is killed will you turn back upon your heels? And whoever turns back upon his heels, he will by no means do harm to Allah in the least and Allah will reward the grateful”, and that is something which they knew that Allah (azwj) is to be obeyed and His (azwj) Commands are to be followed during the lifetime of Muhammad ﷺ, and (as well as) after Allah (azwj) had Made Muhammad ﷺ to pass away. And if it was not for anyone from the people who were with Muhammad ﷺ that they would take to their own desires, and their opinions, and their analogies in opposition to the orders of Muhammad ﷺ, so similarly it is not for anyone from the people after Muhammad ﷺ that they would take to their own desires, and their opinions, and their analogies’. And he  said: ‘Leave the raising of your hands in the Prayer except for the one time when you open the Prayer, for the people have publicised you all by that, and Allah (azwj) is the Helper, and there is no Might and there is no Power except by Allah (azwj)’. And he  said: ‘Supplicate frequently to Allah (azwj) for Allah (azwj) Loves the ones from the believing servants that they should supplicate to Him (azwj), and Allah (azwj) has Promised the believing servants for the Answering, and Allah (azwj) has Destined the supplications of the Believers, on the Day of Judgement, to increase their deeds by it in the Paradise. So, frequently remember Allah (azwj) in accordance with your abilities in every hour of the hours of the night and the day, for Allah (azwj) has Ordered for frequent Remembrance (Al-Zikr) to Him (azwj), and Allah (azwj) Remembers the one who remembers Him (azwj) from the Believers. And know, that Allah (azwj) never Remembers anyone from His (azwj) believing servant except Remembering him with Goodness. So give Allah (azwj) from yourselves, the struggle in obedience to Him (azwj), for Allah (azwj) does not Accept anything from the good with Him (azwj) except by obedience to Him (azwj), and the avoidance of His (azwj) Prohibitions which Allah (azwj) has Prohibited in the apparent of the Quran and in its hidden. Allah (azwj) Blessed and High has Said in His (azwj) Book, and His (azwj) Words are True: “[6:120] And abandon open and secret sin”. And know that whatever Allah (azwj) has Ordered you to avoid, so He (azwj) has Prohibited it, and follow the footsteps of the Messenger ﷺ of Allah (azwj), and his ﷺ Sunnah, so adhere to it and do not follow your own desires, and your opinions, for you will go astray. The most misguided of the people with Allah (azwj) is the one who follows his own desires and his opinion without (following the) Guidance from Allah (azwj). And do good for yourselves in accordance with your abilities, for if you do good, it would be for your own selves, and if you violate, it would be against your own selves. And intermingle with the people and do not burden them upon your necks, including along with that the obedience to your Lord (azwj). And beware of insulting the enemies of Allah (azwj) when they are listening to you, for the enemies will insult Allah (azwj) without awareness, and it is better that you should know the penalty of insulting Allah (azwj) and what it is. He who has insulted the friends of Allah (azwj) is like he has insulted Allah (azwj). And the one who is the most unjust with Allah (azwj) is the one who insults Allah (azwj) and the friends of Allah (azwj), so don’t do it, don’t do it. Follow the Commands of Allah (azwj). There is no Might, and no Power except by Allah (azwj)’. And he  said: ‘O you group for whom Allah (azwj) has Protected for them their affairs! It is for you to follow the footsteps of the Messenger ﷺ of Allah (azwj) and his ﷺ Sunnah, and the footsteps of the Imams  of Guidance from the People  of the Household of the Messenger ﷺ of Allah (azwj) from after him ﷺ and their  Sunnah. So the one who takes to that has been guided, and the one who avoided that and abandoned it, went astray, because they  are the ones  for whom Allah (azwj) Commanded (the people) to be obedient to, and for their  Wilayah. And our  father  the Messenger ﷺ of Allah (azwj) has said: ‘The continuation upon the deeds in the following of the footsteps and the Sunnah, even though they may be little, is more Pleasing to Allah (azwj) and beneficial with Him (azwj) in the Rewards, than the struggle in the ‘Bittah) heresy, and the desires. Indeed, the following of the desires, and the following of the heresies (innovations) without Guidance from Allah (azwj) is misguidance, and every misguidance is heresy, and every heretic will be in the Fire. And nothing can be achieved from the good with Allah (azwj) except by being obedient to Him (azwj), and the patience and being agreeable, because the patience and being agreeable is from the obedience to Allah (azwj). And know, that a servant from the servants has not believed until he is happy with Allah (azwj) with regards to whatever Allah (azwj) has Done for him, and what he has done for Him (azwj) in accordance with what He (azwj) Likes and Dislikes. And Allah (azwj) does not Do with the one who is patient and happy with Allah (azwj) except that which he is deserving of, and that which is better for him, from what he likes or dislikes. And it is for you to “[2:238] Attend constantly to prayers and to the middle prayer and stand up truly obedient to Allah”, just as Allah (azwj) has Commanded the Believers in His (azwj) Book which is in front of you. And beware, and it is for you to love the poor Muslims, for the one who considers them to be lowly due to his own arrogance, so he has slipped from the Religion of Allah (azwj), and Allah (azwj) has for him (a situation of) lowliness and hate. And the Messenger ﷺ of Allah (azwj) has said: ‘My ﷺ Lord (azwj) has Commanded me ﷺ to love the poor among the Muslims’. And know, that the one who belittles anyone from the Muslims will meet Allah (azwj) having Hatred towards him and lowliness from Him (azwj) to the extent that the people will hate him and Allah (azwj) will have intense Hatred towards him. Fear Allah (azwj) with regards to your brothers who are poor Muslims, for they have a right over you that you should love them. Allah (azwj) Commanded His (azwj) Messenger ﷺ to love them, so the one who does not love the one whom Allah (azwj) has Commanded to love, so he has disobeyed Allah (azwj) and His (azwj) Messenger ﷺ, and the one who disobeys Allah (azwj) and His (azwj) Messenger ﷺ and dies upon that, would have died whilst being from the misguided ones. And beware of (considering for yourself) greatness and arrogance, for the Arrogance is the Robe of Allah (azwj) Mighty and Majestic, so the one who disputed with Allah (azwj) for His (azwj) Robe, Allah (azwj) will Reduce him and Disgrace him on the Day of Judgement. And beware of injustices of some of you against the others, for it is not from the characteristics of the righteous. The one who is unjust, Allah (azwj) will Turn his injustice against his own self, and Make His (azwj) Help to be for the one who he was unjust to, and the one whom Allah (azwj) Helps will overcome and be of the group of winners from Allah (azwj). And beware of the envying of some of you against the others, for the disbelief is the origin of the envy. And beware of helping against an oppressed Muslim, for he would supplicate to Allah (azwj) against you and He (azwj) would Answer him regarding you. Our  forefather ﷺ the Messenger ﷺ of Allah (azwj) used to say that: ‘The supplication of an oppressed Muslims gets Answered’. And help each other, for our  forefather ﷺ, the Messenger ﷺ of Allah (azwj) used to say that: ‘Helping a Muslim is better and greater in Reward than the Fasting for a month, and seclusion (Al-I’tikaaf) in the Masjid Al-Haraam (The Sacred Masjid). And beware of creating difficulties for anyone from your Muslim brothers if he owes you anything from before and he is insolvent, for our  forefather the Messenger ﷺ of Allah (azwj) used to say: ‘It is not for a Muslim to make difficulties for a Muslim, and the one who is considerate to the insolvent will be Shaded by Allah (azwj) by a shade on the Day in which there will no shade except for His (azwj) Shade’. And beware, O group under the Mercy and preferred ones over the others, of withholding the Rights of Allah (azwj) before you, day after day and hour after hour, for the one who makes haste in (giving) the Rights of Allah (azwj) which are in front of him, then Allah (azwj) has the Power over the Hastening to him for the multiplication of the good, either immediately or later on. And the one who delays the Rights of Allah (azwj), then Allah (azwj) has the Power over Delaying his sustenance, and the one from whom Allah (azwj) Withholds his sustenance, he would not have the ability to sustain himself. So give to Allah (azwj) the Right from what He (azwj) has Granted you so that He (azwj) would Purify for you the remainder of it, and Complete for you from the Multiplication for you, the excessive Multiplication, the count of which is not known to any but Him (azwj), or its virtues, the Lord (azwj) of the Worlds’. And he  said: ‘Fear Allah (azwj), O group, if you could, and dont be an embarrassment for the Imam , for the one who causes embarrassment for the Imam , he is the one who discredits the righteous people, the ones who follow the Imam  of the Muslims for his  virtues, the patient ones upon the payment of his  rights, the ones who understand his  sanctity. And know, that the one who descends to that level with (respect) the Imam , so he has embarrassed the Imam  (by associating himself with him ) He would do that by cursing the righteous people the ones who (strictly) follow him  from the Muslims for their virtues, the patient ones upon the paying of his  rights, the ones who have recognised his  sanctity, so his curse against (the pious ones) is for the enemies of Allah (azwj), as the Imam  converts that curse into Mercy from Allah (azwj) upon them (the pious ones), and turns the Curse from Allah (azwj) and from the Angels, and from His (azwj) Messenger ﷺ upon them (the deniers). And know, O group, that the Sunnah from Allah (azwj) has flowed within the righteous ones before’. And he  said: ‘The one who wishes to meet Allah (azwj) as a Believer, ‘Haqqan’ Haqqan’ (surely and truly), so he should befriend Allah (azwj), and His (azwj) Messenger, and those who believed , and should distance himself from their  enemies, and accept whatever that has ended up with him from their  virtues, because their  virtues cannot be comprehended by the ‘مَلَكٌ مُقَرَّبٌ’ Angels of Proximity, or ‘نَبِيٌّ مُرْسَلٌ’ the Messenger Prophets , but some among them. Have you not heard what Allah (azwj) has Mentioned from the virtues of following the Imams  of Guidance, and they are the Believers? He (azwj) Said: “[4:69] And whoever obeys Allah and the Messenger, these are with those upon whom Allah has bestowed favors from among the prophets and the truthful and the martyrs and the good, and a goodly company are they!” This is just one perspective from the perspectives of the virtues of following the Imams , so how can others (comprehend) them  and their  virtues? And the one who wishes that Allah (azwj) should Complete for him his faith and he becomes a devout and true Believer, he should fulfill to Allah (azwj) His (azwj) Conditions which He (azwj) has Placed upon the Believers. He (azwj) has Placed the conditions of His (azwj) Wilayah along with the Wilayah of His (azwj) Messenger ﷺ, and the Wilayah of the Imams  of the Believers. He should establish the Prayer, and give the Zakaat, and give to Allah (azwj) goodly loans (Karza e Hasana), and avoid the immoralities, both openly as well as discreetly. There does not remain anything from the detail of what Allah (azwj) has Prohibited, except that it is included in its entirety in His (azwj) Statement. So the one who makes it to be his Religion in what is between himself and Allah (azwj), being sincere to Allah (azwj), and does not authorise for himself to ignore anything from this, so he is, in the Sight of Allah (azwj), in His (azwj) Triumphant Party, and he is from the true Believers. And beware of insisting upon something from what Allah (azwj) has Prohibited in the Apparent of the Quran and its Hidden. And Allah (azwj) the High has Said: “[3:135] and (who) do not knowingly persist in what they have done” (Up to this point it is the narration of Al-Qasim Bin Rabi’e). It means that the Believers before them, when they forgot something from what Conditions Allah (azwj) had Placed upon them in His (azwj) Book, would come to the realisation that they had disobeyed Allah (azwj) in their avoidance of that thing. So they would seek Forgiveness and would not repeat it. So that is the meaning of the Statement of Allah (azwj): “[3:135] and (who) do not knowingly persist in what they have done”. And know that He (azwj) has Commanded and Prohibited, so that there should be obedience in what He (azwj) has Commanded for, and avoidance in what He (azwj) has Prohibited from. So the one who has followed His (azwj) Commands has obeyed Him (azwj), and has realised everything from the good, which is with Him (azwj), and the one who did not avoid what Allah (azwj) has Prohibited from, so he has disobeyed Him (azwj). So if he were to die upon being disobedient to Him (azwj), Allah (azwj) will Fling him upon his face in the Fire. And know, that there is nothing else between Allah (azwj) and anyone from His (azwj) creatures, Angels of Proximity, or Messenger Prophets , or all others apart from that, except for their obedience to Him (azwj). So strive in being obedient to Allah (azwj), if you wish to become true Believers, truly, and there is not Strength except by Allah (azwj)’. And he  said: ‘And it is for you to obey your Lord (azwj) in accordance with your abilities, for Allah (azwj) is your Lord (azwj). And know that the Islam is the submission, and the submission is the Islam. So the one who submits, so he has Islam, and the one who does not submit, there is no Islam to him. And the one wishes to do himself a favour, so he should obey Allah (azwj), for the one who has obeyed Allah (azwj) has indeed done himself a favour. And beware of being disobedient to Allah (azwj) if you were to do it. The one who violated by being disobedient to Allah (azwj), so he has disfavoured himself, and there is no station between favour and disfavour. For the ones who have done a favour in the Sight of their Lord (azwj), is Paradise, and for the ones who have violated in the Sight of their Lord (azwj), is the Fire. So, know that you have to be obedient to Allah (azwj) and avoid being disobedient to Him (azwj). And know, that there is none who is needless of Allah (azwj) from His (azwj) creatures, neither the Angels of Proximity, nor the Messenger Prophets , nor anyone other than that. So the one who wishes that he should benefit from the intercession of the intercessors in the Presence of Allah (azwj), so he should seek to Please Allah (azwj). And know that no one from the creatures of Allah (azwj) can achieve the Pleasure of Allah (azwj) except by being obedient to Him (azwj), and being obedient to His (azwj) Messenger ﷺ, and being obedient to the Masters of the Command  (Wali Al-Amr ) from the Progeny  of Muhammad ﷺ, and that the disobedience to them  is disobedient to Allah (azwj). And do not deny their  virtues, be they great or small. And know, that the deniers are the liars, they are the hypocrites, and that Allah (azwj) Mighty and Majestic Said for the hypocrites, and His (azwj) Words are true, that: “[4:145] Surely the hypocrites are in the lowest stage of the fire and you shall not find a helper for them”. And let no one from among you, whom Allah (azwj) has Necessitated upon his heart, obedience to Him (azwj) and being humble to Him (azwj), should fear any one from the people from whom Allah (azwj) has Removed the qualities of the truth and did not Make him to be deserving of it. So the one whom Allah (azwj) has not Made to be deserving of the qualities of the truth, so these are the hypocrites, these are the Satans (la) among the Humans and the Jinn. And it is the Satans (la) among the Humans that trick, and plot, and deceive, and whisper (cast doubts) from some of them to the others, attempting to divert the people of the truth, whom Allah (azwj) has Honoured by Granting them the insight into the Religion of Allah (azwj), and insight which Allah (azwj) has not Considered the Satans (la) among the Humans to be deserving of it, Intending thereby not to equalise the enemies of Allah (azwj) to the people of the truth, with regards to the doubt, and the denial, and the belying to end up being equal as Allah (azwj) the High has Described in His (azwj) Book: “[4:89] They desire that you should disbelieve as they have disbelieved, so that you might be (all) alike”. Then Allah (azwj) prohibited the people of the truth that they should take the enemies of Allah (azwj) as guardians or as helpers. So do not let them scare you, and do not let them repulse you all from the consideration by the truth which Allah (azwj) has Specialised you with from the tricks of the Satans (la) from the Humans, and their plots in your affairs. You should repel the bad by that which is good in what is between you and them, seeking by that the Pleasure of your Lord (azwj) by being obedient to Him (azwj). And they are such that there is no good with them. It is not permissible for you to display to them the Principles of the Religion of Allah (azwj) (Usool Al-Deen) for they are such that they would hear something from you, be inimical against you, and raise (the issue) against you, and strive for destroying you, and place in front of you that which you dislike. And there is no remedy for you from them in the government of the corrupts. So understand your status in what is between you and the people of the falsehood, for it does not befit the people of the truth to descend to the level of the people of the falsehood. (This is due to the fact) that Allah (azwj) did not Make for the people of the falsehood who does not understand His (azwj) Perspective, the status which is with Him (azwj) for the people of the truth. The Statement of Allah (azwj) in His (azwj) Book where He (azwj) Said: “[38:28] Shall We treat those who believe and work deeds of righteousness, the same as those who do mischief on earth? Shall We treat those who guard against evil, the same as those who turn aside from the right?” He (azwj) has Honoured yourselves rather than the people of the falsehood. And do not make Allah (azwj) Blessed and High, and for Him (azwj) is the Highest Example, and your Imams , and the Religion which you have made it to be for yourselves, to be exposed (vulnerable) to the people of the falsehood. Allah (azwj) would be Angered against you, so you will perish. So, do not do it, do not do it (strictly observe Taqeeya). O righteous people! Do not abandon the Commands of Allah (azwj), and the Command from your affairs for the obedience to Him (azwj), lest Allah (azwj) Alters the Blessings for you. Love for the sake of Allah (azwj) (the ones of similar qualities to yourselves), and hate for the Sake of Allah (azwj) the ones who oppose you. And extend your cordiality and your advice to the ones who possess your qualities, and do not extend it to the ones who have abandoned your qualities, and are inimical towards you, and rebel against you, and wish for calamities to befall upon you. This is our  education which Allah (azwj) Has Educated us  with. So take to it, and understand it and fetter it (to yourselves), and do not throw it behind your backs, whatever is compatible with your guidance and take to it, and whatever is along the lines of your own desires, discard it and do not follow it. And beware of the arrogance against Allah (azwj), and know that a servant is not afflicted by the arrogance against Allah (azwj) except that he is arrogant against the Religion of Allah (azwj). Be upright for the Sake of Allah (azwj) and do not turn back upon your heels, for your will have turn back as losers. May Allah (azwj) Protect us. And beware from the arrogance against Allah (azwj), and there is not strength for us  or for you except by Allah (azwj)’. And he  said: ‘If Allah (azwj) had Created a servant originally, in the original creation as a Believer, he will never die until Allah (azwj) Makes him to detest the evil and he distances himself from it, and the one whom Allah (azwj) has Made to detest the evil and he distances himself from it, Allah (azwj) will Cure him from the arrogance and the forcefulness which has entered into him. So his nature becomes soft, and his morals beautiful, and his face bright, and the reverence of Islam comes to him, and tranquility, and the humbleness, and he restrains himself from the Prohibitions of Allah (azwj) and avoids His (azwj) Harshness. And Allah (azwj) Grants to him the sustenance of the cordiality of the people, and intermingling with them, and avoidance of the cutting off from the people, and the rivalries, and does not get involved with anything from it or the likes of it in anything. However, if Allah (azwj) had Created a servant originally, in the original creation as an infidel, he will never die until he loves the evil and goes near to it. So if the evil becomes beloved to him and he goes near to it, he gets involved in the infidelity, and the forcefulness. So his heart hardens, and his morals deteriorate, and his face darkens, his immorality gets displayed, and his shame becomes little, and Allah (azwj) Uncovers his veil, and he rides upon the Prohibitions. So he never ceases from these tendencies and rides upon the disobedience to Allah (azwj), and hates to obey Him (azwj), and the obedient ones. So the condition of the Believers and the condition of the infidel are in contradiction. Ask Allah (azwj) for health, and seek it from Him (azwj), and there is not Might nor Strength except by Allah (azwj). Observe patience upon the afflictions in the world if you are followed by the afflictions, and intensify the obedience to Allah (azwj), and His (azwj) Wilayah, and the Wilayah of the ones  He (azwj) has Commanded for, it is the better result with Allah (azwj) in the Hereafter, than the kingdom of the world, even though its bounties, and its flowers, and its affluence may be prolonged in the disobedience to Allah (azwj), and in the Wilayah of the one  whom Allah (azwj) has Forbidden from being in his Wilayah, and in his obedience. Allah (azwj) has Commanded for the Wilayah of the Imams  whom Allah (azwj) has Names in His (azwj) Book in His (azwj) Statement: “[21:73] And We made them Imams who guided (people) by Our command” and they  are the ones  for whom  Allah (azwj) has Commanded the Wilayah for, and to be in their  obedience. And the ones whom Allah (azwj) has Forbidden to be in their wilayah, these are the imams of misguidance, for whom Allah (azwj) has Decreed for them the governance in the world over the friends of Allah (azwj) and the Imams  from the Progeny  of Muhammad ﷺ. They act in disobedience to Allah (azwj) in their governments, and in disobedience to His (azwj) Messenger ﷺ so that the Words of the Punishment become reality against them, and that you can end up being with the Prophet ﷺ of Allah (azwj) Muhammad ﷺ and the Messengers  before him ﷺ. So ponder over what stories Allah (azwj) has Related to you in His (azwj) Book of the trials which the His (azwj) Prophets  were Tested by, and the Believers followed them (sa). Then ask Allah (azwj) to Grant you patience upon the affliction in the thick and thin, and the difficulties, and the prosperity, similar to which was Given to them. And beware of debating with the people of the falsehood. And it is for you to follow the guidance of the righteous ones, and their dignified (manners), and their tranquility, and their forbearance, and their humbleness, and their distancing themselves from the Prohibitions of Allah (azwj), and their truthfulness, and their loyalty, and their struggle for the Sake of Allah (azwj) in the deeds by being obedient to Him (azwj). So if you were not to do that, then you will never rise to the status of the righteous ones from before you have with your Lord (azwj). And know that if Allah (azwj) Intends good for a servant, He (azwj) opens his chest for the Islam. So He (azwj) Grants him that he will speak the truth by his tongue, and bind his heart to him so that he will act in accordance with it. So if Allah (azwj) Gathers that to him, He (azwj) Completes for him, his Islam, and if he were to die whilst being upon that, he would have died as being one of the true Muslims. And if Allah (azwj) does not Intend good for a servant, He (azwj) Leaves him to his own self, and his chest becomes constricted and an embarrassment for him. If a true (word) flows from his tongue, his heart does not accept it from him, and if his heart does not accept it from him, he does not follow Allah (azwj) and acts in accordance with it. So if that is gathered to him until he dies whilst being upon that condition, he, then, will be of the hypocrites with Allah (azwj). And all that flowed upon his tongues from the truth which he did not follow Allah (azwj) and his heart did not accept it from him, and he did not act in accordance with it, would be a proof against him on the Day of Judgement. So fear Allah (azwj) and ask Him (azwj) that He (azwj) should Open your chests for the Islam, and that He (azwj) should Make your tongues to speak with the truth until you die whilst being upon that, and that He (azwj) should Make your return (to the Hereafter to be like the) returning of the righteous ones before you. And there is not Strength except by Allah (azwj), and Praise is due to Allah (azwj) the Lord (azwj) of the worlds. And the one who wishes that he should know whether Allah (azwj) Loves him, so he should act in obedience to Allah (azwj) and follow us . Have you not heard the Words of Allah (azwj) Mighty and Majestic to His (azwj) Prophet ﷺ: “[3:31] Say: If you love Allah, then follow me, Allah will love you and forgive you your faults, and Allah is Forgiving, Merciful” By Allah (azwj), no servant will be in obedience to Allah (azwj) ever until Allah (azwj) Makes him to be included along with obedience to Him (azwj), obedience to us . And, by Allah (azwj), no servant will be following us  ever until Allah (azwj) Loves him. And, by Allah (azwj), no servant leaves following us  ever except that he hates us . And, by Allah (azwj), no one ever hates us  except that he disobeys Allah (azwj). And the one who dies whilst being in disobedience to Allah (azwj), Allah (azwj) will Disgrace him and Fling him upon his face in the Fire. And Praise is due to Allah (azwj), the Lord (azwj) of the worlds’.",
                "href": "https://thaqalayn.net/hadith/8/1/1/1",
                "gradings": {}
            }
        }
    },
    {
        "1": {
            "2": {
                "hadithNumber": "Hadith #1",
                "title": "Al-Kafi - Volume 8: The Sahifa of Ali ibn al-Husayn, 'Alayhim al-Salam, and his words on restraint from unlawful matters.",
                "arabicText": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ مَالِكِ بْنِ عَطِيَّةَ عَنْ أَبِي حَمْزَةَ قَالَ مَا سَمِعْتُ بِأَحَدٍ مِنَ النَّاسِ كَانَ أَزْهَدَ مِنْ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) إِلَّا مَا بَلَغَنِي مِنْ عَلِيِّ بْنِ أَبِي طَالِبٍ ( عليه السلام ) قَالَ أَبُو حَمْزَةَ كَانَ الْإِمَامُ عَلِيُّ بْنُ الْحُسَيْنِ ( عليه السلام ) إِذَا تَكَلَّمَ فِي الزُّهْدِ وَ وَعَظَ أَبْكَى مَنْ بِحَضْرَتِهِ قَالَ أَبُو حَمْزَةَ وَ قَرَأْتُ صَحِيفَةً فِيهَا كَلَامُ زُهْدٍ مِنْ كَلَامِ عَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) وَ كَتَبْتُ مَا فِيهَا ثُمَّ أَتَيْتُ عَلِيَّ بْنَ الْحُسَيْنِ ( صلوات الله عليه ) فَعَرَضْتُ مَا فِيهَا عَلَيْهِ فَعَرَفَهُ وَ صَحَّحَهُ وَ كَانَ مَا فِيهَا بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ كَفَانَا اللَّهُ وَ إِيَّاكُمْ كَيْدَ الظَّالِمِينَ وَ بَغْيَ الْحَاسِدِينَ وَ بَطْشَ الْجَبَّارِينَ أَيُّهَا الْمُؤْمِنُونَ لَا يَفْتِنَنَّكُمُ الطَّوَاغِيتُ وَ أَتْبَاعُهُمْ مِنْ أَهْلِ الرَّغْبَةِ فِي هَذِهِ الدُّنْيَا الْمَائِلُونَ إِلَيْهَا الْمُفْتَتِنُونَ بِهَا الْمُقْبِلُونَ عَلَيْهَا وَ عَلَى حُطَامِهَا الْهَامِدِ وَ هَشِيمِهَا الْبَائِدِ غَداً وَ احْذَرُوا مَا حَذَّرَكُمُ اللَّهُ مِنْهَا وَ ازْهَدُوا فِيمَا زَهَّدَكُمُ اللَّهُ فِيهِ مِنْهَا وَ لَا تَرْكَنُوا إِلَى مَا فِي هَذِهِ الدُّنْيَا رُكُونَ مَنِ اتَّخَذَهَا دَارَ قَرَارٍ وَ مَنْزِلَ اسْتِيطَانٍ وَ اللَّهِ إِنَّ لَكُمْ مِمَّا فِيهَا عَلَيْهَا لَدَلِيلًا وَ تَنْبِيهاً مِنْ تَصْرِيفِ أَيَّامِهَا وَ تَغَيُّرِ انْقِلَابِهَا وَ مَثُلَاتِهَا وَ تَلَاعُبِهَا بِأَهْلِهَا إِنَّهَا لَتَرْفَعُ الْخَمِيلَ وَ تَضَعُ الشَّرِيفَ وَ تُورِدُ أَقْوَاماً إِلَى النَّارِ غَداً فَفِي هَذَا مُعْتَبَرٌ وَ مُخْتَبَرٌ وَ زَاجِرٌ لِمُنْتَبِهٍ إِنَّ الْأُمُورَ الْوَارِدَةَ عَلَيْكُمْ فِي كُلِّ يَوْمٍ وَ لَيْلَةٍ مِنْ مُظْلِمَاتِ الْفِتَنِ وَ حَوَادِثِ الْبِدَعِ وَ سُنَنِ الْجَوْرِ وَ بَوَائِقِ الزَّمَانِ وَ هَيْبَةِ السُّلْطَانِ وَ وَسْوَسَةِ الشَّيْطَانِ لَتُثَبِّطُ الْقُلُوبَ عَنْ تَنَبُّهِهَا وَ تُذْهِلُهَا عَنْ مَوْجُودِ الْهُدَى وَ مَعْرِفَةِ أَهْلِ الْحَقِّ إِلَّا قَلِيلًا مِمَّنْ عَصَمَ اللَّهُ فَلَيْسَ يَعْرِفُ تَصَرُّفَ أَيَّامِهَا وَ تَقَلُّبَ حَالَاتِهَا وَ عَاقِبَةَ ضَرَرِ فِتْنَتِهَا إِلَّا مَنْ عَصَمَ اللَّهُ وَ نَهَجَ سَبِيلَ الرُّشْدِ وَ سَلَكَ طَرِيقَ الْقَصْدِ ثُمَّ اسْتَعَانَ عَلَى ذَلِكَ بِالزُّهْدِ فَكَرَّرَ الْفِكْرَ وَ اتَّعَظَ بِالصَّبْرِ فَازْدَجَرَ وَ زَهِدَ فِي عَاجِلِ بَهْجَةِ الدُّنْيَا وَ تَجَافَى عَنْ لَذَّاتِهَا وَ رَغِبَ فِي دَائِمِ نَعِيمِ الْآخِرَةِ وَ سَعَى لَهَا سَعْيَهَا وَ رَاقَبَ الْمَوْتَ وَ شَنَأَ الْحَيَاةَ مَعَ الْقَوْمِ الظَّالِمِينَ نَظَرَ إِلَى مَا فِي الدُّنْيَا بِعَيْنٍ نَيِّرَةٍ حَدِيدَةَ الْبَصَرِ وَ أَبْصَرَ حَوَادِثَ الْفِتَنِ وَ ضَلَالَ الْبِدَعِ وَ جَوْرَ الْمُلُوكِ الظَّلَمَةِ فَلَقَدْ لَعَمْرِي اسْتَدْبَرْتُمُ الْأُمُورَ الْمَاضِيَةَ فِي الْأَيَّامِ الْخَالِيَةِ مِنَ الْفِتَنِ الْمُتَرَاكِمَةِ وَ الِانْهِمَاكِ فِيمَا تَسْتَدِلُّونَ بِهِ عَلَى تَجَنُّبِ الْغُوَاةِ وَ أَهْلِ الْبِدَعِ وَ الْبَغْيِ وَ الْفَسَادِ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ فَاسْتَعِينُوا بِاللَّهِ وَ ارْجِعُوا إِلَى طَاعَةِ اللَّهِ وَ طَاعَةِ مَنْ هُوَ أَوْلَى بِالطَّاعَةِ مِمَّنِ اتُّبِعَ فَأُطِيعَ فَالْحَذَرَ الْحَذَرَ مِنْ قَبْلِ النَّدَامَةِ وَ الْحَسْرَةِ وَ الْقُدُومِ عَلَى اللَّهِ وَ الْوُقُوفِ بَيْنَ يَدَيْهِ وَ تَاللَّهِ مَا صَدَرَ قَوْمٌ قَطُّ عَنْ مَعْصِيَةِ اللَّهِ إِلَّا إِلَى عَذَابِهِ وَ مَا آثَرَ قَوْمٌ قَطُّ الدُّنْيَا عَلَى الْآخِرَةِ إِلَّا سَاءَ مُنْقَلَبُهُمْ وَ سَاءَ مَصِيرُهُمْ وَ مَا الْعِلْمُ بِاللَّهِ وَ الْعَمَلُ إِلَّا إِلْفَانِ مُؤْتَلِفَانِ فَمَنْ عَرَفَ اللَّهَ خَافَهُ وَ حَثَّهُ الْخَوْفُ عَلَى الْعَمَلِ بِطَاعَةِ اللَّهِ وَ إِنَّ أَرْبَابَ الْعِلْمِ وَ أَتْبَاعَهُمُ الَّذِينَ عَرَفُوا اللَّهَ فَعَمِلُوا لَهُ وَ رَغِبُوا إِلَيْهِ وَ قَدْ قَالَ اللَّهُ إِنَّما يَخْشَى اللَّهَ مِنْ عِبادِهِ الْعُلَماءُ فَلَا تَلْتَمِسُوا شَيْئاً مِمَّا فِي هَذِهِ الدُّنْيَا بِمَعْصِيَةِ اللَّهِ وَ اشْتَغِلُوا فِي هَذِهِ الدُّنْيَا بِطَاعَةِ اللَّهِ وَ اغْتَنِمُوا أَيَّامَهَا وَ اسْعَوْا لِمَا فِيهِ نَجَاتُكُمْ غَداً مِنْ عَذَابِ اللَّهِ فَإِنَّ ذَلِكَ أَقَلُّ لِلتَّبِعَةِ وَ أَدْنَى مِنَ الْعُذْرِ وَ أَرْجَى لِلنَّجَاةِ فَقَدِّمُوا أَمْرَ اللَّهِ وَ طَاعَةَ مَنْ أَوْجَبَ اللَّهُ طَاعَتَهُ بَيْنَ يَدَيِ الْأُمُورِ كُلِّهَا وَ لَا تُقَدِّمُوا الْأُمُورَ الْوَارِدَةَ عَلَيْكُمْ مِنْ طَاعَةِ الطَّوَاغِيتِ مِنْ زَهْرَةِ الدُّنْيَا بَيْنَ يَدَيِ اللَّهِ وَ طَاعَتِهِ وَ طَاعَةِ أُولِي الْأَمْرِ مِنْكُمْ وَ اعْلَمُوا أَنَّكُمْ عَبِيدُ اللَّهِ وَ نَحْنُ مَعَكُمْ يَحْكُمُ عَلَيْنَا وَ عَلَيْكُمْ سَيِّدٌ حَاكِمٌ غَداً وَ هُوَ مُوقِفُكُمْ وَ مُسَائِلُكُمْ فَأَعِدُّوا الْجَوَابَ قَبْلَ الْوُقُوفِ وَ الْمُسَاءَلَةِ وَ الْعَرْضِ عَلَى رَبِّ الْعَالَمِينَ يَوْمَئِذٍ لَا تَكَلَّمُ نَفْسٌ إِلَّا بِإِذْنِهِ وَ اعْلَمُوا أَنَّ اللَّهَ لَا يُصَدِّقُ يَوْمَئِذٍ كَاذِباً وَ لَا يُكَذِّبُ صَادِقاً وَ لَا يَرُدُّ عُذْرَ مُسْتَحِقٍّ وَ لَا يَعْذِرُ غَيْرَ مَعْذُورٍ لَهُ الْحُجَّةُ عَلَى خَلْقِهِ بِالرُّسُلِ وَ الْأَوْصِيَاءِ بَعْدَ الرُّسُلِ فَاتَّقُوا اللَّهَ عِبَادَ اللَّهِ وَ اسْتَقْبِلُوا فِي إِصْلَاحِ أَنْفُسِكُمْ وَ طَاعَةِ اللَّهِ وَ طَاعَةِ مَنْ تَوَلَّوْنَهُ فِيهَا لَعَلَّ نَادِماً قَدْ نَدِمَ فِيمَا فَرَّطَ بِالْأَمْسِ فِي جَنْبِ اللَّهِ وَ ضَيَّعَ مِنْ حُقُوقِ اللَّهِ وَ اسْتَغْفِرُوا اللَّهَ وَ تُوبُوا إِلَيْهِ فَإِنَّهُ يَقْبَلُ التَّوْبَةَ وَ يَعْفُو عَنِ السَّيِّئَةِ وَ يَعْلَمُ مَا تَفْعَلُونَ وَ إِيَّاكُمْ وَ صُحْبَةَ الْعَاصِينَ وَ مَعُونَةَ الظَّالِمِينَ وَ مُجَاوَرَةَ الْفَاسِقِينَ احْذَرُوا فِتْنَتَهُمْ وَ تَبَاعَدُوا مِنْ سَاحَتِهِمْ وَ اعْلَمُوا أَنَّهُ مَنْ خَالَفَ أَوْلِيَاءَ اللَّهِ وَ دَانَ بِغَيْرِ دِينِ اللَّهِ وَ اسْتَبَدَّ بِأَمْرِهِ دُونَ أَمْرِ وَلِيِّ اللَّهِ كَانَ فِي نَارٍ تَلْتَهِبُ تَأْكُلُ أَبْدَاناً قَدْ غَابَتْ عَنْهَا أَرْوَاحُهَا وَ غَلَبَتْ عَلَيْهَا شِقْوَتُهَا فَهُمْ مَوْتَى لَا يَجِدُونَ حَرَّ النَّارِ وَ لَوْ كَانُوا أَحْيَاءً لَوَجَدُوا مَضَضَ حَرِّ النَّارِ وَ اعْتَبِرُوا يَا أُولِي الْأَبْصَارِ وَ احْمَدُوا اللَّهَ عَلَى مَا هَدَاكُمْ وَ اعْلَمُوا أَنَّكُمْ لَا تَخْرُجُونَ مِنْ قُدْرَةِ اللَّهِ إِلَى غَيْرِ قُدْرَتِهِ وَ سَيَرَى اللَّهُ عَمَلَكُمْ وَ رَسُولُهُ ثُمَّ إِلَيْهِ تُحْشَرُونَ فَانْتَفِعُوا بِالْعِظَةِ وَ تَأَدَّبُوا بِآدَابِ الصَّالِحِينَ .",
                "englishText": "2. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, and Ali Bin Ibrahim, from his father, altogether from Al-Hassan Bin Mahboub, from Malik Bin Atiyya, from Abu Hamza who said, ‘I have not heard of anyone who was more ascetic (pious) than Ali  Bin Al-Husayn  except for what has reached to me from Ali  Bin Abu Talib ’. Abu Hamza said, ‘Whenever Ali  Bin Al-Husayn  spoke regarding the ascetism (self restrain), those who were present with him  , (their eyes) would be filled with tears’. Abu Hamza said, ‘And I read a Parchment in which was the speech on ascetism from the speeches of Ali  Bin Al-Husayn , and I wrote down what was in it. Then I came to Ali  Bin Al-Husayn , so I presented what was in it to him . He  recognised it, and corrected (my mistakes) from what I had (in my notes)’. In the Name of Allah (azwj), the Beneficent, the Merciful. Allah (azwj) is sufficient for us . And beware of the plots of the unjust ones, and the rebellion of the envious ones, and the threats of the aggressors. O you Believers! Do not be deceived by the tyrants and those who follow them, from the people who covet this world, those that are inclined towards it, those who have been deceived by it, those who go towards it, and to its lifeless ruins, and its chaff which will be defunct tomorrow. And be cautious of what Allah (azwj) has Cautioned you from it, and abstain with regards to what Allah (azwj) has Told you to abstain from it, and do not incline towards what is in this world, inclining like the ones who has taken it to be as a house for permanent dwelling. By Allah (azwj), that which is in it is evidence for you and a warning from the changing of its days, and its conditions, and its examples, and it’s playing with its people. It raises the fallen one and degrades the honourable one, and it will return its people to the Fire tomorrow. In it, there is a significant learning and warning, that the affairs which you come across every day and night from the darkness of the strife, and the new innovations, and the unjust traditions, and the commotions of the era, and the dignity of the Sultan, and the whisperings of the Satan (la), all discourage the hearts from taking lessons from it, and boggle it from finding guidance, and the recognition of the people of the truth, except for a few whom Allah (azwj) has Protected. There is no one who will understand the changing of its days, and the alteration of its conditions, and hurtful consequences of its strife except for the one who is Protected by Allah (azwj), and Makes him to approach the way of guidance, and travels on the road purposefully. Then (he obtains) help against that by the ascetism, frequent thinking, paying attention to patience in order to notice the warning, and abstain from the immediate delights of the world, and defy its pleasures, and desire the Eternal Bliss of the Hereafter, and strive for it a striving. And he monitors the (approach of) death and passing away of the life with the unjust people. He looks at what is in the world with an illuminated vision, and the strife-taking place, and the misguidance of the innovations, and the injustices of the unjust kings. By my  life, you have matters from the past which were from days in which were free from strife, pre-occupations and engagements which have evidenced for you on avoiding the misguided and the people of innovation (Heretics) who rebel and create mischief in the earth without any right to do so. So seek Help from Allah (azwj) and return to the obedience of Allah (azwj) and the obedience of the one  who is the foremost for the obedience and to be followed and obeyed. So beware of the danger before the remorse and the regret before proceeding to Allah (azwj) and the pausing in front of Him (azwj), and no people ever went to Allah (azwj) after having disobeyed Him (azwj) except to His (azwj) Punishment, and no people preferred the world over the Hereafter at all except that evil was their return, and evil was their journey. The Knowledge, by Allah (azwj) and the deeds are nothing but two harmonious matters. So the one who recognises Allah (azwj) fears Him (azwj), and the fear urges him to the deeds in obedience to Allah (azwj) and that the heads of the knowledge and those that follow them recognise Allah (azwj) so they work (do deeds) for Him (azwj) and desire towards Him (azwj), and Allah (azwj) has Said: “[35:28] Those truly fear Allah, among His Servants, who have knowledge”. So do not seek anything from this world by being disobedient to Allah (azwj), and preoccupy yourselves in this world by obedience to Allah (azwj), and seize its days, in a way to ensure your salvation ‘Tomorrow’ from the Punishment of Allah (azwj). That is the smallest consequence and the lowest form of excuse and the hope for the salvation. So give priority to the Commands of Allah (azwj) and the obedience to the one  whose obedience Allah (azwj) has Made it to be more than obligatory in all the matters in front of you. Do not give priority to the commands, which come to you from being obedient to the tyrants about the attractions of this world as oppose to that of Allah (azwj) but rather submit to Him (azwj), and to the Masters of the Command  (Ul Al-Amr) from among you. And know that you are all servants of Allah (azwj) and we  are with you. There is a Ruler (azwj) Who will Rule over us  and you tomorrow, who is the Chief of the rulers. And He (azwj) will Make you to pause and Question you, so prepare the answer before the pausing and the Questioning and presentation to the Lord (azwj) of the Worlds on the Day in which no soul shall speak except by His (azwj) Permission. And know that Allah (azwj), on that Day, will neither Ratify a liar nor will He (azwj) Belie a truthful one, nor will He (azwj) Reject the excuse of a deserving one, nor Excuse the one who has no justification, as He (azwj) has the Proof over His (azwj) creatures by the Messengers  and the successors  of the Messengers (sa). So fear Allah (azwj), servants of Allah (azwj), and welcome the correctors to yourselves, and the obedience to Allah (azwj) and the obedience to the ones  whom Allah (azwj) has Made to be Guardians regarding it. Perhaps the remorseful ones may regret for having wasted their yesterday regarding the Side of Allah (azwj) (Junb Allah (azwj) i.e. Ali ), and wasted the Rights of Allah (azwj). And seek Forgiveness from Allah (azwj) and repent to Him (azwj) for He (azwj) Accepts the repentance, and Forgives the sins and Knows what you are doing. And beware of the company of the disobedience ones, and the help of the unjust ones, and the compulsions of the mischievous ones. Be cautious of their strife and distance yourselves from their places. And know that the one who opposes the Guardians  of Allah (azwj), and makes it to be a Religion without the Religion of Allah (azwj), and issues commands other than the commands of the Guardians  of Allah (azwj) will be in the Inflamed Fire, which consumes the bodies from which its spirit is absent, and which have been overcome by its misfortune. (At preent) they are dead, not feeling the heat of the Fire, and had they been alive they would have found their suffering in the heat of the Fire. And take a lesson, O people of vision, and Praise Allah (azwj) for what He (azwj) has Guided you with, and know that you cannot escape from the Power of Allah (azwj) to another power. Allah (azwj) Sees your deeds, as well as His (azwj) Messenger, then to them will be your resurrection. So benefit from the advice, and educate yourselves with the discipline of the righteous.",
                "href": "https://thaqalayn.net/hadith/8/1/2/1",
                "gradings": {}
            }
        }
    },
    {
        "1": {
            "3": {
                "hadithNumber": "Hadith #1",
                "title": "Al-Kafi - Volume 8: The Will of Ameer al-Mumineen (a.s) to his companions",
                "arabicText": "أَحْمَدُ بْنُ مُحَمَّدِ بْنِ أَحْمَدَ الْكُوفِيُّ وَ هُوَ الْعَاصِمِيُّ عَنْ عَبْدِ الْوَاحِدِ بْنِ الصَّوَّافِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ الْهَمْدَانِيِّ عَنْ أَبِي الْحَسَنِ مُوسَى ( عليه السلام ) قَالَ كَانَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) يُوصِي أَصْحَابَهُ وَ يَقُولُ أُوصِيكُمْ بِتَقْوَى اللَّهِ فَإِنَّهَا غِبْطَةُ الطَّالِبِ الرَّاجِي وَ ثِقَةُ الْهَارِبِ اللَّاجِي وَ اسْتَشْعِرُوا التَّقْوَى شِعَاراً بَاطِناً وَ اذْكُرُوا اللَّهَ ذِكْراً خَالِصاً تَحْيَوْا بِهِ أَفْضَلَ الْحَيَاةِ وَ تَسْلُكُوا بِهِ طَرِيقَ النَّجَاةِ انْظُرُوا فِي الدُّنْيَا نَظَرَ الزَّاهِدِ الْمُفَارِقِ لَهَا فَإِنَّهَا تُزِيلُ الثَّاوِيَ السَّاكِنَ وَ تَفْجَعُ الْمُتْرَفَ الْآمِنَ لَا يُرْجَى مِنْهَا مَا تَوَلَّى فَأَدْبَرَ وَ لَا يُدْرَى مَا هُوَ آتٍ مِنْهَا فَيُنْتَظَرَ وُصِلَ الْبَلَاءُ مِنْهَا بِالرَّخَاءِ وَ الْبَقَاءُ مِنْهَا إِلَى فَنَاءٍ فَسُرُورُهَا مَشُوبٌ بِالْحُزْنِ وَ الْبَقَاءُ فِيهَا إِلَى الضَّعْفِ وَ الْوَهْنِ فَهِيَ كَرَوْضَةٍ اعْتَمَّ مَرْعَاهَا وَ أَعْجَبَتْ مَنْ يَرَاهَا عَذْبٌ شِرْبُهَا طَيِّبٌ تَرْبُهَا تَمُجُّ عُرُوقُهَا الثَّرَى وَ تَنْطُفُ فُرُوعُهَا النَّدَى حَتَّى إِذَا بَلَغَ الْعُشْبُ إِبَّانَهُ وَ اسْتَوَى بَنَانُهُ هَاجَتْ رِيحٌ تَحُتُّ الْوَرَقَ وَ تُفَرِّقُ مَا اتَّسَقَ فَأَصْبَحَتْ كَمَا قَالَ اللَّهُ هَشِيماً تَذْرُوهُ الرِّياحُ وَ كانَ اللَّهُ عَلى كُلِّ شَيْ‏ءٍ مُقْتَدِراً انْظُرُوا فِي الدُّنْيَا فِي كَثْرَةِ مَا يُعْجِبُكُمْ وَ قِلَّةِ مَا يَنْفَعُكُمْ",
                "englishText": "3. Ahmad Bin Muhammad Bin Ahmad All Kufy, and he is Al-A’asmiy, from Abdul Wahid Bin Al-Sawwaf, from Muhammad Bin Ismail Al-Hamdany who has narrated the following: Abu Al-Hassan Musa  having said: ‘Amir-ul-Momineen  used to bequeath to his  companions saying: ‘I  bequeath you to fear Allah (azwj) for it is happiness for the truthful seeker, and a heavy shackle for the runaway fugitive. And be aware of the piety realising it within yourselves, and remember Allah (azwj) with a sincere Remembrance, being revived by it, and journey upon the path of salvation. Look at this world with the vision of the ascetics, the ones who have parted from it, for it dislodges its residents and causes distress to the affluent ones who (superficially) feel safe. Do not hope for those that are turned away from it, not knowing what it is that will come from it. So await patiently for the prosperity upon the arrival of the afflictions from it, and the survival from it up to the end. So its happiness is tainted with the grief, and the survival in it is up to the weakness and the fragility. So it is like a garden, the pasture of which is dense causing those who look at it, to wonder at it. Its drinks are sweet, its covering (soil) is good, its roots are excited in the ground, and its branches drip moisture until the grass reaches its due level. The scent gets triggered under the blades and gets separated from it in the morning, just as Allah (azwj) has Said: “[18:45] then it becomes dry broken into pieces which the winds scatter; and Allah is the holder of power over all things.” Look at this world and the numerous things which cause you to wonder, and the scarcity of the things which benefit you’.",
                "href": "https://thaqalayn.net/hadith/8/1/3/1",
                "gradings": {}
            }
        }
    },
    {
        "1": {
            "4": {
                "hadithNumber": "Hadith #1",
                "title": "Al-Kafi - Volume 8: The sermon of ‘Amir al-Mu’minin, Ali, ‘Alayhi al-Salam, called the Sermon of Means and Connections",
                "arabicText": "مُحَمَّدُ بْنُ عَلِيِّ بْنِ مَعْمَرٍ عَنْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ عُكَايَةَ التَّمِيمِيِّ عَنِ الْحُسَيْنِ بْنِ النَّضْرِ الْفِهْرِيِّ عَنْ أَبِي عَمْرٍو الْأَوْزَاعِيِّ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرِ بْنِ يَزِيدَ قَالَ دَخَلْتُ عَلَى أَبِي جَعْفَرٍ ( عليه السلام ) فَقُلْتُ يَا ابْنَ رَسُولِ اللَّهِ قَدْ أَرْمَضَنِي اخْتِلَافُ الشِّيعَةِ فِي مَذَاهِبِهَا فَقَالَ يَا جَابِرُ أَ لَمْ أَقِفْكَ عَلَى مَعْنَى اخْتِلَافِهِمْ مِنْ أَيْنَ اخْتَلَفُوا وَ مِنْ أَيِّ جِهَةٍ تَفَرَّقُوا قُلْتُ بَلَى يَا ابْنَ رَسُولِ اللَّهِ قَالَ فَلَا تَخْتَلِفْ إِذَا اخْتَلَفُوا يَا جَابِرُ إِنَّ الْجَاحِدَ لِصَاحِبِ الزَّمَانِ كَالْجَاحِدِ لِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) فِي أَيَّامِهِ يَا جَابِرُ اسْمَعْ وَ عِ قُلْتُ إِذَا شِئْتَ قَالَ اسْمَعْ وَ عِ وَ بَلِّغْ حَيْثُ انْتَهَتْ بِكَ رَاحِلَتُكَ إِنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) خَطَبَ النَّاسَ بِالْمَدِينَةِ بَعْدَ سَبْعَةِ أَيَّامٍ مِنْ وَفَاةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ ذَلِكَ حِينَ فَرَغَ مِنْ جَمْعِ الْقُرْآنِ وَ تَأْلِيفِهِ فَقَالَ الْحَمْدُ لِلَّهِ الَّذِي مَنَعَ الْأَوْهَامَ أَنْ تَنَالَ إِلَّا وُجُودَهُ وَ حَجَبَ الْعُقُولَ أَنْ تَتَخَيَّلَ ذَاتَهُ لِامْتِنَاعِهَا مِنَ الشَّبَهِ وَ التَّشَاكُلِ بَلْ هُوَ الَّذِي لَا يَتَفَاوَتُ فِي ذَاتِهِ وَ لَا يَتَبَعَّضُ بِتَجْزِئَةِ الْعَدَدِ فِي كَمَالِهِ فَارَقَ الْأَشْيَاءَ لَا عَلَى اخْتِلَافِ الْأَمَاكِنِ وَ يَكُونُ فِيهَا لَا عَلَى وَجْهِ الْمُمُازَجَةِ وَ عَلِمَهَا لَا بِأَدَاةٍ لَا يَكُونُ الْعِلْمُ إِلَّا بِهَا وَ لَيْسَ بَيْنَهُ وَ بَيْنَ مَعْلُومِهِ عِلْمُ غَيْرِهِ بِهِ كَانَ عَالِماً بِمَعْلُومِهِ إِنْ قِيلَ كَانَ فَعَلَى تَأْوِيلِ أَزَلِيَّةِ الْوُجُودِ وَ إِنْ قِيلَ لَمْ يَزَلْ فَعَلَى تَأْوِيلِ نَفْيِ الْعَدَمِ فَسُبْحَانَهُ وَ تَعَالَى عَنْ قَوْلِ مَنْ عَبَدَ سِوَاهُ وَ اتَّخَذَ إِلَهاً غَيْرَهُ عُلُوّاً كَبِيراً نَحْمَدُهُ بِالْحَمْدِ الَّذِي ارْتَضَاهُ مِنْ خَلْقِهِ وَ أَوْجَبَ قَبُولَهُ عَلَى نَفْسِهِ وَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَ أَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَ رَسُولُهُ شَهَادَتَانِ تَرْفَعَانِ الْقَوْلَ وَ تُضَاعِفَانِ الْعَمَلَ خَفَّ مِيزَانٌ تُرْفَعَانِ مِنْهُ وَ ثَقُلَ مِيزَانٌ تُوضَعَانِ فِيهِ وَ بِهِمَا الْفَوْزُ بِالْجَنَّةِ وَ النَّجَاةُ مِنَ النَّارِ وَ الْجَوَازُ عَلَى الصِّرَاطِ وَ بِالشَّهَادَةِ تَدْخُلُونَ الْجَنَّةَ وَ بِالصَّلَاةِ تَنَالُونَ الرَّحْمَةَ أَكْثِرُوا مِنَ الصَّلَاةِ عَلَى نَبِيِّكُمْ إِنَّ اللَّهَ وَ مَلائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ يا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَ سَلِّمُوا تَسْلِيماً صَلَّى اللَّهُ عَلَيْهِ وَ آلِهِ وَ سَلَّمَ تَسْلِيماً أَيُّهَا النَّاسُ إِنَّهُ لَا شَرَفَ أَعْلَى مِنَ الْإِسْلَامِ وَ لَا كَرَمَ أَعَزُّ مِنَ التَّقْوَى وَ لَا مَعْقِلَ أَحْرَزُ مِنَ الْوَرَعِ وَ لَا شَفِيعَ أَنْجَحُ مِنَ التَّوْبَةِ وَ لَا لِبَاسَ أَجْمَلُ مِنَ الْعَافِيَةِ وَ لَا وِقَايَةَ أَمْنَعُ مِنَ السَّلَامَةِ وَ لَا مَالَ أَذْهَبُ بِالْفَاقَةِ مِنَ الرِّضَا بِالْقَنَاعَةِ وَ لَا كَنْزَ أَغْنَى مِنَ الْقُنُوعِ وَ مَنِ اقْتَصَرَ عَلَى بُلْغَةِ الْكَفَافِ فَقَدِ انْتَظَمَ الرَّاحَةَ وَ تَبَوَّأَ خَفْضَ الدَّعَةِ وَ الرَّغْبَةُ مِفْتَاحُ التَّعَبِ وَ الِاحْتِكَارُ مَطِيَّةُ النَّصَبِ وَ الْحَسَدُ آفَةُ الدِّينِ وَ الْحِرْصُ دَاعٍ إِلَى التَّقَحُّمِ فِي الذُّنُوبِ وَ هُوَ دَاعِي الْحِرْمَانِ وَ الْبَغْيُ سَائِقٌ إِلَى الْحَيْنِ وَ الشَّرَهُ جَامِعٌ لِمَسَاوِي الْعُيُوبِ رُبَّ طَمَعٍ خَائِبٍ وَ أَمَلٍ كَاذِبٍ وَ رَجَاءٍ يُؤَدِّي إِلَى الْحِرْمَانِ وَ تِجَارَةٍ تَئُولُ إِلَى الْخُسْرَانِ أَلَا وَ مَنْ تَوَرَّطَ فِي الْأُمُورِ غَيْرَ نَاظِرٍ فِي الْعَوَاقِبِ فَقَدْ تَعَرَّضَ لِمُفْضِحَاتِ النَّوَائِبِ وَ بِئْسَتِ الْقِلَادَةُ الذَّنْبُ لِلْمُؤْمِنِ َيُّهَا النَّاسُ إِنَّهُ لَا كَنْزَ أَنْفَعُ مِنَ الْعِلْمِ وَ لَا عِزَّ أَرْفَعُ مِنَ الْحِلْمِ وَ لَا حَسَبَ أَبْلَغُ مِنَ الْأَدَبِ وَ لَا نَصَبَ أَوْضَعُ مِنَ الْغَضَبِ وَ لَا جَمَالَ أَزْيَنُ مِنَ الْعَقْلِ وَ لَا سَوْأَةَ أَسْوَأُ مِنَ الْكَذِبِ وَ لَا حَافِظَ أَحْفَظُ مِنَ الصَّمْتِ وَ لَا غَائِبَ أَقْرَبُ مِنَ الْمَوْتِ أ أَيُّهَا النَّاسُ إِنَّهُ مَنْ نَظَرَ فِي عَيْبِ نَفْسِهِ اشْتَغَلَ عَنْ عَيْبِ غَيْرِهِ وَ مَنْ رَضِيَ بِرِزْقِ اللَّهِ لَمْ يَأْسَفْ عَلَى مَا فِي يَدِ غَيْرِهِ وَ مَنْ سَلَّ سَيْفَ الْبَغْيِ قُتِلَ بِهِ وَ مَنْ حَفَرَ لِأَخِيهِ بِئْراً وَقَعَ فِيهَا وَ مَنْ هَتَكَ حِجَابَ غَيْرِهِ انْكَشَفَ عَوْرَاتُ بَيْتِهِ وَ مَنْ نَسِيَ زَلَلَهُ اسْتَعْظَمَ زَلَلَ غَيْرِهِ وَ مَنْ أُعْجِبَ بِرَأْيِهِ ضَلَّ وَ مَنِ اسْتَغْنَى بِعَقْلِهِ زَلَّ وَ مَنْ تَكَبَّرَ عَلَى النَّاسِ ذَلَّ وَ مَنْ سَفِهَ عَلَى النَّاسِ شُتِمَ وَ مَنْ خَالَطَ الْأَنْذَالَ حُقِّرَ وَ مَنْ حَمَلَ مَا لَا يُطِيقُ عَجَزَ أَيُّهَا النَّاسُ إِنَّهُ لَا مَالَ هُوَ أَعْوَدُ مِنَ الْعَقْلِ وَ لَا فَقْرَ هُوَ أَشَدُّ مِنَ الْجَهْلِ وَ لَا وَاعِظَ هُوَ أَبْلَغُ مِنَ النُّصْحِ وَ لَا عَقْلَ كَالتَّدْبِيرِ وَ لَا عِبَادَةَ كَالتَّفَكُّرِ وَ لَا مُظَاهَرَةَ أَوْثَقُ مِنَ الْمُشَاوَرَةِ وَ لَا وَحْشَةَ أَشَدُّ مِنَ الْعُجْبِ وَ لَا وَرَعَ كَالْكَفِّ عَنِ الْمَحَارِمِ وَ لَا حِلْمَ كَالصَّبْرِ وَ الصَّمْتِ أَيُّهَا النَّاسُ فِي الْإِنْسَانِ عَشْرُ خِصَالٍ يُظْهِرُهَا لِسَانُهُ شَاهِدٌ يُخْبِرُ عَنِ الضَّمِيرِ حَاكِمٌ يَفْصِلُ بَيْنَ الْخِطَابِ وَ نَاطِقٌ يُرَدُّ بِهِ الْجَوَابُ وَ شَافِعٌ يُدْرَكُ بِهِ الْحَاجَةُ وَ وَاصِفٌ يُعْرَفُ بِهِ الْأَشْيَاءُ وَ أَمِيرٌ يَأْمُرُ بِالْحَسَنِ وَ وَاعِظٌ يَنْهَى عَنِ الْقَبِيحِ وَ مُعَزٍّ تُسَكَّنُ بِهِ الْأَحْزَانُ وَ حَاضِرٌ تُجْلَى بِهِ الضَّغَائِنُ وَ مُونِقٌ تَلْتَذُّ بِهِ الْأَسْمَاعُ أَيُّهَا النَّاسُ إِنَّهُ لَا خَيْرَ فِي الصَّمْتِ عَنِ الْحُكْمِ كَمَا أَنَّهُ لَا خَيْرَ فِي الْقَوْلِ بِالْجَهْلِ وَ اعْلَمُوا أَيُّهَا النَّاسُ أَنَّهُ مَنْ لَمْ يَمْلِكْ لِسَانَهُ يَنْدَمْ وَ مَنْ لَا يَعْلَمْ يَجْهَلْ وَ مَنْ لَا يَتَحَلَّمْ لَا يَحْلُمْ وَ مَنْ لَا يَرْتَدِعْ لَا يَعْقِلْ وَ مَنْ لَا يَعْلَمْ يُهَنْ وَ مَنْ يُهَنْ لَا يُوَقَّرْ وَ مَنْ لَا يُوَقَّرْ يَتَوَبَّخْ وَ مَنْ يَكْتَسِبْ مَالًا مِنْ غَيْرِ حَقِّهِ يَصْرِفْهُ فِي غَيْرِ أَجْرِهِ وَ مَنْ لَا يَدَعْ وَ هُوَ مَحْمُودٌ يَدَعْ وَ هُوَ مَذْمُومٌ وَ مَنْ لَمْ يُعْطِ قَاعِداً مُنِعَ قَائِماً وَ مَنْ يَطْلُبِ الْعِزَّ بِغَيْرِ حَقٍّ يَذِلَّ وَ مَنْ يَغْلِبْ بِالْجَوْرِ يُغْلَبْ وَ مَنْ عَانَدَ الْحَقَّ لَزِمَهُ الْوَهْنُ وَ مَنْ تَفَقَّهَ وُقِّرَ وَ مَنْ تَكَبَّرَ حُقِّرَ وَ مَنْ لَا يُحْسِنْ لَا يُحْمَدْ أَيُّهَا النَّاسُ إِنَّ الْمَنِيَّةَ قَبْلَ الدَّنِيَّةِ وَ التَّجَلُّدَ قَبْلَ التَّبَلُّدِ وَ الْحِسَابَ قَبْلَ الْعِقَابِ وَ الْقَبْرَ خَيْرٌ مِنَ الْفَقْرِ وَ غَضَّ الْبَصَرِ خَيْرٌ مِنْ كَثِيرٍ مِنَ النَّظَرِ وَ الدَّهْرَ يَوْمٌ لَكَ وَ يَوْمٌ عَلَيْكَ فَإِذَا كَانَ لَكَ فَلَا تَبْطَرْ وَ إِذَا كَانَ عَلَيْكَ فَاصْبِرْ فَبِكِلَيْهِمَا تُمْتَحَنُ [وَ فِي نُسْخَةٍ وَ كِلَاهُمَا سَيُخْتَبَرُ] أَيُّهَا النَّاسُ أَعْجَبُ مَا فِي الْإِنْسَانِ قَلْبُهُ وَ لَهُ مَوَادُّ مِنَ الْحِكْمَةِ وَ أَضْدَادٌ مِنْ خِلَافِهَا فَإِنْ سَنَحَ لَهُ الرَّجَاءُ أَذَلَّهُ الطَّمَعُ وَ إِنْ هَاجَ بِهِ الطَّمَعُ أَهْلَكَهُ الْحِرْصُ وَ إِنْ مَلَكَهُ الْيَأْسُ قَتَلَهُ الْأَسَفُ وَ إِنْ عَرَضَ لَهُ الْغَضَبُ اشْتَدَّ بِهِ الْغَيْظُ وَ إِنْ أُسْعِدَ بِالرِّضَى نَسِيَ التَّحَفُّظَ وَ إِنْ نَالَهُ الْخَوْفُ شَغَلَهُ الْحَذَرُ وَ إِنِ اتَّسَعَ لَهُ الْأَمْنُ اسْتَلَبَتْهُ الْعِزَّةُ [وَ فِي نُسْخَةٍ أَخَذَتْهُ الْعِزَّةُ] وَ إِنْ جُدِّدَتْ لَهُ نِعْمَةٌ أَخَذَتْهُ الْعِزَّةُ وَ إِنْ أَفَادَ مَالًا أَطْغَاهُ الْغِنَى وَ إِنْ عَضَّتْهُ فَاقَةٌ شَغَلَهُ الْبَلَاءُ [وَ فِي نُسْخَةٍ جَهَدَهُ الْبُكَاءُ] وَ إِنْ أَصَابَتْهُ مُصِيبَةٌ فَضَحَهُ الْجَزَعُ وَ إِنْ أَجْهَدَهُ الْجُوعُ قَعَدَ بِهِ الضَّعْفُ وَ إِنْ أَفْرَطَ فِي الشِّبَعِ كَظَّتْهُ الْبِطْنَةُ فَكُلُّ تَقْصِيرٍ بِهِ مُضِرٌّ وَ كُلُّ إِفْرَاطٍ لَهُ مُفْسِدٌ أَيُّهَا النَّاسُ إِنَّهُ مَنْ فَلَّ ذَلَّ وَ مَنْ جَادَ سَادَ وَ مَنْ كَثُرَ مَالُهُ رَأَسَ وَ مَنْ كَثُرَ حِلْمُهُ نَبُلَ وَ مَنْ أَفْكَرَ فِي ذَاتِ اللَّهِ تَزَنْدَقَ وَ مَنْ أَكْثَرَ مِنْ شَيْ‏ءٍ عُرِفَ بِهِ وَ مَنْ كَثُرَ مِزَاحُهُ اسْتُخِفَّ بِهِ وَ مَنْ كَثُرَ ضِحْكُهُ ذَهَبَتْ هَيْبَتُهُ فَسَدَ حَسَبُ مَنْ لَيْسَ لَهُ أَدَبٌ إِنَّ أَفْضَلَ الْفِعَالِ صِيَانَةُ الْعِرْضِ بِالْمَالِ لَيْسَ مَنْ جَالَسَ الْجَاهِلَ بِذِي مَعْقُولٍ مَنْ جَالَسَ الْجَاهِلَ فَلْيَسْتَعِدَّ لِقِيلٍ وَ قَالٍ لَنْ يَنْجُوَ مِنَ الْمَوْتِ غَنِيٌّ بِمَالِهِ وَ لَا فَقِيرٌ لِإِقْلَالِهِ أَيُّهَا النَّاسُ لَوْ أَنَّ الْمَوْتَ يُشْتَرَى لَاشْتَرَاهُ مِنْ أَهْلِ الدُّنْيَا الْكَرِيمُ الْأَبْلَجُ وَ اللَّئِيمُ الْمَلْهُوجُ أَيُّهَا النَّاسُ إِنَّ لِلْقُلُوبِ شَوَاهِدَ تُجْرِي الْأَنْفُسَ عَنْ مَدْرَجَةِ أَهْلِ التَّفْرِيطِ وَ فِطْنَةُ الْفَهْمِ لِلْمَوَاعِظِ مَا يَدْعُو النَّفْسَ إِلَى الْحَذَرِ مِنَ الْخَطَرِ وَ لِلْقُلُوبِ خَوَاطِرَ لِلْهَوَى وَ الْعُقُولُ تَزْجُرُ وَ تَنْهَى وَ فِي التَّجَارِبِ عِلْمٌ مُسْتَأْنَفٌ وَ الِاعْتِبَارُ يَقُودُ إِلَى الرَّشَادِ وَ كَفَاكَ أَدَباً لِنَفْسِكَ مَا تَكْرَهُهُ لِغَيْرِكَ وَ عَلَيْكَ لِأَخِيكَ الْمُؤْمِنِ مِثْلُ الَّذِي لَكَ عَلَيْهِ لَقَدْ خَاطَرَ مَنِ اسْتَغْنَى بِرَأْيِهِ وَ التَّدَبُّرُ قَبْلَ الْعَمَلِ فَإِنَّهُ يُؤْمِنُكَ مِنَ النَّدَمِ وَ مَنِ اسْتَقْبَلَ وُجُوهَ الْآرَاءِ عَرَفَ مَوَاقِعَ الْخَطَإِ وَ مَنْ أَمْسَكَ عَنِ الْفُضُولِ عَدَلَتْ رَأْيَهُ الْعُقُولُ وَ مَنْ حَصَّنَ شَهْوَتَهُ فَقَدْ صَانَ قَدْرَهُ وَ مَنْ أَمْسَكَ لِسَانَهُ أَمِنَهُ قَوْمُهُ وَ نَالَ حَاجَتَهُ وَ فِي تَقَلُّبِ الْأَحْوَالِ عِلْمُ جَوَاهِرِ الرِّجَالِ وَ الْأَيَّامُ تُوضِحُ لَكَ السَّرَائِرَ الْكَامِنَةَ وَ لَيْسَ فِي الْبَرْقِ الْخَاطِفِ مُسْتَمْتَعٌ لِمَنْ يَخُوضُ فِي الظُّلْمَةِ وَ مَنْ عُرِفَ بِالْحِكْمَةِ لَحَظَتْهُ الْعُيُونُ بِالْوَقَارِ وَ الْهَيْبَةِ وَ أَشْرَفُ الْغِنَى تَرْكُ الْمُنَى وَ الصَّبْرُ جُنَّةٌ مِنَ الْفَاقَةِ وَ الْحِرْصُ عَلَامَةُ الْفَقْرِ وَ الْبُخْلُ جِلْبَابُ الْمَسْكَنَةِ وَ الْمَوَدَّةُ قَرَابَةٌ مُسْتَفَادَةٌ وَ وَصُولٌ مُعْدِمٌ خَيْرٌ مِنْ جَافٍ مُكْثِرٍ وَ الْمَوْعِظَةُ كَهْفٌ لِمَنْ وَعَاهَا وَ مَنْ أَطْلَقَ طَرْفَهُ كَثُرَ أَسَفُهُ وَ قَدْ أَوْجَبَ الدَّهْرُ شُكْرَهُ عَلَى مَنْ نَالَ سُؤْلَهُ وَ قَلَّ مَا يُنْصِفُكَ اللِّسَانُ فِي نَشْرِ قَبِيحٍ أَوْ إِحْسَانٍ وَ مَنْ ضَاقَ خُلُقُهُ مَلَّهُ أَهْلُهُ وَ مَنْ نَالَ اسْتَطَالَ وَ قَلَّ مَا تَصْدُقُكَ الْأُمْنِيَّةُ وَ التَّوَاضُعُ يَكْسُوكَ الْمَهَابَةَ وَ فِي سَعَةِ الْأَخْلَاقِ كُنُوزُ الْأَرْزَاقِ كَمْ مِنْ عَاكِفٍ عَلَى ذَنْبِهِ فِي آخِرِ أَيَّامِ عُمُرِهِ وَ مَنْ كَسَاهُ الْحَيَاءُ ثَوْبَهُ خَفِيَ عَلَى النَّاسِ عَيْبُهُ وَ انْحُ الْقَصْدَ مِنَ الْقَوْلِ فَإِنَّ مَنْ تَحَرَّى الْقَصْدَ خَفَّتْ عَلَيْهِ الْمُؤَنُ وَ فِي خِلَافِ النَّفْسِ رُشْدُكَ مَنْ عَرَفَ الْأَيَّامَ لَمْ يَغْفُلْ عَنِ الِاسْتِعْدَادِ أَلَا وَ إِنَّ مَعَ كُلِّ جُرْعَةٍ شَرَقاً وَ إِنَّ فِي كُلِّ أُكْلَةٍ غُصَصاً لَا تُنَالُ نِعْمَةٌ إِلَّا بِزَوَالِ أُخْرَى وَ لِكُلِّ ذِي رَمَقٍ قُوتٌ وَ لِكُلِّ حَبَّةٍ آكِلٌ وَ أَنْتَ قُوتُ الْمَوْتِ اعْلَمُوا أَيُّهَا النَّاسُ أَنَّهُ مَنْ مَشَى عَلَى وَجْهِ الْأَرْضِ فَإِنَّهُ يَصِيرُ إِلَى بَطْنِهَا وَ اللَّيْلُ وَ النَّهَارُ يَتَنَازَعَانِ [يَتَسَارَعَانِ] فِي هَدْمِ الْأَعْمَارِ يَا أَيُّهَا النَّاسُ كُفْرُ النِّعْمَةِ لُؤْمٌ وَ صُحْبَةُ الْجَاهِلِ شُؤْمٌ إِنَّ مِنَ الْكَرَمِ لِينَ الْكَلَامِ وَ مِنَ الْعِبَادَةِ إِظْهَارَ اللِّسَانِ وَ إِفْشَاءَ السَّلَامِ إِيَّاكَ وَ الْخَدِيعَةَ فَإِنَّهَا مِنْ خُلُقِ اللَّئِيمِ لَيْسَ كُلُّ طَالِبٍ يُصِيبُ وَ لَا كُلُّ غَائِبٍ يَئُوبُ لَا تَرْغَبْ فِيمَنْ زَهِدَ فِيكَ رُبَّ بَعِيدٍ هُوَ أَقْرَبُ مِنْ قَرِيبٍ سَلْ عَنِ الرَّفِيقِ قَبْلَ الطَّرِيقِ وَ عَنِ الْجَارِ قَبْلَ الدَّارِ أَلَا وَ مَنْ أَسْرَعَ فِي الْمَسِيرِ أَدْرَكَهُ الْمَقِيلُ اسْتُرْ عَوْرَةَ أَخِيكَ كَمَا تَعْلَمُهَا فِيكَ اغْتَفِرْ زَلَّةَ صَدِيقِكَ لِيَوْمِ يَرْكَبُكَ عَدُوُّكَ مَنْ غَضِبَ عَلَى مَنْ لَا يَقْدِرُ عَلَى ضَرِّهِ طَالَ حُزْنُهُ وَ عَذَّبَ نَفْسَهُ مَنْ خَافَ رَبَّهُ كَفَّ ظُلْمَهُ [مَنْ خَافَ رَبَّهُ كُفِيَ عَذَابَهُ] وَ مَنْ لَمْ يَزِغْ فِي كَلَامِهِ أَظْهَرَ فَخْرَهُ وَ مَنْ لَمْ يَعْرِفِ الْخَيْرَ مِنَ الشَّرِّ فَهُوَ بِمَنْزِلَةِ الْبَهِيمَةِ إِنَّ مِنَ الْفَسَادِ إِضَاعَةَ الزَّادِ مَا أَصْغَرَ الْمُصِيبَةَ مَعَ عِظَمِ الْفَاقَةِ غَداً هَيْهَاتَ هَيْهَاتَ وَ مَا تَنَاكَرْتُمْ إِلَّا لِمَا فِيكُمْ مِنَ الْمَعَاصِي وَ الذُّنُوبِ فَمَا أَقْرَبَ الرَّاحَةَ مِنَ التَّعَبِ وَ الْبُؤْسَ مِنَ النَّعِيمِ وَ مَا شَرٌّ بِشَرٍّ بَعْدَهُ الْجَنَّةُ وَ مَا خَيْرٌ بِخَيْرٍ بَعْدَهُ النَّارُ وَ كُلُّ نَعِيمٍ دُونَ الْجَنَّةِ مَحْقُورٌ وَ كُلُّ بَلَاءٍ دُونَ النَّارِ عَافِيَةٌ وَ عِنْدَ تَصْحِيحِ الضَّمَائِرِ تُبْدُو الْكَبَائِرُ تَصْفِيَةُ الْعَمَلِ أَشَدُّ مِنَ الْعَمَلِ وَ تَخْلِيصُ النِّيَّةِ مِنَ الْفَسَادِ أَشَدُّ عَلَى الْعَامِلِينَ مِنْ طُولِ الْجِهَادِ هَيْهَاتَ لَوْ لَا التُّقَى لَكُنْتُ أَدْهَى الْعَرَبِ أَيُّهَا النَّاسُ إِنَّ اللَّهَ تَعَالَى وَعَدَ نَبِيَّهُ مُحَمَّداً ( صلى الله عليه وآله ) الْوَسِيلَةَ وَ وَعْدُهُ الْحَقُّ وَ لَنْ يُخْلِفَ اللَّهُ وَعْدَهُ أَلَا وَ إِنَّ الْوَسِيلَةَ عَلَى دَرَجِ الْجَنَّةِ وَ ذِرْوَةِ ذَوَائِبِ الزُّلْفَةِ وَ نِهَايَةِ غَايَةِ الْأُمْنِيَّةِ لَهَا أَلْفُ مِرْقَاةٍ مَا بَيْنَ الْمِرْقَاةِ إِلَى الْمِرْقَاةِ حُضْرُ الْفَرَسِ الْجَوَادِ مِائَةَ عَامٍ وَ هُوَ مَا بَيْنَ مِرْقَاةِ دُرَّةٍ إِلَى مِرْقَاةِ جَوْهَرَةٍ إِلَى مِرْقَاةِ زَبَرْجَدَةٍ إِلَى مِرْقَاةِ لُؤْلُؤَةٍ إِلَى مِرْقَاةِ يَاقُوتَةٍ إِلَى مِرْقَاةِ زُمُرُّدَةٍ إِلَى مِرْقَاةِ مَرْجَانَةٍ إِلَى مِرْقَاةِ كَافُورٍ إِلَى مِرْقَاةِ عَنْبَرٍ إِلَى مِرْقَاةِ يَلَنْجُوجٍ إِلَى مِرْقَاةِ ذَهَبٍ إِلَى مِرْقَاةِ غَمَامٍ إِلَى مِرْقَاةِ هَوَاءٍ إِلَى مِرْقَاةِ نُورٍ قَدْ أَنَافَتْ عَلَى كُلِّ الْجِنَانِ وَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَوْمَئِذٍ قَاعِدٌ عَلَيْهَا مُرْتَدٍ بِرَيْطَتَيْنِ رَيْطَةٍ مِنْ رَحْمَةِ اللَّهِ وَ رَيْطَةٍ مِنْ نُورِ اللَّهِ عَلَيْهِ تَاجُ النُّبُوَّةِ وَ إِكْلِيلُ الرِّسَالَةِ قَدْ أَشْرَقَ بِنُورِهِ الْمَوْقِفُ وَ أَنَا يَوْمَئِذٍ عَلَى الدَّرَجَةِ الرَّفِيعَةِ وَ هِيَ دُونَ دَرَجَتِهِ وَ عَلَيَّ رَيْطَتَانِ رَيْطَةٌ مِنْ أُرْجُوَانِ النُّورِ وَ رَيْطَةٌ مِنْ كَافُورٍ وَ الرُّسُلُ وَ الْأَنْبِيَاءُ قَدْ وَقَفُوا عَلَى الْمَرَاقِي وَ أَعْلَامُ الْأَزْمِنَةِ وَ حُجَجُ الدُّهُورِ عَنْ أَيْمَانِنَا وَ قَدْ تَجَلَّلَهُمْ حُلَلُ النُّورِ وَ الْكَرَامَةِ لَا يَرَانَا مَلَكٌ مُقَرَّبٌ وَ لَا نَبِيٌّ مُرْسَلٌ إِلَّا بُهِتَ بِأَنْوَارِنَا وَ عَجِبَ مِنْ ضِيَائِنَا وَ جَلَالَتِنَا وَ عَنْ يَمِينِ الْوَسِيلَةِ عَنْ يَمِينِ الرَّسُولِ ( صلى الله عليه وآله ) غَمَامَةٌ بَسْطَةَ الْبَصَرِ يَأْتِي مِنْهَا النِّدَاءُ يَا أَهْلَ الْمَوْقِفِ طُوبَى لِمَنْ أَحَبَّ الْوَصِيَّ وَ آمَنَ بِالنَّبِيِّ الْأُمِّيِّ الْعَرَبِيِّ وَ مَنْ كَفَرَ فَالنَّارُ مَوْعِدُهُ وَ عَنْ يَسَارِ الْوَسِيلَةِ عَنْ يَسَارِ الرَّسُولِ ( صلى الله عليه وآله ) ظُلَّةٌ يَأْتِي مِنْهَا النِّدَاءُ يَا أَهْلَ الْمَوْقِفِ طُوبَى لِمَنْ أَحَبَّ الْوَصِيَّ وَ آمَنَ بِالنَّبِيِّ الْأُمِّيِّ وَ الَّذِي لَهُ الْمُلْكُ الْأَعْلَى لَا فَازَ أَحَدٌ وَ لَا نَالَ الرَّوْحَ وَ الْجَنَّةَ إِلَّا مَنْ لَقِيَ خَالِقَهُ بِالْإِخْلَاصِ لَهُمَا وَ الِاقْتِدَارِ بِنُجُومِهِمَا فَأَيْقِنُوا يَا أَهْلَ وَلَايَةِ اللَّهِ بِبَيَاضِ وُجُوهِكُمْ وَ شَرَفِ مَقْعَدِكُمْ وَ كَرَمِ مَآبِكُمْ وَ بِفَوْزِكُمُ الْيَوْمَ عَلَى سُرُرٍ مُتَقَابِلِينَ وَ يَا أَهْلَ الِانْحِرَافِ وَ الصُّدُودِ عَنِ اللَّهِ عَزَّ ذِكْرُهُ وَ رَسُولِهِ وَ صِرَاطِهِ وَ أَعْلَامِ الْأَزْمِنَةِ أَيْقِنُوا بِسَوَادِ وُجُوهِكُمْ وَ غَضَبِ رَبِّكُمْ جَزَاءً بِمَا كُنْتُمْ تَعْمَلُونَ وَ مَا مِنْ رَسُولٍ سَلَفَ وَ لَا نَبِيٍّ مَضَى إِلَّا وَ قَدْ كَانَ مُخْبِراً أُمَّتَهُ بِالْمُرْسَلِ الْوَارِدِ مِنْ بَعْدِهِ وَ مُبَشِّراً بِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ مُوصِياً قَوْمَهُ بِاتِّبَاعِهِ وَ مُحَلِّيَهُ عِنْدَ قَوْمِهِ لِيَعْرِفُوهُ بِصِفَتِهِ وَ لِيَتَّبِعُوهُ عَلَى شَرِيعَتِهِ وَ لِئَلَّا يَضِلُّوا فِيهِ مِنْ بَعْدِهِ فَيَكُونَ مَنْ هَلَكَ أَوْ ضَلَّ بَعْدَ وُقُوعِ الْإِعْذَارِ وَ الْإِنْذَارِ عَنْ بَيِّنَةٍ وَ تَعْيِينِ حُجَّةٍ فَكَانَتِ الْأُمَمُ فِي رَجَاءٍ مِنَ الرُّسُلِ وَ وُرُودٍ مِنَ الْأَنْبِيَاءِ وَ لَئِنْ أُصِيبَتْ بِفَقْدِ نَبِيٍّ بَعْدَ نَبِيٍّ عَلَى عِظَمِ مَصَائِبِهِمْ وَ فَجَائِعِهَا بِهِمْ فَقَدْ كَانَتْ عَلَى سَعَةٍ مِنَ الْأَمَلِ وَ لَا مُصِيبَةٌ عَظُمَتْ وَ لَا رَزِيَّةٌ جَلَّتْ كَالْمُصِيبَةِ بِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) لِأَنَّ اللَّهَ خَتَمَ بِهِ الْإِنْذَارَ وَ الْإِعْذَارَ وَ قَطَعَ بِهِ الِاحْتِجَاجَ وَ الْعُذْرَ بَيْنَهُ وَ بَيْنَ خَلْقِهِ وَ جَعَلَهُ بَابَهُ الَّذِي بَيْنَهُ وَ بَيْنَ عِبَادِهِ وَ مُهَيْمِنَهُ الَّذِي لَا يَقْبَلُ إِلَّا بِهِ وَ لَا قُرْبَةَ إِلَيْهِ إِلَّا بِطَاعَتِهِ وَ قَالَ فِي مُحْكَمِ كِتَابِهِ مَنْ يُطِعِ الرَّسُولَ فَقَدْ أَطاعَ اللَّهَ وَ مَنْ تَوَلَّى فَما أَرْسَلْناكَ عَلَيْهِمْ حَفِيظاً فَقَرَنَ طَاعَتَهُ بِطَاعَتِهِ وَ مَعْصِيَتَهُ بِمَعْصِيَتِهِ فَكَانَ ذَلِكَ دَلِيلًا عَلَى مَا فَوَّضَ إِلَيْهِ وَ شَاهِداً لَهُ عَلَى مَنِ اتَّبَعَهُ وَ عَصَاهُ وَ بَيَّنَ ذَلِكَ فِي غَيْرِ مَوْضِعٍ مِنَ الْكِتَابِ الْعَظِيمِ فَقَالَ تَبَارَكَ وَ تَعَالَى فِي التَّحْرِيضِ عَلَى اتَّبَاعِهِ وَ التَّرْغِيبِ فِي تَصْدِيقِهِ وَ الْقَبُولِ بِدَعْوَتِهِ قُلْ إِنْ كُنْتُمْ تُحِبُّونَ اللَّهَ فَاتَّبِعُونِي يُحْبِبْكُمُ اللَّهُ وَ يَغْفِرْ لَكُمْ ذُنُوبَكُمْ فَاتِّبَاعُهُ ( صلى الله عليه وآله ) مَحَبَّةُ اللَّهِ وَ رِضَاهُ غُفْرَانُ الذُّنُوبِ وَ كَمَالُ الْفَوْزِ وَ وُجُوبُ الْجَنَّةِ وَ فِي التَّوَلِّي عَنْهُ وَ الْإِعْرَاضِ مُحَادَّةُ اللَّهِ وَ غَضَبُهُ وَ سَخَطُهُ وَ الْبُعْدُ مِنْهُ مُسْكِنُ النَّارِ وَ ذَلِكَ قَوْلُهُ وَ مَنْ يَكْفُرْ بِهِ مِنَ الْأَحْزابِ فَالنَّارُ مَوْعِدُهُ يَعْنِي الْجُحُودَ بِهِ وَ الْعِصْيَانَ لَهُ فَإِنَّ اللَّهَ تَبَارَكَ اسْمُهُ امْتَحَنَ بِي عِبَادَهُ وَ قَتَلَ بِيَدِي أَضْدَادَهُ وَ أَفْنَى بِسَيْفِي جُحَّادَهُ وَ جَعَلَنِي زُلْفَةً لِلْمُؤْمِنِينَ وَ حِيَاضَ مَوْتٍ عَلَى الْجَبَّارِينَ وَ سَيْفَهُ عَلَى الْمُجْرِمِينَ وَ شَدَّ بِي أَزْرَ رَسُولِهِ وَ أَكْرَمَنِي بِنَصْرِهِ وَ شَرَّفَنِي بِعِلْمِهِ وَ حَبَانِي بِأَحْكَامِهِ وَ اخْتَصَّنِي بِوَصِيَّتِهِ وَ اصْطَفَانِي بِخِلَافَتِهِ فِي أُمَّتِهِ فَقَالَ ( صلى الله عليه وآله ) وَ قَدْ حَشَدَهُ الْمُهَاجِرُونَ وَ الْأَنْصَارُ وَ انْغَصَّتْ بِهِمُ الْمَحَافِلُ أَيُّهَا النَّاسُ إِنَّ عَلِيّاً مِنِّي كَهَارُونَ مِنْ مُوسَى إِلَّا أَنَّهُ لَا نَبِيَّ بَعْدِي فَعَقَلَ الْمُؤْمِنُونَ عَنِ اللَّهِ نَطَقَ الرَّسُولُ إِذْ عَرَفُونِي أَنِّي لَسْتُ بِأَخِيهِ لِأَبِيهِ وَ أُمِّهِ كَمَا كَانَ هَارُونُ أَخَا مُوسَى لِأَبِيهِ وَ أُمِّهِ وَ لَا كُنْتُ نَبِيّاً فَاقْتَضَى نُبُوَّةً وَ لَكِنْ كَانَ ذَلِكَ مِنْهُ اسْتِخْلَافاً لِي كَمَا اسْتَخْلَفَ مُوسَى هَارُونَ (عليه السلام) حَيْثُ يَقُولُ اخْلُفْنِي فِي قَوْمِي وَ أَصْلِحْ وَ لا تَتَّبِعْ سَبِيلَ الْمُفْسِدِينَ وَ قَوْلُهُ ( عليه السلام ) حِينَ تَكَلَّمَتْ طَائِفَةٌ فَقَالَتْ نَحْنُ مَوَالِي رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَخَرَجَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِلَى حَجَّةِ الْوَدَاعِ ثُمَّ صَارَ إِلَى غَدِيرِ خُمٍّ فَأَمَرَ فَأُصْلِحَ لَهُ شِبْهُ الْمِنْبَرِ ثُمَّ عَلَاهُ وَ أَخَذَ بِعَضُدِي حَتَّى رُئِيَ بَيَاضُ إِبْطَيْهِ رَافِعاً صَوْتَهُ قَائِلًا فِي مَحْفِلِهِ مَنْ كُنْتُ مَوْلَاهُ فَعَلِيٌّ مَوْلَاهُ اللَّهُمَّ وَالِ مَنْ وَالَاهُ وَ عَادِ مَنْ عَادَاهُ فَكَانَتْ عَلَى وَلَايَتِي وَلَايَةُ اللَّهِ وَ عَلَى عَدَاوَتِي عَدَاوَةُ اللَّهِ وَ أَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ فِي ذَلِكَ الْيَوْمِ الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَ أَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي وَ رَضِيتُ لَكُمُ الْإِسْلامَ دِيناً فَكَانَتْ وَلَايَتِي كَمَالَ الدِّينِ وَ رِضَا الرَّبِّ جَلَّ ذِكْرُهُ وَ أَنْزَلَ اللَّهُ تَبَارَكَ وَ تَعَالَى اخْتِصَاصاً لِي وَ تَكَرُّماً نَحَلَنِيهِ وَ إِعْظَاماً وَ تَفْصِيلًا مِنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) مَنَحَنِيهِ وَ هُوَ قَوْلُهُ تَعَالَى ثُمَّ رُدُّوا إِلَى اللَّهِ مَوْلاهُمُ الْحَقِّ أَلا لَهُ الْحُكْمُ وَ هُوَ أَسْرَعُ الْحاسِبِينَ فِيَّ مَنَاقِبُ لَوْ ذَكَرْتُهَا لَعَظُمَ بِهَا الِارْتِفَاعُ فَطَالَ لَهَا الِاسْتِمَاعُ وَ لَئِنْ تَقَمَّصَهَا دُونِيَ الْأَشْقَيَانِ وَ نَازَعَانِي فِيمَا لَيْسَ لَهُمَا بِحَقٍّ وَ رَكِبَاهَا ضَلَالَةً وَ اعْتَقَدَاهَا جَهَالَةً فَلَبِئْسَ مَا عَلَيْهِ وَرَدَا وَ لَبِئْسَ مَا لِأَنْفُسِهِمَا مَهَّدَا يَتَلَاعَنَانِ فِي دُورِهِمَا وَ يَتَبَرَّأُ كُلُّ وَاحِدٍ مِنْهُمَا مِنْ صَاحِبِهِ يَقُولُ لِقَرِينِهِ إِذَا الْتَقَيَا يا لَيْتَ بَيْنِي وَ بَيْنَكَ بُعْدَ الْمَشْرِقَيْنِ فَبِئْسَ الْقَرِينُ فَيُجِيبُهُ الْأَشْقَى عَلَى رُثُوثَةٍ يَا لَيْتَنِي لَمْ أَتَّخِذْكَ خَلِيلًا لَقَدْ أَضْلَلْتَنِي عَنِ الذِّكْرِ بَعْدَ إِذْ جَاءَنِي وَ كَانَ الشَّيْطَانُ لِلْإِنْسَانِ خَذُولًا فَأَنَا الذِّكْرُ الَّذِي عَنْهُ ضَلَّ وَ السَّبِيلُ الَّذِي عَنْهُ مَالَ وَ الْإِيمَانُ الَّذِي بِهِ كَفَرَ وَ الْقُرْآنُ الَّذِي إِيَّاهُ هَجَرَ وَ الدِّينُ الَّذِي بِهِ كَذَّبَ وَ الصِّرَاطُ الَّذِي عَنْهُ نَكَبَ وَ لَئِنْ رَتَعَا فِي الْحُطَامِ الْمُنْصَرِمِ وَ الْغُرُورِ الْمُنْقَطِعِ وَ كَانَا مِنْهُ عَلَى شَفَا حُفْرَةٍ مِنَ النَّارِ لَهُمَا عَلَى شَرِّ وُرُودٍ فِي أَخْيَبِ وُفُودٍ وَ أَلْعَنِ مَوْرُودٍ يَتَصَارَخَانِ بِاللَّعْنَةِ وَ يَتَنَاعَقَانِ بِالْحَسْرَةِ مَا لَهُمَا مِنْ رَاحَةٍ وَ لَا عَنْ عَذَابِهِمَا مِنْ مَنْدُوحَةٍ إِنَّ الْقَوْمَ لَمْ يَزَالُوا عُبَّادَ أَصْنَامٍ وَ سَدَنَةَ أَوْثَانٍ يُقِيمُونَ لَهَا الْمَنَاسِكَ وَ يَنْصِبُونَ لَهَا الْعَتَائِرَ وَ يَتَّخِذُونَ لَهَا الْقُرْبَانَ وَ يَجْعَلُونَ لَهَا الْبَحِيرَةَ وَ الْوَصِيلَةَ وَ السَّائِبَةَ وَ الْحَامَ وَ يَسْتَقْسِمُونَ بِالْأَزْلَامِ عَامِهِينَ عَنِ اللَّهِ عَزَّ ذِكْرُهُ حَائِرِينَ عَنِ الرَّشَادِ مُهْطِعِينَ إِلَى الْبِعَادِ وَ قَدِ اسْتَحْوَذَ عَلَيْهِمُ الشَّيْطَانُ وَ غَمَرَتْهُمْ سَوْدَاءُ الْجَاهِلِيَّةِ وَ رَضَعُوهَا جَهَالَةً وَ انْفَطَمُوهَا ضَلَالَةً فَأَخْرَجَنَا اللَّهُ إِلَيْهِمْ رَحْمَةً وَ أَطْلَعَنَا عَلَيْهِمْ رَأْفَةً وَ أَسْفَرَ بِنَا عَنِ الْحُجُبِ نُوراً لِمَنِ اقْتَبَسَهُ وَ فَضْلًا لِمَنِ اتَّبَعَهُ وَ تَأْيِيداً لِمَنْ صَدَّقَهُ فَتَبَوَّءُوا الْعِزَّ بَعْدَ الذِّلَّةِ وَ الْكَثْرَةَ بَعْدَ الْقِلَّةِ وَ هَابَتْهُمُ الْقُلُوبُ وَ الْأَبْصَارُ وَ أَذْعَنَتْ لَهُمُ الْجَبَابِرَةُ وَ طَوَائِفُهَا وَ صَارُوا أَهْلَ نِعْمَةٍ مَذْكُورَةٍ وَ كَرَامَةٍ مَيْسُورَةٍ وَ أَمْنٍ بَعْدَ خَوْفٍ وَ جَمْعٍ بَعْدَ كَوْفٍ وَ أَضَاءَتْ بِنَا مَفَاخِرُ مَعَدِّ بْنِ عَدْنَانَ وَ أَوْلَجْنَاهُمْ بَابَ الْهُدَى وَ أَدْخَلْنَاهُمْ دَارَ السَّلَامِ وَ أَشْمَلْنَاهُمْ ثَوْبَ الْإِيمَانِ وَ فَلَجُوا بِنَا فِي الْعَالَمِينَ وَ أَبْدَتْ لَهُمْ أَيَّامُ الرَّسُولِ آثَارَ الصَّالِحِينَ مِنْ حَامٍ مُجَاهِدٍ وَ مُصَلٍّ قَانِتٍ وَ مُعْتَكِفٍ زَاهِدٍ يُظْهِرُونَ الْأَمَانَةَ وَ يَأْتُونَ الْمَثَابَةَ حَتَّى إِذَا دَعَا اللَّهُ عَزَّ وَ جَلَّ نَبِيَّهُ ( صلى الله عليه وآله ) وَ رَفَعَهُ إِلَيْهِ لَمْ يَكُ ذَلِكَ بَعْدَهُ إِلَّا كَلَمْحَةٍ مِنْ خَفْقَةٍ أَوْ وَمِيضٍ مِنْ بَرْقَةٍ إِلَى أَنْ رَجَعُوا عَلَى الْأَعْقَابِ وَ انْتَكَصُوا عَلَى الْأَدْبَارِ وَ طَلَبُوا بِالْأَوْتَارِ وَ أَظْهَرُوا الْكَتَائِبَ وَ رَدَمُوا الْبَابَ وَ فَلُّوا الدِّيَارَ وَ غَيَّرُوا آثَارَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ رَغِبُوا عَنْ أَحْكَامِهِ وَ بَعُدُوا مِنْ أَنْوَارِهِ وَ اسْتَبْدَلُوا بِمُسْتَخْلَفِهِ بَدِيلًا لَمْ يَكُ ذَلِكَ بَعْدَهُ إِلَّا كَلَمْحَةٍ مِنْ خَفْقَةٍ أَوْ وَمِيضٍ مِنْ بَرْقَةٍ إِلَى أَنْ رَجَعُوا عَلَى الْأَعْقَابِ وَ انْتَكَصُوا عَلَى الْأَدْبَارِ وَ طَلَبُوا بِالْأَوْتَارِ وَ أَظْهَرُوا الْكَتَائِبَ وَ رَدَمُوا الْبَابَ وَ فَلُّوا الدِّيَارَ وَ غَيَّرُوا آثَارَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ رَغِبُوا عَنْ أَحْكَامِهِ وَ بَعُدُوا مِنْ أَنْوَارِهِ وَ اسْتَبْدَلُوا بِمُسْتَخْلَفِهِ بَدِيلًا اتَّخَذُوهُ وَ كَانُوا ظَالِمِينَ وَ زَعَمُوا أَنَّ مَنِ اخْتَارُوا مِنْ آلِ أَبِي قُحَافَةَ أَوْلَى بِمَقَامِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) مِمَّنِ اخْتَارَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِمَقَامِهِ وَ أَنَّ مُهَاجِرَ آلِ أَبِي قُحَافَةَ خَيْرٌ مِنَ الْمُهَاجِرِيِّ الْأَنْصَارِيِّ الرَّبَّانِيِّ نَامُوسِ هَاشِمِ بْنِ عَبْدِ مَنَافٍ أَلَا وَ إِنَّ أَوَّلَ شَهَادَةِ زُورٍ وَقَعَتْ فِي الْإِسْلَامِ شَهَادَتُهُمْ أَنَّ صَاحِبَهُمْ مُسْتَخْلَفُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَلَمَّا كَانَ مِنْ أَمْرِ سَعْدِ بْنِ عُبَادَةَ مَا كَانَ رَجَعُوا عَنْ ذَلِكَ وَ قَالُوا إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) مَضَى وَ لَمْ يَسْتَخْلِفْ فَكَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الطَّيِّبُ الْمُبَارَكُ أَوَّلَ مَشْهُودٍ عَلَيْهِ بِالزُّورِ فِي الْإِسْلَامِ وَ عَنْ قَلِيلٍ يَجِدُونَ غِبَّ مَا [يَعْلَمُونَ وَ سَيَجِدُونَ التَّالُونَ غِبَّ مَا] أَسَّسَهُ الْأَوَّلُونَ وَ لَئِنْ كَانُوا فِي مَنْدُوحَةٍ مِنَ الْمَهْلِ وَ شِفَاءٍ مِنَ الْأَجَلِ وَ سَعَةٍ مِنَ الْمُنْقَلَبِ وَ اسْتِدْرَاجٍ مِنَ الْغُرُورِ وَ سُكُونٍ مِنَ الْحَالِ وَ إِدْرَاكٍ مِنَ الْأَمَلِ فَقَدْ أَمْهَلَ اللَّهُ عَزَّ وَ جَلَّ شَدَّادَ بْنَ عَادٍ وَ ثَمُودَ بْنَ عَبُّودٍ وَ بَلْعَمَ بْنَ بَاعُورٍ وَ أَسْبَغَ عَلَيْهِمْ نِعَمَهُ ظَاهِرَةً وَ بَاطِنَةً وَ أَمَدَّهُمْ بِالْأَمْوَالِ وَ الْأَعْمَارِ وَ أَتَتْهُمُ الْأَرْضُ بِبَرَكَاتِهَا لِيَذَّكَّرُوا آلَاءَ اللَّهِ وَ لِيَعْرِفُوا الْإِهَابَةَ لَهُ وَ الْإِنَابَةَ إِلَيْهِ وَ لِيَنْتَهُوا عَنِ الِاسْتِكْبَارِ فَلَمَّا بَلَغُوا الْمُدَّةَ وَ اسْتَتَمُّوا الْأُكْلَةَ أَخَذَهُمُ اللَّهُ عَزَّ وَ جَلَّ وَ اصْطَلَمَهُمْ فَمِنْهُمْ مَنْ حُصِبَ وَ مِنْهُمْ مَنْ أَخَذَتْهُ الصَّيْحَةُ وَ مِنْهُمْ مَنْ أَحْرَقَتْهُ الظُّلَّةُ وَ مِنْهُمْ مَنْ أَوْدَتْهُ الرَّجْفَةُ وَ مِنْهُمْ مَنْ أَرْدَتْهُ الْخَسْفَةُ فَما كانَ اللَّهُ لِيَظْلِمَهُمْ وَ لكِنْ كانُوا أَنْفُسَهُمْ يَظْلِمُونَ أَلَا وَ إِنَّ لِكُلِّ أَجَلٍ كِتَاباً فَإِذَا بَلَغَ الْكِتَابُ أَجَلَهُ لَوْ كُشِفَ لَكَ عَمَّا هَوَى إِلَيْهِ الظَّالِمُونَ وَ آلَ إِلَيْهِ الْأَخْسَرُونَ لَهَرَبْتَ إِلَى اللَّهِ عَزَّ وَ جَلَّ مِمَّا هُمْ عَلَيْهِ مُقِيمُونَ وَ إِلَيْهِ صَائِرُونَ أَلَا وَ إِنِّي فِيكُمْ أَيُّهَا النَّاسُ كَهَارُونَ فِي آلِ فِرْعَوْنَ وَ كَبَابِ حِطَّةٍ فِي بَنِي إِسْرَائِيلَ وَ كَسَفِينَةِ نُوحٍ فِي قَوْمِ نُوحٍ إِنِّي النَّبَأُ الْعَظِيمُ وَ الصِّدِّيقُ الْأَكْبَرُ وَ عَنْ قَلِيلٍ سَتَعْلَمُونَ مَا تُوعَدُونَ وَ هَلْ هِيَ إِلَّا كَلُعْقَةِ الْآكِلِ وَ مَذْقَةِ الشَّارِبِ وَ خَفْقَةِ الْوَسْنَانِ ثُمَّ تُلْزِمُهُمُ الْمَعَرَّاتُ خِزْياً فِي الدُّنْيَا وَ يَوْمَ الْقِيامَةِ يُرَدُّونَ إِلى أَشَدِّ الْعَذابِ وَ مَا اللَّهُ بِغَافِلٍ عَمَّا يَعْمَلُونَ فَمَا جَزَاءُ مَنْ تَنَكَّبَ مَحَجَّتَهُ وَ أَنْكَرَ حُجَّتَهُ وَ خَالَفَ هُدَاتَهُ وَ حَادَّ عَنْ نُورِهِ وَ اقْتَحَمَ فِي ظُلَمِهِ وَ اسْتَبْدَلَ بِالْمَاءِ السَّرَابَ وَ بِالنَّعِيمِ الْعَذَابَ وَ بِالْفَوْزِ الشَّقَاءَ وَ بِالسَّرَّاءِ الضَّرَّاءَ وَ بِالسَّعَةِ الضَّنْكَ إِلَّا جَزَاءُ اقْتِرَافِهِ وَ سُوءُ خِلَافِهِ فَلْيُوقِنُوا بِالْوَعْدِ عَلَى حَقِيقَتِهِ وَ لْيَسْتَيْقِنُوا بِمَا يُوعَدُونَ يَوْمَ تَأْتِي الصَّيْحَةَ بِالْحَقِّ ذلِكَ يَوْمُ الْخُرُوجِ إِنَّا نَحْنُ نُحْيِي وَ نُمِيتُ وَ إِلَيْنَا الْمَصِيرُ يَوْمَ تَشَقَّقُ الْأَرْضُ عَنْهُمْ سِراعاً ـ إِلَى آخِرِ السُّورَةِ ـ .",
                "englishText": "4. Muhammad Bin Ali Bin Ma’mar, from Muhammad Bin Ali Bin Ukaayat Al-Tamimy, from Al-Husayn Bin Al-Nazar Al-Fahry, from Abu Amro Al-Awzaiy, from Amro Bin Shimr, from Jabir Bin Yazeed who said: ‘I came up to Abu Ja’far , so I said, ‘O son  of the Messenger ﷺ of Allah (azwj), the differing among the Shiites in this Doctrine causes me pain’. He  said: ‘O Jabir, shall I  not suffice you with the meanings of their differences, from where they are differing, and from which perspective they are separating?’ I said, ‘Yes, O son  of the Messenger ﷺ of Allah (azwj)’. He  said: ‘So do not differ if they differ, O Jabir. The one who fights against the Master  of the Era (Imam  of his time) is like the one who has fought against the Messenger ﷺ of Allah (azwj) in his ﷺ days. O Jabir, listen attentively’. I said, ‘As you  like’. He  said: ‘Listen attentively, and make it reach to wherever your ride takes you, that Amir-ul-Momineen  preached to the People at Al-Medina, seven days after the passing away of the Messenger ﷺ of Allah (azwj), and that was when he  was free from collecting the Quran and compiling it. He  said: ‘Praise be to Allah (azwj) Who has Prevented the imaginations to grasp Him (azwj) except for His (azwj) Existence, and Veiled the intellects to think about His (azwj) Essence due to the restrictions of Him (azwj) having no similarities or images. But He (azwj) is the One in Whose Essence there are not differences nor any division into a number of parts due to the Perfection. He (azwj) is separate from the things, not due to being in a different place, and He (azwj) is in things, not being mixed within them, and He (azwj) Knows these, not by the use of tools. And He (azwj) is not Knowledgeable except by it, and there is nothing between Him (azwj) and His (azwj) Knowledge, any other knowledge. He (azwj) is the Knowledgeable by Himself (azwj). If it is said that He (azwj) was, it would be interpreted as the eternal existence, and if it is said that He (azwj) will never cease (to exist), it would be interpreted as the negation of the non-existence. He (azwj) is Glorious, and higher than the words of those who worship other than Him (azwj) and have taken a god other than Him (azwj). He (azwj) is Higher and Greater. We  Praise Him (azwj) with a Praise of those of His (azwj) creatures who has Pleased Him (azwj), and He (azwj) has Made it to be more than Obligatory upon Himself (azwj) to Accept it. And I  hereby testify that there is no God but Allah (azwj), One, with no Associates for Himself (azwj), and I  testify that Muhammad ﷺ is His (azwj) servant and His (azwj) Messenger. These two testimonies elevate the words and increase the deeds. Light is the Scale from which these two are raised from, and heavy is the Scale on which these two are placed. And by these two is the victory of the Paradise, and the salvation from the Fire, and the Permission upon the (crossing of) the Bridge. And it is by the testimony that you will be entering the Paradise, and by the Prayers that you will be consuming the Mercy. Send the greetings frequently upon your Prophet ﷺ “[33:56] Surely Allah and His angels bless the Prophet; O you who believe! call for (Divine) blessings on him and salute him with a (becoming) salutation”. O you people! There is no nobility higher than Al-Islam, nor a prestige more honourable than the piety, nor a stronghold better than devoutness, nor an intercessor more excellent than repentance, nor a robe more majestic than good health, nor a protection more secure than safety, nor a wealth better at dispelling poverty than contentment with conviction/cetainity, nor a treasure more enriching than being satisfied. And the one lives at the subsistence level and the reduction in comfort, so he has made the preparations for the rest, and the desires is the key to the fatigue, and the monopolisation follows from affliction, and the jealousy is a scourge on the Religion, and the greed is an invitation to the indulgence in the sins and the reason for the deprivation, and the transgression is a driver to the destruction, and greed gathers all the defects. Perhaps a failed greed, a false hope leads to the dispossession and a business trade to incur a loss. The one who gets involved in the matters without looking at the consequences will be exposed to misfortunes, and the most evil of the collars (humiliation) for a Believer is the sin. O you people! There is no treasure more beneficial than the knowledge, and no honour higher than the forbearance, and no nobility more eloquent than the ethics, and no affliction greater than anger, and no majesty more decorative than the intellect, and nothing is more disgraceful than the lies, and no protection safer than silence, and no absentee which is nearer than the death. O you people! The one who looks at his own faults will be too pre-occupied to look at the faults of the others, and the one who is contented with the sustenance of Allah (azwj) will not despair upon what is in the hands of the others, and the one who unsheathes the sword of rebellion will be killed by it, and the one who drills a pit for his brother will fall into it himself, and the one who discloses the veiled (privacy) of others will uncover the privacy of his own house, and the one who forgets his own mistakes will magnify the mistakes of the others, and the one who wonders at his own opinion will go astray, and the one who considers himself to be needless due to his intellect will make mistakes, and the one who is arrogant to the people will be humiliated, and the one who is a fool to the people will be hated, and the one who mixes with the villains will be degraded, and the one who burdens himself with what he cannot endure will be frustrated. O you people! There is no wealth more valuable than the intellect, and no poverty which is more intense than the ignorance, and no preacher which is more profound than the sound advice, and no reasoning like the contemplation, and no worship like the pondering, and no demonstration more reliable than the consultation, and no isolation more severe than the self-conceit, nor piety like refraining from the Prohibitions, and no forbearance like patience and silence. O you people! In the human being there are ten qualities, which are revealed by his tongue and becomes witness to his hidden thoughts, it is a ruler by which he decides between what to be said, and the words by which he returns the answer, and an intercessor (limbs) by which he achieves the needs, and a describer (senses) by which he recognises the things, and a commander (decision) by which he commands for the good, and a preacher by which he prohibits from the ugly (deeds), and a consoler by which he gives solace to the sorrows, and a conscious by which he clears the malice, and an articulator by which he gives pleasure to the ears. O you people! There is no good in keeping silent about the ‘الْحُكْمِ’ (the Command) just as there is no good in speaking out of ignorance. And know, O you people, that the one who does not control his tongue will regret, and the one who does not learn will be ignorant, and the one who does not forbear will not content, and the one who is not deterred does not learn, and the one who does not know is insulted, and the one who is insulted is not respected, and the one who is not respected is taunted, and the one who acquires wealth from where he has no right to do so will spend it extravagantly in other that the right way, and the one who does not desist when he is praised will desist when he is condemned, and the one who does not give in comfort will also be refused when in the need, and the one who seeks the honour without being deserving of it will be disgraced, the one who overcomes with injustice will also be overpowered, and the one who opposed the truth will necessitate weakness for himself, and the one who ponders will be dignified, and the one who is arrogant will be belittled, and the one who is not good will not be praised. O you people! The death is (better) before the lowliness, and the endurance before the apathy, and the accounting before the Punishment, and the grave is better than the poverty, lowering the sight is better than looking at a great deal, and the time, a day is for you and a day against you. So if it is for you, do not be ungrateful, and if it is against you, observe patience. So with both of them you will be Examined. (And in another copy – ‘And with both of them you will be Tested’) O you people! The strangest of what is in the human being is his heart, and in it are matters of wisdom and the antibodies to the one who opposes it. When there is prosperity for him, greed humiliates him, and if greed excites him, the thriftiness destroys him, when despair overpowers him, the remorse kills him, and when the anger presents itself, the rage intensifies, and when he is happy and satisfied he forgets to conserve, and when fear seizes him he gets preoccupied by caution, and when security is widened for him his honour makes him complacent (and in another copy ‘pride takes him over’), and when new bounties come up for him pride takes him over, and when he is benefitted by money his richness makes him oppressive, and when poverty bites him he is preoccupied by the affliction (and in another copy ‘he strives in the weeping’), and when he is inflicted by hardship anxiety injures him, and when the hunger exhausts him he is disabled by the weakness, and when he over-eats he is upset by indigestion, so every deficiency is harmful to him, and every excess spoils him. O you people! The one who is miserly will be disgraced and the one who is generous will be the master, and the one who increases his wealth becomes the leader and the one who increases his forbearance becomes noble, and the one who ponders regarding the Essence of Allah (azwj) becomes an Atheist, and the one who frequents in something becomes known for it, and the one frequently jokes will be taken lightly, and the one who frequently laughs his prestige goes away, the one who has no ethics will corrupt. The best deed is the maintenance of honour by wealth. There is none who sits with the ignorant ones who is reasonable, for the one who sits with the ignorant ones should ready himself for (a lot of) talk (against him)’. And he  said: ‘Neither did the rich one obtain salvation from death by his wealth, nor did the poor one due to his scarcity’. O you people! Had the death been (a commodity) which could be bought, the good and the honourable ones of the world, as well as the wicked and the greedy ones would have bought it. O you people! There are witnesses for the hearts which hold them back from being the people of excesses, and there is insight for the understanding, which alerts the self and caution it from the danger. And for the heart there are memories of desires, and the intellect admonishes and prohibits from it. And in the experiences there is an appellant, which is a reliable guide to the right way. It is sufficient for yourself what you would not like it to happen to others, and it is upon you that the same should be for your believing brother, and in it upon him, likewise. The one who considers his own opinion to be self-sufficing from him would endanger him, and the pondering before the deeds would keep you safe from remorse. And the one who welcomes different opinions would understand the places of mistakes. And the one who refrains from the useless matters his opinion would balance the intellects. The one who fortifies his carnal desires so he has kept his respect, and the one who restrains his tongue is trusted by the people and will achieve his needs. And in the alteration of the situations the jewels of the men become known, and the passing days make apparent the inner selves. And there is no enjoyment in the swiftness of lightning for the one who goes through darkness. And the one who is recognised by the wisdom, the eyes will notice him with reverence and prestige. The most noble of riches is the avoidance of wishes, and the patience is a shield against poverty, and the greed is a sign of poverty, and the stinginess is the gown of destitution, and the cordiality with the relatives is beneficial, and the sympathy of the poor is better than the disloyal rich. Counselling is like a cave for the one who listens to it, and the one who does not restrain his eyes, his regrets increase. And the (passage of) time has made it to be more than obligatory for the one who avails it, to thank it. The tongue does very little justice in displaying the ugly and the good. The one who constricts his ethics, his family get tired of him. And the one who seeks, achieves it for a long time, and very little of what is wished is sincere. Modesty clothes you with dignity, and in the extensiveness of the morals is a treasure for the sustenance, and how many from the people remain in their sins until the end of their days. And the one who robes himself with bashfulness as his clothing his faults are hidden from the people. And intend moderation in your speech, for the one who intends it will incur light expenses, and in the opposition to the ego is guidance for you. And the one who recognises the ‘days’ (his end) will never be oblivious from the preparation. Nay! Along with every sip (of drink) is (possibility of) choking, and in every morsel is (the possibility of) suffocation. Bounties cannot be achieved except by the decline of other (bounties), and for every breath is life, and for every grain is a consumer, and you are the morsel of the death. And know, O you people! The ones who walks upon the face of the earth will end up in its belly, and the nights and the days, they dispute (they accelerate) regarding the destruction of the life-span. O you people! Ingratitude for the bounties is wickedness, and the company of the ignorant is ominous. The softness of the speech is from the prestige. And from the (acts of) worship are displayed by the tongue (make it heard) and increase the greetings. Beware of deceit for it is from the manners of the villains. Every seeker does not get a share, nor does every absentee return. Its not certain that one will get what he wishes and the lost is recovered. Seek (the company) of friends before setting of and ensure (good) neighbourhood before (moving into) the house. Indeed! The one who moves fast will catche up with the slower ones. Conceal the private (matters) of your brother just as he knows regarding you. Forgive the mistakes of your friend for the day that your enemy comes to dominate you. The one who is angry with the one over whom he has no power to injure, his grief would be prolonged and it will punish his soul. The one who fears his Lord (azwj) will refrain from committing injustices. The one who is good with the words would display his pride. And the one who does not recognise the good from the evil, is like an animal. Indeed the corruption destroys the provisions (of the Hereafter). How little is the difficulty (of today) as compared with the great destitution tomorrow. Far it is! Far it is from being compared. And what is your antipathy due to, except for your indulgence in acts of disobedience and the sins. So how close is the rest to the tiredness, and the misery from the Bounties. The hardships are not painful after which there is the Paradise, and the goodtime is not the (lasting) comfort after which there is the Fire. And every bounty apart from the Paradise is insignificant, and every affliction apart from the Fire is healthy. And turning away from correcting the consciences leads to the major sins. Purification of the deeds is more difficult than the deed itself, and the sincerity of the intention from the corruption is more difficulty upon the performer of the deed than the lengthy Jihaad. Far it is! Had it not been for the piety I  would have been the shrewdest of the Arabs. O you people! Allah (azwj) the High Promised His (azwj) Prophet ﷺ Muhammad ﷺ the Means (Al-Waseela), and His (azwj) Promise is True, and Allah (azwj) does not Go against His (azwj) Promise. Surely Al-Waseela is on the steps of the Paradise and is at the peak of the nearness (to Allah (azwj)), and is a total security at the very end of it. There are a thousand staircases, and what is in between one staircase and the other there is a travel distance by a fine horse of a hundred years. And in between these is a staircase of gems going up to a staircase of jewels, to a staircase of aquamarines, to a staircase of pearls, to a staircase of rubies, to a staircase of emeralds, to a staircase of corals, to a staircase of camphor, to a staircase of ambergris, to a staircase of aloe, to a staircase of gold, to a staircase of clouds, to a staircase of air, to a staircase of Light which encompasses all of the Gardens. And on that Day the Messenger ﷺ of Allah (azwj) would be seated wearing two Garments – a Garment of the Mercy of Allah (azwj) and a Garment of the Light of Allah (azwj). On him ﷺ will be a Crown of the Prophet-hood and a Garland of the Message, the Light of which will illuminate the whole of the Pausing Place (Station in the Hereafter). And on that Day, I  will be upon the High Level, and it will be lower than his ﷺ Level, and on me  would be two Garments – a Garment of purple Light and a Garment of Camphor. And the Messengers  and the Prophets ﷺ would have paused upon my  staircase, with the Flags of the Eras and the Proof of the ages on our  right, and they  will have Majestic Garments of Light and the Prestige. There is no Angel of Proximity, and no Messenger Prophet ﷺ who will look at us  except that he will be stunned by our  Light. And stranger than our  Illumination and our  Majesty is the Al-Waseela on our  right, and on the right of the Messenger ﷺ of Allah (azwj) will be a cloud stretching out as far as the eye can see. A Call will come out from it: ‘O people of the Pausing Place! Goodness is for the ones who loved the successor  and believed in the Prophet ﷺ, the ‘Ummy’ of the Arabs. And the one who disbelieved, so the Fire is Prepared for him. And on the left of Al-Waseela, from the left of the Messenger ﷺ of Allah (azwj) will be a shade. A Call will come out from it: ‘O people of the Pausing Place! Goodness is for the ones who loved the successor  and believed in the ‘Ummy’ Prophet ﷺ, the one ﷺ for whom is the High Kingdom. There is no success for anyone, nor happiness for the soul, and the Paradise except for the one who is meeting his Creator (azwj) with the sincerity for these two  and the follower of the stars (Imams ) from these two . Be convinced, O people of Al-Wilayah of Allah (azwj), of the whitening of your faces, and the prestige of your seating, and the honour of your return and your success today, with bliss, facing each other. And O people of the deviation, and the diverters from Allah (azwj), Mighty is His (azwj) Remembrance, and from His (azwj) Messenger ﷺ, and from His (azwj) Path, and the Flags of the eras, be convinced of the blackening of your faces, and the Wrath of your Lord (azwj), a Recompense of what you used to do before. And there is none from the Messengers  who preceded and none from the Prophets  of the past except that he  had informed his  community of the Messenger ﷺ to come after him , and the good news of the Messenger ﷺ of Allah (azwj), and bequeathed to his  community, and described him ﷺ to his  community his ﷺ qualities, and that they should follow him ﷺ and be upon his ﷺ Law, so that they would not stray with regards to him ﷺ after him . So the ones who would face destruction and straying afterwards would only be after the occurrence of the reasons and the warnings, and having been acquainted with the evidence, and the arguments having been established. So the communities lived in hope about the Messengers  and the Prophets  to come, if they were in difficult circumstances in the absence of a Prophet  after their Prophet , in their great difficulties and disasters, so they were at the time in a state of hope. And there have never been a difficulty which was greater, and nor a disaster greater like the difficulties with the Messenger of Allah ﷺ, because Allah (azwj) Ended the Warnings, and the Reasons, and Cut-off through him ﷺ the Arguments, and the Reasons between Him (azwj) and His (azwj) creatures, and Made him ﷺ to be His (azwj) Door which was between Him (azwj) and His (azwj) servants, and as His (azwj) Authority which nothing would be Acceptable except by him ﷺ, nor any nearness to Him (azwj) except by being obedient to him ﷺ. And He (azwj) Said Decisively in His (azwj) Book: “[4:80] Whoever obeys the Messenger, he indeed obeys Allah and whoever turns back, so We have not sent you as a keeper over them”. So He (azwj) Joined obedience to Himself (azwj) with obedience to him ﷺ, and disobedience to Himself (azwj) with disobedience to him ﷺ. So that was the Evidence which was Delegated to him ﷺ, and a Testimony against the one who obeys him ﷺ, and disobeys him ﷺ, and between that in other places from the Great Book. So the Blessed and the High Said in the Incitement to follow him ﷺ, and the Exhortation with regards to his ﷺ ratification, and the acceptance of his ﷺ Call: “[3:31] Say, (O Muhammad, tell to mankind): If you love Allah, follow me; Allah will love you and forgive you your sins”. So following him ﷺ achieves the Love of Allah (azwj) and His (azwj) Pleasure, and the Forgiveness of the sins, and the completeness of the success, and the necessitation of the Paradise. And in the turning away from him ﷺ achieves the Enmity of Allah (azwj), and His (azwj) Wrath, and His (azwj) Harshness, and remoteness from Him (azwj), and a dwelling in the Fire and that is His (azwj) Statement: “[11:17] and whoever of the (different) parties disbelieves in it, the Fire will be their promised meeting-place”, meaning the striving against him ﷺ and disobedience to him ﷺ. Allah (azwj), Blessed is His (azwj) Name, Tested His (azwj) servants by me , and killed those that opposed Him (azwj) by my  hand, and annihilated those that strived against Him (azwj) by my  sword, and Made me  to be a Means of nearness to Him (azwj) (Zulfat) for the Believers, and a ground of death for the toughest tyrants, and His (azwj) Sword against the criminals, and Strengthened by me  the back of His (azwj) Messenger ﷺ, and Honoured me  by helping him ﷺ, and Privileged me  with his ﷺ knowledge, and Gifted me  with his ﷺ Laws, and Favoured me  for his ﷺ successorship, and Chose me  for his ﷺ Caliphate in his ﷺ community. So he ﷺ said when he ﷺ mobilised the Emigrants and the Helpers in their gathering: ‘O you people! Surely, Ali  is from me ﷺ like Haroun  was from Musa  except that there is no Prophet  to come after me ﷺ. So the Believers understood that the Messenger ﷺ was speaking on behalf of Allah (azwj). They recognised me  that I  was not his ﷺ brother by his ﷺ father  or his ﷺ mother  as was the case with Haroun ﷺ who was the brother of Musa  from his  father and his  mother , nor was I  a Prophet . The Prophet-hood has ended. But, that was from him ﷺ appointing me  as the Caliph just as Musa  had appointed Haroun  as the Caliph when he  said: “[7:142] Take my place among my people, and act well and do not follow the way of the mischief-makers.” And his ﷺ words when a group spoke saying, ‘We are the friends of the Messenger of Allah (azwj)’. So the Messenger ﷺ of Allah (azwj) went out to the Farewell Pilgrimage, then came up to Ghadeer Khumm. So he ﷺ ordered for something resembling a Pulpit to be prepared to him ﷺ. Then he ﷺ ascended it, grabbed my  arm and raised it to the extent that the whiteness of his ﷺ armpits were seen, and said in a raised voice in that forum: ‘The one to whom I ﷺ was the Master of, so Ali  is his Master. Our Allah (azwj)! Befriend the one who befriends him , and be Inimical to the one who is an enemy to him . Thus, upon my  Wilayah is the Wilayah of Allah (azwj), and upon my  enmity is the enmity against Allah (azwj). And Allah (azwj), Mighty and Majestic Revealed in that day: “[5:3] This day have I perfected for you your religion and completed My favor on you and chosen for you Islam as a religion”. So upon my  Wilayah was the completion of the Religion, and the Pleasure of the Lord (azwj), Majestic is His (azwj) Remembrance. And Allah (azwj), Blessed and High, Revealed it especially for me  and Honoured the Gifting it for me  as (a sign of) greatness, and its gifting from the Messenger of Allah ﷺ, and it is the Statement of the High: “[6:62] Then are men returned unto Allah, their protector, the (only) reality: Is not His the command? and He is the swiftest in taking account.” If I  were to mention my  merits, its loftiness would be great, and it’s listening prolonged. And about me , two miserable ones before me  disputed with me  regarding that in which they had no rights over it, and they rode its misguidance, and believed in the ignorance. So evil is what was to them, what they returned to, and evil is what they made as a cradle for themselves. They cursed each other in their own houses, and each one of them distanced himself from his companion saying to him when he met him, ‘Alas! If only there was the distance between the East and the West between me and between you’. So evil is the friend who answered him, the miserable one upon his ragged condition, “[25:28] O woe is me! would that I had not taken such a one for a friend. [25:29] He verily led me astray from the Reminder after it had reached me. Satan was ever man’s deserter in the hour of need”. So I  am the Reminder from which he went astray, and the Way from which he deviated, and the Belief which he denied, and the Quran from which he fled, and the Religion which he belied, and the Path from which he digressed. And the debris which they lived upon in their constant pride, they were on it on the verge of the Fire (prepared) for them - an evil return amongst the wicked group, to a condemned destination. They will be shouting curses at each other grumbling in regret. There will be no rest for these two; nor a respite from their inevitable Punishment. The people never ceased to be the worshippers of the idols and being the custodians of the idols, establishing rituals for them, and designated certain offerings for them in order to seek nearness to them. And they made for them titles such as ‘Al-Baheyra, and Al-Waseyla, and Al-Sa’ebat, and Al-Haam’. They distributed these idols by casting lots by arrows, wondering about Allah (azwj) Mighty is His (azwj) Remembrance. They were confused about the guidance, hastening to the remoteness, and they had been overcome by Satan (la) who had flooded them with the darkness of ignorance, having breastfed them with ignorance and weaned them with misguidance. Allah (azwj) Brought us  out to them as a Mercy, and Informed about us  as being higher than them, and Removed the Veil of Light from us  for those that sought us , and Preferred the ones who followed it (the Light), and we  were a support for the ones who ratified it. So honour followed after the disgrace, and the plenty after the scarcity. And their hearts and their eyes revered them, and the tyrants yielded to them, and its respective communities became the people of the Bounties, being worthy of mention, and prestigious, and ease, and security after fear, and ‘جَمْعٍ’ union after having been separated. And Ma’d Bin Adnan was illuminated (famous) due to us  and we  inserted them in the Door of Guidance, and we  entered them into the House of Peace, and we  clothed them with the garment of Belief, and they became famous due to us  in the worlds, and the effects of the righteous people appeared for them in the days of the Messenger ﷺ, from a striving protector, and an obedient worshipper, and an ascetic retreater, and they preserved the trusts and became as such until when Allah (azwj) Mighty and Majestic Called back His (azwj) Prophet ﷺ and Raised him ﷺ to Himself (azwj). That was not after him ﷺ except like a moment of pulse, or a glimmer of lightning for them to return back and turn back upon their heels, and sought revenge by forming battalions, and they blocked the Door and destroyed the houses, and changed the effects of the Messenger of Allah ﷺ, and turned away from his ﷺ rulings, and distanced themselves from his ﷺ Light, and they changed his ﷺ Caliph with an alternate. They took to him, and they were unjust in doing so, and they thought that the one whom they had chosen from the descendants of Abu Kohafa (Abu Bakr) is higher in status than the one  whom the Messenger ﷺ of Allah (azwj) had chosen to be in his ﷺ place, and that the Emigrants from the progeny of Abu Kohafa were better than the Emigrants and the Helpers of the Rabbi of the Law Hashim Bin Abd Manaf . Nay! The first false testimony which occurred in Al-Islam was their testimony that their companion (Abu Bakr) is the one whom the Messenger ﷺ of Allah (azwj) had made to be the Caliph. So when the matter of Sa’d Bin Ubada was what it was, they retracted from that and said that the Messenger ﷺ of Allah (azwj) passed away and did not appoint a Caliph. So the Messenger of Allah ﷺ, the good, the Blessed, was the first one in Al-Islam against who the false testimony was borne. And after a little while they found out the evil of what (they came to know and found out the consequences of the evil of what) the former ones had established. And they had an alternative and an opportunity to recover from the death, and had the time to turn around from the lure of pride, and be in a tranquil condition, and the realisation of the deeds. Allah (azwj) had respited Shaddaad Bin Aad, and Thamud Bin Abbuwad, and Bal’am Bin Ba’our, and Bestowed upon them His (azwj) Favours, both apparent as well as hidden, Supplied them with the wealth, and the (prolongation) of their lives, and Granted them the land, so that due to these Blessings they would Remember the Signs of Allah (azwj), and they would recognise and be awed by Him (azwj), and turn to Him (azwj), and bring an end to their arrogance. So before they reached their (allocated) time, and enjoy their meal, Allah (azwj) Mighty and Majestic Grabbed them and cut them down. Some of them from sandstorm, some were overtaken by a scream, and some from being burned by the shadow, and some from the tremors, and some from sinking of the earth. Allah (azwj) was not Unjust to them, but they had been unjust to their own selves. Indeed! For every term there is a writing. So when the writing reaches its term, and it is uncovered for you about what would befall the unjust ones, and what the greatest losers have got to, you will run towards Allah (azwj) Mighty and Majestic from what they had been involved in and to what they are proceeding to. Nay! And I  am among you, O you people, like Haroun  was in the people of the Pharaoh (la), and like the Door of Hitta in the Children of Israel, and like the Ark of Noah  in the people of Noah . I  am the Great News (Al-Nabaa Al-Azeem), and the Great Truthful (Al-Siddique Al-Akbar), And after a little while you will come to know what had been Promised to you. And is this anything else but (was committed) for a morsel of food, and a sip of drink, light sleep. Then the disgrace will be necessitated upon them in the world, and on the Day of Judgement they will be returning to intense Punishment. And Allah (azwj) is not Oblivious (forgetful) of what they have done. So what is the Recompense for the one who turned away from His (azwj) Proof , and denied His (azwj) Argument, and opposed His (azwj) Guides , and turned away from His (azwj) Light and stormed (his way) into the darkness, and exchanged water for the mirage, and Bounties for the Punishment, and the success for the misery, and prosperity for the poverty, and the ease for the hardship. Nay! This is the Recompense of what they had sown and done before. So be certain of the Promise and of its reality, and be assured of what has been Promised on the Day of the coming of the ‘Scream’ (Dooms Day), with the Truth. “[50:42] The day when they shall hear the cry in truth; that is the day of coming forth. [50:43] Surely We give life and cause to die, and to Us is the eventuAl-coming [50:44] The day on which the earth shall cleave asunder under them, they will make haste; that is a gathering together easy to Us”.",
                "href": "https://thaqalayn.net/hadith/8/1/4/1",
                "gradings": {}
            }
        }
    },
    {
        "1": {
            "5": {
                "hadithNumber": "Hadith #1",
                "title": "Al-Kafi - Volume 8: The sermon of al-Talutiyah",
                "arabicText": "-مُحَمَّدُ بْنُ عَلِيِّ بْنِ مَعْمَرٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَيُّوبَ الْأَشْعَرِيُّ عَنْ عَمْرٍو الْأَوْزَاعِيِّ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ أَبِي الْهَيْثَمِ بْنِ التَّيِّهَانِ أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) خَطَبَ النَّاسَ بِالْمَدِينَةِ فَقَالَ الْحَمْدُ لِلَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ كَانَ حَيّاً بِلَا كَيْفٍ وَ لَمْ يَكُنْ لَهُ كَانٌ وَ لَا كَانَ لِكَانِهِ كَيْفٌ وَ لَا كَانَ لَهُ أَيْنٌ وَ لَا كَانَ فِي شَيْ‏ءٍ وَ لَا كَانَ عَلَى شَيْ‏ءٍ وَ لَا ابْتَدَعَ لِكَانِهِ مَكَاناً وَ لَا قَوِيَ بَعْدَ مَا كَوَّنَ شَيْئاً وَ لَا كَانَ ضَعِيفاً قَبْلَ أَنْ يُكَوِّنَ شَيْئاً وَ لَا كَانَ مُسْتَوْحِشاً قَبْلَ أَنْ يَبْتَدِعَ شَيْئاً وَ لَا يُشْبِهُ شَيْئاً وَ لَا كَانَ خِلْواً عَنِ الْمُلْكِ قَبْلَ إِنْشَائِهِ وَ لَا يَكُونُ خِلْواً مِنْهُ بَعْدَ ذَهَابِهِ كَانَ إِلَهاً حَيّاً بِلَا حَيَاةٍ وَ مَالِكاً قَبْلَ أَنْ يُنْشِئَ شَيْئاً وَ مَالِكاً بَعْدَ إِنْشَائِهِ لِلْكَوْنِ وَ لَيْسَ يَكُونُ لِلَّهِ كَيْفٌ وَ لَا أَيْنٌ وَ لَا حَدٌّ يُعْرَفُ وَ لَا شَيْ‏ءٌ يُشْبِهُهُ وَ لَا يَهْرَمُ لِطُولِ بَقَائِهِ وَ لَا يَضْعُفُ لِذُعْرَةٍ وَ لَا يَخَافُ كَمَا تَخَافُ خَلِيقَتُهُ مِنْ شَيْ‏ءٍ وَ لَكِنْ سَمِيعٌ بِغَيْرِ سَمْعٍ وَ بَصِيرٌ بِغَيْرِ بَصَرٍ وَ قَوِيٌّ بِغَيْرِ قُوَّةٍ مِنْ خَلْقِهِ لَا تُدْرِكُهُ حَدَقُ النَّاظِرِينَ وَ لَا يُحِيطُ بِسَمْعِهِ سَمْعُ السَّامِعِينَ إِذَا أَرَادَ شَيْئاً كَانَ بِلَا مَشُورَةٍ وَ لَا مُظَاهَرَةٍ وَ لَا مُخَابَرَةٍ وَ لَا يَسْأَلُ أَحَداً عَنْ شَيْ‏ءٍ مِنْ خَلْقِهِ أَرَادَهُ لا تُدْرِكُهُ الْأَبْصارُ وَ هُوَ يُدْرِكُ الْأَبْصارَ وَ هُوَ اللَّطِيفُ الْخَبِيرُ وَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَ أَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَ رَسُولُهُ أَرْسَلَهُ بِالْهُدَى وَ دِينِ الْحَقِّ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ وَ لَوْ كَرِهَ الْمُشْرِكُونَ فَبَلَّغَ الرِّسَالَةَ وَ أَنْهَجَ الدَّلَالَةَ ( صلى الله عليه وآله ) أَيُّهَا الْأُمَّةُ الَّتِي خُدِعَتْ فَانْخَدَعَتْ وَ عَرَفَتْ خَدِيعَةَ مَنْ خَدَعَهَا فَأَصَرَّتْ عَلَى مَا عَرَفَتْ وَ اتَّبَعَتْ أَهْوَاءَهَا وَ ضَرَبَتْ فِي عَشْوَاءِ غَوَايَتِهَا وَ قَدِ اسْتَبَانَ لَهَا الْحَقُّ فَصَدَّتْ عَنْهُ وَ الطَّرِيقُ الْوَاضِحُ فَتَنَكَّبَتْهُ أَمَا وَ الَّذِي فَلَقَ الْحَبَّةَ وَ بَرَأَ النَّسَمَةَ لَوِ اقْتَبَسْتُمُ الْعِلْمَ مِنْ مَعْدِنِهِ وَ شَرِبْتُمُ الْمَاءَ بِعُذُوبَتِهِ وَ ادَّخَرْتُمُ الْخَيْرَ مِنْ مَوْضِعِهِ وَ أَخَذْتُمُ الطَّرِيقَ مِنْ وَاضِحِهِ وَ سَلَكْتُمْ مِنَ الْحَقِّ نَهْجَهُ لَنَهَجَتْ بِكُمُ السُّبُلُ وَ بَدَتْ لَكُمُ الْأَعْلَامُ وَ أَضَاءَ لَكُمُ الْإِسْلَامُ فَأَكَلْتُمْ رَغَداً وَ مَا عَالَ فِيكُمْ عَائِلٌ وَ لَا ظُلِمَ مِنْكُمْ مُسْلِمٌ وَ لَا مُعَاهَدٌ وَ لَكِنْ سَلَكْتُمْ سَبِيلَ الظَّلَامِ فَأَظْلَمَتْ عَلَيْكُمْ دُنْيَاكُمْ بِرُحْبِهَا وَ سُدَّتْ عَلَيْكُمْ أَبْوَابُ الْعِلْمِ فَقُلْتُمْ بِأَهْوَائِكُمْ وَ اخْتَلَفْتُمْ فِي دِينِكُمْ فَأَفْتَيْتُمْ فِي دِينِ اللَّهِ بِغَيْرِ عِلْمٍ وَ اتَّبَعْتُمُ الْغُوَاةَ فَأَغْوَتْكُمْ وَ تَرَكْتُمُ الْأَئِمَّةَ فَتَرَكُوكُمْ فَأَصْبَحْتُمْ تَحْكُمُونَ بِأَهْوَائِكُمْ إِذَا ذُكِرَ الْأَمْرُ سَأَلْتُمْ أَهْلَ الذِّكْرِ فَإِذَا أَفْتَوْكُمْ قُلْتُمْ هُوَ الْعِلْمُ بِعَيْنِهِ فَكَيْفَ وَ قَدْ تَرَكْتُمُوهُ وَ نَبَذْتُمُوهُ وَ خَالَفْتُمُوهُ رُوَيْداً عَمَّا قَلِيلٍ تَحْصُدُونَ جَمِيعَ مَا زَرَعْتُمْ وَ تَجِدُونَ وَخِيمَ مَا اجْتَرَمْتُمْ وَ مَا اجْتَلَبْتُمْ وَ الَّذِي فَلَقَ الْحَبَّةَ وَ بَرَأَ النَّسَمَةَ لَقَدْ عَلِمْتُمْ أَنِّي صَاحِبُكُمْ وَ الَّذِي بِهِ أُمِرْتُمْ وَ أَنِّي عَالِمُكُمْ وَ الَّذِي بِعِلْمِهِ نَجَاتُكُمْ وَ وَصِيُّ نَبِيِّكُمْ وَ خِيَرَةُ رَبِّكُمْ وَ لِسَانُ نُورِكُمْ وَ الْعَالِمُ بِمَا يُصْلِحُكُمْ فَعَنْ قَلِيلٍ رُوَيْداً يَنْزِلُ بِكُمْ مَا وُعِدْتُمْ وَ مَا نَزَلَ بِالْأُمَمِ قَبْلَكُمْ وَ سَيَسْأَلُكُمُ اللَّهُ عَزَّ وَ جَلَّ عَنْ أَئِمَّتِكُمْ مَعَهُمْ تُحْشَرُونَ وَ إِلَى اللَّهِ عَزَّ وَ جَلَّ غَداً تَصِيرُونَ أَمَا وَ اللَّهِ لَوْ كَانَ لِي عِدَّةُ أَصْحَابِ طَالُوتَ أَوْ عِدَّةُ أَهْلِ بَدْرٍ وَ هُمْ أَعْدَاؤُكُمْ لَضَرَبْتُكُمْ بِالسَّيْفِ حَتَّى تَئُولُوا إِلَى الْحَقِّ وَ تُنِيبُوا لِلصِّدْقِ فَكَانَ أَرْتَقَ لِلْفَتْقِ وَ آخَذَ بِالرِّفْقِ اللَّهُمَّ فَاحْكُمْ بَيْنَنَا بِالْحَقِّ وَ أَنْتَ خَيْرُ الْحَاكِمِينَ قَالَ ثُمَّ خَرَجَ مِنَ الْمَسْجِدِ فَمَرَّ بِصِيرَةٍ فِيهَا نَحْوٌ مِنْ ثَلَاثِينَ شَاةً فَقَالَ وَ اللَّهِ لَوْ أَنَّ لِي رِجَالًا يَنْصَحُونَ لِلَّهِ عَزَّ وَ جَلَّ وَ لِرَسُولِهِ بِعَدَدِ هَذِهِ الشِّيَاهِ لَأَزَلْتُ ابْنَ آكِلَةِ الذِّبَّانِ عَنْ مُلْكِهِ قَالَ فَلَمَّا أَمْسَى بَايَعَهُ ثَلَاثُمِائَةٍ وَ سِتُّونَ رَجُلًا عَلَى الْمَوْتِ فَقَالَ لَهُمْ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) اغْدُوا بِنَا إِلَى أَحْجَارِ الزَّيْتِ مُحَلِّقِينَ وَ حَلَقَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فَمَا وَافَى مِنَ الْقَوْمِ مُحَلِّقاً إِلَّا أَبُو ذَرٍّ وَ الْمِقْدَادُ وَ حُذَيْفَةُ بْنُ الْيَمَانِ وَ عَمَّارُ بْنُ يَاسِرٍ وَ جَاءَ سَلْمَانُ فِي آخِرِ الْقَوْمِ فَرَفَعَ يَدَهُ إِلَى السَّمَاءِ فَقَالَ اللَّهُمَّ إِنَّ الْقَوْمَ اسْتَضْعَفُونِي كَمَا اسْتَضْعَفَتْ بَنُو إِسْرَائِيلَ هَارُونَ اللَّهُمَّ فَإِنَّكَ تَعْلَمُ مَا نُخْفِي وَ مَا نُعْلِنُ وَ مَا يَخْفَى عَلَيْكَ شَيْ‏ءٌ فِي الْأَرْضِ وَ لَا فِي السَّمَاءِ تَوَفَّنِي مُسْلِماً وَ أَلْحِقْنِي بِالصَّالِحِينَ أَمَا وَ الْبَيْتِ وَ الْمُفْضِي إِلَى الْبَيْتِ [وَ فِي نُسْخَةٍ وَ الْمُزْدَلِفَةِ] وَ الْخِفَافِ إِلَى التَّجْمِيرِ لَوْ لَا عَهْدٌ عَهِدَهُ إِلَيَّ النَّبِيُّ الْأُمِّيُّ ( صلى الله عليه وآله ) لَأَوْرَدْتُ الْمُخَالِفِينَ خَلِيجَ الْمَنِيَّةِ وَ لَأَرْسَلْتُ عَلَيْهِمْ شَآبِيبَ صَوَاعِقِ الْمَوْتِ وَ عَنْ قَلِيلٍ سَيَعْلَمُونَ .",
                "englishText": "5. Muhammad Bin Ali Bin Ma’mar, from Muhammad Bin Ali, from Abdullah Bin Ayyub Al-Ash’ary, from Amro Al-Awza’iy, from Amro Bin Shimr, from Salma Biin Kuheyl, from Abu Al-Haysam Bin Al-Tayhaan who has narrated: Amir-ul-Momineen  gave a sermon to the people at Al-Medina. Amir-ul-Momineen  said: ‘All Praise is due to Allah (azwj) besides Whom (azwj) there is no god but Him (azwj). He (azwj) was Alive without (dependence on) any quality and without reliance on anything but on Himself (azwj) to exist nor can there be ‘where’ for Him (azwj), nor He (azwj) is within anything, nor He (azwj) is upon anything, nor there is a beginning place for Him (azwj), and He (azwj) is not strong after having Created a thing, nor was He (azwj) weak before anything came into being, nor was He (azwj) lonely before He (azwj) Began anything, nor is there anything which Resembles Him (azwj), nor was He (azwj) without a Kingdom before He (azwj) Created it, nor will He (azwj) be without it after it goes away. He (azwj) is a Living God without having a lifespan, and He (azwj) was the Owner before He (azwj) Created anything, and will be the Owner after having Creating the Universe. And there cannot be for Allah (azwj), ‘How’ nor ‘Where’, and no Limit to be Recognised by, and nothing resembles Him (azwj), and He (azwj) does not age due to the Duration of His (azwj) Remaining, nor does He (azwj) weaken due to being Alone, nor does He (azwj) get scared like His (azwj) creatures do due to something. But, He (azwj) is All Hearing without having ears, He (azwj) is All Seeing without having eyes, and He (azwj) is Almighty without deriving strength from His (azwj) creatures. The gaze of the lookers cannot perceive Him (azwj), and the ears of the listeners cannot sense (hear) Him (azwj). If He (azwj) Intends something, it would be without any consultation, or demonstration, or informing, or asking anyone about anything from His (azwj) creatures, of His (azwj) Intention. The vision cannot perceive Him (azwj), but He (azwj) Sees all visions. And He (azwj) is the Kind, the Aware, and I  testify that there is no god except Allah (azwj), One, having no associates for Him (azwj), and I  testify that Muhammad ﷺ is His (azwj) servant. He (azwj) Sent him  with the Guidance, and the true Religion, to overcome all the religions even though the Polytheists may not like it. So he ﷺ preached the Message, and I  follow the evidence. O you community which has been deceived, and understood the deception of the deceiver who deceived it, but still persisted upon what it recognised, and wandered randomly in its seduction. And the truth had been clarified but they still turned away from it, and the path was made clear but they still deviated from it. But, by the One (azwj) Who Split the seed and stemmed life from it, had you sought the knowledge from its Mine, and drank the water with its sweetness, and kept the good in its place, and take the path which was clear, and approached the truth by its programme the way would have been set out for you, and the signs would have appeared to you, and Al-Islam would have been illuminated for you. So you would have eaten plentiful, and there would have been no breadwinner among you who would have failed (to earn), nor any injustice would have been done to any Muslim or allies. But, you walked upon the path of the darkness, so your world became dark for you by its vastness. And the doors of knowledge were closed to you so you spoke from your own desires, and differed in your Religion, and started issuing verdicts (Fatwas) in the Religion of Allah (azwj) without (being Blessed with the) Knowledge. And you followed the misguided people so they misguided you, and you abandoned the Imams  so they  abandoned you. So you took control (of your own affairs) through judging by your own desires. When a matter was mentioned, you asked the People  of the Remembrance (Ahl Al-Zikr), so when they  issued a verdict (Fatwa) to you, you said, ‘This is exactly the knowledge’. So how come you have abandoned him , and neglected him , and opposed him ? Slowly (but surely), just wait a little while, and you will harvest all of what you have cultivated, and you will find the evil of what you have done and sought. By the One (azwj) Who Split the seed and stemmed life from it, you knew that I  was your Master and the one  whom you had been Commanded (for being obedient to), and I  am more knowledgeable than you all and the one  by whose knowledge was your salvation, and the successor  of your Prophet ﷺ, and the best of your Lord (azwj), and the tongue (speaker) for your light (guidance), and the knowledge by which you can correct yourselves. So slowly (but surely) what has been narrated will descend upon you all, what has been promised, that which descended upon the communities before you. And Allah (azwj) Mighty and Majestic will Question you all about your Imams  with whom  you will be raised, and to Allah (azwj) Mighty and Majestic you will be going to tomorrow. But, by Allah (azwj), if I  had for me , the number of companions which Talut had, or the number of the people at Badr who oppose your enemies, I  would have struck by the sword until you would have come to the truth, and you would have repented sincerely. So that would have been more suitable than mending the rifts and taking to friendliness. Our Allah (azwj), Judge between us with the truth, and You (azwj) are the Best of the Judges’. He (the narrator) said, ‘Then he  went out from the Masjid. He  passed by a herd in which were around thirty sheep, so he  said: ‘By Allah (azwj), if I  had for me  for the sake of Allah (azwj) and His (azwj) Messenger ﷺ, the number of these sheep, I  would have removed the son of the woman who ate unhealthy things, from his kingdom’. He (the narrator) said, ‘When it was evening, three hundred and sixty men had pledged allegiance to him , to the death. So Amir-ul-Momineen  said to them: ‘Come to us (in the morning) to the Ahjaar Al-Zayt having shaved (your heads)’. And Amir-ul-Momineen  shaved (his  head). No one from the people remained loyal, except for Abu Dharr (ar), and Al-Miqdad (ar), and Huzayfa Al-Yamani (ar), and Ammar Bin Yasser (ar), and Salman (ar). So he  raised his  hands towards the sky and said: ‘Our Allah (azwj)! The people have weakened me  just as the Children of Israel had weakened Haroun . Our Allah (azwj)! You (azwj) Know what we hide and what we proclaim, and there is nothing which is hidden from You (azwj) in the earth, nor in the sky. Make me to pass away as a Muslim, and Associate me  with the righteous ones’. But, by the House (Kaaba), and the Leading up to the House (and in another copy, ‘Al-Muzdalifa’), and the walking to the throwing of the pebbles, had it not been for the oath which the Ummy Prophet ﷺ had taken from me , I  would have returned the opposition to the gulf of the death, and I  would have sent upon them thunderbolts of the death, and after a little while they will come to know’.",
                "href": "https://thaqalayn.net/hadith/8/1/5/1",
                "gradings": {}
            }
        }
    },
    {
        "1": {
            "75": {
                "hadithNumber": "Hadith #1",
                "title": "Al-Kafi - Volume 8: In Praise of Hassan ibn Thabit",
                "arabicText": "وَ بِهَذَا الْإِسْنَادِ عَنْ أَبَانٍ عَنْ عُقْبَةَ بْنِ بَشِيرٍ الْأَسَدِيِّ عَنِ الْكُمَيْتِ بْنِ زَيْدٍ الْأَسَدِيِّ قَالَ دَخَلْتُ عَلَى أَبِي جَعْفَرٍ (عليه السلام) فَقَالَ وَ اللَّهِ يَا كُمَيْتُ لَوْ كَانَ عِنْدَنَا مَالٌ لَأَعْطَيْنَاكَ مِنْهُ وَ لَكِنْ لَكَ مَا قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) لِحَسَّانَ بْنِ ثَابِتٍ لَنْ يَزَالَ مَعَكَ رُوحُ الْقُدُسِ مَا ذَبَبْتَ عَنَّا قَالَ قُلْتُ خَبِّرْنِي عَنِ الرَّجُلَيْنِ قَالَ فَأَخَذَ الْوِسَادَةَ فَكَسَرَهَا فِي صَدْرِهِ ثُمَّ قَالَ وَ اللَّهِ يَا كُمَيْتُ مَا أُهَرِيقَ مِحْجَمَةٌ مِنْ دَمٍ وَ لَا أُخِذَ مَالٌ مِنْ غَيْرِ حِلِّهِ وَ لَا قُلِبَ حَجَرٌ عَنْ حَجَرٍ إِلَّا ذَاكَ فِي أَعْنَاقِهِمَا.",
                "englishText": "75. And by this chain, from Abaan, from Uqba Bin Basheer Al-Asady, from Al-Kumeyt Bin Zayd Al-asady who said: ‘I came up to Abu Ja’far , so he  said: ‘By Allah (azwj), O Kumeyt, if we  had in our  possession some wealth, we  would have given you from it, but for you is what the Rasool ﷺ Allah (azwj) said to Hassan Bin Sabit: ‘The Holy Spirit will not cease to be with you so long as you defend us ﷺ’. I said, ‘Inform me about the two men (Abu Bakr and Umar)’. He (the narrator) said: ‘He  took the pillow and folded it unto his  chest’ and said: ‘By Allah (azwj), O Kumeyt, there is no blood spilled unlawfully, nor any wealth taken without right, and not stone turned from another stone except that it would be upon their necks’.",
                "href": "https://thaqalayn.net/hadith/8/1/75/1",
                "gradings": {}
            }
        }
    },
    {
        "1": {
            "104": {
                "hadithNumber": "Hadith #1",
                "title": "Al-Kafi - Volume 8: About the words of Allah ‘...in that the people of hell dispute among them’ (38:62)",
                "arabicText": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مَنْصُورِ بْنِ يُونُسَ عَنْ عَنْبَسَةَ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ إِذَا اسْتَقَرَّ أَهْلُ النَّارِ فِي النَّارِ يَفْقِدُونَكُمْ فَلَا يَرَوْنَ مِنْكُمْ أَحَداً فَيَقُولُ بَعْضُهُمْ لِبَعْضٍ ما لَنا لا نَرى رِجالًا كُنَّا نَعُدُّهُمْ مِنَ الْأَشْرارِ أَتَّخَذْناهُمْ سِخْرِيًّا أَمْ زاغَتْ عَنْهُمُ الْأَبْصارُ قَالَ وَ ذَلِكَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ إِنَّ ذلِكَ لَحَقٌّ تَخاصُمُ أَهْلِ النَّارِ يَتَخَاصَمُونَ فِيكُمْ فِيمَا كَانُوا يَقُولُونَ فِي الدُّنْيَا.",
                "englishText": "104. Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al-Hakam, from Mansour Bin Yunus, from Anbasat, who has narrated the following: Abu Abdullah  said: ‘When the inhabitants of the Fire settle down in the Fire, they will miss you (Shiites). So they will not see any one from you (therein). So some of them will say to the others, “[38:62] And they will say: \"What has happened to us that we see not men whom we used to number among the bad ones? [38:63] Was it that we (only) took them in scorn, or have our eyes (now) turned aside from them? [38:64]. Imam  said: ‘And that is the Statement of Allah (azwj) Mighty and Majestic: “That most surely is the truth: the contending one with another of the inmates of the fire”. They will be disputing with each other regarding you (Shiites) with regards to what they had been saying about you (Shiites) in the world’.",
                "href": "https://thaqalayn.net/hadith/8/1/104/1",
                "gradings": {}
            }
        }
    },
    {
        "1": {
            "235": {
                "hadithNumber": "Hadith #1",
                "title": "Al-Kafi - Volume 8: About omens",
                "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ عَمْرِو بْنِ حُرَيْثٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) الطِّيَرَةُ عَلَى مَا تَجْعَلُهَا إِنْ هَوَّنْتَهَا تَهَوَّنَتْ وَ إِنْ شَدَّدْتَهَا تَشَدَّدَتْ وَ إِنْ لَمْ تَجْعَلْهَا شَيْئاً لَمْ تَكُنْ شَيْئاً.",
                "englishText": "235. Ali Bin Ibrahim, from his father, from Abdullah Bin Al-Mugheira, from Amro Bin Hureys who said: Abu Abdullah  said: ‘The omen is upon what you make it to be. If you take it lightly, it would be light, if you take it seriously it would be intense, and if you do not make anything of it, it would not be anything’.",
                "href": "https://thaqalayn.net/hadith/8/1/235/1",
                "gradings": {}
            }
        }
    },
    {
        "1": {
            "291": {
                "hadithNumber": "Hadith #1",
                "title": "Al-Kafi - Volume 8: About the conceited people",
                "arabicText": "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ الْكِنْدِيِّ عَنْ أَحْمَدَ بْنِ الْحَسَنِ الْمِيثَمِيِّ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ عَبْدِ الْأَعْلَى مَوْلَى آلِ سَامٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ يَقُولُ تُؤْتَى بِالْمَرْأَةِ الْحَسْنَاءِ يَوْمَ الْقِيَامَةِ الَّتِي قَدِ افْتُتِنَتْ فِي حُسْنِهَا فَتَقُولُ يَا رَبِّ حَسَّنْتَ خَلْقِي حَتَّى لَقِيتُ مَا لَقِيتُ فَيُجَاءُ بِمَرْيَمَ (عليها السلام) فَيُقَالُ أَنْتِ أَحْسَنُ أَوْ هَذِهِ قَدْ حَسَّنَّاهَا فَلَمْ تُفْتَتَنْ وَ يُجَاءُ بِالرَّجُلِ الْحَسَنِ الَّذِي قَدِ افْتُتِنَ فِي حُسْنِهِ فَيَقُولُ يَا رَبِّ حَسَّنْتَ خَلْقِي حَتَّى لَقِيتُ مِنَ النِّسَاءِ مَا لَقِيتُ فَيُجَاءُ بِيُوسُفَ (عليه السلام) فَيُقَالُ أَنْتَ أَحْسَنُ أَوْ هَذَا قَدْ حَسَّنَّاهُ فَلَمْ يُفْتَتَنْ وَ يُجَاءُ بِصَاحِبِ الْبَلَاءِ الَّذِي قَدْ أَصَابَتْهُ الْفِتْنَةُ فِي بَلَائِهِ فَيَقُولُ يَا رَبِّ شَدَّدْتَ عَلَيَّ الْبَلَاءَ حَتَّى افْتُتِنْتُ فَيُؤْتَى بِأَيُّوبَ (عليه السلام) فَيُقَالُ أَ بَلِيَّتُكَ أَشَدُّ أَوْ بَلِيَّةُ هَذَا فَقَدِ ابْتُلِيَ فَلَمْ يُفْتَتَنْ.",
                "englishText": "291. Humeyd Bin Ziyad, from Al-Hassan Bin Muhammad Al-Kindy, from Ahmad Bin Al-Hassan Al-Maysamy, from Aban Bin usman, from Abdul A’la a slave of progeny of Saam who said: I heard Abu Abdullah  saying: ‘On the Day of Judgement, they will bring a beautiful woman who had done Fitna (mischief) due to her beauty. So she will say, ‘O Lord (azwj)! You (azwj) Created me beautiful until I did what I did. So they will come with Maryam  and say to her, ‘Are you more beautiful or her ? She  had beauty in her  but did not do Fitna (mischief)’. And they would come with the handsome man who had done Fitna (mischief) due to his beauty. So he will say, ‘O Lord (azwj)! You (azwj) Created me with beauty until I did with the women what I did. So they will bring Yusuf  and say, ‘Are you more handsome or he  is? He  had beauty but did not do Fitna (mischief)’. And they will come with the afflicted person who had been involved in Ftina (mischief) due to his afflictions. So he will say, ‘O Lord (azwj)! The intensity of the afflictions upon me were such that I did Fitna (mischief)’. So they would come with Ayyub . So they would say, ‘Were your afflictions more severe or his  afflictions? He  was in afflictions but did not do Fitna (mischief)’.",
                "href": "https://thaqalayn.net/hadith/8/1/291/1",
                "gradings": {}
            }
        }
    },
    {
        "1": {
            "554": {
                "hadithNumber": "Hadith #2",
                "title": "Al-Kafi - Volume 8: \"Give the glad news...\" (10:2)",
                "arabicText": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَبْدِ اللَّهِ بْنِ يَحْيَى الْكَاهِلِيِّ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ ما تُغْنِي الْآياتُ وَ النُّذُرُ عَنْ قَوْمٍ لا يُؤْمِنُونَ قَالَ لَمَّا أُسْرِيَ بِرَسُولِ اللَّهِ (صلى الله عليه وآله) أَتَاهُ جَبْرَئِيلُ بِالْبُرَاقِ فَرَكِبَهَا فَأَتَى بَيْتَ الْمَقْدِسِ فَلَقِيَ مَنْ لَقِيَ مِنْ إِخْوَانِهِ مِنَ الْأَنْبِيَاءِ (عليهم السلام) ثُمَّ رَجَعَ فَحَدَّثَ أَصْحَابَهُ أَنِّي أَتَيْتُ بَيْتَ الْمَقْدِسِ وَ رَجَعْتُ مِنَ اللَّيْلَةِ وَ قَدْ جَاءَنِي جَبْرَئِيلُ بِالْبُرَاقِ فَرَكِبْتُهَا وَ آيَةُ ذَلِكَ أَنِّي مَرَرْتُ بِعِيرٍ لِأَبِي سُفْيَانَ عَلَى مَاءٍ لِبَنِي فُلَانٍ وَ قَدْ أَضَلُّوا جَمَلًا لَهُمْ أَحْمَرَ وَ قَدْ هَمَّ الْقَوْمُ فِي طَلَبِهِ فَقَالَ بَعْضُهُمْ لِبَعْضٍ إِنَّمَا جَاءَ الشَّامَ وَ هُوَ رَاكِبٌ سَرِيعٌ وَ لَكِنَّكُمْ قَدْ أَتَيْتُمُ الشَّامَ وَ عَرَفْتُمُوهَا فَسَلُوهُ عَنْ أَسْوَاقِهَا وَ أَبْوَابِهَا وَ تُجَّارِهَا فَقَالُوا يَا رَسُولَ اللَّهِ كَيْفَ الشَّامُ وَ كَيْفَ أَسْوَاقُهَا قَالَ كَانَ رَسُولُ اللَّهِ (صلى الله عليه وآله) إِذَا سُئِلَ عَنِ الشَّيْ‏ءِ لَا يَعْرِفُهُ شُقَّ عَلَيْهِ حَتَّى يُرَى ذَلِكَ فِي وَجْهِهِ قَالَ فَبَيْنَمَا هُوَ كَذَلِكَ إِذْ أَتَاهُ جَبْرَئِيلُ (عليه السلام) فَقَالَ يَا رَسُولَ اللَّهِ هَذِهِ الشَّامُ قَدْ رُفِعَتْ لَكَ فَالْتَفَتَ رَسُولُ اللَّهِ (صلى الله عليه وآله) فَإِذَا هُوَ بِالشَّامِ بِأَبْوَابِهَا وَ أَسْوَاقِهَا وَ تُجَّارِهَا فَقَالَ أَيْنَ السَّائِلُ عَنِ الشَّامِ فَقَالُوا لَهُ فُلَانٌ وَ فُلَانٌ فَأَجَابَهُمْ رَسُولُ اللَّهِ (صلى الله عليه وآله) فِي كُلِّ مَا سَأَلُوهُ عَنْهُ فَلَمْ يُؤْمِنْ مِنْهُمْ إِلَّا قَلِيلٌ وَ هُوَ قَوْلُ اللَّهِ تَبَارَكَ وَ تَعَالَى وَ ما تُغْنِي الْآياتُ وَ النُّذُرُ عَنْ قَوْمٍ لا يُؤْمِنُونَ ثُمَّ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) نَعُوذُ بِاللَّهِ أَنْ لَا نُؤْمِنَ بِاللَّهِ وَ بِرَسُولِهِ آمَنَّا بِاللَّهِ وَ بِرَسُولِهِ (صلى الله عليه وآله).",
                "englishText": "555. Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al-Hakam, from Abdullah Bin Yahya Al-Kahily, who has said: Abu Abdullah  regarding the Statement of Allah (azwj) Mighty and Majestic: “[10:101] and signs and warners do not avail a people who would not believe”. He  said: ‘When ascension took place with the Messenger ﷺ of Allah (azwj), Jibraeel came up to him ﷺ with Al-Buraaq (the ride). So he ﷺ rode on it and came to Bayt Al-Maqdas (Jerusalem). So he ﷺ met the ones whom he ﷺ met from his ﷺ brothers from the Prophets . Then he ﷺ returned and narrated it to his ﷺ companions, ‘I ﷺ came to Bayt Al-Maqdas, and returned during the night. Jibraeel came to me ﷺ with Al-Buraaq, so I ﷺ rode upon it, and the sign of that is that I ﷺ passed by the camels of Abu Sufyan being watered at the watering hole of the clan of so and so. A red camel of theirs had strayed and the group were looking for it. So some of them said to the others, ‘But rather he ﷺ went to Syria whilst riding at speed whereas you have been to Syria and recognise it. So ask him ﷺ about its markets, and its doors, and its businessmen’. So they said, ‘O Messenger ﷺ of Allah (azwj), how is Syria, and how are its markets?’ He  said: ‘The Messenger ﷺ, when asked about something that he ﷺ did not recognise, he ﷺ would not describe it until after seeing it in front of him ﷺ. So when they were in the middle of that, Jibraeel came up to him ﷺ and said: ‘O Rasool Allah ﷺ, this here is Syria which has been raised for you ﷺ!’ So the Rasool Allah ﷺ turned and visualised Syria, with its doors, and its markets, and its businessmen’. So he ﷺ said: ‘Where are the questioners about Syria?’ So they said to him ﷺ, ‘It is so and so and so and so (Abu Bakr and Umar)’. So the Rasool Allah ﷺ answered them with regards to all of what they asked from him ﷺ. Even then they did not believe from among them, except for a few, and it is the Statement of Allah (azwj) Blessed and High: “[10:101] and signs and warners do not avail a people who would not believe”. Then Abu Abdullah  said: ‘We  seek Refuge with Allah (azwj) from disbelief in Allah (azwj) and in His (azwj) Rasool ﷺ. We  believe in Allah (azwj) and in His (azwj) Messenger ﷺ’.",
                "href": "https://thaqalayn.net/hadith/8/1/554/2",
                "gradings": {}
            }
        }
    },
    {
        "1": {
            "575": {
                "hadithNumber": "Hadith #1",
                "title": "Al-Kafi - Volume 8: The connection with them AS is the connection of the eons",
                "arabicText": "مُحَمَّدُ بْنُ يَحْيَى وَ الْحُسَيْنُ بْنُ مُحَمَّدٍ جَمِيعاً عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ عَبَّادِ بْنِ يَعْقُوبَ عَنْ أَحْمَدَ بْنِ إِسْمَاعِيلَ عَنْ عَمْرِو بْنِ كَيْسَانَ عَنْ أَبِي عَبْدِ اللَّهِ الْجُعْفِيِّ قَالَ قَالَ لِي أَبُو جَعْفَرٍ مُحَمَّدُ بْنُ عَلِيٍّ (عليه السلام) كَمِ الرِّبَاطُ عِنْدَكُمْ قُلْتُ أَرْبَعُونَ قَالَ لَكِنْ رِبَاطُنَا رِبَاطُ الدَّهْرِ وَ مَنِ ارْتَبَطَ فِينَا دَابَّةً كَانَ لَهُ وَزْنُهَا وَ وَزْنُ وَزْنِهَا مَا كَانَتْ عِنْدَهُ وَ مَنِ ارْتَبَطَ فِينَا سِلَاحاً كَانَ لَهُ وَزْنُهُ مَا كَانَ عِنْدَهُ لَا تَجْزَعُوا مِنْ مَرَّةٍ وَ لَا مِنْ مَرَّتَيْنِ وَ لَا مِنْ ثَلَاثٍ وَ لَا مِنْ أَرْبَعٍ فَإِنَّمَا مَثَلُنَا وَ مَثَلُكُمْ مَثَلُ نَبِيٍّ كَانَ فِي بَنِي إِسْرَائِيلَ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ أَنِ ادْعُ قَوْمَكَ لِلْقِتَالِ فَإِنِّي سَأَنْصُرُكَ فَجَمَعَهُمْ مِنْ رُءُوسِ الْجِبَالِ وَ مِنْ غَيْرِ ذَلِكَ ثُمَّ تَوَجَّهَ بِهِمْ فَمَا ضَرَبُوا بِسَيْفٍ وَ لَا طَعَنُوا بِرُمْحٍ حَتَّى انْهَزَمُوا ثُمَّ أَوْحَى اللَّهُ تَعَالَى إِلَيْهِ أَنِ ادْعُ قَوْمَكَ إِلَى الْقِتَالِ فَإِنِّي سَأَنْصُرُكَ فَجَمَعَهُمْ ثُمَّ تَوَجَّهَ بِهِمْ فَمَا ضَرَبُوا بِسَيْفٍ وَ لَا طَعَنُوا بِرُمْحٍ حَتَّى انْهَزَمُوا ثُمَّ أَوْحَى اللَّهُ إِلَيْهِ أَنِ ادْعُ قَوْمَكَ إِلَى الْقِتَالِ فَإِنِّي سَأَنْصُرُكَ فَدَعَاهُمْ فَقَالُوا وَعَدْتَنَا النَّصْرَ فَمَا نُصِرْنَا فَأَوْحَى اللَّهُ تَعَالَى إِلَيْهِ إِمَّا أَنْ يَخْتَارُوا الْقِتَالَ أَوِ النَّارَ فَقَالَ يَا رَبِّ الْقِتَالُ أَحَبُّ إِلَيَّ مِنَ النَّارِ فَدَعَاهُمْ فَأَجَابَهُ مِنْهُمْ ثَلَاثُمِائَةٍ وَ ثَلَاثَةَ عَشَرَ عِدَّةَ أَهْلِ بَدْرٍ فَتَوَجَّهَ بِهِمْ فَمَا ضَرَبُوا بِسَيْفٍ وَ لَا طَعَنُوا بِرُمْحٍ حَتَّى فَتَحَ اللَّهُ عَزَّ وَ جَلَّ لَهُمْ.",
                "englishText": "576. Muhammad Bin Yahya, and Al-Husayn Bin Muhammad, together from Ja’far Bin Muhammad, from Abbad Bin Yaqoub, from Ahmad Bin Ismail, from Amro Bin Kaysan, from Abu Abdullah Al-Ju’fy who said: ‘Abu Ja’far Muhammad Bin Ali  said to me: ‘How many Rabaat (guards) are there in your presence?’ I said, ‘Forty’. He  said: ‘But our  guards are eternal guards. The ones who is a guard amongst us who looks after an animal, there will be for him its weight, and the weight of its (animal) weight so long as it was with him. And the one who is a guard amongst us with weapon would have its weight so long as it was with him. Do not grieve from once, or twice, or three times, or four, for our example and your example is like the example of the Prophet  who was in the Children of Israel. So Allah (azwj) Mighty and Majestic Revealed to him : “If you  prepare your  people for the fighting, I (azwj) will Help you ’. So he  gathered them from the top of the mountains and from other places (other) than that. Then he  directed them for it. So they neither struck with their swords, nor did they stab with their spears until they were defeated. Then Allah (azwj) Revealed to him: “If you  prepare your  people for the fighting, I (azwj) will Help you ”. So he  called them. They said, ‘You promised us the Help, but no Help came to us’. So Allah (azwj) the High Revealed to him : “But, they can either choose to fight or the Fire’. So he  said: ‘O Lord (azwj)! The fighting is more beloved to me  than the Fire’. So he  called upon them, and three hundred and thirteen of them answered him , the same number of the people of Badr. So he  directed them (for the battle). They neither struck with their swords, nor stabbed with their spears, until Allah (azwj) Mighty and Majestic Granted victory to them’.",
                "href": "https://thaqalayn.net/hadith/8/1/575/1",
                "gradings": {}
            }
        }
    }
]