{
  "Volume #14": {
    "Book #2": {
      "Chapter #2": {
        "Hadith #35": {
          "Title": "Al-Tawhid: Divine Unity and‬‬ Negation of Anthropomorphism",
          "Link": "https://thaqalayn.net/hadith/14/2/2/35",
          "Arabic Text": "36 - حدثنا أحمد بن هارون الفامي رضي الله عنه، قال: حدثنا محمد بن عبد الله بن جعفر الحميري، عن أبيه، عن أحمد بن محمد بن عيسى، عن محمد بن خالد البرقي، عن محمد بن أبي عمير، عن المفضل بن عمر، عن أبي عبد الله عليه السلام، قال: من شبه الله بخلقه فهو مشرك، إن الله تبارك وتعالى لا يشبه شيئا ولا يشبهه شئ وكل ما وقع في الوهم فهو بخلافه . قال مصنف هذا الكتاب رحمه الله: الدليل على أن الله سبحانه لا يشبه شيئا من خلقه من جهة من الجهات أنه لا جهة لشئ من أفعاله إلا محدثة، ولا جهة محدثة إلا وهي تدل على حدوث من هي له، فلو كان الله جل ثناؤه يشبه شيئا منها لدلت على حدوثه من حيث دلت على حدوث من هي له  إذ المتماثلان في العقول يقتضيان حكما واحدا من حيث تماثلا منها  وقد قام الدليل على أن الله عز وجل قديم، ومحال أن يكون قديما من جهة وحادثا من أخرى. ومن الدليل على أن الله تبارك وتعالى قديم أنه لو كان حادثا لوجب أن يكون له محدث، لأن الفعل لا يكون إلا بفاعل، ولكان القول في محدثه كالقول فيه، وفي هذا وجود حادث قبل حادث لا إلى أول، وهذا محال، فصح أنه لا بد من صانع قديم، وإذا كان ذلك كذلك فالذي يوجب قدم ذلك الصانع ويدل عليه يوجب قدم صانعنا ويدل عليه . ",
          "English Text": "36. Ahmad ibn Harun al-Fami (may Allah be pleased with him) said: Muhammad ibn `Abd Allah ibn Ja`far al-Himyari said on the authority of his father, on the authority of Ahmad ibn Muhammad ibn `Isa, on the authority of Mohammad ibn Khalid al-Barqi, on the authority of Muhammad ibn Abu `Umayr, on the authority of al-Mufaddal ibn `Umar that Abu `Abd Allah al-Sadiq  said: He who anthropomorphizes Allah with His Creation is an infidel. Verily, Allah, the Blessed and the Exalted, does not resemble anything and nothing resembles Him. Everything that is imagined is other than Him. The Compiler (may Allah have mercy on him) of this book says: The proof that nothing resembles Allah, the Glorified, in His Creation in any dimension, is that there is no dimension for any of His Actions except that it has a beginning [muhdathah]. Therefore, it Allah, High be His Praise, resembles anything from His Creation, then that would certainly give Him a beginning… At the same time, two things which are intellectually similar require one ruling due to their similarity. And the proof had been established for Allah, the Mighty and High, being without beginning [qadim], It is impossible that He may be Eternal in one dimension, and have beginning another. Another proof that Allah, Blessed and Exalted be He, is without beginning is that if He had a beginning then there must have been someone that gave Him a beginning, because an action requires an agent. And surely the word about one who gave beginning to Him is like the word about Him. And in this (case) there is existence of an eternal before an eternal that has no prior (to Him). This is impossible. Hence, it is correct that there must be an Eternal Creator. And if it is so, then whatever demands the eternity of that creator and indicates upon him, also demands the eternity of the Creator we believe in and indicates upon Him.",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "من حيث السند لا بأس بها",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (12/253)"
          }
        }
      },
      "Chapter #8": {
        "Hadith #1": {
          "Title": "Al-Tawhid: What is Related Regarding the Vision",
          "Link": "https://thaqalayn.net/hadith/14/2/8/1",
          "Arabic Text": "1 - حدثنا محمد بن موسى بن المتوكل رحمه الله، قال: حدثنا علي بن إبراهيم ابن هاشم، عن أبيه، عن النوفلي، عن السكوني، عن أبي عبد الله، عن آبائه عليهم السلام قال: مر النبي صلى الله عليه وآله وسلم على رجل وهو رافع بصره إلى السماء يدعو، فقال له رسول الله صلى الله عليه وآله وسلم: غض بصرك فإنك لن تراه. وقال: ومر النبي صلى الله عليه وآله وسلم على رجل رافع يديه إلى السماء وهو يدعو، فقال رسول الله صلى الله عليه وآله وسلم: اقصر من يديك فإنك لن تناله .",
          "English Text": "1. Muhammad ibn Musa ibn al-Mutawakkil (may Allah have mercy on him) said: `Ali ibn Ibrahim ibn Hashim said on the authority of his father, on the authority of al-Nawfali, on the authority of al-Sakuni, on the authority of Abu `Abd Allah, on the authority of his forefathers  that The Prophet ﷺ passed by a man who was supplication with his eyes raised to the sky. The Messenger of Allah ﷺ said to him: “Cast down your eyes for you will certainly not see Him.” He ﷺ also said that: “The Prophet ﷺ passed by a man who was supplicating with his hands raised to the sky. The Messenger of Allah ﷺ said to him: `Lower your hand for your will surely not reach Him.’”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "معتبرة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (8/116)"
          }
        }
      },
      "Chapter #9": {
        "Hadith #3": {
          "Title": "Al-Tawhid: Omnipotence",
          "Link": "https://thaqalayn.net/hadith/14/2/9/3",
          "Arabic Text": "3 - حدثنا أبي رحمه الله قال: حدثنا سعد بن عبد الله، قال: حدثنا محمد بن الحسين بن أبي الخطاب، عن أحمد بن أبي نصر، قال: جاء قوم من وراء النهر إلى أبي الحسن عليه السلام، فقالوا له: جئناك نسألك عن ثلاث مسائل، فإن أجبتنا فيها علمنا أنك عالم، فقال: سلوا، فقالوا: أخبرنا عن الله أين كان، وكيف كان، وعلى أي شئ كان اعتماده؟ فقال: إن الله عز وجل كيف الكيف فهو بلا كيف، وأين الأين فهو بلا أين، وكان اعتماده على قدرته، فقالوا: نشهد أنك عالم. قال مصنف هذا الكتاب: يعني بقوله: (وكان اعتماده على قدرته) أي على ذاته لأن القدرة من صفات ذات الله عز وجل . ",
          "English Text": "3. My father  said: Sa`d ibn `Abd Allah said: Muhammad ibn al-Husayn ibn Abu al-Khattab said, on the authority of Ahmad ibn Muhammad ibn Abu Nasr that A group of people came from across the river to see Abu al-Hasan al-Rida  and said: “We have come to ask you three questions. If you can answer all the three question, we will know that you are the Most Learned.” The Imam  said: “Ask.” They said: “Let us know about Allah: Where is He? How is He? And what does He rely upon?” Hence, he  replied, “Verily, Allah, the Mighty and High, created the quality of `how;’ therefore `how’ does not apply to Hi. He has created space; thus, He is not in need of space. And He relies upon His Omnipotence.” They said: We testify that you are Most Learned One.” The Compiler of this book  says: The meaning of his statement `He relies upon His Omnipotence’ is that He relies on His Being, because Omnipotence is one of the Essential Attributes of Allah, the Might and High.",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (9/88)"
          }
        },
        "Hadith #6": {
          "Title": "Al-Tawhid: Omnipotence",
          "Link": "https://thaqalayn.net/hadith/14/2/9/6",
          "Arabic Text": "6 - حدثنا أبي رحمه الله قال: حدثنا سعد بن عبد الله، قال: حدثنا يعقوب ابن يزيد، عن حماد بن عيسى، عن ربعي بن عبد الله، عن الفضيل بن يسار قال: سمعت أبا عبد الله عليه السلام يقول: إن الله عز وجل لا يوصف. قال: وقال زرارة: قال أبو جعفر عليه السلام: إن الله عز وجل لا يوصف (١) وكيف يوصف وقد قال في كتابه: ﴿وما قدروا الله حق قدره﴾  فلا يوصف بقدرة إلا كان أعظم من ذلك. ",
          "English Text": "6. My father  related us that Sa`d ibn `Abd Allah said: Ya`qub ibn Yazid said, on the authority of Hammad ibn `Isa, on the authority of Rub`I ibn `Abd Allah, on the authority of al-Fudayl ibn Yasar that I heard Abu `Abd Allah al-Sadiq  that “Verily, Allah, the Mighty and High, cannot be described.” Zurarah said: Abu Ja`far al-Baqir  said: “Verily, Allah, the Mighty and High, cannot be described. And how could He be described when He has said in his Book: And they do not assign to Allah the attributes due to Him? Thus, whatever they assign Him, He is greater than that.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "معتبرة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (9/89)"
          }
        },
        "Hadith #11": {
          "Title": "Al-Tawhid: Omnipotence",
          "Link": "https://thaqalayn.net/hadith/14/2/9/11",
          "Arabic Text": "11 - حدثنا علي بن أحمد بن عبد الله البرقي رحمه الله، قال: حدثنا أبي، عن جده أحمد بن أبي عبد الله، عن أحمد بن محمد بن أبي نصر، قال: جاء رجل إلى الرضا عليه السلام فقال: هل يقدر ربك أن يجعل السماوات والأرض وما بينهما في بيضة؟ قال: نعم، وفي أصغر من البيضة، قد جعلها في عينك وهي أقل من البيضة، لأنك إذا فتحتها عاينت السماء والأرض وما بينهما، ولو شاء لأعماك عنها. ",
          "English Text": "11. `Ali ibn Ahmad ibn `Abd Allah la-Barqi  said: My father said, on the authority of his grandfather Ahmad ibn Abu `Abd Allah, on the authority of Ahmad ibn Muhammad ibn Abu Nasr that A man came to al-Rida  and enquired: “Does Your Lord have the power to place the heavens and the Earth and whatever is between them inside an egg?” Hence, he  replied, Of course he can! In fact, He has placed it in something even smaller than an egg. He has placed it all in your eye, while it is smaller than an egg. For when you open it, you see the Heavens and the Earth and whatever is in between them. IF he has willed, He would have blinded you from it all.",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "معتبرة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (9/89)"
          }
        }
      },
      "Chapter #30": {
        "Hadith #4": {
          "Title": "Al-Tawhid: What is the Qur’an?",
          "Link": "https://thaqalayn.net/hadith/14/2/30/4",
          "Arabic Text": "4 - حدثنا أبي رحمه الله، قال: حدثنا سعد بن عبد الله، قال: حدثنا محمد بن عيسى بن عبيد اليقطيني، قال: كتب علي بن محمد بن علي بن موسى الرضا عليهم السلام إلى بعض شيعته ببغداد: بسم الله الرحمن الرحيم عصمنا الله وإياك من الفتنة فإن يفعل فقد أعظم بها نعمة  وإن لا يفعل فهي الهلكة، نحن نرى أن الجدال في القرآن بدعة، اشترك فيها السائل والمجيب، فيتعاطى السائل ما ليس له، ويتكلف المجيب ما ليس عليه، وليس الخالق إلا الله عز وجل، وما سواه مخلوق، والقرآن كلام الله، لا تجعل له اسما من عندك فتكون من الضالين، جعلنا الله وإياك من الذين يخشون ربهم بالغيب وهم من الساعة مشفقون. ",
          "English Text": "4. My father (may Allah have mercy on him) said: Sa`d ibn `Abd Allah said: Muhammad ibn `Isa ibn `Ubayd al-Yaqtini that `Ali ibn Muhammad ibn `ali ibn Musa al-Rida  wrote to some of his Shi`ites in Baghdad: In the name of Allah, the Most Compassionate, the Most Merciful. May Allah guard us all from mischief! If He does, then it is a great bounty. And if He does not, then it is a disaster. The argument regarding the Qur’an is an innovation [bid`ah] in which both the questioner and the answerer is equally responsible. The questioner engages into what he should not. And the answerer is constrained to answer what is incorrect. There is no creator except Allah, the Mighty and High. Anything other than Him is created. The Qur’an is Word of Allah. Do not make a name for it from your own self or you will be led astray. May Allah count us among those who fear their Lord and those who re apprehensive of the coming of the Hour (of Judgment).",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (2/358)"
          }
        }
      },
      "Chapter #56": {
        "Hadith #19": {
          "Title": "Al-Tawhid: Capability",
          "Link": "https://thaqalayn.net/hadith/14/2/56/19",
          "Arabic Text": "19 - حدثنا أبي رضي الله عنه، قال: حدثنا سعد بن عبد الله، عن أحمد بن محمد ابن عيسى، عن الحسين بن سعيد، عن محمد بن أبي عمير، عن هشام بن سالم، عن أبي عبد الله عليه السلام قال: ما كلف الله العباد كلفة فعل ولا نهاهم عن شئ حتى جعل لهم الاستطاعة ثم أمرهم ونهاهم، فلا يكون العبد آخذا ولا تاركا إلا باستطاعة متقدمة قبل الأمر والنهي وقبل الأخذ والترك وقبل القبض والبسط. ",
          "English Text": "19. My father  said: Sa`d ibn `Abd Allah said, on the authority of Ahmad ibn Muhammad ibn `Isa, on the authority of al-Husayn ibn Sa`id, on the authority of Muhammad ibn Abu `Umayr, on the authority of Hisham ibn Salim that Abu `Abd Allah al-Sadiq : Allah does not oblige His Servants to complete an action, nor does He forbid them form anything, without giving them the ability to do so. Then, and only then, He commands them to complete certain actions or to refrain from certain actins. Therefore, a servant (of Allah) cannot obey or disobey unless he has been given the ability to do so. The ability to act or to desist from action precedes the command, the action, apprehension, and delight.",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (9/409)"
          }
        },
        "Hadith #24": {
          "Title": "Al-Tawhid: Capability",
          "Link": "https://thaqalayn.net/hadith/14/2/56/24",
          "Arabic Text": "24 - حدثنا أحمد بن محمد بن يحيى العطار رحمه الله، قال: حدثنا سعد بن عبد الله، عن يعقوب بن يزيد، عن حماد بن عيسى، عن حريز بن عبد الله، عن أبي عبد الله عليه السلام، قال: قال رسول الله صلى الله عليه وآله: رفع عن أمتي تسعة: الخطأ، و النسيان، وما أكرهوا عليه، وما لا يطيقون، وما لا يعلمون، وما اضطروا إليه، و الحسد، والطيرة، والتفكر في الوسوسة في الخلق ما لم ينطق بشفة. (٢) ",
          "English Text": "24. Ahmad ibn Muhammad ibn Yahya al-`Attar said: Sa`d ibn `Abd Allah said, on the authority of Ya`qub ibn Yazid, on the authority of Hammad ibn `Isa, on the authority of Hariz ibn `Abd Allah, on the authority of Abu `Abd Allah  that The Messenger of Allah ﷺ said: “Nine things have been raised from My Ummah: error, forgetfulness, coercion, weakness, ignorance, compulsion, jealousy, evil omen, and the evil thoughts form the whisper (of Satan) which they do not say.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (2/198)"
          }
        }
      },
      "Chapter #58": {
        "Hadith #5": {
          "Title": "Al-Tawhid: Privilege and Adversity",
          "Link": "https://thaqalayn.net/hadith/14/2/58/5",
          "Arabic Text": "5 - حدثنا محمد بن الحسن بن أحمد بن الوليد رحمه الله، قال: حدثنا محمد بن الحسن الصفار، عن يعقوب بن يزيد، عن صفوان بن يحيى، عن منصور بن حازم، عن أبي عبد الله عليه السلام، قال: إن الله عز وجل خلق السعاة والشقاوة قبل أن يخلق خلقه  فمن علمه الله سعيدا لم يبغضه أبدا، وإن عمل شرا أبغض عمله ولم يبغضه، وإن كان علمه شقيا لم يحبه أبدا، وإن عمل صالحا أحب عمله وأبغضه لما يصير إليه، فإذا أحب الله شيئا لم يبغضه أبدا، وإذا أبغض شيئا لم يحبه أبدا. ",
          "English Text": "5. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid  said: Muhammad ibn al-Hasan alSaffar said, on the authority of Ya`qub ibn Yazid, on the authority of Safwan ibn Yahya, on the authority of Mansur ibn Hazim that: Abu `Abd Allah al-Sadiq  said: Verily, Allah, the Mighty and High, created privileged and adversity before He created His Creation. So whoever Allah knows to be privileged, Allah is never displeased with Him at any time. Even if he does an evil deed, Allah is displeased with the act, but not with him. If He knows someone to be adverse, Allah is displeased with Him at all times. Even if he does a good deed, Allah is please with the act, but displeased with him for what he will become. Thus, if Allah is pleased with something, then He never displeased with it; and if He is displeased with something, He is never pleased with it.",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (5/397)"
          }
        }
      },
      "Chapter #59": {
        "Hadith #7": {
          "Title": "Al-Tawhid: The Negation of Determinism and Relinquishment",
          "Link": "https://thaqalayn.net/hadith/14/2/59/7",
          "Arabic Text": "7 - أبي رحمه الله، قال: حدثنا: سعد بن عبد الله، قال: حدثنا أحمد بن محمد بن خالد، عن أبيه، عن سليمان بن جعفر الجعفري، عن أبي الحسن الرضا عليه السلام، قال: ذكر عنده الجبر والتفويض، فقال: ألا أعطيكم في هذا أصلا لا تختلفون فيه ولا تخاصمون عليه أحدا إلا كسرتموه، قلنا: إن رأيت ذلك، فقال: إن الله عز وجل لم يطع بإكراه، ولم يعص بغلبة  ولم يهمل العباد في ملكه، هو المالك لما ملكهم، والقادر على ما أقدرهم عليه، فإن ائتمر العباد بطاعته لم يكن الله عنها صادا ولا منها مانعا وإن ائتمروا بمعصيته فشاء أن يحول بينهم وبين ذلك فعل وإن لم يحل وفعلوه فليس هو الذي أدخلهم فيه، ثم قال عليه السلام: من يضبط حدود هذا الكلام فقد خصم من خالفه .",
          "English Text": "7. My father  said: Sa`d ibn `Abd Allah said: Ahmad ibn Muhammad ibn Khalid said, on the authority of his father, on the authority of Sulayman in Ja`far al-Ja`fari that Determinism and relinquishment were mentioned in the presence of Abu al-Hasan alRida . Hence, he  said: “Shall I not give you an argument that will enable you to destroy the arguments of anyone who debates with you?” We replied, “Only if you think it is proper.” He  replied, Verily, Allah, the Mighty and High, does not compel anyone to obey or disobey. He does not neglect His Servants in His Sovereignty. He is the Master over Everything they Possess, and He is All-Powerful over their actins. If they decide to obey Allah, He will not prevent them or obstruct them. If they decide to disobey Allah, and He wishes to prevent them form doing so, He will do so. However, if He does not prevent them from disobeying, and they disobey, He has not compelled them to do so. He  then added, “whosoever masters this argument will defeat his opponent.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (2/347)"
          }
        }
      },
      "Chapter #60": {
        "Hadith #1": {
          "Title": "Al-Tawhid: Predestination, Divine Decree, Trials, Means of Sustenance Rates, and Restricted Powers",
          "Link": "https://thaqalayn.net/hadith/14/2/60/1",
          "Arabic Text": "1 - أبي رحمه الله، قال: حدثنا سعد بن عبد الله، قال: حدثنا يعقوب بن يزيد، عن ابن أبي عمير، عن جميل بن دراج، عن زرارة، عن عبد الله بن سليمان، عن أبي عبد الله عليه السلام، قال: سمعته يقول: إن القضاء والقدر خلقان من خلق الله، والله يزيد في الخلق ما يشاء. ",
          "English Text": "1. My father  said: Sa`d ibn `Abd Allah said: Ya`qub ibn Yazid said, on the authority of Ibn Abu `Umayr, on the authority of Jamil ibn Durraj, o the authority of Zurarah, on the authority of `Abd Allah ibn Sulayman that Abu `Abd Allah al-Sadiq  said: “Verily, predestination, and the Divine Decree are creations from the creation of Allah. Allah increases for the creation whatever He wills.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (9/82)"
          }
        },
        "Hadith #2": {
          "Title": "Al-Tawhid: Predestination, Divine Decree, Trials, Means of Sustenance Rates, and Restricted Powers",
          "Link": "https://thaqalayn.net/hadith/14/2/60/2",
          "Arabic Text": "2 - حدثنا محمد بن الحسن بن أحمد بن الوليد رحمه الله، قال: حدثنا محمد بن الحسن الصفار، عن إبراهيم بن هاشم، عن علي بن معبد، عن درست، عن ابن أذينة  عن أبي عبد الله عليه السلام، قال: قلت له جعلت فداك ما تقول في القضاء والقدر؟ قال: أقول: إن الله تبارك وتعالى إذا جمع العباد يوم القيامة سألهم عما عهد إليهم ولم يسألهم عما قضى عليهم . ",
          "English Text": "2. Muhammad ibn al-Hasan ibn Ahmad ibn al-Walid  said: Muhammad ibn al-Hasan alSaffar said, on the authority of Ibrahim ibn Hashim, on the authority of `Ali ibn Ma`bad, on the authority of Durust, on the authority of Udhaynah that I asked Abu `Abd Allah al-Sadiq : “May I be your ransom! What is your belief regarding predestination, and the Divine Decree?” He  replied, “I believe: Verily, Allah, the Blessed and Exalted, will gather all of His Servants on the Day of Judgment. He will ask them about what He assigned them, and not what was predestined for them.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (9/82)"
          }
        },
        "Hadith #8": {
          "Title": "Al-Tawhid: Predestination, Divine Decree, Trials, Means of Sustenance Rates, and Restricted Powers",
          "Link": "https://thaqalayn.net/hadith/14/2/60/8",
          "Arabic Text": "8 - حدثنا علي بن عبد الله الوراق، وعلي بن محمد بن الحسن المعروف بابن مقبرة القزويني  قالا: حدثنا سعد بن عبد الله، قال: حدثنا الهيثم بن أبي مسروق النهدي، عن الحسين بن علوان، عن عمرو بن ثابت  عن سعد بن طريف عن الإصبع بن نباته، قال: إن أمير المؤمنين عليه السلام عدل من عند حائط مائل إلى حائط آخر، فقيل له، يا أمير المؤمنين أتفر من قضاء الله؟ فقال: أفر من قضاء الله إلى قدر الله عز وجل . ",
          "English Text": "8. `Ali ibn `Abd al-Warraq and `Ali ibn Muhammad ibn al-Hasan known to be Ibn Maqbarah alQazwini both said: Sa`d ibn `Abd Allah said: al-Haytham ibn Abu Masruq al-Nahdi said, on the authority of al-Husayn ibn `Ulwan, on the authority of `Amr ibn Thabit, on the authority of Sa`d ibn Tarif, on the authority of al-Asbagh ibn Nabatah that The Commander of the Faithful  moved from a wall that was tilted to another wall so it was said to him, “O Commander of the Faithful! Are you fleeing from the destiny of Allah?” He  replied, “I am fleeing from the destiny of Allah to the Divine Decree of Allah, the Mighty and High.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "معتبرة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (9/165)"
          }
        },
        "Hadith #13": {
          "Title": "Al-Tawhid: Predestination, Divine Decree, Trials, Means of Sustenance Rates, and Restricted Powers",
          "Link": "https://thaqalayn.net/hadith/14/2/60/13",
          "Arabic Text": "13 - حدثنا أحمد بن الحسن القطان، قال: حدثنا أحمد بن محمد بن سعيد الهمداني، قال: حدثنا علي بن الحسن بن علي بن فضال، عن أبيه، عن هارون ابن مسلم  عن ثابت بن أبي صفية، عن سعد الخفاف، عن الأصبغ بن نباتة، قال: قال أمير المؤمنين عليه السلام لرجل: إن كنت لا تطيع خالقك فلا تأكل رزقه  وإن كنت واليت عدوه فأخرج عن ملكه، وإن كنت غير قانع بقضائه وقدره فاطلب ربا سواه. ",
          "English Text": "13. Ahmad ibn al-Hasan al-Qittan said: Ahmad ibn Muhammad ibn Sa`id al-Hamdani said: `Ali ibn al-Hasan ibn `Ali ibn Fuddal said, on the authority of his father, on the authority of Harun ibn Muslim, on the authority of Thabit ibn Abu Safiyyah, on the authority of Sa`d al-Khaffaf, on the authority of al-Asbagh ibn Nubatah that The Commander of the Faithful  said to a man, “If you do not wish to obey your Creator, then do not eat of His Sustenance. And if you support His Enemy (Satan), then leave His Realm. If you are dissatisfied with His destiny and His Divine Decree, then find a Lord other than Him.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "من حيث السند لا بأس بها",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (9/165)"
          }
        }
      },
      "Chapter #63": {
        "Hadith #6": {
          "Title": "Al-Tawhid: Command, Prohibition, Promise and Threat",
          "Link": "https://thaqalayn.net/hadith/14/2/63/6",
          "Arabic Text": "6 - حدثنا أحمد بن زياد بن جعفر الهمداني رضي الله عنه، قال: حدثنا علي بن إبراهيم بن هاشم، عن أبيه، عن محمد بن أبي عمير، قال: سمعت موسى بن جعفر عليهما السلام يقول: لا يخلد الله في النار إلا أهل الكفر والجحود وأهل الضلال و الشرك. ومن اجتنب الكبائر من المؤمنين لم يسأل عن الصغائر، قال الله تبارك و تعالى: ﴿إن تجتنبوا كبائر ما تنهون عنه نكفر عنكم سيئاتكم وندخلكم مدخلا كريما﴾  قال: فقلت له: يا ابن رسول الله فالشفاعة لمن تجب من المذنبين؟ قال: حدثني أبي، عن آبائه، عن علي عليهم السلام قال: سمعت رسول الله صلى الله عليه وآله وسلم يقول: (إنما شفاعتي لأهل الكبائر من أمتي، فأما المحسنون منهم فما عليهم من سبيل) قال ابن أبي - عمير: فقلت له: يا ابن رسول الله فكيف تكون الشفاعة لأهل الكبائر والله تعالى ذكره يقول: ﴿ولا يشفعون إلا لمن ارتضى وهم من خشيته مشفقون﴾  ومن يرتكب الكبائر لا يكون مرتضى، فقال: يا أبا أحمد ما من مؤمن يرتك ذنبا إلا ساءه ذلك وندم عليه، وقد قال النبي صلى الله عليه وآله وسلم: (كفى بالندم توبة) وقال عليه السلام: ((من سرته حسنته وساءته سيئة فهو مؤمن)  فمن لم يندم على ذنب يرتكبه فليس بمؤمن ولم تجب له الشفاعة وكان ظالما، والله تعالى ذكره يقول: (ما للظالمين من حميم ولا شفيع يطاع)  فقلت له: يا ابن رسول الله وكيف لا يكون مؤمنا من لم يندم على ذنب يرتكبه؟ فقال: يا أبا أحمد ما من أحد يرتكب كبيرة من المعاصي و هو يعلم أنه سيعاقب عليها إلا ندم على ما ارتكب ومتى ندم كان تائبا مستحقا للشفاعة، ومتى لم يندم عليها كان مصرا والمصر لا يغفر له لأنه غير مؤمن بعقوبة ما ارتكب ولو كان مؤمنا بالعقوبة لندم، وقد قال النبي صلى الله عليه وآله: (لا كبيرة مع الاستغفار ولا صغيرة مع الاصرار) وأما قول الله عز وجل: (ولا يشفعون إلا لمن ارتضى) فإنهم لا يشفعون إلا لمن ارتضى الله دينه، والدين الاقرار بالجزاء على الحسنات والسيئات، فمن ارتضى الله دينه ندم على ما ارتكبه من الذنوب لمعرفته بعاقبته في القيامة.  ",
          "English Text": "6. Ahmad ibn Ziyad ibn Ja`far al-Hamdani  said: `Ali ibn Ibrahim ibn Hashim said, on the authority of his father, on the authority of Muhammad ibn Abu `Umayr that Musa ibn Ja`far  said: Allah will not make the Hell eternal for anyone except for those who disbelieved and denied, and those who went astray and rejected monotheism. Believers who refrained from major sins will not be asked about the minor sins they may have committed. Allah, the Blessed and Exalted, says: If you shun the great sins which you are forbidden, We will do away with your small sins and cause you to enter an honorable place of entering. The reporter says: I asked him, “O son of the messenger of Allah ﷺ! To which sinners does intercession [shafa`at] apply?” He  replied, “My father  related to me, on the authority of his forefathers  the authority of `Ali  that: The Messenger of Allah ﷺ said: “Verily, my intercession applies to the members of my Ummah who committed major sins. As for the good-doers, they should not be concerned.” Ibn Abu `Umayr says: I asked him, O son of the Messenger of Allah! How can intercession apply to those who commit major sins, when Allah, exalted be His Remembrance, says: And they do not intercede except for him whom He approves and for fear of Him they tremble; and whoever commits major sins cannot be the approved one, Thus, he  responded, O Abu Ahmad! There is not a believer who commits a sin but that it grieves him, and he regrets it. The Prophet ﷺ has said: “Regret is sufficient for repentance.” He  has also said: Whoever is pleased by his good deeds and grieved by his bad deeds is a believer.” Therefore, he who commits a sin, and does not regret it, is not a believer, and intercession will not apply to him because he is unjust. Allah, exalted be His Remembrance, says: The unjust shall not have nay compassionate friend nor any intercessor who should be obeyed. I asked him, “O son of the Messenger of Allah! Why is a person an unbeliever is he does not feel any remorse for his sins?” He  replied, O Abu Ahmad! If someone knows that he has committed a major sin, and knows that he will be punished for it, he will surely regret his action. If feels remorse, he has repented, and deserves intercession. If he does not regret his action, he will persist in his sin. Persistent, habitual sinners are not forgiven, because they do not believe that they will be punished for their actions. If they believed in the punishment then surely they would regret their action. The Prophet ﷺ said: No major sin remains after repentance. And no sin remains minor if one engages in it habitually. As for the Word of Allah, the Mighty and High: And they do not intercede except for him whom He approves; then he will not receive intercession unless Allah approves his belief. Belief is the confirmation of reward for good deeds and punishment over bad deeds. If Allah accepts a person’s faith as sincere, it is because the person regrets the sins he has committed, and fears their punishment on the Day of Judgment.",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (2/279)"
          }
        }
      }
    }
  }
}