[
    {
        "1": {
            "8": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Hadith of Musa, 'Alayhim al-Salam",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ عَلِيِّ بْنِ عِيسَى رَفَعَهُ قَالَ إِنَّ مُوسَى (عليه السلام) نَاجَاهُ اللَّهُ تَبَارَكَ وَ تَعَالَى فَقَالَ لَهُ فِي مُنَاجَاتِهِ يَا مُوسَى لَا يَطُولُ فِي الدُّنْيَا أَمَلُكَ فَيَقْسُوَ لِذَلِكَ قَلْبُكَ وَ قَاسِي الْقَلْبِ مِنِّي بَعِيدٌ يَا مُوسَى كُنْ كَمَسَرَّتِي فِيكَ فَإِنَّ مَسَرَّتِي أَنْ أُطَاعَ فَلَا أُعْصَى فَأَمِتْ قَلْبَكَ بِالْخَشْيَةِ وَ كُنْ خَلَقَ الثِّيَابِ جَدِيدَ الْقَلْبِ تُخْفَى عَلَى أَهْلِ الْأَرْضِ وَ تُعْرَفُ فِي أَهْلِ السَّمَاءِ حِلْسَ الْبُيُوتِ مِصْبَاحَ اللَّيْلِ وَ اقْنُتْ بَيْنَ يَدَيَّ قُنُوتَ الصَّابِرِينَ وَ صِحْ إِلَيَّ مِنْ كَثْرَةِ الذُّنُوبِ صِيَاحَ الْمُذْنِبِ الْهَارِبِ مِنْ عَدُوِّهِ وَ اسْتَعِنْ بِي عَلَى ذَلِكَ فَإِنِّي نِعْمَ الْعَوْنُ وَ نِعْمَ الْمُسْتَعَانُ يَا مُوسَى إِنِّي أَنَا اللَّهُ فَوْقَ الْعِبَادِ وَ الْعِبَادُ دُونِي وَ كُلٌّ لِي دَاخِرُونَ فَاتَّهِمْ نَفْسَكَ عَلَى نَفْسِكَ وَ لَا تَأْتَمِنْ وَلَدَكَ عَلَى دِينِكَ إِلَّا أَنْ يَكُونَ وَلَدُكَ مِثْلَكَ يُحِبُّ الصَّالِحِينَ يَا مُوسَى اغْسِلْ وَ اغْتَسِلْ وَ اقْتَرِبْ مِنْ عِبَادِيَ الصَّالِحِينَ يَا مُوسَى كُنْ إِمَامَهُمْ فِي صَلَاتِهِمْ وَ إِمَامَهُمْ فِيمَا يَتَشَاجَرُونَ وَ احْكُمْ بَيْنَهُمْ بِمَا أَنْزَلْتُ عَلَيْكَ فَقَدْ أَنْزَلْتُهُ حُكْماً بَيِّناً وَ بُرْهَاناً نَيِّراً وَ نُوراً يَنْطِقُ بِمَا كَانَ فِي الْأَوَّلِينَ وَ بِمَا هُوَ كَائِنٌ فِي الْآخِرِينَ أُوصِيكَ يَا مُوسَى وَصِيَّةَ الشَّفِيقِ الْمُشْفِقِ بِابْنِ الْبَتُولِ عِيسَى ابْنِ مَرْيَمَ صَاحِبِ الْأَتَانِ وَ الْبُرْنُسِ وَ الزَّيْتِ وَ الزَّيْتُونِ وَ الْمِحْرَابِ وَ مِنْ بَعْدِهِ بِصَاحِبِ الْجَمَلِ الْأَحْمَرِ الطَّيِّبِ الطَّاهِرِ الْمُطَهَّرِ فَمَثَلُهُ فِي كِتَابِكَ أَنَّهُ مُؤْمِنٌ مُهَيْمِنٌ عَلَى الْكُتُبِ كُلِّهَا وَ أَنَّهُ رَاكِعٌ سَاجِدٌ رَاغِبٌ رَاهِبٌ إِخْوَانُهُ الْمَسَاكِينُ وَ أَنْصَارُهُ قَوْمٌ آخَرُونَ وَ يَكُونُ فِي زَمَانِهِ أَزْلٌ وَ زِلْزَالٌ وَ قَتْلٌ وَ قِلَّةٌ مِنَ الْمَالِ اسْمُهُ أَحْمَدُ مُحَمَّدٌ الْأَمِينُ مِنَ الْبَاقِينَ مِنْ ثُلَّةِ الْأَوَّلِينَ الْمَاضِينَ يُؤْمِنُ بِالْكُتُبِ كُلِّهَا وَ يُصَدِّقُ جَمِيعَ الْمُرْسَلِينَ وَ يَشْهَدُ بِالْإِخْلَاصِ لِجَمِيعِ النَّبِيِّينَ أُمَّتُهُ مَرْحُومَةٌ مُبَارَكَةٌ مَا بَقُوا فِي الدِّينِ عَلَى حَقَائِقِهِ لَهُمْ سَاعَاتٌ مُوَقَّتَاتٌ يُؤَدُّونَ فِيهَا الصَّلَوَاتِ أَدَاءَ الْعَبْدِ إِلَى سَيِّدِهِ نَافِلَتَهُ فَبِهِ فَصَدِّقْ وَ مِنْهَاجَهُ فَاتَّبِعْ فَإِنَّهُ أَخُوكَ يَا مُوسَى إِنَّهُ أُمِّيٌّ وَ هُوَ عَبْدٌ صِدْقٌ يُبَارَكُ لَهُ فِيمَا وَضَعَ يَدَهُ عَلَيْهِ وَ يُبَارَكُ عَلَيْهِ كَذَلِكَ كَانَ فِي عِلْمِي وَ كَذَلِكَ خَلَقْتُهُ بِهِ أَفْتَحُ السَّاعَةَ وَ بِأُمَّتِهِ أَخْتِمُ مَفَاتِيحَ الدُّنْيَا فَمُرْ ظَلَمَةَ بَنِي إِسْرَائِيلَ أَنْ لَا يَدْرُسُوا اسْمَهُ وَ لَا يَخْذُلُوهُ وَ إِنَّهُمْ لَفَاعِلُونَ وَ حُبُّهُ لِي حَسَنَةٌ فَأَنَا مَعَهُ وَ أَنَا مِنْ حِزْبِهِ وَ هُوَ مِنْ حِزْبِي وَ حِزْبُهُمُ الْغَالِبُونَ فَتَمَّتْ كَلِمَاتِي لَأُظْهِرَنَّ دِينَهُ عَلَى الْأَدْيَانِ كُلِّهَا وَ لَأُعْبَدَنَّ بِكُلِّ مَكَانٍ وَ لَأُنْزِلَنَّ عَلَيْهِ قُرْآناً فُرْقَاناً شِفَاءً لِمَا فِي الصُّدُورِ مِنْ نَفْثِ الشَّيْطَانِ فَصَلِّ عَلَيْهِ يَا ابْنَ عِمْرَانَ فَإِنِّي أُصَلِّي عَلَيْهِ وَ مَلَائِكَتِي يَا مُوسَى أَنْتَ عَبْدِي وَ أَنَا إِلَهُكَ لَا تَسْتَذِلَّ الْحَقِيرَ الْفَقِيرَ وَ لَا تَغْبِطِ الْغَنِيَّ بِشَيْ‏ءٍ يَسِيرٍ وَ كُنْ عِنْدَ ذِكْرِي خَاشِعاً وَ عِنْدَ تِلَاوَتِهِ بِرَحْمَتِي طَامِعاً وَ أَسْمِعْنِي لَذَاذَةَ التَّوْرَاةِ بِصَوْتٍ خَاشِعٍ حَزِينٍ اطْمَئِنَّ عِنْدَ ذِكْرِي وَ ذَكِّرْ بِي مَنْ يَطْمَئِنُّ إِلَيَّ وَ اعْبُدْنِي وَ لَا تُشْرِكْ بِي شَيْئاً وَ تَحَرَّ مَسَرَّتِي إِنِّي أَنَا السَّيِّدُ الْكَبِيرُ إِنِّي خَلَقْتُكَ مِنْ نُطْفَةٍ مِنْ مَاءٍ مَهِينٍ مِنْ طِينَةٍ أَخْرَجْتُهَا مِنْ أَرْضٍ ذَلِيلَةٍ مَمْشُوجَةٍ فَكَانَتْ بَشَراً فَأَنَا صَانِعُهَا خَلْقاً فَتَبَارَكَ وَجْهِي وَ تَقَدَّسَ صَنِيعِي لَيْسَ كَمِثْلِي شَيْ‏ءٌ وَ أَنَا الْحَيُّ الدَّائِمُ الَّذِي لَا أَزُولُ يَا مُوسَى كُنْ إِذَا دَعَوْتَنِي خَائِفاً مُشْفِقاً وَجِلًا عَفِّرْ وَجْهَكَ لِي فِي التُّرَابِ وَ اسْجُدْ لِي بِمَكَارِمِ بَدَنِكَ وَ اقْنُتْ بَيْنَ يَدَيَّ فِي الْقِيَامِ وَ نَاجِنِي حِينَ تُنَاجِينِي بِخَشْيَةٍ مِنْ قَلْبٍ وَجِلٍ وَ احْيَ بِتَوْرَاتِي أَيَّامَ الْحَيَاةِ وَ عَلِّمِ الْجُهَّالَ مَحَامِدِي وَ ذَكِّرْهُمْ آلَائِي وَ نِعْمَتِي وَ قُلْ لَهُمْ لَا يَتَمَادَوْنَ فِي غَيِّ مَا هُمْ فِيهِ فَإِنَّ أَخْذِي أَلِيمٌ شَدِيدٌ يَا مُوسَى إِذَا انْقَطَعَ حَبْلُكَ مِنِّي لَمْ يَتَّصِلْ بِحَبْلِ غَيْرِي فَاعْبُدْنِي وَ قُمْ بَيْنَ يَدَيَّ مَقَامَ الْعَبْدِ الْحَقِيرِ الْفَقِيرِ ذُمَّ نَفْسَكَ فَهِيَ أَوْلَى بِالذَّمِّ وَ لَا تَتَطَاوَلْ بِكِتَابِي عَلَى بَنِي إِسْرَائِيلَ فَكَفَى بِهَذَا وَاعِظاً لِقَلْبِكَ وَ مُنِيراً وَ هُوَ كَلَامُ رَبِّ الْعَالَمِينَ جَلَّ وَ تَعَالَى يَا مُوسَى مَتَى مَا دَعَوْتَنِي وَ رَجَوْتَنِي فَإِنِّي سَأَغْفِرُ لَكَ عَلَى مَا كَانَ مِنْكَ السَّمَاءُ تُسَبِّحُ لِي وَجَلًا وَ الْمَلَائِكَةُ مِنْ مَخَافَتِي مُشْفِقُونَ وَ الْأَرْضُ تُسَبِّحُ لِي طَمَعاً وَ كُلُّ الْخَلْقِ يُسَبِّحُونَ لِي دَاخِرُونَ ثُمَّ عَلَيْكَ بِالصَّلَاةِ الصَّلَاةِ فَإِنَّهَا مِنِّي بِمَكَانٍ وَ لَهَا عِنْدِي عَهْدٌ وَثِيقٌ وَ أَلْحِقْ بِهَا مَا هُوَ مِنْهَا زَكَاةَ الْقُرْبَانِ مِنْ طَيِّبِ الْمَالِ وَ الطَّعَامِ فَإِنِّي لَا أَقْبَلُ إِلَّا الطَّيِّبَ يُرَادُ بِهِ وَجْهِي وَ اقْرُنْ مَعَ ذَلِكَ صِلَةَ الْأَرْحَامِ فَإِنِّي أَنَا اللَّهُ الرَّحْمَنُ الرَّحِيمُ وَ الرَّحِمُ أَنَا خَلَقْتُهَا فَضْلًا مِنْ رَحْمَتِي لِيَتَعَاطَفَ بِهَا الْعِبَادُ وَ لَهَا عِنْدِي سُلْطَانٌ فِي مَعَادِ الْآخِرَةِ وَ أَنَا قَاطِعُ مَنْ قَطَعَهَا وَ وَاصِلُ مَنْ وَصَلَهَا وَ كَذَلِكَ أَفْعَلُ بِمَنْ ضَيَّعَ أَمْرِي يَا مُوسَى أَكْرِمِ السَّائِلَ إِذَا أَتَاكَ بِرَدٍّ جَمِيلٍ أَوْ إِعْطَاءٍ يَسِيرٍ فَإِنَّهُ يَأْتِيكَ مَنْ لَيْسَ بِإِنْسٍ وَ لَا جَانٍّ مَلَائِكَةُ الرَّحْمَنِ يَبْلُونَكَ كَيْفَ أَنْتَ صَانِعٌ فِيمَا أَوْلَيْتُكَ وَ كَيْفَ مُوَاسَاتُكَ فِيمَا خَوَّلْتُكَ وَ اخْشَعْ لِي بِالتَّضَرُّعِ وَ اهْتِفْ لِي بِوَلْوَلَةِ الْكِتَابِ وَ اعْلَمْ أَنِّي أَدْعُوكَ دُعَاءَ السَّيِّدِ مَمْلُوكَهُ لِيَبْلُغَ بِهِ شَرَفَ الْمَنَازِلِ وَ ذَلِكَ مِنْ فَضْلِي عَلَيْكَ وَ عَلَى آبَائِكَ الْأَوَّلِينَ يَا مُوسَى لَا تَنْسَنِي عَلَى كُلِّ حَالٍ وَ لَا تَفْرَحْ بِكَثْرَةِ الْمَالِ فَإِنَّ نِسْيَانِي يُقْسِي الْقُلُوبَ وَ مَعَ كَثْرَةِ الْمَالِ كَثْرَةُ الذُّنُوبِ الْأَرْضُ مُطِيعَةٌ وَ السَّمَاءُ مُطِيعَةٌ وَ الْبِحَارُ مُطِيعَةٌ وَ عِصْيَانِي شَقَاءُ الثَّقَلَيْنِ وَ أَنَا الرَّحْمَنُ الرَّحِيمُ رَحْمَانُ كُلِّ زَمَانٍ آتِي بِالشِّدَّةِ بَعْدَ الرَّخَاءِ وَ بِالرَّخَاءِ بَعْدَ الشِّدَّةِ وَ بِالْمُلُوكِ بَعْدَ الْمُلُوكِ وَ مُلْكِي دَائِمٌ قَائِمٌ لَا يَزُولُ وَ لَا يَخْفَى عَلَيَّ شَيْ‏ءٌ فِي الْأَرْضِ وَ لَا فِي السَّمَاءِ وَ كَيْفَ يَخْفَى عَلَيَّ مَا مِنِّي مُبْتَدَؤُهُ وَ كَيْفَ لَا يَكُونُ هَمُّكَ فِيمَا عِنْدِي وَ إِلَيَّ تَرْجِعُ لَا مَحَالَةَ يَا مُوسَى اجْعَلْنِي حِرْزَكَ وَ ضَعْ عِنْدِي كَنْزَكَ مِنَ الصَّالِحَاتِ وَ خَفْنِي وَ لَا تَخَفْ غَيْرِي إِلَيَّ الْمَصِيرُ يَا مُوسَى ارْحَمْ مَنْ هُوَ أَسْفَلُ مِنْكَ فِي الْخَلْقِ وَ لَا تَحْسُدْ مَنْ هُوَ فَوْقَكَ فَإِنَّ الْحَسَدَ يَأْكُلُ الْحَسَنَاتِ كَمَا تَأْكُلُ النَّارُ الْحَطَبَ يَا مُوسَى إِنَّ ابْنَيْ آدَمَ تَوَاضَعَا فِي مَنْزِلَةٍ لِيَنَالَا بِهَا مِنْ فَضْلِي وَ رَحْمَتِي فَقَرَّبَا قُرْبَاناً وَ لَا أَقْبَلُ إِلَّا مِنَ الْمُتَّقِينَ فَكَانَ مِنْ شَأْنِهِمَا مَا قَدْ عَلِمْتَ فَكَيْفَ تَثِقُ بِالصَّاحِبِ بَعْدَ الْأَخِ وَ الْوَزِيرِ يَا مُوسَى ضَعِ الْكِبْرَ وَ دَعِ الْفَخْرَ وَ اذْكُرْ أَنَّكَ سَاكِنُ الْقَبْرِ فَلْيَمْنَعْكَ ذَلِكَ مِنَ الشَّهَوَاتِ يَا مُوسَى عَجِّلِ التَّوْبَةَ وَ أَخِّرِ الذَّنْبَ وَ تَأَنَّ فِي الْمَكْثِ بَيْنَ يَدَيَّ فِي الصَّلَاةِ وَ لَا تَرْجُ غَيْرِي اتَّخِذْنِي جُنَّةً لِلشَّدَائِدِ وَ حِصْناً لِمُلِمَّاتِ الْأُمُورِ يَا مُوسَى كَيْفَ تَخْشَعُ لِي خَلِيقَةٌ لَا تَعْرِفُ فَضْلِي عَلَيْهَا وَ كَيْفَ تَعْرِفُ فَضْلِي عَلَيْهَا وَ هِيَ لَا تَنْظُرُ فِيهِ وَ كَيْفَ تَنْظُرُ فِيهِ وَ هِيَ لَا تُؤْمِنُ بِهِ وَ كَيْفَ تُؤْمِنُ بِهِ وَ هِيَ لَا تَرْجُو ثَوَاباً وَ كَيْفَ تَرْجُو ثَوَاباً وَ هِيَ قَدْ قَنِعَتْ بِالدُّنْيَا وَ اتَّخَذَتْهَا مَأْوًى وَ رَكَنَتْ إِلَيْهَا رُكُونَ الظَّالِمِينَ يَا مُوسَى نَافِسْ فِي الْخَيْرِ أَهْلَهُ فَإِنَّ الْخَيْرَ كَاسْمِهِ وَ دَعِ الشَّرَّ لِكُلِّ مَفْتُونٍ يَا مُوسَى اجْعَلْ لِسَانَكَ مِنْ وَرَاءِ قَلْبِكَ تَسْلَمْ وَ أَكْثِرْ ذِكْرِي بِاللَّيْلِ وَ النَّهَارِ تَغْنَمْ وَ لَا تَتَّبِعِ الْخَطَايَا فَتَنْدَمَ فَإِنَّ الْخَطَايَا مَوْعِدُهَا النَّارُ يَا مُوسَى أَطِبِ الْكَلَامَ لِأَهْلِ التَّرْكِ لِلذُّنُوبِ وَ كُنْ لَهُمْ جَلِيساً وَ اتَّخِذْهُمْ لِغَيْبِكَ إِخْوَاناً وَ جِدَّ مَعَهُمْ يَجِدُّونَ مَعَكَ يَا مُوسَى الْمَوْتُ يَأْتِيكَ لَا مَحَالَةَ فَتَزَوَّدْ زَادَ مَنْ هُوَ عَلَى مَا يَتَزَوَّدُ وَارِدٌ عَلَى الْيَقِينِ يَا مُوسَى مَا أُرِيدَ بِهِ وَجْهِي فَكَثِيرٌ قَلِيلُهُ وَ مَا أُرِيدَ بِهِ غَيْرِي فَقَلِيلٌ كَثِيرُهُ وَ إِنَّ أَصْلَحَ أَيَّامِكَ الَّذِي هُوَ أَمَامَكَ فَانْظُرْ أَيُّ يَوْمٍ هُوَ فَأَعِدَّ لَهُ الْجَوَابَ فَإِنَّكَ مَوْقُوفٌ وَ مَسْئُولٌ وَ خُذْ مَوْعِظَتَكَ مِنَ الدَّهْرِ وَ أَهْلِهِ فَإِنَّ الدَّهْرَ طَوِيلُهُ قَصِيرٌ وَ قَصِيرُهُ طَوِيلٌ وَ كُلُّ شَيْ‏ءٍ فَانٍ فَاعْمَلْ كَأَنَّكَ تَرَى ثَوَابَ عَمَلِكَ لِكَيْ يَكُونَ أَطْمَعَ لَكَ فِي الْآخِرَةِ لَا مَحَالَةَ فَإِنَّ مَا بَقِيَ مِنَ الدُّنْيَا كَمَا وَلَّى مِنْهَا وَ كُلُّ عَامِلٍ يَعْمَلُ عَلَى بَصِيرَةٍ وَ مِثَالٍ فَكُنْ مُرْتَاداً لِنَفْسِكَ يَا ابْنَ عِمْرَانَ لَعَلَّكَ تَفُوزُ غَداً يَوْمَ السُّؤَالِ فَهُنَالِكَ يَخْسَرُ الْمُبْطِلُونَ يَا مُوسَى أَلْقِ كَفَّيْكَ ذُلًّا بَيْنَ يَدَيَّ كَفِعْلِ الْعَبْدِ الْمُسْتَصْرِخِ إِلَى سَيِّدِهِ فَإِنَّكَ إِذَا فَعَلْتَ ذَلِكَ رُحِمْتَ وَ أَنَا أَكْرَمُ الْقَادِرِينَ يَا مُوسَى سَلْنِي مِنْ فَضْلِي وَ رَحْمَتِي فَإِنَّهُمَا بِيَدِي لَا يَمْلِكُهُمَا أَحَدٌ غَيْرِي وَ انْظُرْ حِينَ تَسْأَلُنِي كَيْفَ رَغْبَتَكَ فِيمَا عِنْدِي لِكُلِّ عَامِلٍ جَزَاءٌ وَ قَدْ يُجْزَى الْكَفُورُ بِمَا سَعَى يَا مُوسَى طِبْ نَفْساً عَنِ الدُّنْيَا وَ انْطَوِ عَنْهَا فَإِنَّهَا لَيْسَتْ لَكَ وَ لَسْتَ لَهَا مَا لَكَ وَ لِدَارِ الظَّالِمِينَ إِلَّا لِعَامِلٍ فِيهَا بِالْخَيْرِ فَإِنَّهَا لَهُ نِعْمَ الدَّارُ يَا مُوسَى مَا آمُرُكَ بِهِ فَاسْمَعْ وَ مَهْمَا أَرَاهُ فَاصْنَعْ خُذْ حَقَائِقَ التَّوْرَاةِ إِلَى صَدْرِكَ وَ تَيَقَّظْ بِهَا فِي سَاعَاتِ اللَّيْلِ وَ النَّهَارِ وَ لَا تُمَكِّنْ أَبْنَاءَ الدُّنْيَا مِنْ صَدْرِكَ فَيَجْعَلُونَهُ وَكْراً كَوَكْرِ الطَّيْرِ يَا مُوسَى أَبْنَاءُ الدُّنْيَا وَ أَهْلُهَا فِتَنٌ بَعْضُهُمْ لِبَعْضٍ فَكُلٌّ مُزَيَّنٌ لَهُ مَا هُوَ فِيهِ وَ الْمُؤْمِنُ مَنْ زُيِّنَتْ لَهُ الْآخِرَةُ فَهُوَ يَنْظُرُ إِلَيْهَا مَا يَفْتُرُ قَدْ حَالَتْ شَهْوَتُهَا بَيْنَهُ وَ بَيْنَ لَذَّةِ الْعَيْشِ فَأَدْلَجَتْهُ بِالْأَسْحَارِ كَفِعْلِ الرَّاكِبِ السَّائِقِ إِلَى غَايَتِهِ يَظَلُّ كَئِيباً وَ يُمْسِي حَزِيناً فَطُوبَى لَهُ لَوْ قَدْ كُشِفَ الْغِطَاءُ مَا ذَا يُعَايِنُ مِنَ السُّرُورِ يَا مُوسَى الدُّنْيَا نُطْفَةٌ لَيْسَتْ بِثَوَابٍ لِلْمُؤْمِنِ وَ لَا نَقِمَةٍ مِنْ فَاجِرٍ فَالْوَيْلُ الطَّوِيلُ لِمَنْ بَاعَ ثَوَابَ مَعَادِهِ بِلَعْقَةٍ لَمْ تَبْقَ وَ بِلَعْسَةٍ لَمْ تَدُمْ وَ كَذَلِكَ فَكُنْ كَمَا أَمَرْتُكَ وَ كُلُّ أَمْرِي رَشَادٌ يَا مُوسَى إِذَا رَأَيْتَ الْغِنَى مُقْبِلًا فَقُلْ ذَنْبٌ عُجِّلَتْ لِي عُقُوبَتُهُ وَ إِذَا رَأَيْتَ الْفَقْرَ مُقْبِلًا فَقُلْ مَرْحَباً بِشِعَارِ الصَّالِحِينَ وَ لَا تَكُنْ جَبَّاراً ظَلُوماً وَ لَا تَكُنْ لِلظَّالِمِينَ قَرِيناً يَا مُوسَى مَا عُمُرٌ وَ إِنْ طَالَ يُذَمُّ آخِرُهُ وَ مَا ضَرَّكَ مَا زُوِيَ عَنْكَ إِذَا حُمِدَتْ مَغَبَّتُهُ يَا مُوسَى صَرَخَ الْكِتَابُ إِلَيْكَ صُرَاخاً بِمَا أَنْتَ إِلَيْهِ صَائِرٌ فَكَيْفَ تَرْقُدُ عَلَى هَذَا الْعُيُونُ أَمْ كَيْفَ يَجِدُ قَوْمٌ لَذَّةَ الْعَيْشِ لَوْ لَا التَّمَادِي فِي الْغَفْلَةِ وَ الِاتِّبَاعُ لِلشِّقْوَةِ وَ التَّتَابُعُ لِلشَّهْوَةِ وَ مِنْ دُونِ هَذَا يَجْزَعُ الصِّدِّيقُونَ يَا مُوسَى مُرْ عِبَادِي يَدْعُونِي عَلَى مَا كَانَ بَعْدَ أَنْ يُقِرُّوا لِي أَنِّي أَرْحَمُ الرَّاحِمِينَ مُجِيبُ الْمُضْطَرِّينَ وَ أَكْشِفُ السُّوءَ وَ أُبَدِّلُ الزَّمَانَ وَ آتِي بِالرَّخَاءِ وَ أَشْكُرُ الْيَسِيرَ وَ أُثِيبُ الْكَثِيرَ وَ أُغْنِي الْفَقِيرَ وَ أَنَا الدَّائِمُ الْعَزِيزُ الْقَدِيرُ فَمَنْ لَجَأَ إِلَيْكَ وَ انْضَوَى إِلَيْكَ مِنَ الْخَاطِئِينَ فَقُلْ أَهْلًا وَ سَهْلًا يَا رَحْبَ الْفِنَاءِ بِفِنَاءِ رَبِّ الْعَالَمِينَ وَ اسْتَغْفِرْ لَهُمْ وَ كُنْ لَهُمْ كَأَحَدِهِمْ وَ لَا تَسْتَطِلْ عَلَيْهِمْ بِمَا أَنَا أَعْطَيْتُكَ فَضْلَهُ وَ قُلْ لَهُمْ فَلْيَسْأَلُونِي مِنْ فَضْلِي وَ رَحْمَتِي فَإِنَّهُ لَا يَمْلِكُهَا أَحَدٌ غَيْرِي وَ أَنَا ذُو الْفَضْلِ الْعَظِيمِ طُوبَى لَكَ يَا مُوسَى كَهْفُ الْخَاطِئِينَ وَ جَلِيسُ الْمُضْطَرِّينَ وَ مُسْتَغْفِرٌ لِلْمُذْنِبِينَ إِنَّكَ مِنِّي بِالْمَكَانِ الرَّضِيِّ فَادْعُنِي بِالْقَلْبِ النَّقِيِّ وَ اللِّسَانِ الصَّادِقِ وَ كُنْ كَمَا أَمَرْتُكَ أَطِعْ أَمْرِي وَ لَا تَسْتَطِلْ عَلَى عِبَادِي بِمَا لَيْسَ مِنْكَ مُبْتَدَاهُ وَ تَقَرَّبْ إِلَيَّ فَإِنِّي مِنْكَ قَرِيبٌ فَإِنِّي لَمْ أَسْأَلْكَ مَا يُؤْذِيكَ ثِقَلُهُ وَ لَا حَمْلُهُ إِنَّمَا سَأَلْتُكَ أَنْ تَدْعُوَنِي فَأُجِيبَكَ وَ أَنْ تَسْأَلَنِي فَأُعْطِيَكَ وَ أَنْ تَتَقَرَّبَ إِلَيَّ بِمَا مِنِّي أَخَذْتَ تَأْوِيلَهُ وَ عَلَيَّ تَمَامُ تَنْزِيلِهِ يَا مُوسَى انْظُرْ إِلَى الْأَرْضِ فَإِنَّهَا عَنْ قَرِيبٍ قَبْرُكَ وَ ارْفَعْ عَيْنَيْكَ إِلَى السَّمَاءِ فَإِنَّ فَوْقَكَ فِيهَا مَلِكاً عَظِيماً وَ ابْكِ عَلَى نَفْسِكَ مَا دُمْتَ فِي الدُّنْيَا وَ تَخَوَّفِ الْعَطَبَ وَالْمَهَالِكَ وَ لَا تَغُرَّنَّكَ زِينَةُ الدُّنْيَا وَ زَهْرَتُهَا وَ لَا تَرْضَ بِالظُّلْمِ وَ لَا تَكُنْ ظَالِماً فَإِنِّي لِلظَّالِمِ رَصِيدٌ حَتَّى أُدِيلَ مِنْهُ الْمَظْلُومَ يَا مُوسَى إِنَّ الْحَسَنَةَ عَشَرَةُ أَضْعَافٍ وَ مِنَ السَّيِّئَةِ الْوَاحِدَةِ الْهَلَاكُ لَا تُشْرِكْ بِي لَا يَحِلُّ لَكَ أَنْ تُشْرِكَ بِي قَارِبْ وَ سَدِّدْ وَ ادْعُ دُعَاءَ الطَّامِعِ الرَّاغِبِ فِيمَا عِنْدِي النَّادِمِ عَلَى مَا قَدَّمَتْ يَدَاهُ فَإِنَّ سَوَادَ اللَّيْلِ يَمْحُوهُ النَّهَارُ وَ كَذَلِكَ السَّيِّئَةُ تَمْحُوهَا الْحَسَنَةُ وَ عَشْوَةُ اللَّيْلِ تَأْتِي عَلَى ضَوْءِ النَّهَارِ وَ كَذَلِكَ السَّيِّئَةُ تَأْتِي عَلَى الْحَسَنَةِ الْجَلِيلَةِ فَتُسَوِّدُهَا .",
                    "englishText": "8. Ali Bin Ibrahim, from his father, from Amro Bin Usman, from Ali Bin Isa, from an unbroken chain. He  said: ‘ (Prophet) Musa  was whispering (Munajaat) to Allah (azwj) Blessed and High. He (azwj) Said in His (azwj) Whispering: ‘O Musa ! Do not have long hopes regarding the world. That would harden your  heart, and the hard-hearted one is remote from Me (azwj). O Musa ! Turn yourself  (to obedience) for the sake of My (azwj) Pleasure, for if My (azwj) Pleasure is obeyed, so I (azwj) am not disobeyed. Kill your heart with the fear and create new clothes for the heart. You  will be hidden from the people of the earth and be recognised by the people of the sky. Spread out the lamps in your house at night and plead before Me (azwj) with the pleading of the patient ones and wail to Me (azwj) from the great number of the sins like the wailing of the sinner who has fled from his enemies. And seek help for that from Me (azwj) for I (azwj) am the Best of the Helpers, and the best of the Supporters. O Musa ! I (azwj) am Allah (azwj) high above the servants, and the servants are below Me (azwj), and everyone is helpless before Me (azwj). Accuse yourself for having wronged yourself, and do not trust your  son upon your  Religion unless he becomes like you , loving the righteous ones. O Musa ! Wash and bathe and be near to My (azwj) righteous servants. O Musa ! Be their Imam in their Prayers, and their Imam in what they squabble about, and judge between them by what I (azwj) have Revealed unto you . I (azwj) have Sent it down as a clear and luminous Proof, and a Light Speaking by what had transpired regarding the former ones and what will be regarding the later ones. I (azwj) Bequeath to you , O Musa , a bequest of the compassionate, the kind-hearted son of the Pious Lady, Isa  son of Maryam , owner of the mule, and the hooded gown, and the oil and the olive, and the Prayer Niche. And from after him ﷺ, about the owner of the red camel, the food, and pure, the purified. His ﷺ example in your  Book is that he ﷺ is a Believer, dominant over all the Books, and that he ﷺ is the bowing one, the prostrating one, a seeker, a Monk, his ﷺ brothers will be the poor, and his ﷺ helpers will be another people, and there will occur in his ﷺ era hardships and earthquakes, killings, and shortages of the wealth. His ﷺ name would be Ahmad ﷺ, Muhammad ﷺ, the trusted one from the remaining ones of the previous generations. He ﷺ will believe in all the Books and ratify all the Messengers  and testify sincerely for all the Prophets . His ﷺ community will be the ones under the Mercy, Blessed with what will remain in the Religion upon its reality. They will fulfill their Prayers at its prescribed times, as servants optionally do for their chiefs, acknowledge him ﷺ and follow his ﷺ path. So he ﷺ is your  brother. O Musa ! He ﷺ is the ‘Ummy’, and he ﷺ is a truthful servant. Whatever he ﷺ places his ﷺ hand upon, it becomes a Blessing for him ﷺ and a Blessing for it. That is how it was in My ﷺ Knowledge and that is how I (azwj) Created him ﷺ as. It is by him ﷺ that I (azwj) will Open the Hour (Day of Judgement) and it is by his ﷺ community I (azwj) shall Seal (Bring an end to) the keys of the world. So, order the unjust ones of the Children of Israel that they should learn his ﷺ name, and not to abandon it, but they (surely) will do it. And to love him ﷺ is a good deed to Me (azwj), for I (azwj) am with him ﷺ and I (azwj) am from his ﷺ group, and he ﷺ is from My (azwj) Group, and their group shall overcome. So, I (azwj) have Completed My (azwj) Words and will Make his ﷺ Religion to prevail over all the Religions, and I (azwj) will be worshipped in all places, and I (azwj) shall Reveal unto him ﷺ the Quran as a Criterion, a healing for what is in the chests from the whisperings of Satan (la). So send greetings to him ﷺ, O son  of Imran , for I (azwj) Send Greetings to him ﷺ and so do My (azwj) Angels. O Musa ! You  are My (azwj) servant and I (azwj) am your (azwj) God. Do not belittle the despicable, the poor, and do not envy the rich for a little thing. And become humble in My (azwj) Remembrance and in it’s (the Torah) Recitation ravenously by My (azwj) Mercy, and make Me (azwj) Hear the pleasance of the Torah in a humble voice, full of grief. Be at rest during My (azwj) Remembrance, and mention Me (azwj) to the ‘one’ who is assured to Me (azwj), and worship Me (azwj) and do not associate with Me (azwj) anything. And make haste to My (azwj) Pleasure, ‘إِنِّي أَنَا السَّيِّدُ الْكَبِيرُ’ for I (azwj) and the Great Master (azwj). I (azwj) Created you  from a seed of menial water from clay which I (azwj) Took out from a disgraceful mixture of dust. So it was a human being and I (azwj) carved it into a creature. So Blessed is My (azwj) ‘وَجْهِي’ (My Wali ), and Holy is My (azwj) Craft. There is nothing like Me (azwj) and I (azwj) am the Eternal Living One who will not Decline. O Musa ! When you supplicate to Me (azwj), be fearful, anxious and rub your  face in the dust to Me (azwj) and prostrate to Me (azwj) by the noble parts of your  body, and plead in front of Me (azwj) when standing, and whisper to Me (azwj) when you whisper with a humble heart anxiously, and revive My (azwj) Torah in the days of the life, and teach My (azwj) Praise to the ignorant ones, and remind them of My (azwj) Favours, and My (azwj) Bounties, and tell them not to persist in the transgression in which they are engulfed, for My (azwj) Hold is Painful and Intense. O Musa ! If I (azwj) Cut off your Rope from Me (azwj) you  will not (be able to) connect with the rope of others. So, worship Me (azwj), and stand in front of Me (azwj) like the standing of the lowly poor servant. Condemn yourself for it is the highest (most deserving) for condemnation, and do not empower the Children of Israel by My (azwj) Book, for it is sufficient advice for your  heart and an enlightenment, and it is the Speech of the Lord (azwj) of the Worlds, Majestic and High. O Musa ! Whenever you supplicate to Me (azwj) and refer to Me (azwj), I (azwj) shall Forgive you  what was from you . The sky Glorifies to Me (azwj) My (azwj) Majesty, and the Angels are fearful of Me (azwj) and anxious, and the earth Glorifies to Me (azwj) ravenously, and all of the creation Glorifies Me (azwj) in humbleness. Then it is on you to Pray. The Prayer has a place with Me (azwj) and for it has in My (azwj) Presence a firm Covenant and I (azwj) Attach to it what was from it. Zakat is a sacrifice in order to cleanse the wealth, and the food, for I (azwj) do not Accept except for the ‘الطَّيِّبَ’ pure, (unless the instructions of) My (azwj) ‘وَجْهِي’ (My Wali ) are sought. And I (azwj) Joined with that the maintenance of relations, for I (azwj) am Allah (azwj), the Beneficent, the Merciful, and as for the relationships, I (azwj) Created it Preferentially from My (azwj) Mercy for the servants to sympathise (with each other) by it, and for it, in My (azwj) Presence is an authorization in the return of the Hereafter, and I (azwj) will Cut-off the one who cuts it off (from My (azwj) Wali ), and Connect with the one who keeps the connection (with My (azwj) Wali ). And that is how I (azwj) will Deal in My (azwj) Command. O Musa ! Be generous to the beggar when he comes to you  by beautiful words, or giving easily because he may have come to you from neither from the humans nor from the Jinn. The Angels of the Beneficent come to test you  to see how you  are in your  dealings in regard to what I (azwj) have Given to you , and how consoling you  are regarding what I (azwj) have Authorised you  with. And be humble to Me (azwj) with the beseeching, and wail to Me (azwj) by lamentations from the Book. And know that I (azwj) Call you with the Calling of the master to his slave to Make him reach to the honourable position, and that is from My (azwj) Grace to you  and to your  forefathers of the former ones. O Musa ! Do not forget Me (azwj) in every situation, and do not be happy due to the abundance of the wealth, because forgetting Me (azwj) hardens the hearts, and the abundance of the wealth brings the abundance of the sins. The earth is obedient, and the sky is obedient, and the oceans are obedient, whereas disobedient to Me (azwj) are the unfortunate ones of Humans and the Jinns (Al-Saqalayn). And I (azwj) am the Beneficent, the Merciful. I (azwj) am Beneficent in every era. I (azwj) Give hardship after ease, and ease after hardship, and kings after kings, whereas My (azwj) Kingdom is permanently based and will never cease. And there is not hidden from Me (azwj) anything in the earth, nor in the sky, and how can it be hidden from Me (azwj) and from Me (azwj) is its beginning, and how come you are not fearful regarding what is in My (azwj) possession, and to Me (azwj) you  will inevitably return. O Musa ! Make Me (azwj) to be your  Protector, and place in My (azwj) possession your treasure for the good deeds, and fear Me (azwj) and do not fear others. To Me (azwj) is the destination. O Musa ! Be merciful to the one who is lower than you among the creatures, and do not become jealous of the one who is above you , for the jealousy consumes the good deeds just like the fire consumes the firewood. O Musa ! The two sons of Adam  wanted to express humbleness at a stage so that they could win My (azwj) Grace and My (azwj) Mercy. So they offered offerings, and I (azwj) do not Accept except from the pious ones. So their affair was what you  know, so, after this, how can you  (select) a trustworthy companion, the brother and the vizier (but by Me (azwj))? O Musa ! Put aside the arrogance and leave the pride, and remember that you  will be dwelling in the grave, and that should prevent you  from the lustful desires. O Musa ! Hasten to the repentance, and delay the sins, and deliberate in your  staying in front of Me (azwj) during the Prayer, and do not place hope in others. Take Me (azwj) to be your  shield in the difficulties, and as a fortress in disastrous circumstances. O Musa ! How can a creature humble itself to Me (azwj) without being aware of My (azwj) Mercy, and how can one recognise My (azwj) Mercy without having observed it; and how can one (ever) observe it without having faith in it, and how can one believe in it without having any hope of being blessed from it; and how can one hope for being Blessed while being satisfied with the world, having taken refuge in it and relying on the support of the unjust ones. O Musa ! Compete for the good with the people of goodness because the good is like its name, and leave the evil for those who are fascinated by it. O Musa ! Keep your  tongue behind your  heart and you  will be safe, and Remember Me (azwj) abundantly during the night and the day and you will gain, and do not follow the sins (errors) but you  will regret, for the sins are scheduled for the Fire. O Musa ! Speak good to the people who have left the sins and be in their company, and take them as your  brother in your  absence, and strive along with them and let them strive with you . O Musa ! The death will inevitably come to you . So make provision of such provisions like the one who is certain that it would last him till (he reaches) his destination. O Musa ! What you  intend with by for My (azwj) Face ‘وَجْهِي’ (My Wali ), even a little (submission) is a lot, and what you  intend with by for other than Me (azwj), even a lot (of effort to please him) is little (worthless). And reform your  days which are in front of you , and to realize the day in front of you and prepare to benefit from it, as for you  will be Paused and Questioned. Take your  lesson from the (past) era and its people, for the span of the era is short, but its shortness can be availed (to earn rewards), since everything is destined for destruction. So act as if you  can see the Reward for your  deeds in order for it to be an inevitable greed for you  regarding the Hereafter, for whatever is remaining from the world is like what has passed from it, and every worker strives upon visions and examples. So return to yourself , O son  of Imran , perhaps you  will succeed tomorrow on the Day of Questioning, for that is where the wrong doers will lose out. O Musa ! Throw out your  hand in front of Me (azwj) like the act of the slave calling out to his master, for if you  were to do that, you  will be the recipient of Mercy for I (azwj) am the Most Generous of the Powerful ones. O Musa ! Ask Me (azwj) from My (azwj) Grace, and My (azwj) Mercy, for these two are in My (azwj) Hands, none other is their owner, and look when you  ask Me (azwj) how your  wish is with what is in My (azwj) Possession. For every worker is a Recompense, and the disbeliever will be Recompensed with what he strives for. O Musa ! Do not concern yourself  with the world and seclude from it, for it is not for you , and you  are not its owner, and it is a house for the unjust ones. However, the one who does good deeds in it, it is a good house for him. O Musa ! What I (azwj) have Commanded you  to, so listen and keep quiet at whatever you  see. Take the realities of the Torah to your  chest, and keep vigil by it in the hours of the night and the day, and do not let the sons of the world to make your  chest to be a nest like the nest of the birds. O Musa ! The sons of the world and its people are a trial for some of them to the others. So each one of them decorates what is regarding him, whereas the Believer is the one for whom the Hereafter is decorated. So he looks at it unabated, and its pleasures become a barrier for him in between him and the pleasures of life. So he idealises by the dawn like the act of the passenger driven by it to its destination, remaining bleak and sad in the evening. So good news would be for him, and the curtain is Lifted, what he will see would delight his eyes. O Musa ! The world is a seed. It is not of any benefit for the Believer, nor is it a penalty for the one who is sinful. So, a lengthy woe is for the one who sells the Reward of his return for a morsel, which does not remain and a sip, which does not continue. So be as I (azwj) have Commanded you  to be, and every Command of Mine (azwj) is Guidance. O Musa ! When you  see the richness coming to you , so say: ‘It is a sin which is hastening the punishment for me ’. And when you  see the poverty coming to you , so say: ‘Welcome to the sign of the righteous ones’. And do not become an unjust tyrant, and do not join up with the unjust ones. O Musa ! What is a lifetime and it is lengthy and its end is condemnable. And what goes away from you  does not adversely affect you  if you  were to praise its result. O Musa ! The Book has Screamed out to you  a loud Scream with what you  are headed for. So how can the eyes fall asleep upon this, or how can the people find pleasure in the life. Had it not been for the deliberately being oblivious, and the following of the misfortune and the following of the lustful desires, and from other than this, that the righteous are in grief. O Musa ! Order My (azwj) servants to supplicate to Me (azwj) in whatever situation they may be in after having accepted that I (azwj) am indeed the Most Merciful of the merciful ones, the Answerer to the restless, and Remover of the evil, and the Changer of the eras, and the Giver of comfort, Thankful for a little, and Rewarding a great deal, and Enricher of the poor, and I (azwj) am the Eternally Mighty and Powerful. So the one who comes to you  and joined up with you  from the sinful ones, so say: ‘Welcome to the courtyard of the Lord (azwj) of the Worlds’, and seek Forgiven for them, and be kind to them like one of other, and do not dominate them by what I (azwj) have Given to you  of the preference over them, and tell them to ask from Me (azwj) from (and) My (azwj) Grace, and My (azwj) Mercy, for no one else is the owner of these, and I (azwj) am of the Great Grace , Good to you. O Musa ! Be a cave for the erroneous, and sit with the restless, and a seeker of Forgiveness among the sinful ones. You  are from Me (azwj) at the status of the Pleasure, so supplicate to Me (azwj) with the pure heart, and the truthful tongue, and be as I (azwj) have Commanded you  to be. Be obedient to My (azwj) Command and do not dominate over My (azwj) servants by what is not begun from you . And come nearer to Me (azwj), for I (azwj) am very near to you , for I (azwj) will never Ask you  what injures you  by its weight nor to carry it (burden). But rather, I (azwj) Ask you  that you  should supplicate to Me (azwj) so I (azwj) will Answer you , and that Ask from Me (azwj) so I (azwj) shall Give it to you , and that to come near to Me (azwj) by what you  have taken from Me (azwj) of its interpretation, and to Me (azwj) is the completion of its Revelation. O Musa ! Look towards the earth, for very soon it shall be your  grave, and raise your  eyes towards the sky for it is above you  and in it are great Angels, and weep upon yourself  for as long as you  are in the world, and fear the perishable and the destruction, and do not be deceived by the adornments of the world and its flowers, and do not be pleased with the injustice, and do not become an unjust one for I (azwj) Hold the oppressor to Account until I (azwj) Get justice from him for the oppressed one. O Musa ! The good deeds are Rewarded tenfold but there is single punishment for a sin even one is so severe. Do not Associate (anyone) with Me (azwj), it is not Permissible for you that you  should Associate with Me (azwj). Come nearer and be steadfast, and supplicate like the supplication of the greedy one greedy for what is in My (azwj) Possession, and regretful over what he has sent by what his hands (had earned) before. Just as the blackness of the night obliterates the day, and similarly the sins obliterate the good deeds, and the darkness of the night comes over the whiteness of the day, and similarly the sins come over the outstanding sins and blacken them (further)’.",
                    "href": "https://thaqalayn.net/hadith/8/1/8/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "مرفوع مجهول موقوف",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15 / 91)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "21": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: The Sermon of ‘Amir al-Mu’minin, Ali, ‘Alayhi al-Salam",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ إِبْرَاهِيمَ بْنِ عُثْمَانَ عَنْ سُلَيْمِ بْنِ قَيْسٍ الْهِلَالِيِّ قَالَ خَطَبَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فَحَمِدَ اللَّهَ وَ أَثْنَى عَلَيْهِ ثُمَّ صَلَّى عَلَى النَّبِيِّ ( صلى الله عليه وآله ) ثُمَّ قَالَ أَلَا إِنَّ أَخْوَفَ مَا أَخَافُ عَلَيْكُمْ خَلَّتَانِ اتِّبَاعُ الْهَوَى وَ طُولُ الْأَمَلِ أَمَّا اتِّبَاعُ الْهَوَى فَيَصُدُّ عَنِ الْحَقِّ وَ أَمَّا طُولُ الْأَمَلِ فَيُنْسِي الْآخِرَةَ أَلَا إِنَّ الدُّنْيَا قَدْ تَرَحَّلَتْ مُدْبِرَةً وَ إِنَّ الْآخِرَةَ قَدْ تَرَحَّلَتْ مُقْبِلَةً وَ لِكُلِّ وَاحِدَةٍ بَنُونَ فَكُونُوا مِنْ أَبْنَاءِ الْآخِرَةِ وَ لَا تَكُونُوا مِنْ أَبْنَاءِ الدُّنْيَا فَإِنَّ الْيَوْمَ عَمَلٌ وَ لَا حِسَابَ وَ إِنَّ غَداً حِسَابٌ وَ لَا عَمَلَ وَ إِنَّمَا بَدْءُ وُقُوعِ الْفِتَنِ مِنْ أَهْوَاءٍ تُتَّبَعُ وَ أَحْكَامٍ تُبْتَدَعُ يُخَالَفُ فِيهَا حُكْمُ اللَّهِ يَتَوَلَّى فِيهَا رِجَالٌ رِجَالًا أَلَا إِنَّ الْحَقَّ لَوْ خَلَصَ لَمْ يَكُنِ اخْتِلَافٌ وَ لَوْ أَنَّ الْبَاطِلَ خَلَصَ لَمْ يُخَفْ عَلَى ذِي حِجًى لَكِنَّهُ يُؤْخَذُ مِنْ هَذَا ضِغْثٌ وَ مِنْ هَذَا ضِغْثٌ فَيُمْزَجَانِ فَيُجَلَّلَانِ مَعاً فَهُنَالِكَ يَسْتَوْلِي الشَّيْطَانُ عَلَى أَوْلِيَائِهِ وَ نَجَا الَّذِينَ سَبَقَتْ لَهُمْ مِنَ اللَّهِ الْحُسْنَى إِنِّي سَمِعْتُ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) يَقُولُ كَيْفَ أَنْتُمْ إِذَا لَبَسَتْكُمْ فِتْنَةٌ يَرْبُو فِيهَا الصَّغِيرُ وَ يَهْرَمُ فِيهَا الْكَبِيرُ يَجْرِي النَّاسُ عَلَيْهَا وَ يَتَّخِذُونَهَا سُنَّةً فَإِذَا غُيِّرَ مِنْهَا شَيْ‏ءٌ قِيلَ قَدْ غُيِّرَتِ السُّنَّةُ وَ قَدْ أَتَى النَّاسُ مُنْكَراً ثُمَّ تَشْتَدُّ الْبَلِيَّةُ وَ تُسْبَى الذُّرِّيَّةُ وَ تَدُقُّهُمُ الْفِتْنَةُ كَمَا تَدُقُّ النَّارُ الْحَطَبَ وَ كَمَا تَدُقُّ الرَّحَى بِثِفَالِهَا وَ يَتَفَقَّهُونَ لِغَيْرِ اللَّهِ وَ يَتَعَلَّمُونَ لِغَيْرِ الْعَمَلِ وَ يَطْلُبُونَ الدُّنْيَا بِأَعْمَالِ الْآخِرَةِ ثُمَّ أَقْبَلَ بِوَجْهِهِ وَ حَوْلَهُ نَاسٌ مِنْ أَهْلِ بَيْتِهِ وَ خَاصَّتِهِ وَ شِيعَتِهِ فَقَالَ قَدْ عَمِلَتِ الْوُلَاةُ قَبْلِي أَعْمَالًا خَالَفُوا فِيهَا رَسُولَ اللَّهِ ( صلى الله عليه وآله ) مُتَعَمِّدِينَ لِخِلَافِهِ نَاقِضِينَ لِعَهْدِهِ مُغَيِّرِينِ لِسُنَّتِهِ وَ لَوْ حَمَلْتُ النَّاسَ عَلَى تَرْكِهَا وَ حَوَّلْتُهَا إِلَى مَوَاضِعِهَا وَ إِلَى مَا كَانَتْ فِي عَهْدِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) لَتَفَرَّقَ عَنِّي جُنْدِي حَتَّى أَبْقَى وَحْدِي أَوْ قَلِيلٌ مِنْ شِيعَتِيَ الَّذِينَ عَرَفُوا فَضْلِي وَ فَرْضَ إِمَامَتِي مِنْ كِتَابِ اللَّهِ عَزَّ وَ جَلَّ وَ سُنَّةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) أَ رَأَيْتُمْ لَوْ أَمَرْتُ بِمَقَامِ إِبْرَاهِيمَ ( عليه السلام ) فَرَدَدْتُهُ إِلَى الْمَوْضِعِ الَّذِي وَضَعَهُ فِيهِ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ رَدَدْتُ فَدَكاً إِلَى وَرَثَةِ فَاطِمَةَ ( عليها السلام ) وَ رَدَدْتُ صَاعَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) كَمَا كَانَ وَ أَمْضَيْتُ قَطَائِعَ أَقْطَعَهَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِأَقْوَامٍ لَمْ تُمْضَ لَهُمْ وَ لَمْ تُنْفَذْ وَ رَدَدْتُ دَارَ جَعْفَرٍ إِلَى وَرَثَتِهِ وَ هَدَمْتُهَا مِنَ الْمَسْجِدِ وَ رَدَدْتُ قَضَايَا مِنَ الْجَوْرِ قُضِيَ بِهَا وَ نَزَعْتُ نِسَاءً تَحْتَ رِجَالٍ بِغَيْرِ حَقٍّ فَرَدَدْتُهُنَّ إِلَى أَزْوَاجِهِنَّ وَ اسْتَقْبَلْتُ بِهِنَّ الْحُكْمَ فِي الْفُرُوجِ وَ الْأَحْكَامِ وَ سَبَيْتُ ذَرَارِيَّ بَنِي تَغْلِبَ وَ رَدَدْتُ مَا قُسِمَ مِنْ أَرْضِ خَيْبَرَ وَ مَحَوْتُ دَوَاوِينَ الْعَطَايَا وَ أَعْطَيْتُ كَمَا كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يُعْطِي بِالسَّوِيَّةِ وَ لَمْ أَجْعَلْهَا دُولَةً بَيْنَ الْأَغْنِيَاءِ وَ أَلْقَيْتُ الْمَسَاحَةَ وَ سَوَّيْتُ بَيْنَ الْمَنَاكِحِ وَ أَنْفَذْتُ خُمُسَ الرَّسُولِ كَمَا أَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ وَ فَرَضَهُ وَ رَدَدْتُ مَسْجِدَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) إِلَى مَا كَانَ عَلَيْهِ وَ سَدَدْتُ مَا فُتِحَ فِيهِ مِنَ الْأَبْوَابِ وَ فَتَحْتُ مَا سُدَّ مِنْهُ وَ حَرَّمْتُ الْمَسْحَ عَلَى الْخُفَّيْنِ وَ حَدَدْتُ عَلَى النَّبِيذِ وَ أَمَرْتُ بِإِحْلَالِ الْمُتْعَتَيْنِ وَ أَمَرْتُ بِالتَّكْبِيرِ عَلَى الْجَنَائِزِ خَمْسَ تَكْبِيرَاتٍ وَ أَلْزَمْتُ النَّاسَ الْجَهْرَ بِبِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ وَ أَخْرَجْتُ مَنْ أُدْخِلَ مَعَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فِي مَسْجِدِهِ مِمَّنْ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَخْرَجَهُ وَ أَدْخَلْتُ مَنْ أُخْرِجَ بَعْدَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) مِمَّنْ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَدْخَلَهُ وَ حَمَلْتُ النَّاسَ عَلَى حُكْمِ الْقُرْآنِ وَ عَلَى الطَّلَاقِ عَلَى السُّنَّةِ وَ أَخَذْتُ الصَّدَقَاتِ عَلَى أَصْنَافِهَا وَ حُدُودِهَا وَ رَدَدْتُ الْوُضُوءَ وَ الْغُسْلَ وَ الصَّلَاةَ إِلَى مَوَاقِيتِهَا وَ شَرَائِعِهَا وَ مَوَاضِعِهَا وَ رَدَدْتُ أَهْلَ نَجْرَانَ إِلَى مَوَاضِعِهِمْ وَ رَدَدْتُ سَبَايَا فَارِسَ وَ سَائِرِ الْأُمَمِ إِلَى كِتَابِ اللَّهِ وَ سُنَّةِ نَبِيِّهِ ( صلى الله عليه وآله ) إِذاً لَتَفَرَّقُوا عَنِّي وَ اللَّهِ لَقَدْ أَمَرْتُ النَّاسَ أَنْ لَا يَجْتَمِعُوا فِي شَهْرِ رَمَضَانَ إِلَّا فِي فَرِيضَةٍ وَ أَعْلَمْتُهُمْ أَنَّ اجْتِمَاعَهُمْ فِي النَّوَافِلِ بِدْعَةٌ فَتَنَادَى بَعْضُ أَهْلِ عَسْكَرِي مِمَّنْ يُقَاتِلُ مَعِي يَا أَهْلَ الْإِسْلَامِ غُيِّرَتْ سُنَّةُ عُمَرَ يَنْهَانَا عَنِ الصَّلَاةِ فِي شَهْرِ رَمَضَانَ تَطَوُّعاً وَ لَقَدْ خِفْتُ أَنْ يَثُورُوا فِي نَاحِيَةِ جَانِبِ عَسْكَرِي مَا لَقِيتُ مِنْ هَذِهِ الْأُمَّةِ مِنَ الْفُرْقَةِ وَ طَاعَةِ أَئِمَّةِ الضَّلَالَةِ وَ الدُّعَاةِ إِلَى النَّارِ وَ أَعْطَيْتُ مِنْ ذَلِكَ سَهْمَ ذِي الْقُرْبَى الَّذِي قَالَ اللَّهُ عَزَّ وَ جَلَّ إِنْ كُنْتُمْ آمَنْتُمْ بِاللَّهِ وَ ما أَنْزَلْنا عَلى عَبْدِنا يَوْمَ الْفُرْقانِ يَوْمَ الْتَقَى الْجَمْعانِ فَنَحْنُ وَ اللَّهِ عَنَى بِذِي الْقُرْبَى الَّذِي قَرَنَنَا اللَّهُ بِنَفْسِهِ وَ بِرَسُولِهِ ( صلى الله عليه وآله ) فَقَالَ تَعَالَى فَلِلَّهِ وَ لِلرَّسُولِ وَ لِذِي الْقُرْبى وَ الْيَتامى وَ الْمَساكِينِ وَ ابْنِ السَّبِيلِ فِينَا خَاصَّةً كَيْ لا يَكُونَ دُولَةً بَيْنَ الْأَغْنِياءِ مِنْكُمْ وَ ما آتاكُمُ الرَّسُولُ فَخُذُوهُ وَ ما نَهاكُمْ عَنْهُ فَانْتَهُوا وَ اتَّقُوا اللَّهَ فِي ظُلْمِ آلِ مُحَمَّدٍ إِنَّ اللَّهَ شَدِيدُ الْعِقابِ لِمَنْ ظَلَمَهُمْ رَحْمَةً مِنْهُ لَنَا وَ غِنًى أَغْنَانَا اللَّهُ بِهِ وَ وَصَّى بِهِ نَبِيَّهُ ( صلى الله عليه وآله ) وَ لَمْ يَجْعَلْ لَنَا فِي سَهْمِ الصَّدَقَةِ نَصِيباً أَكْرَمَ اللَّهُ رَسُولَهُ ( صلى الله عليه وآله ) وَ أَكْرَمَنَا أَهْلَ الْبَيْتِ أَنْ يُطْعِمَنَا مِنْ أَوْسَاخِ النَّاسِ فَكَذَّبُوا اللَّهَ وَ كَذَّبُوا رَسُولَهُ وَ جَحَدُوا كِتَابَ اللَّهِ النَّاطِقَ بِحَقِّنَا وَ مَنَعُونَا فَرْضاً فَرَضَهُ اللَّهُ لَنَا مَا لَقِيَ أَهْلُ بَيْتِ نَبِيٍّ مِنْ أُمَّتِهِ مَا لَقِينَا بَعْدَ نَبِيِّنَا ( صلى الله عليه وآله ) وَ اللَّهُ الْمُسْتَعَانُ عَلَى مَنْ ظَلَمَنَا وَ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ .",
                    "englishText": "21. Ali Bin Ibrahim, from his father, from Hamaad Bin Isa, from Ibrahim Bin Usman, from Sulaym Bin Qays Al-Hilaly who said: ‘Amir-ul-Momineen  preached, so he  Praised Allah (azwj) and Extolled Him (azwj), then sent greetings of peace ‘Salam’ upon the Prophet ﷺ, then said: ‘Indeed! From the fears what I  fear for you are two categories – following of desires and long hopes. As for the following of desires, so it will sway you away from the truth, and as for the long hopes, so they will make you forget the Hereafter. Indeed! The world has moved backwards (away from you) and that the Hereafter has moved forward (towards you), and for each of these are sons. So become from the sons of the Hereafter and do not become from the sons of the world, for today is the day of the deeds and there is no Reckoning, but tomorrow is the (day of) Reckoning and no (room to perform) deeds. However, the commencement of the strife ‘Fitna’ occurs from the following of desires, and (the man made) rules are followed in opposition to the Commands of Allah (azwj), so that a man would rule over a man (using these rules). Indeed! Surely the truth, had it been pure, there would have been no differing, and had the falsehood been pure, there would have been no fear about the one with the proof, but they take a fistful from this and a fistful from this, so they are mixed together. So that is where the Satan (la) rules over his (la) friends, and the ones for whom goodness has preceded from Allah (azwj) escape from this. I  heard the Messenger ﷺ of Allah (azwj) saying: ‘How will your condition be when you are clothed in ‘Fitna’ (strife) in which the young ones will grow older while the adults would become elderly. The people will flow towards it (fitna) and take it as a Sunnah. So if something is altered therein, they will say, ‘The Sunnah has been altered’, and the people would have become deniers. Then the affliction would intensify, and the offspring would become captivated and the ‘Fitna’ (strife) would consume them just as the fire consumes the firewood, or just as the millstone grinds upon its lower base. And they would learn the Laws for the sake of other than Allah (azwj), and they would learn for the sake of other than doing good deeds, and they will be coveting the world instead of working for the Hereafter. Then he  turned his  face towards those from his  family and his  special ones and his  Shiites who were around him , so he  said: ‘The rulers before me  acted in opposition to the Messenger ﷺ of Allah (azwj) deliberately breaching the Covenant with him ﷺ and altering his ﷺ Sunnah. And if I  had burdened the people on avoiding it, and turned it back to its place and to what is used to be in the era of the Messenger ﷺ of Allah (azwj), my  army would disperse from me  to the extent that there would remain only myself  or a few from my  Shiites who recognise my  ‘Fazilat’ (virtues). And my  Imamate has been Obligated from the Book of Allah (azwj) Mighty and Majestic, and the Sunnah of the Messenger ﷺ of Allah (azwj). Consider (what would happen) if I  were to order for the Maqaam e Ibrahim  to be returned to its place where it was placed by the Messenger ﷺ of Allah (azwj), and returned the (plantation of) Fadak to the inheritors of Fatima , and returned to the ‘Sa’a’ (unit of measurement) to just as it was before, and execute the treaties which were made by the Messenger ﷺ of Allah (azwj) for the people, which were never executed nor were those ever established, And return the house of Ja’far  to his  inheritors, and demolish it from the Masjid, and rescind the inequitable Judgements which were judged and remove the women who are under (married to) certain men without right and return them back to their husbands, and issue the order regarding the matrimony, and the orders regarding the captives of the Clan of Taghlub, and return what was distributed from the land of Khyber, and erase the register of gifts and give it out as the Messenger ﷺ of Allah (azwj) used to give it out in an equitable manner and not make it to be distributed between the rich, and drop Al-Musahaat (currency), and equalise between the marriages, and enforce the Khums of the Messenger ﷺ just as it had been Commanded by Allah (azwj) Mighty and Majestic and make it to be obligatory, And return the Masjid of the Messenger ﷺ of Allah (azwj) to what it used to be, and shut what was in it from the doors, and open what has been closed in it, and prohibit the wiping (Masaah) upon the socks, and enforce the punishment upon the partaking of Al-Nabeedh (intoxicant), and make the two Mu’tah’s to be permissible, and order for the Takbeer over the dead body as five Takbeers, and necessitate the people to recite ‘In the Name of Allah (azwj) the Beneficent the Merciful’ aloud (in the Prayer), and throw out the one who has been included with the Messenger ﷺ of Allah (azwj) in his ﷺ Masjid the one whom the Messenger ﷺ of Allah (azwj) had thrown out, and enter the one who had been thrown out after the Messenger ﷺ of Allah (azwj) whom the Messenger ﷺ of Allah (azwj) had included, And burden the people to the Commands of the Quran and upon the divorce to be in accordance with the Sunnah, and take the charities upon its types and its limits, and return the ablution and the (major) ablution and the Prayer to its prescribed times, and its laws and its places, and return the people of Najraan to their own places, and return the Persian captives, and the rest of the community to the Book of Allah (azwj) and the Sunnah of its Prophet ﷺ. By Allah (azwj), they would disperse from me  if I  were to order the people not to gather in the Month of Ramadhan except for the obligatory (Prayers) and make it known to them that their gathering for the optional Prayers (Nawaafil) is an innovation. So some of the people in my  army would call out to the ones who are fighting alongside me , ‘O people of Al-Islam! The Sunnah of Umar has been changed. He  is preventing us from the optional Prayer in the Month of Ramadhan, and I  had feared that there would be a revolt in a section of my  army. What will be meted out from this community from the sectarianism and the obedience to the imams of the misguidance and their calling to the Fire if I  were to give out from that the share of the near relatives about which Allah (azwj) Mighty and Majestic has Said: “[8:41] if you believe in Allah and in that which We revealed to Our servant, on the day of distinction, the day on which the two parties met”. So we  are the ones Meant by the near relatives whom Allah (azwj) has Joined with Himself (azwj) and with His (azwj) Messenger ﷺ. So the High Said: “[59:7] it is for Allah and for the Messenger, and for the near of kin and the orphans and the needy and the wayfarer, so that it may not be a thing taken by turns among the rich of you, and whatever the Messenger gives you, accept it, and from whatever he forbids you, keep back and be careful of Allah (of being unjust to the Progeny  of Muhammad ﷺ); surely Allah is severe in retributing (evil)” to the one who is unjust to them . (This is) a Mercy from Him (azwj) to us  and a self-sufficiency by which Allah (azwj) has Made us  to be self-sufficient with. And He (azwj) Bequeathed for it to His (azwj) Prophet ﷺ and did not Make for us  a share in the charity. Allah (azwj) Honoured His (azwj) Messenger ﷺ and Honoured us  the People  of the Household, that He (azwj) should Feed us  from the dirt of the people (charity). They belied Allah (azwj), and belied His (azwj) Messenger ﷺ and fought against the Book of Allah (azwj) which Speaks of our  rights, and prevented from us  the obligation which Allah (azwj) has Obligated for us . What has been meted out to us  after our  Prophet ﷺ, and Allah (azwj) is the Helper against the one who is unjust to us , and there is no Might and no Power except by Allah (azwj) the High, the Magnificent’.",
                    "href": "https://thaqalayn.net/hadith/8/1/21/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "ضعيف على الشهور معتب عند ي",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15 / 130)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "32": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: The excellence of the Shi’ah",
                    "arabicText": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ مُيَسِّرٍ قَالَ دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ كَيْفَ أَصْحَابُكَ فَقُلْتُ جُعِلْتُ فِدَاكَ لَنَحْنُ عِنْدَهُمْ أَشَرُّ مِنَ الْيَهُودِ وَ النَّصَارَى وَ الْمَجُوسِ وَ الَّذِينَ أَشْرَكُوا قَالَ وَ كَانَ مُتَّكِئاً فَاسْتَوَى جَالِساً ثُمَّ قَالَ كَيْفَ قُلْتَ قُلْتُ وَ اللَّهِ لَنَحْنُ عِنْدَهُمْ أَشَرُّ مِنَ الْيَهُودِ وَ النَّصَارَى وَ الْمَجُوسِ وَ الَّذِينَ أَشْرَكُوا فَقَالَ أَمَا وَ اللَّهِ لَا تَدْخُلُ النَّارَ مِنْكُمُ اثْنَانِ لَا وَ اللَّهِ وَ لَا وَاحِدٌ وَ اللَّهِ إِنَّكُمُ الَّذِينَ قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ قالُوا ما لَنا لا نَرى رِجالًا كُنَّا نَعُدُّهُمْ مِنَ الْأَشْرارِ أَتَّخَذْناهُمْ سِخْرِيًّا أَمْ زاغَتْ عَنْهُمُ الْأَبْصارُ إِنَّ ذلِكَ لَحَقٌّ تَخاصُمُ أَهْلِ النَّارِ ثُمَّ قَالَ طَلَبُوكُمْ وَ اللَّهِ فِي النَّارِ فَمَا وَجَدُوا مِنْكُمْ أَحَداً",
                    "englishText": "32. Ali Bin Muhammad, from Ahmad Bin Abu Abdullah, from Usman Bin Isa, from Muyassar who said: ‘I came up to Abu Abdullah . He  said: ‘How are your companions?’ So I said, ‘May I be sacrificed for you , we (Shiites) are more evil in the people’s eyes than the Jews, and the Christians, and the Magians, and those who associate (Mushriqeen)’. He (the narrator) said, ‘He  had been leaning upon a pillow, so he  sat up straight, then said: ‘How did you say that which you said?’ I said, ‘By Allah (azwj), we (Shiites) are (considered to be) the most evil ones among them, more so than the Jews and the Christians, and the Magians, and those that associate (Mushriqeen)’. He  said: ‘But, by Allah (azwj), no two of you will enter the Fire. No, by Allah (azwj), not even one. By Allah (azwj), you (Shiites) are the ones about whom Allah (azwj) Mighty and Majestic has Said: “[38:62] And they shall say: What is the matter with us that we do not see men whom we used to count among the evil? [38:63] Was it that we (only) took them in scorn, or have our eyes (now) turned aside from them? [38:64] That most surely is the truth: the contending one with another of the inmates of the fire”. Then he  said: ‘By Allah (azwj), they will be seeking you in the Fire, so they will not find even one of you therein’.",
                    "href": "https://thaqalayn.net/hadith/8/1/32/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "موثق على الظاهر",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15  / 179)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "65": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Cure for anxiety, sadness, poverty, and illness",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) مَنْ ظَهَرَتْ عَلَيْهِ النِّعْمَةُ فَلْيُكْثِرْ ذِكْرَ الْحَمْدُ لِلَّهِ وَ مَنْ كَثُرَتْ هُمُومُهُ فَعَلَيْهِ بِالِاسْتِغْفَارِ وَ مَنْ أَلَحَّ عَلَيْهِ الْفَقْرُ فَلْيُكْثِرْ مِنْ قَوْلِ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ يَنْفِي عَنْهُ الْفَقْرَ وَ قَالَ فَقَدَ النَّبِيُّ (صلى الله عليه وآله) رَجُلًا مِنَ الْأَنْصَارِ فَقَالَ مَا غَيَّبَكَ عَنَّا فَقَالَ الْفَقْرُ يَا رَسُولَ اللَّهِ وَ طُولُ السُّقْمِ فَقَالَ لَهُ رَسُولُ اللَّهِ (صلى الله عليه وآله) أَ لَا أُعَلِّمُكَ كَلَاماً إِذَا قُلْتَهُ ذَهَبَ عَنْكَ الْفَقْرُ وَ السُّقْمُ فَقَالَ بَلَى يَا رَسُولَ اللَّهِ فَقَالَ إِذَا أَصْبَحْتَ وَ أَمْسَيْتَ فَقُلْ لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ [الْعَلِيِّ الْعَظِيمِ] تَوَكَّلْتُ عَلَى الْحَيِّ الَّذِي لَا يَمُوتُ وَ الْحَمْدُ لِلَّهِ الَّذِي لَمْ يَتَّخِذْ وَلَداً وَ لَمْ يَكُنْ لَهُ شَرِيكٌ فِي الْمُلْكِ وَ لَمْ يَكُنْ لَهُ وَلِيٌّ مِنَ الذُّلِّ وَ كَبِّرْهُ تَكْبِيراً فَقَالَ الرَّجُلُ فَوَ اللَّهِ مَا قُلْتُهُ إِلَّا ثَلَاثَةَ أَيَّامٍ حَتَّى ذَهَبَ عَنِّي الْفَقْرُ وَ السُّقْمُ. لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ [الْعَلِيِّ الْعَظِيمِ] تَوَكَّلْتُ عَلَى الْحَيِّ الَّذِي لَا يَمُوتُ وَ الْحَمْدُ لِلَّهِ الَّذِي لَمْ يَتَّخِذْ وَلَداً وَ لَمْ يَكُنْ لَهُ شَرِيكٌ فِي الْمُلْكِ وَ لَمْ يَكُنْ لَهُ وَلِيٌّ مِنَ الذُّلِّ وَ كَبِّرْهُ تَكْبِيراً فَقَالَ الرَّجُلُ فَوَ اللَّهِ مَا قُلْتُهُ",
                    "englishText": "65. Ali Bin Ibrahim, from his father, from Al-Nawfaly, from Al-Sakuny, who has narrated the following: Abu Abdullah  has said that the Rasool ﷺ Allah (azwj) said; ‘For whom the Blessings appear should frequently mention ‘الْحَمْدُ لِلَّهِ’ ‘Praise be to Allah (azwj)’, and the one who has numerous worries so for him is ‘بِالِاسْتِغْفَارِ’ to seek Forgiveness, and the one who is pressed by the poverty should frequently say ‘لَا حَوْلَ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ’ ‘There is no Power and no Might except by Allah (azwj) the High the Magnificent, the poverty would be negated from him’. And he  said: ‘The Prophet ﷺ missed a man from the Helpers so he ﷺ said to him: ‘What is the reason for your absence?’ He said, ‘The poverty, O Rasool ﷺ Allah (azwj), and the lengthy illness’. So he ﷺ said to him: ‘Shall I ﷺ teach you certain words, if you were to recite these, the poverty would go away from you, as well as the illness?’ He said, ‘Yes, O Rasool ﷺ Allah (azwj)’. So he ﷺ said: ‘When it is the morning and evening, say: ‘There is no Power and no Might except by Allah (azwj), the High, the Magnificent. I hereby rely upon the Alive Who does not die, and Praise be to Allah (azwj) Who never Took for Himself (azwj) a son, and there never was for Him (azwj) an associate in the Kingdom, and will not be for Him (azwj) a guardian from the humiliation, and Great is His (azwj) Greatness’. So the man said, ‘By Allah (azwj), I had not recited it except for three days, and the poverty and the illness went away from me’.",
                    "href": "https://thaqalayn.net/hadith/8/1/65/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "ضعيف على الشهور",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15 / 221)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "81": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Is perfection in good food and body?",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ يُونُسَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) لِعَبَّادِ بْنِ كَثِيرٍ الْبَصْرِيِّ الصُّوفِيِّ وَيْحَكَ يَا عَبَّادُ غَرَّكَ أَنْ عَفَّ بَطْنُكَ وَ فَرْجُكَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ فِي كِتَابِهِ يا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَ قُولُوا قَوْلًا سَدِيداً يُصْلِحْ لَكُمْ أَعْمالَكُمْ اعْلَمْ أَنَّهُ لَا يَتَقَبَّلُ اللَّهُ مِنْكَ شَيْئاً حَتَّى تَقُولَ قَوْلًا عَدْلًا.",
                    "englishText": "81. Ali Bin Ibrahim, from Muhammad Bin Isa Bin Ubeyd, from Yunus who said: Abu Abdullah  said to Abbaad Bin Kaseer Al-Basry Al-Soufy: ‘Woe be unto you, O Abbaad! You have been deceived yourself by (merely) abstaining from your stomach and your genitals. Allah (azwj) Mighty and Majestic has Said: “[33:70] O you who believe! be careful of (your duty to) Allah and speak the right word [33:71] He will put your deeds into a right state for you”. You must realise that Allah (azwj) will not Accept from you anything until you speak the truth and just word (do not only rely on the meditation but accept the truth, the Wilayah of Amimah )’.",
                    "href": "https://thaqalayn.net/hadith/8/1/81/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "صحيح ظاهرا",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15 / 260)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "95": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Hadith of Abu al-Hassan Musa, 'Alayhim al-Salam to Ali ibn Suwayd",
                    "arabicText": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ مُحَمَّدِ بْنِ مَنْصُورٍ الْخُزَاعِيِّ عَنْ عَلِيِّ بْنِ سُوَيْدٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ عَمِّهِ حَمْزَةَ بْنِ بَزِيعٍ عَنْ عَلِيِّ بْنِ سُوَيْدٍ وَ الْحَسَنُ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ النَّهْدِيِّ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ مُحَمَّدِ بْنِ مَنْصُورٍ عَنْ عَلِيِّ بْنِ سُوَيْدٍ قَالَ كَتَبْتُ إِلَى أَبِي الْحَسَنِ مُوسَى ( عليه السلام ) وَ هُوَ فِي الْحَبْسِ كِتَاباً أَسْأَلُهُ عَنْ حَالِهِ وَ عَنْ مَسَائِلَ كَثِيرَةٍ فَاحْتَبَسَ الْجَوَابُ عَلَيَّ أَشْهُراً ثُمَّ أَجَابَنِي بِجَوَابٍ هَذِهِ نُسْخَتُهُ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ الْحَمْدُ لِلَّهِ الْعَلِيِّ الْعَظِيمِ الَّذِي بِعَظَمَتِهِ وَ نُورِهِ أَبْصَرَ قُلُوبَ الْمُؤْمِنِينَ وَ بِعَظَمَتِهِ وَ نُورِهِ عَادَاهُ الْجَاهِلُونَ وَ بِعَظَمَتِهِ وَ نُورِهِ ابْتَغَى مَنْ فِي السَّمَاوَاتِ وَ مَنْ فِي الْأَرْضِ إِلَيْهِ الْوَسِيلَةَ بِالْأَعْمَالِ الْمُخْتَلِفَةِ وَ الْأَدْيَانِ الْمُتَضَادَّةِ فَمُصِيبٌ وَ مُخْطِئٌ وَ ضَالٌّ وَ مُهْتَدٍ وَ سَمِيعٌ وَ أَصَمُّ وَ بَصِيرٌ وَ أَعْمَى حَيْرَانُ فَالْحَمْدُ لِلَّهِ الَّذِي عَرَفَ وَ وَصَفَ دِينَهُ مُحَمَّدٌ (صلى الله عليه وآله) أَمَّا بَعْدُ فَإِنَّكَ امْرُؤٌ أَنْزَلَكَ اللَّهُ مِنْ آلِ مُحَمَّدٍ بِمَنْزِلَةٍ خَاصَّةٍ وَ حَفِظَ مَوَدَّةَ مَا اسْتَرْعَاكَ مِنْ دِينِهِ وَ مَا أَلْهَمَكَ مِنْ رُشْدِكَ وَ بَصَّرَكَ مِنْ أَمْرِ دِينِكَ بِتَفْضِيلِكَ إِيَّاهُمْ وَ بِرَدِّكَ الْأُمُورَ إِلَيْهِمْ كَتَبْتَ تَسْأَلُنِي عَنْ أُمُورٍ كُنْتُ مِنْهَا فِي تَقِيَّةٍ وَ مِنْ كِتْمَانِهَا فِي سَعَةٍ فَلَمَّا انْقَضَى سُلْطَانُ الْجَبَابِرَةِ وَ جَاءَ سُلْطَانُ ذِي السُّلْطَانِ الْعَظِيمِ بِفِرَاقِ الدُّنْيَا الْمَذْمُومَةِ إِلَى أَهْلِهَا الْعُتَاةِ عَلَى خَالِقِهِمْ رَأَيْتُ أَنْ أُفَسِّرَ لَكَ مَا سَأَلْتَنِي عَنْهُ مَخَافَةَ أَنْ يَدْخُلَ الْحَيْرَةُ عَلَى ضُعَفَاءِ شِيعَتِنَا مِنْ قِبَلِ جَهَالَتِهِمْ فَاتَّقِ اللَّهَ عَزَّ ذِكْرُهُ وَ خُصَّ لِذَلِكَ الْأَمْرِ أَهْلَهُ وَ احْذَرْ أَنْ تَكُونَ سَبَبَ بَلِيَّةٍ عَلَى الْأَوْصِيَاءِ أَوْ حَارِشاً عَلَيْهِمْ بِإِفْشَاءِ مَا اسْتَوْدَعْتُكَ وَ إِظْهَارِ مَا اسْتَكْتَمْتُكَ وَ لَنْ تَفْعَلَ إِنْ شَاءَ اللَّهُ إِنَّ أَوَّلَ مَا أُنْهِي إِلَيْكَ أَنِّي أَنْعَى إِلَيْكَ نَفْسِي فِي لَيَالِيَّ هَذِهِ غَيْرَ جَازِعٍ وَ لَا نَادِمٍ وَ لَا شَاكٍّ فِيمَا هُوَ كَائِنٌ مِمَّا قَدْ قَضَى اللَّهُ عَزَّ وَ جَلَّ وَ حَتَمَ فَاسْتَمْسِكْ بِعُرْوَةِ الدِّينِ آلِ مُحَمَّدٍ وَ الْعُرْوَةِ الْوُثْقَى الْوَصِيِّ بَعْدَ الْوَصِيِّ وَ الْمُسَالَمَةِ لَهُمْ وَ الرِّضَا بِمَا قَالُوا وَ لَا تَلْتَمِسْ دِينَ مَنْ لَيْسَ مِنْ شِيعَتِكَ وَ لَا تُحِبَّنَّ دِينَهُمْ فَإِنَّهُمُ الْخَائِنُونَ الَّذِينَ خَانُوا اللَّهَ وَ رَسُولَهُ وَ خَانُوا أَمَانَاتِهِمْ وَ تَدْرِي مَا خَانُوا أَمَانَاتِهِمُ ائْتُمِنُوا عَلَى كِتَابِ اللَّهِ فَحَرَّفُوهُ وَ بَدَّلُوهُ وَ دُلُّوا عَلَى وُلَاةِ الْأَمْرِ مِنْهُمْ فَانْصَرَفُوا عَنْهُمْ فَأَذَاقَهُمُ اللَّهُ لِبَاسَ الْجُوعِ وَ الْخَوْفِ بِمَا كَانُوا يَصْنَعُونَ وَ سَأَلْتَ عَنْ رَجُلَيْنِ اغْتَصَبَا رَجُلًا مَالًا كَانَ يُنْفِقُهُ عَلَى الْفُقَرَاءِ وَ الْمَسَاكِينِ وَ أَبْنَاءِ السَّبِيلِ وَ فِي سَبِيلِ اللَّهِ فَلَمَّا اغْتَصَبَاهُ ذَلِكَ لَمْ يَرْضَيَا حَيْثُ غَصَبَاهُ حَتَّى حَمَّلَاهُ إِيَّاهُ كُرْهاً فَوْقَ رَقَبَتِهِ إِلَى مَنَازِلِهِمَا فَلَمَّا أَحْرَزَاهُ تَوَلَّيَا إِنْفَاقَهُ أَ يَبْلُغَانِ بِذَلِكَ كُفْراً فَلَعَمْرِي لَقَدْ نَافَقَا قَبْلَ ذَلِكَ وَ رَدَّا عَلَى اللَّهِ عَزَّ وَ جَلَّ كَلَامَهُ وَ هَزِئَا بِرَسُولِهِ ( صلى الله عليه وآله ) وَ هُمَا الْكَافِرَانِ عَلَيْهِمَا لَعْنَةُ اللَّهِ وَ الْمَلَائِكَةِ وَ النَّاسِ أَجْمَعِينَ وَ اللَّهِ مَا دَخَلَ قَلْبَ أَحَدٍ مِنْهُمَا شَيْ‏ءٌ مِنَ الْإِيمَانِ مُنْذُ خُرُوجِهِمَا مِنْ حَالَتَيْهِمَا وَ مَا ازْدَادَا إِلَّا شَكّاً كَانَا خَدَّاعَيْنِ مُرْتَابَيْنِ مُنَافِقَيْنِ حَتَّى تَوَفَّتْهُمَا مَلَائِكَةُ الْعَذَابِ إِلَى مَحَلِّ الْخِزْيِ فِي دَارِ الْمُقَامِ وَ سَأَلْتَ عَمَّنْ حَضَرَ ذَلِكَ الرَّجُلَ وَ هُوَ يُغْصَبُ مَالُهُ وَ يُوضَعُ عَلَى رَقَبَتِهِ مِنْهُمْ عَارِفٌ وَ مُنْكِرٌ فَأُولَئِكَ أَهْلُ الرَّدَّةِ الْأُولَى مِنْ هَذِهِ الْأُمَّةِ فَعَلَيْهِمْ لَعْنَةُ اللَّهِ وَ الْمَلَائِكَةِ وَ النَّاسِ أَجْمَعِينَ وَ سَأَلْتَ عَنْ مَبْلَغِ عِلْمِنَا وَ هُوَ عَلَى ثَلَاثَةِ وُجُوهٍ مَاضٍ وَ غَابِرٌ وَ حَادِثٌ فَأَمَّا الْمَاضِي فَمُفَسَّرٌ وَ أَمَّا الْغَابِرُ فَمَزْبُورٌ وَ أَمَّا الْحَادِثُ فَقَذْفٌ فِي الْقُلُوبِ وَ نَقْرٌ فِي الْأَسْمَاعِ وَ هُوَ أَفْضَلُ عِلْمِنَا وَ لَا نَبِيَّ بَعْدَ نَبِيِّنَا مُحَمَّدٍ (صلى الله عليه وآله) وَ سَأَلْتَ عَنْ أُمَّهَاتِ أَوْلَادِهِمْ وَ عَنْ نِكَاحِهِمْ وَ عَنْ طَلَاقِهِمْ فَأَمَّا أُمَّهَاتُ أَوْلَادِهِمْ فَهُنَّ عَوَاهِرُ إِلَى يَوْمِ الْقِيَامَةِ نِكَاحٌ بِغَيْرِ وَلِيٍّ وَ طَلَاقٌ فِي غَيْرِ عِدَّةٍ وَ أَمَّا مَنْ دَخَلَ فِي دَعْوَتِنَا فَقَدْ هَدَمَ إِيمَانُهُ ضَلَالَهُ وَ يَقِينُهُ شَكَّهُ وَ سَأَلْتَ عَنِ الزَّكَاةِ فِيهِمْ فَمَا كَانَ مِنَ الزَّكَاةِ فَأَنْتُمْ أَحَقُّ بِهِ لِأَنَّا قَدْ حَلَّلْنَا ذَلِكَ لَكُمْ مَنْ كَانَ مِنْكُمْ وَ أَيْنَ كَانَ وَ سَأَلْتَ عَنِ الضُّعَفَاءِ فَالضَّعِيفُ مَنْ لَمْ يُرْفَعْ إِلَيْهِ حُجَّةٌ وَ لَمْ يَعْرِفِ الِاخْتِلَافَ فَإِذَا عَرَفَ الِاخْتِلَافَ فَلَيْسَ بِضَعِيفٍ وَ سَأَلْتَ عَنِ الشَّهَادَاتِ لَهُمْ فَأَقِمِ الشَّهَادَةَ لِلَّهِ عَزَّ وَ جَلَّ وَ لَوْ عَلَى نَفْسِكَ وَ الْوَالِدَيْنِ وَ الْأَقْرَبِينَ فِيمَا بَيْنَكَ وَ بَيْنَهُمْ فَإِنْ خِفْتَ عَلَى أَخِيكَ ضَيْماً فَلَا وَ ادْعُ إِلَى شَرَائِطِ اللَّهِ عَزَّ ذِكْرُهُ بِمَعْرِفَتِنَا مَنْ رَجَوْتَ إِجَابَتَهُ وَ لَا تَحَصَّنْ بِحِصْنِ رِيَاءٍ وَ وَالِ آلَ مُحَمَّدٍ وَ لَا تَقُلْ لِمَا بَلَغَكَ عَنَّا وَ نُسِبَ إِلَيْنَا هَذَا بَاطِلٌ وَ إِنْ كُنْتَ تَعْرِفُ مِنَّا خِلَافَهُ فَإِنَّكَ لَا تَدْرِي لِمَا قُلْنَاهُ وَ عَلَى أَيِّ وَجْهٍ وَصَفْنَاهُ آمِنْ بِمَا أُخْبِرُكَ وَ لَا تُفْشِ مَا اسْتَكْتَمْنَاكَ مِنْ خَبَرِكَ إِنَّ مِنْ وَاجِبِ حَقِّ أَخِيكَ أَنْ لَا تَكْتُمَهُ شَيْئاً تَنْفَعُهُ بِهِ لِأَمْرِ دُنْيَاهُ وَ آخِرَتِهِ وَ لَا تَحْقِدَ عَلَيْهِ وَ إِنْ أَسَاءَ وَ أَجِبْ دَعْوَتَهُ إِذَا دَعَاكَ وَ لَا تُخَلِّ بَيْنَهُ وَ بَيْنَ عَدُوِّهِ مِنَ النَّاسِ وَ إِنْ كَانَ أَقْرَبَ إِلَيْهِ مِنْكَ وَ عُدْهُ فِي مَرَضِهِ لَيْسَ مِنْ أَخْلَاقِ الْمُؤْمِنِينَ الْغِشُّ وَ لَا الْأَذَى وَ لَا الْخِيَانَةُ وَ لَا الْكِبْرُ وَ لَا الْخَنَا وَ لَا الْفُحْشُ وَ لَا الْأَمْرُ بِهِ فَإِذَا رَأَيْتَ الْمُشَوَّهَ الْأَعْرَابِيَّ فِي جَحْفَلٍ جَرَّارٍ فَانْتَظِرْ فَرَجَكَ وَ لِشِيعَتِكَ الْمُؤْمِنِينَ وَ إِذَا انْكَسَفَتِ الشَّمْسُ فَارْفَعْ بَصَرَكَ إِلَى السَّمَاءِ وَ انْظُرْ مَا فَعَلَ اللَّهُ عَزَّ وَ جَلَّ بِالْمُجْرِمِينَ فَقَدْ فَسَّرْتُ لَكَ جُمَلًا مُجْمَلًا وَ صَلَّى اللَّهُ عَلَى مُحَمَّدٍ وَ آلِهِ الْأَخْيَارِ.",
                    "englishText": "95. A number of our companions, from Sahl Bin Ziyad, from Ismail Bin Mahraan, from Muhammad Bin Mansour Al-Khuzai’e, from Ali Bin Suweyd and Muhammad Bin Yahya, from Muhammad Bin Al-Husayn, from Muhammad Bin Ismail Bin Yazi’e, from his uncle Hamza bin Yazi’e, from Ali Bin Suweyd and Al-Hassan Biin Muhammad, from Muhammad Bin Ahmad Al-Nahdy, from Ismail Bin Mahraan, from Muhammad bin Mansour, from Ali Bin Suweyd who said: ‘I wrote to Abu Al-Hassan Musa  whilst he  was in the solitary confinement. I wrote asking him  about his  condition and about numerous matters. The answer did not come for months, then he  answered me by an answer and this is its copy: - In the Name of Allah (azwj) the Beneficent, the Merciful. Praise be to the High, the Magnificent. It is by His (azwj) Greatness and His (azwj) Light the hearts of the ‘الْمُؤْمِنِينَ’ (believers) achieve vision, and by His (azwj) Greatness and His (azwj) Light, (whereas) the ignorant ones are inimical to Him (azwj), and by His (azwj) Greatness and His (azwj) Light crave the ones in the heavens and in the earth and to Him (azwj) is the Means by the different deeds and the contradictory Religions. So the rightful, and the mistaken, and the stray, and the guided, and the hearing, and the deaf, and the seeing, and the blind ones are perplexed. So the Praise Belongs to Allah (azwj) Whose Religion was recognised and described by Muhammad ﷺ. Having said that, you are of the people whom Allah (azwj) has Blessed by Sending the Progeny  of Muhammad ﷺ (towards you and) and by special status, and Preserved the cordiality which attracted you to His (azwj) Religion, and what He (azwj) has Inspired from your guidance and your vision from the matters of your Religion that you give preference to them  and are referring your matters to them . You wrote to me  asking me  about matters which I  was observing dissimulation in and concealed them for a while. So when the authority of the tyrant passed by, and there came the authority of the One (azwj) with Great Authority, by my  departing from the world which has been condemned by its inhabitants who have hardened themselves against their Creator, I  saw that I  could explain to you what you had asked me  about, fearing that our  weak Shiites may enter into confusion because of the ignorance which is in front of them. So fear Allah (azwj), Mighty is His (azwj) Mention, and single out for these matters, its deserving ones, and be cautious that you should become a reason for the calamities against the successors  or provoking (people) against them  by publicising what I  am entrusting you with and exposing what I  have told you to conceal, and Allah (azwj) Willing, you will not do this. Firstly what I  would like to inform you is that you should mourn for myself  in this very night without remorse and no complaints, for what is to transpire is from what Allah (azwj) Mighty and Majestic has Ordained and is inevitable. So attach yourself to the Handle of the Progeny  of Muhammad ﷺ, and the Firmest Handle of the successor  after the successor , and the submission to them  and be pleased with what they  say, and do not seek Religion from the ones who are not from your Shiites, and do not love their Religion, for they are traitors who have betrayed Allah (azwj) and His (azwj) Rasool ﷺ, and betrayed their trusts. And do you know how they betrayed their trusts? They were entrusted with the Book of Allah (azwj) so they distorted it and changed it, and evidenced it upon the rulers among them. So stay away from them. Allah (azwj) has Made them to Taste the clothing of the hunger, and the fear due to what they had done. And you asked about two men (Abu Bakr and Umar) who usurped the wealth of a man which he used to spend upon the poor and the needy and the traveller in need, and in the Way of Allah (azwj). So when they usurped that, they were not happy until they made him carry it unwillingly upon his ride to their own homes. When they undertook to be in charge of its spending, and so reached infidelity by doing that. By my  life, they had become hypocrites before that and rejected against Allah (azwj) His (azwj) Words, and mocked at His (azwj) Rasool ﷺ, and they were both infidels. May Allah (azwj) Curse them, and the Angels, and the people altogether. By Allah (azwj), the ‘Eman’ (belief) did not enter into the heart of any one of them since their coming out from their condition (Kufr), and it did not increase them in anything except for doubts. They were deceivers, sceptical, hypocrites until they both died and the Angels of Punishment took them to the place of disgrace in the eternal abode. And you asked about those who were in the presence of that man whilst he was usurping his wealth and placed it upon his ride, and there were among them who knew about it and denied it. So those (Abu Bakr and Umar) are the first apostates from this community, and so may the Curse of Allah (azwj) and the Angels and all the people be upon them. And you asked about extent of our  Knowledge, and it is upon three aspects. The past, and the future, and the newly recurring. So as for the past, it has been explained, and as for the future, it has been written down, and as for that which is newly occurring, so it gets imprinted upon the hearts, and resonated in the ears, and it is the highest of our  Knowledge, and there is no Prophet  after our  Prophet ﷺ. And you asked about the mothers of their children (the followers of those two), and about their marriages, and about their divorces. So, as for the mothers of their children, they are prostitutes up to the Day of Judgement, having married without a guardian (Wali’s consent), and going through divorces without (completing the) waiting periods. And as for the one who enters into our  Invitation (call to Wilayah), so his ‘Eman’ demolishes his misguidance, and so does his ‘Yaqeen’ conviction (demolish) his doubts. And you asked about the Zakaat among them. So, there was nothing from the Zakaat (for them), as you are more deserving of it, because we  have made that to be lawful for you, and those who are from you wherever they may be. And you asked about the weak. So the weak is the one who cannot argue against (the batil) and he does not understand the differences, for if he understands the difference, then he is not with the weakness. You asked about the ‘الشَّهَادَاتِ’ testimonies for them. So establish the testimony for the sake of Allah (azwj), even if it is against your own-self, and the parents and the relatives in what is between you and them. So if you fear injustice against your brother, don’t (be part of it). And call to the Law of Allah (azwj), as He (azwj) has (placed those) in our  recognition (Ma’rifat). The one who hopes would be Answered and do not barricade yourself by the fort of hypocrisy. And befriend the Progeny  of Muhammad ﷺ and do not speak of what reaches you from us , and ascribe to us that ‘this is false’, and you may know something from us  which is against it, for you do not know why we  may have said it, and upon which perspective we may have described it. Believe in what I  inform you  and do not publicise what I  have told you to conceal from what I  inform you. It is from the obligatory right of your brother that you do not conceal anything from him which might benefit him in the affairs of the world and the Hereafter. And do not hold a grudge against him and not to hurt him, and answer his call when he calls you and do not leave him alone between him and his enemies from the people even though they may be closer to you than him, and support him in his illness. It is not from etiquettes of the ‘الْمُؤْمِنِينَ’ Believers, the defrauding, and the injuring, and the treachery, and the arrogance, and the vulgarities, and the immoralities, and the commanding for such things. So if you were to see the deformed Bedouin in legions (large armies), so wait for your relief (Al-Qaim ), and for your Shiites, the believers, and when the sun rises, raise your vision to the sky and look at what Allah (azwj) has Done with the criminals. So I  have explained to you all of this in summary. And send greetings upon Muhammad ﷺ and his ﷺ Progeny , the righteous’.",
                    "href": "https://thaqalayn.net/hadith/8/1/95/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "ف قوة الصحيح",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15 / 295)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "96": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: The rare hadith about Abu Dharr",
                    "arabicText": "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ مُحَمَّدِ بْنِ أَيُّوبَ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ أَتَى أَبُو ذَرٍّ رَسُولَ اللَّهِ (صلى الله عليه وآله) فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي قَدِ اجْتَوَيْتُ الْمَدِينَةَ أَ فَتَأْذَنُ لِي أَنْ أَخْرُجَ أَنَا وَ ابْنُ أَخِي إِلَى مُزَيْنَةَ فَنَكُونَ بِهَا فَقَالَ إِنِّي أَخْشَى أَنْ يُغِيرَ عَلَيْكَ خَيْلٌ مِنَ الْعَرَبِ فَيُقْتَلَ ابْنُ أَخِيكَ فَتَأْتِيَنِي شَعَثاً فَتَقُومَ بَيْنَ يَدَيَّ مُتَّكِئاً عَلَى عَصَاكَ فَتَقُولَ قُتِلَ ابْنُ أَخِي وَ أُخِذَ السَّرْحُ فَقَالَ يَا رَسُولَ اللَّهِ بَلْ لَا يَكُونُ إِلَّا خَيْراً إِنْ شَاءَ اللَّهُ فَأَذِنَ لَهُ رَسُولُ اللَّهِ (صلى الله عليه وآله) فَخَرَجَ هُوَ وَ ابْنُ أَخِيهِ وَ امْرَأَتُهُ فَلَمْ يَلْبَثْ هُنَاكَ إِلَّا يَسِيراً حَتَّى غَارَتْ خَيْلٌ لِبَنِي فَزَارَةَ فِيهَا عُيَيْنَةُ بْنُ حِصْنٍ فَأُخِذَتِ السَّرْحُ وَ قُتِلَ ابْنُ أَخِيهِ وَ أُخِذَتِ امْرَأَتُهُ مِنْ بَنِي غِفَارٍ وَ أَقْبَلَ أَبُو ذَرٍّ يَشْتَدُّ حَتَّى وَقَفَ بَيْنَ يَدَيْ رَسُولِ اللَّهِ (صلى الله عليه وآله) وَ بِهِ طَعْنَةٌ جَائِفَةٌ فَاعْتَمَدَ عَلَى عَصَاهُ وَ قَالَ صَدَقَ اللَّهُ وَ رَسُولُهُ أُخِذَ السَّرْحُ وَ قُتِلَ ابْنُ أَخِي وَ قُمْتُ بَيْنَ يَدَيْكَ عَلَى عَصَايَ فَصَاحَ رَسُولُ اللَّهِ (صلى الله عليه وآله) فِي الْمُسْلِمِينَ فَخَرَجُوا فِي الطَّلَبِ فَرَدُّوا السَّرْحَ وَ قَتَلُوا نَفَراً مِنَ الْمُشْرِكِينَ.",
                    "englishText": "96. Humeyd Bin Ziyad, from Al-Hassan Bin Muhammad Bin Sama’at, from Muhammad Bin Ayyub and Ali Bin Ibrahim, from his father altogether from Ahmad Bin Muhammad Bin Abu Nasr, from Abaan Bin Usmaan, from Abu Baseer, who has narrated the following: Abu Abdullah  having said: ‘Abu Dharr (ar) came to the Rasool ﷺ Allah (azwj) and said, ‘O Rasool ﷺ Allah (azwj), I  have begun disliking Al-Medina. Will you ﷺ permit me , and that I (ar) and the son of my (ar) brother go out to Muzeyna, for we are from it?’ He ﷺ said: ‘I ﷺ fear that you (ar) might be attacked by Arab horsemen, so they would kill the son of your (ar) brother and you will come to me ﷺ beaten up, and stand in front of me ﷺ leaning upon your stick and you will say, ‘The son of my (ar) brother has been killed, and the cattle taken away’. He (ar) said, ‘O Rasool ﷺ Allah (azwj), but nothing will happen except for the good, Allah (azwj) Willing’. So the Rasool ﷺ Allah (azwj) gave him (ar) permission. So he (ar) and the son of his (ar) brother, and his (ar) wife went out. But, very soon the horsemen of the Clan of Fazaarat, among whom was Uyaynah Bin Hasan attacked them, took away the cattle, and killed the son of his (ar) brother, and took his (ar) wife who as from the Clan of Ghaffaar. And Abu Dharr (ar) came up in an intensely difficult condition and paused in front of the Rasool ﷺ Allah (azwj), badly wounded and leaning upon his stick and said, ‘Allah (azwj) and His (azwj) Rasool ﷺ were right. The cattle were taken, and the son of my (ar) brother being killed, and I (ar) am leaning upon my stick’. So the Rasool ﷺ Allah (azwj) cried out among the Muslims. So they went out in the search, and returned the cattle, and killed a number from the Polytheists’.",
                    "href": "https://thaqalayn.net/hadith/8/1/96/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "حسن أو موثوق كالصحيح",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15 / 303)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "135": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: From the rights of Muslims",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ع قَالَ قَالَ النَّبِيُّ (صلى الله عليه وآله) حَقٌّ عَلَى الْمُسْلِمِ إِذَا أَرَادَ سَفَراً أَنْ يُعْلِمَ إِخْوَانَهُ وَ حَقٌّ عَلَى إِخْوَانِهِ إِذَا قَدِمَ أَنْ يَأْتُوهُ.",
                    "englishText": "135. Ali Bin Ibrahim, from his father, from Al-Nowfaly, from Al-Sakuny, who has narrated the following: Abu Abdullah  having said: ‘The Prophet ﷺ said: ‘It is a right upon the Muslim if he intends to travel that he should let his brothers know about it, and it is a right upon his brothers that they should come to him (visit) when he comes back’.",
                    "href": "https://thaqalayn.net/hadith/8/1/135/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "ضعيف على الشهور",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15 / 371)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "136": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Two unknown bounties",
                    "arabicText": "وَ بِهَذَا الْإِسْنَادِ قَالَ قَالَ النَّبِيُّ (صلى الله عليه وآله) خَلَّتَانِ كَثِيرٌ مِنَ النَّاسِ فِيهِمَا مَفْتُونٌ الصِّحَّةُ وَ الْفَرَاغُ.",
                    "englishText": "136. And by this chain, who has narrated the following: Imam  said: ‘The Prophet ﷺ said: ‘There are two qualities which the people are infatuated with – the health and the leisure’.",
                    "href": "https://thaqalayn.net/hadith/8/1/136/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "ضعيف على الشهور",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15 / 372)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "137": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Prohibition on exposing oneself for accusation",
                    "arabicText": "وَ بِهَذَا الْإِسْنَادِ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ (عليه السلام) مَنْ عَرَّضَ نَفْسَهُ لِلتُّهَمَةِ فَلَا يَلُومَنَّ مَنْ أَسَاءَ بِهِ الظَّنَّ وَ مَنْ كَتَمَ سِرَّهُ كَانَتِ الْخِيَرَةُ فِي يَدِهِ.",
                    "englishText": "137. And by this chain, who has narrated the following: Imam  said: ‘Amir-ul-Momineen  said: ‘The one who exposes himself for the accusation, so he should not blame the one who thinks bad about him, and the one who conceals his secret, would have the good in his hands (is secure from that)’.",
                    "href": "https://thaqalayn.net/hadith/8/1/137/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "ضعيف على الشهور",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (15 / 372)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "143": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Hadith of Zaynab the fragrance seller",
                    "arabicText": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي نَجْرَانَ عَنْ صَفْوَانَ عَنْ خَلَفِ بْنِ حَمَّادٍ عَنِ الْحُسَيْنِ بْنِ زَيْدٍ الْهَاشِمِيِّ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ جَاءَتْ زَيْنَبُ الْعَطَّارَةُ الْحَوْلَاءُ إِلَى نِسَاءِ النَّبِيِّ (صلى الله عليه وآله) وَ بَنَاتِهِ وَ كَانَتْ تَبِيعُ مِنْهُنَّ الْعِطْرَ فَجَاءَ النَّبِيُّ (صلى الله عليه وآله) وَ هِيَ عِنْدَهُنَّ فَقَالَ إِذَا أَتَيْتِنَا طَابَتْ بُيُوتُنَا فَقَالَتْ بُيُوتُكَ بِرِيحِكَ أَطْيَبُ يَا رَسُولَ اللَّهِ قَالَ إِذَا بِعْتِ فَأَحْسِنِي وَ لَا تَغُشِّي فَإِنَّهُ أَتْقَى وَ أَبْقَى لِلْمَالِ فَقَالَتْ يَا رَسُولَ اللَّهِ مَا أَتَيْتُ بِشَيْ‏ءٍ مِنْ بَيْعِي وَ إِنَّمَا أَتَيْتُ أَسْأَلُكَ عَنْ عَظَمَةِ اللَّهِ عَزَّ وَ جَلَّ فَقَالَ جَلَّ جَلَالُ اللَّهِ سَأُحَدِّثُكِ عَنْ بَعْضِ ذَلِكِ ثُمَّ قَالَ إِنَّ هَذِهِ الْأَرْضَ بِمَنْ عَلَيْهَا عِنْدَ الَّتِي تَحْتَهَا كَحَلْقَةٍ مُلْقَاةٍ فِي فَلَاةٍ قِيٍّ وَ هَاتَانِ بِمَنْ فِيهِمَا وَ مَنْ عَلَيْهِمَا عِنْدَ الَّتِي تَحْتَهَا كَحَلْقَةٍ مُلْقَاةٍ فِي فَلَاةٍ قِيٍّ وَ الثَّالِثَةُ حَتَّى انْتَهَى إِلَى السَّابِعَةِ وَ تَلَا هَذِهِ الْآيَةَ خَلَقَ سَبْعَ سَماواتٍ وَ مِنَ الْأَرْضِ مِثْلَهُنَّ وَ السَّبْعُ الْأَرَضِينَ بِمَنْ فِيهِنَّ وَ مَنْ عَلَيْهِنَّ عَلَى ظَهْرِ الدِّيكِ كَحَلْقَةٍ مُلْقَاةٍ فِي فَلَاةٍ قِيٍّ وَ الدِّيكُ لَهُ جَنَاحَانِ جَنَاحٌ فِي الْمَشْرِقِ وَ جَنَاحٌ فِي الْمَغْرِبِ وَ رِجْلَاهُ فِي التُّخُومِ وَ السَّبْعُ وَ الدِّيكُ بِمَنْ فِيهِ وَ مَنْ عَلَيْهِ عَلَى الصَّخْرَةِ كَحَلْقَةٍ مُلْقَاةٍ فِي فَلَاةٍ قِيٍّ وَ الصَّخْرَةُ بِمَنْ فِيهَا وَ مَنْ عَلَيْهَا عَلَى ظَهْرِ الْحُوتِ كَحَلْقَةٍ مُلْقَاةٍ فِي فَلَاةٍ قِيٍّ وَ السَّبْعُ وَ الدِّيكُ وَ الصَّخْرَةُ وَ الْحُوتُ بِمَنْ فِيهِ وَ مَنْ عَلَيْهِ عَلَى الْبَحْرِ الْمُظْلِمِ كَحَلْقَةٍ مُلْقَاةٍ فِي فَلَاةٍ قِيٍّ وَ السَّبْعُ وَ الدِّيكُ وَ الصَّخْرَةُ وَ الْحُوتُ وَ الْبَحْرُ الْمُظْلِمُ عَلَى الْهَوَاءِ الذَّاهِبِ كَحَلْقَةٍ مُلْقَاةٍ فِي فَلَاةٍ قِيٍّ وَ السَّبْعُ وَ الدِّيكُ وَ الصَّخْرَةُ وَ الْحُوتُ وَ الْبَحْرُ الْمُظْلِمُ وَ الْهَوَاءُ عَلَى الثَّرَى كَحَلْقَةٍ مُلْقَاةٍ فِي فَلَاةٍ قِيٍّ ثُمَّ تَلَا هَذِهِ الْآيَةَ لَهُ ما فِي السَّماواتِ وَ ما فِي الْأَرْضِ وَ ما بَيْنَهُما وَ ما تَحْتَ الثَّرى ثُمَّ انْقَطَعَ الْخَبَرُ عِنْدَ الثَّرَى وَ السَّبْعُ وَ الدِّيكُ وَ الصَّخْرَةُ وَ الْحُوتُ وَ الْبَحْرُ الْمُظْلِمُ وَ الْهَوَاءُ وَ الثَّرَى بِمَنْ فِيهِ وَ مَنْ عَلَيْهِ عِنْدَ السَّمَاءِ الْأُولَى كَحَلْقَةٍ فِي فَلَاةٍ قِيٍّ وَ هَذَا كُلُّهُ وَ سَمَاءُ الدُّنْيَا بِمَنْ عَلَيْهَا وَ مَنْ فِيهَا عِنْدَ الَّتِي فَوْقَهَا كَحَلْقَةٍ فِي فَلَاةٍ قِيٍّ وَ هَاتَانِ السَّمَاءَانِ وَ مَنْ فِيهِمَا وَ مَنْ عَلَيْهِمَا عِنْدَ الَّتِي فَوْقَهُمَا كَحَلْقَةٍ فِي فَلَاةٍ قِيٍّ وَ هَذِهِ الثَّلَاثُ بِمَنْ فِيهِنَّ وَ مَنْ عَلَيْهِنَّ عِنْدَ الرَّابِعَةِ كَحَلْقَةٍ فِي فَلَاةٍ قِيٍّ حَتَّى انْتَهَى إِلَى السَّابِعَةِ وَ هُنَّ وَ مَنْ فِيهِنَّ وَ مَنْ عَلَيْهِنَّ عِنْدَ الْبَحْرِ الْمَكْفُوفِ عَنْ أَهْلِ الْأَرْضِ كَحَلْقَةٍ فِي فَلَاةٍ قِيٍّ وَ هَذِهِ السَّبْعُ وَ الْبَحْرُ الْمَكْفُوفُ عِنْدَ جِبَالِ الْبَرَدِ كَحَلْقَةٍ فِي فَلَاةٍ قِيٍّ وَ تَلَا هَذِهِ الْآيَةَ وَ يُنَزِّلُ مِنَ السَّماءِ مِنْ جِبالٍ فِيها مِنْ بَرَدٍ وَ هَذِهِ السَّبْعُ وَ الْبَحْرُ الْمَكْفُوفُ وَ جِبَالُ الْبَرَدِ عِنْدَ الْهَوَاءِ الَّذِي تَحَارُ فِيهِ الْقُلُوبُ كَحَلْقَةٍ فِي فَلَاةٍ قِيٍّ وَ هَذِهِ السَّبْعُ وَ الْبَحْرُ الْمَكْفُوفُ وَ جِبَالُ الْبَرَدِ وَ الْهَوَاءُ عِنْدَ حُجُبِ النُّورِ كَحَلْقَةٍ فِي فَلَاةٍ قِيٍّ وَ هَذِهِ السَّبْعُ وَ الْبَحْرُ الْمَكْفُوفُ وَ جِبَالُ الْبَرَدِ وَ الْهَوَاءُ وَ حُجُبُ النُّورِ عِنْدَ الْكُرْسِيِّ كَحَلْقَةٍ فِي فَلَاةٍ قِيٍّ ثُمَّ تَلَا هَذِهِ الْآيَةَ وَسِعَ كُرْسِيُّهُ السَّماواتِ وَ الْأَرْضَ وَ لا يَؤُدُهُ حِفْظُهُما وَ هُوَ الْعَلِيُّ الْعَظِيمُ وَ هَذِهِ السَّبْعُ وَ الْبَحْرُ الْمَكْفُوفُ وَ جِبَالُ الْبَرَدِ وَ الْهَوَاءُ وَ حُجُبُ النُّورِ وَ الْكُرْسِيُّ عِنْدَ الْعَرْشِ كَحَلْقَةٍ فِي فَلَاةٍ قِيٍّ وَ تَلَا هَذِهِ الْآيَةَ الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى [وَ فِي رِوَايَةِ الْحَسَنِ] الْحُجُبُ قَبْلَ الْهَوَاءِ الَّذِي تَحَارُ فِيهِ الْقُلُوبُ.",
                    "englishText": "143. Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Abdul Rahmaan Bin Abu Najraan, from Safwaan, from Halaf Bin Hammaad, from Al-Husayn Bin Zayd Al-Hashimy, who has narrated the following: Abu Abdullah  said: ‘Zaynab the perfume seller came to the wives and the daughters of the Prophet ﷺ, and she used to sell the perfume to them. The Prophet ﷺ came over whilst she was among them. So he ﷺ said: ‘You bring aroma to our ﷺ house’. She said, ‘Your ﷺ house is better in aroma due to your ﷺ fragrance, O Rasool Allah ﷺ!’ He ﷺ said: ‘When you sell, do it well and do not cheat, for it would be more pious and protective of the wealth’. She said, ‘O Rasool Allah ﷺ, I did not come to sell anything, but rather I came to ask you ﷺ about the Magnificence of Allah (azwj) Mighty and Majestic’. So he ﷺ said: ‘Majestic is the Majesty of Allah (azwj). I ﷺ shall tell you about some of that’. Then he ﷺ said: ‘This earth with what is upon it, compared to that which is below it, it like a ring thrown in the desert, and these two with what is within them and what is upon them, compared to what is beneath them is like a ring thrown in the desert, and the third one, until it ends with the seventh’. And he ﷺ recited this Verse: “[65:12] Allah is He Who created seven Firmaments and of the earth a similar number”. The seven earths (firmaments) along with all that is contained within it and what is on it are upon the back of the rooster, like a ring thrown in the desert. And the rooster has two wings to it – a wing in the east and a wing in the west, and its legs are on the fringes of it, and the seven (firmaments) and the rooster and all that is contained with these and whatever is on it, are upon a rock, like a ring thrown in the desert. And the rock along with all that it contains, and all that is on it, are upon the back of the whale like a ring thrown in the desert. And the seven (firmaments), and the rooster, and the rock, and the whale along with that they contain and what is on them are upon the dark ocean like a ring thrown in the desert. And the seven (firmaments), and the rooster, and the rock, and the whale, and the dark ocean are upon the outgoing air like a ring thrown in the desert. And the seven (firmaments), and the rooster, and the rock, and the whale, and the dark ocean, and the air are upon the soil (Al-Sarayy) like a ring thrown in the desert’. Then he ﷺ recited this Verse: “[20:6] To Him belongs what is in the heavens and on earth, and all between them, and all beneath the soil”. Then the information about the soil (Al-Sarayy) is terminated. And the seven (firmaments), and the rooster, and the rock, and the whale, and the dark ocean, and the air, and the soil (Al-Sarayy) along with all that these contain and whatever is on it, compared to the first sky is like a ring thrown in the desert. And all of this, and the sky of the world along with what is on it and what is contained within it, compared to that which is above it, is like a ring thrown in the desert. And these two skies and whatever these two contain, and what is on them, compared to what is above these two, are like a ring thrown in the desert. And these three, along with what is contained within them and whatever is on them, compared to the fourth, are like a ring thrown in the desert, (and it is like this) until it ends with the seventh. And these and all that is contained within them and whatever is on them, compared to the ocean hidden from the people of the earth, is like a ring thrown in the desert. And these seven, and the hidden ocean, compared to the cold mountain are like a ring thrown in the desert’. And he ﷺ recited this Verse: “[24:43] And He sends down of the clouds that are (like) mountains wherein is hail”. And these seven, and the hidden ocean, and the cold mountain, compared to the air which the hearts are confused about, are like a ring thrown in the desert. And these seven, and the hidden ocean, and the cold mountain, and the air, compared to veils of the light are like a ring thrown in the desert. And these seven, and the hidden ocean, and the cold mountain, and the air, and the veils of the light, compared to the Chair (Al-Kursy) are like a ring thrown in the desert’. And he ﷺ recited this Verse: “[2:255] His Throne (Chair) includes the heavens and the earth, and He is never weary of preserving them. He is the Sublime, the Tremendous”. And these seven, and the hidden ocean, and the cold mountain, and the air, and veils of the light, and the Chair, compared to the Throne are like a ring thrown in the desert’. And he ﷺ recite this Verse: “[20:5] The Beneficent One, Who is established on the Throne”. (And in the report of Al-Hassan) – ‘The veils before the air about which the hearts are confused’.",
                    "href": "https://thaqalayn.net/hadith/8/1/143/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "مجهول ويكن عده ف السان 6",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2 / 5)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "153": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Religion has two governments",
                    "arabicText": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ وَ مُحَمَّدُ بْنُ الْحَسَنِ جَمِيعاً عَنْ صَالِحِ بْنِ أَبِي حَمَّادٍ عَنْ أَبِي جَعْفَرٍ الْكُوفِيِّ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ جَعَلَ الدِّينَ دَوْلَتَيْنِ دَوْلَةً لآِدَمَ (عليه السلام) وَ دَوْلَةً لِإِبْلِيسَ فَدَوْلَةُ آدَمَ هِيَ دَوْلَةُ اللَّهِ عَزَّ وَ جَلَّ فَإِذَا أَرَادَ اللَّهُ عَزَّ وَ جَلَّ أَنْ يُعْبَدَ عَلَانِيَةً أَظْهَرَ دَوْلَةَ آدَمَ وَ إِذَا أَرَادَ اللَّهُ أَنْ يُعْبَدَ سِرّاً كَانَتْ دَوْلَةُ إِبْلِيسَ فَالْمُذِيعُ لِمَا أَرَادَ اللَّهُ سَتْرَهُ مَارِقٌ مِنَ الدِّينِ",
                    "englishText": "153. Muhammad Bin Abu Abdullah, and Muhammad Bin Al-Hassan, altogether from Saleh Bin Abu Hammaad, who has narrated the following: Abu Abdullah  said that: ‘Allah (azwj) Mighty and Majestic Made two governments for the Religion. The government of Adam  and the government of Iblees (la). The government of Adam  is the government of Allah (azwj) Mighty and Majestic. So if Allah (azwj) Mighty and Majestic Intends to be worshipped publicly, He (azwj) Makes apparent the government of Adam , and if He (azwj) Intends that He (azwj) should be worshipped in secret, it would be the government of Iblees (la). So the broadcaster of what Allah (azwj) has Intended to be a secret, is a renegade from the Religion’.",
                    "href": "https://thaqalayn.net/hadith/8/1/153/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "مرسل ضعيف",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 19)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "161": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Why a believer is called a believer",
                    "arabicText": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مَرْوَكِ بْنِ عُبَيْدٍ عَنْ رِفَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قَالَ أَ تَدْرِي يَا رِفَاعَةُ لِمَ سُمِّيَ الْمُؤْمِنُ مُؤْمِناً قَالَ قُلْتُ لَا أَدْرِي قَالَ لِأَنَّهُ يُؤْمِنُ عَلَى اللَّهِ عَزَّ وَ جَلَّ فَيُجِيزُ [اللَّهُ] لَهُ أَمَانَهُ.",
                    "englishText": "161. Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Marouk Bin Ubeyd, from Rafa’at, who has narrated the following: Abu Abdullah  having said: ‘Do you know, O Rafa’at, why the ‘الْمُؤْمِنُ’ Believer is called ‘Momin’?’ I said, ‘I do not know’. He  said: ‘Because he entrusts himself to Allah (azwj) Mighty and Majestic, so Allah (azwj) Authorises safety for him’.",
                    "href": "https://thaqalayn.net/hadith/8/1/161/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "كالصحيح",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 23)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "187": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Ash’ath ibn Qays and his children",
                    "arabicText": "سَهْلُ بْنُ زِيَادٍ عَنْ يَعْقُوبَ بْنِ يَزِيدَ أَوْ غَيْرِهِ عَنْ سُلَيْمَانَ كَاتِبِ عَلِيِّ بْنِ يَقْطِينٍ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ إِنَّ الْأَشْعَثَ بْنَ قَيْسٍ شَرِكَ فِي دَمِ أَمِيرِ الْمُؤْمِنِينَ (عليه السلام) وَ ابْنَتُهُ جَعْدَةُ سَمَّتِ الْحَسَنَ (عليه السلام) وَ مُحَمَّدٌ ابْنُهُ شَرِكَ فِي دَمِ الْحُسَيْنِ (عليه السلام).",
                    "englishText": "187. Sahl Bin Ziyad, from Yaqoub Bin Yazeed or someone else, from Sulayman the write of Ali Bin Yaqteen, from the one whom he mentioned, who has narrated the following: Abu Abdullah  said that: ‘Al-Ash’as Bin Qays is a participant in the blood (killing) of Amir-ul-Momineen , and his daughter Jo’da poisoned Al-Hassan , and his son Muhammad is a participant in the blood (killing) of Al-Husayn ’.",
                    "href": "https://thaqalayn.net/hadith/8/1/187/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "سكت عنه",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 37)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "201": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: About the words of Allah ‘those who are pious before Allah…’ (65:3)",
                    "arabicText": "عَلِيٌّ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدٍ الْكُنَاسِيِّ قَالَ حَدَّثَنَا مَنْ رَفَعَهُ إِلَى أَبِي عَبْدِ اللَّهِ (عليه السلام) فِي قَوْلِهِ عَزَّ ذِكْرُهُ وَ مَنْ يَتَّقِ اللَّهَ يَجْعَلْ لَهُ مَخْرَجاً وَ يَرْزُقْهُ مِنْ حَيْثُ لا يَحْتَسِبُ قَالَ هَؤُلَاءِ قَوْمٌ مِنْ شِيعَتِنَا ضُعَفَاءُ لَيْسَ عِنْدَهُمْ مَا يَتَحَمَّلُونَ بِهِ إِلَيْنَا فَيَسْمَعُونَ حَدِيثَنَا وَ يَقْتَبِسُونَ مِنْ عِلْمِنَا فَيَرْحَلُ قَوْمٌ فَوْقَهُمْ وَ يُنْفِقُونَ أَمْوَالَهُمْ وَ يُتْعِبُونَ أَبْدَانَهُمْ حَتَّى يَدْخُلُوا عَلَيْنَا فَيَسْمَعُوا حَدِيثَنَا فَيَنْقُلُونَهُ إِلَيْهِمْ فَيَعِيهِ هَؤُلَاءِ وَ تُضَيِّعُهُ هَؤُلَاءِ فَأُولَئِكَ الَّذِينَ يَجْعَلُ اللَّهُ عَزَّ ذِكْرُهُ لَهُمْ مَخْرَجاً وَ يَرْزُقُهُمْ مِنْ حَيْثُ لَا يَحْتَسِبُونَ وَ فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ هَلْ أَتاكَ حَدِيثُ الْغاشِيَةِ قَالَ الَّذِينَ يَغْشَوْنَ الْإِمَامَ إِلَى قَوْلِهِ عَزَّ وَ جَلَّ لا يُسْمِنُ وَ لا يُغْنِي مِنْ جُوعٍ قَالَ لَا يَنْفَعُهُمْ وَ لَا يُغْنِيهِمْ لَا يَنْفَعُهُمُ الدُّخُولُ وَ لَا يُغْنِيهِمُ الْقُعُودُ.",
                    "englishText": "201. Ali, from Ali Bin Al-Husayn, from Muhammad Al-Kunary who said: ‘It was narrated to us with an unbroken chain going up to Abu Abdullah  regarding His (azwj) Statement, Mighty is His (azwj) Mention: “[65:2] and whoever is careful of (his duty to) Allah, He will make for him an outlet [65:3] And He provides for him from (sources) he never could imagine”. He  said: ‘These are our  weak Shites who do not have the means in order to take it (directly) from us . So they hear our  Hadeeth and they try to accumulate from our  Knowledge. A people who are higher than them, who spend their wealth, tiring their bodies to the extent that they came up to us , hear our  Hadeeth and transmit these to them. So these ones preserve them, whilst those ones waste them. So they are the ones for whom Allah (azwj) Mighty is His (azwj) Mention Makes an outlet for them and Gives them Sustenance (Hadeeth) from a source which they had not even considered beforehand. And with regards to the Statement of Allah (azwj) Mighty and Majestic: “[88:1] Has not there come to you the news of the overwhelming calamity?” he  said; ‘These are the ones who have cheated the Imam ’ – up to the Statement of the Mighty and Majestic: “[88:7] Which will neither nourish nor satisfy hunger”, said: ‘It will neither benefit them, nor free them from needs, nor will it benefit them with the entering (marital relationships), nor free them from the need of sitting down (from begging for more)’.",
                    "href": "https://thaqalayn.net/hadith/8/1/201/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "مرفوع",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 67)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "202": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Those who planned to takeover, usurp Khilafah",
                    "arabicText": "عَنْهُ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ ما يَكُونُ مِنْ نَجْوى ثَلاثَةٍ إِلَّا هُوَ رابِعُهُمْ وَ لا خَمْسَةٍ إِلَّا هُوَ سادِسُهُمْ وَ لا أَدْنى مِنْ ذلِكَ وَ لا أَكْثَرَ إِلَّا هُوَ مَعَهُمْ أَيْنَ ما كانُوا ثُمَّ يُنَبِّئُهُمْ بِما عَمِلُوا يَوْمَ الْقِيامَةِ إِنَّ اللَّهَ بِكُلِّ شَيْ‏ءٍ عَلِيمٌ قَالَ نَزَلَتْ هَذِهِ الْآيَةُ فِي فُلَانٍ وَ فُلَانٍ وَ أَبِي عُبَيْدَةَ الْجَرَّاحِ وَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَ سَالِمٍ مَوْلَى أَبِي حُذَيْفَةَ وَ الْمُغِيرَةِ بْنِ شُعْبَةَ حَيْثُ كَتَبُوا الْكِتَابَ بَيْنَهُمْ وَ تَعَاهَدُوا وَ تَوَافَقُوا لَئِنْ مَضَى مُحَمَّدٌ لَا تَكُونُ الْخِلَافَةُ فِي بَنِي هَاشِمٍ وَ لَا النُّبُوَّةُ أَبَداً فَأَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ فِيهِمْ هَذِهِ الْآيَةَ قَالَ قُلْتُ قَوْلُهُ عَزَّ وَ جَلَّ أَمْ أَبْرَمُوا أَمْراً فَإِنَّا مُبْرِمُونَ أَمْ يَحْسَبُونَ أَنَّا لا نَسْمَعُ سِرَّهُمْ وَ نَجْواهُمْ بَلى وَ رُسُلُنا لَدَيْهِمْ يَكْتُبُونَ قَالَ وَ هَاتَانِ الْآيَتَانِ نَزَلَتَا فِيهِمْ ذَلِكَ الْيَوْمَ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) لَعَلَّكَ تَرَى أَنَّهُ كَانَ يَوْمٌ يُشْبِهُ يَوْمَ كُتِبَ الْكِتَابُ إِلَّا يَوْمَ قُتِلَ الْحُسَيْنُ (عليه السلام) وَ هَكَذَا كَانَ فِي سَابِقِ عِلْمِ اللَّهِ عَزَّ وَ جَلَّ الَّذِي أَعْلَمَهُ رَسُولَ اللَّهِ (صلى الله عليه وآله) أَنْ إِذَا كُتِبَ الْكِتَابُ قُتِلَ الْحُسَيْنُ وَ خَرَجَ الْمُلْكُ مِنْ بَنِي هَاشِمٍ فَقَدْ كَانَ ذَلِكَ كُلُّهُ قُلْتُ وَ إِنْ طائِفَتانِ مِنَ الْمُؤْمِنِينَ اقْتَتَلُوا فَأَصْلِحُوا بَيْنَهُما فَإِنْ بَغَتْ إِحْداهُما عَلَى الْأُخْرى فَقاتِلُوا الَّتِي تَبْغِي حَتَّى تَفِي‏ءَ إِلى أَمْرِ اللَّهِ فَإِنْ فاءَتْ فَأَصْلِحُوا بَيْنَهُما بِالْعَدْلِ قَالَ الْفِئَتَانِ إِنَّمَا جَاءَ تَأْوِيلُ هَذِهِ الْآيَةِ يَوْمَ الْبَصْرَةِ وَ هُمْ أَهْلُ هَذِهِ الْآيَةِ وَ هُمُ الَّذِينَ بَغَوْا عَلَى أَمِيرِ الْمُؤْمِنِينَ (عليه السلام) فَكَانَ الْوَاجِبَ عَلَيْهِ قِتَالُهُمْ وَ قَتْلُهُمْ حَتَّى يَفِيئُوا إِلَى أَمْرِ اللَّهِ وَ لَوْ لَمْ يَفِيئُوا لَكَانَ الْوَاجِبَ عَلَيْهِ فِيمَا أَنْزَلَ اللَّهُ أَنْ لَا يَرْفَعَ السَّيْفَ عَنْهُمْ حَتَّى يَفِيئُوا وَ يَرْجِعُوا عَنْ رَأْيِهِمْ لِأَنَّهُمْ بَايَعُوا طَائِعِينَ غَيْرَ كَارِهِينَ وَ هِيَ الْفِئَةُ الْبَاغِيَةُ كَمَا قَالَ اللَّهُ تَعَالَى فَكَانَ الْوَاجِبَ عَلَى أَمِيرِ الْمُؤْمِنِينَ (عليه السلام) أَنْ يَعْدِلَ فِيهِمْ حَيْثُ كَانَ ظَفِرَ بِهِمْ كَمَا عَدَلَ رَسُولُ اللَّهِ (صلى الله عليه وآله) فِي أَهْلِ مَكَّةَ إِنَّمَا مَنَّ عَلَيْهِمْ وَ عَفَا وَ كَذَلِكَ صَنَعَ أَمِيرُ الْمُؤْمِنِينَ (عليه السلام) بِأَهْلِ الْبَصْرَةِ حَيْثُ ظَفِرَ بِهِمْ مِثْلَ مَا صَنَعَ النَّبِيُّ (صلى الله عليه وآله) بِأَهْلِ مَكَّةَ حَذْوَ النَّعْلِ بِالنَّعْلِ قَالَ قُلْتُ قَوْلُهُ عَزَّ وَ جَلَّ وَ الْمُؤْتَفِكَةَ أَهْوى قَالَ هُمْ أَهْلُ الْبَصْرَةِ هِيَ الْمُؤْتَفِكَةُ قُلْتُ وَ الْمُؤْتَفِكاتِ أَتَتْهُمْ رُسُلُهُمْ بِالْبَيِّناتِ قَالَ أُولَئِكَ قَوْمُ لُوطٍ ائْتَفَكَتْ عَلَيْهِمُ انْقَلَبَتْ عَلَيْهِمْ.",
                    "englishText": "202. From him, from Ali Bin Al-Husayn, from Ali Bin Abu hamza, from Abu Baseer, who has narrated the following: Abu Abdullah  regarding the Statement of Allah (azwj) Mighty and Majestic: “[58:7] Nowhere is there a secret counsel between three persons but He is the fourth of them, nor (between) five but He is the sixth of them, nor less than that nor more but He is with them wherever they are; then He will inform them of what they did on the day of resurrection: surely Allah is Cognizant of all things”. He  said; ‘This was Revealed regarding so and so and so and so (Abu Bakr and Umar), and Abu Ubeyda Ibn Al-Jarrah, and Abdul Rahman Ibn Awf, and Saalim Mawla Abu Huzeyfa, and Al-Mugheira Bin Sho’ba, when they wrote the agreement in between them and took a pledge and agreed that if Muhammad ﷺ were to pass away, they would not let the Caliphate to be in the Clan of Hashim, nor the Prophet-hood ever. So Allah (azwj) Mighty and Majestic Revealed this Verse with regards to them. I said, ‘The Statement of the Mighty and Majestic: “[43:79] Or have they settled an affair? Then surely, We are the settlers. [43:80] Or do they think that We do not hear what they conceal and their secret discourses? Indeed (We do), and Our messengers are by them, to record”. He  said: ‘And these two Verse were Revealed regarding them on that day’. Abu Abdullah  said: ‘Hopefully you will see that is was a day resembling the day of the writing of the agreement except for the day Al-Husayn  was martyred, and thus it had preceded in the Knowledge of Allah (azwj) Mighty and Majestic which He (azwj) Made known to the Rasool Allah ﷺ that when the agreement is written down, Al-Husayn  would be martyred, and the kingdom would exit from the Clan of Hashim. So all of that did take place. I said, ‘The Verse: “[49:9] And if two parties of the believers quarrel, make peace between them; but if one of them acts wrongfully towards the other, fight that which acts wrongfully until it returns to Allah’s command; then if it returns, make peace between them with justice and act equitably; surely Allah loves those who act equitably”. He  said: ‘The two groups, but rather its explanation came on the day of Al-Basra (The battle of the Camel), and they are the ones belonging to this Verse, and they are the ones who rebelled against Amir-ul-Momineen . So it was obligatory upon him  to fight them, and he  fought them until they submitted to the Command of Allah (azwj). And had they not been submitted, it became obligatory upon him  with regards to what Allah (azwj) Revealed, that he  should not raise his sword (stop fighting) until they complied and returned from their opinions, because they had pledged their allegiances willingly, without compulsion. And this is the rebel group as Allah (azwj) the High has Said. So it was obligatory upon Amir-ul-Momineen  that he  should deal with justice among them when he  was victorious over them, just as the Rasool Allah ﷺ had been just among the people of Mecca, he ﷺ was benevolent upon them and forgave them. And that is what Amir-ul-Momineen  did with the people of Al-Basra when he  was victorious over them similar to what the Rasool Allah ﷺ did with the people of Mecca. Like a sandal follows a sandal (same footsteps). I said, ‘(What about) the Statement of the Mighty and Majestic: “[53:53] And He destroyed the Overthrown Cities (of Sodom and Gomorrah)”. He  said: ‘These are the people of Al-Basra. It is the overthrown city’. I said, ‘(What about) “[9:70] and the overthrown cities; their messengers came to them with clear arguments”. He  said: ‘They were the people of Lut , their town was turned upside down upon them’.",
                    "href": "https://thaqalayn.net/hadith/8/1/202/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "موثق على الظهر",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 68)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "236": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Expiation for an omen",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) كَفَّارَةُ الطِّيَرَةِ التَّوَكُّلُ.",
                    "englishText": "236. Ali Bin Ibrahim, from his father, from Al-Nawfaly, from Al-Sakuny, who has narrated: Abu Abdullah  says that the Rasool Allah ﷺ said: ‘The expiration of the omen is the reliance (upon Allah (azwj))’.",
                    "href": "https://thaqalayn.net/hadith/8/1/236/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "ضعيف على الشهور",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 100)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "253": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Two callers at both ends of the day",
                    "arabicText": "عَنْهُ عَنْ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ وَ الْحَجَّالِ عَنْ دَاوُدَ بْنِ فَرْقَدٍ قَالَ سَمِعَ رَجُلٌ مِنَ الْعِجْلِيَّةِ هَذَا الْحَدِيثَ قَوْلَهُ يُنَادِي مُنَادٍ أَلَا إِنَّ فُلَانَ بْنَ فُلَانٍ وَ شِيعَتَهُ هُمُ الْفَائِزُونَ أَوَّلَ النَّهَارِ وَ يُنَادِي آخِرَ النَّهَارِ أَلَا إِنَّ عُثْمَانَ وَ شِيعَتَهُ هُمُ الْفَائِزُونَ قَالَ وَ يُنَادِي أَوَّلَ النَّهَارِ مُنَادَى آخِرِ النَّهَارِ فَقَالَ الرَّجُلُ فَمَا يُدْرِينَا أَيُّمَا الصَّادِقُ مِنَ الْكَاذِبَ فَقَالَ يُصَدِّقُهُ عَلَيْهَا مَنْ كَانَ يُؤْمِنُ بِهَا قَبْلَ أَنْ يُنَادِيَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ أَ فَمَنْ يَهْدِي إِلَى الْحَقِّ أَحَقُّ أَنْ يُتَّبَعَ أَمَّنْ لا يَهِدِّي إِلَّا أَنْ يُهْدى الْآيَةَ.",
                    "englishText": "253. From him, from Muhammad, from Ibn Fazzaal and Al-hajjaal, from Dawood Bin Farqad who said: A man from Ajaliyya heard this Hadeeth – A caller will call out: ‘So and so son of so and so and his Shites are the successful ones’ at the beginning of the day, and another one will call out at the end of the day: ‘Usman and his Shites are the successful ones’. He  said: ‘And the caller at the beginning of the day and (another) calling at the end of the day’. So the man said, ‘So what would make us understand which one is the truthful from the liar?’ So he  said: ‘The one who would believe in it before the call, would be ratifying it. Allah (azwj) Says: “[10:35] Is He then Who guides to the truth more worthy to be followed, or he who himself does not go aright unless he is guided?” The verse.",
                    "href": "https://thaqalayn.net/hadith/8/1/253/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "صحيح معتمد أو موقوف",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 127)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "259": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Excellence of Shi’ah",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَمْرِو بْنِ أَبِي الْمِقْدَامِ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ خَرَجْتُ أَنَا وَ أَبِي حَتَّى إِذَا كُنَّا بَيْنَ الْقَبْرِ وَ الْمِنْبَرِ إِذَا هُوَ بِأُنَاسٍ مِنَ الشِّيعَةِ فَسَلَّمَ عَلَيْهِمْ ثُمَّ قَالَ إِنِّي وَ اللَّهِ لَأُحِبُّ رِيَاحَكُمْ وَ أَرْوَاحَكُمْ فَأَعِينُونِي عَلَى ذَلِكَ بِوَرَعٍ وَ اجْتِهَادٍ وَ اعْلَمُوا أَنَّ وَلَايَتَنَا لَا تُنَالُ إِلَّا بِالْوَرَعِ وَ الِاجْتِهَادِ وَ مَنِ ائْتَمَّ مِنْكُمْ بِعَبْدٍ فَلْيَعْمَلْ بِعَمَلِهِ أَنْتُمْ شِيعَةُ اللَّهِ وَ أَنْتُمْ أَنْصَارُ اللَّهِ وَ أَنْتُمُ السَّابِقُونَ الْأَوَّلُونَ وَ السَّابِقُونَ الْآخِرُونَ وَ السَّابِقُونَ فِي الدُّنْيَا وَ السَّابِقُونَ فِي الْآخِرَةِ إِلَى الْجَنَّةِ قَدْ ضَمِنَّا لَكُمُ الْجَنَّةَ بِضَمَانِ اللَّهِ عَزَّ وَ جَلَّ وَ ضَمَانِ رَسُولِ اللَّهِ (صلى الله عليه وآله) وَ اللَّهِ مَا عَلَى دَرَجَةِ الْجَنَّةِ أَكْثَرُ أَرْوَاحاً مِنْكُمْ فَتَنَافَسُوا فِي فَضَائِلِ الدَّرَجَاتِ أَنْتُمُ الطَّيِّبُونَ وَ نِسَاؤُكُمُ الطَّيِّبَاتُ كُلُّ مُؤْمِنَةٍ حَوْرَاءُ عَيْنَاءُ وَ كُلُّ مُؤْمِنٍ صِدِّيقٌ وَ لَقَدْ قَالَ أَمِيرُ الْمُؤْمِنِينَ (عليه السلام) لِقَنْبَرٍ يَا قَنْبَرُ أَبْشِرْ وَ بَشِّرْ وَ اسْتَبْشِرْ فَوَ اللَّهِ لَقَدْ مَاتَ رَسُولُ اللَّهِ (صلى الله عليه وآله) وَ هُوَ عَلَى أُمَّتِهِ سَاخِطٌ إِلَّا الشِّيعَةَ أَلَا وَ إِنَّ لِكُلِّ شَيْ‏ءٍ عِزّاً وَ عِزُّ الْإِسْلَامِ الشِّيعَةُ أَلَا وَ إِنَّ لِكُلِّ شَيْ‏ءٍ دِعَامَةً وَ دِعَامَةُ الْإِسْلَامِ الشِّيعَةُ أَلَا وَ إِنَّ لِكُلِّ شَيْ‏ءٍ ذِرْوَةً وَ ذِرْوَةُ الْإِسْلَامِ الشِّيعَةُ أَلَا وَ إِنَّ لِكُلِّ شَيْ‏ءٍ شَرَفاً وَ شَرَفُ الْإِسْلَامِ الشِّيعَةُ أَلَا وَ إِنَّ لِكُلِّ شَيْ‏ءٍ سَيِّداً وَ سَيِّدُ الْمَجَالِسِ مَجَالِسُ الشِّيعَةِ أَلَا وَ إِنَّ لِكُلِّ شَيْ‏ءٍ إِمَاماً وَ إِمَامُ الْأَرْضِ أَرْضٌ تَسْكُنُهَا الشِّيعَةُ وَ اللَّهِ لَوْ لَا مَا فِي الْأَرْضِ مِنْكُمْ مَا رَأَيْتَ بِعَيْنٍ عُشْباً أَبَداً وَ اللَّهِ لَوْ لَا مَا فِي الْأَرْضِ مِنْكُمْ مَا أَنْعَمَ اللَّهُ عَلَى أَهْلِ خِلَافِكُمْ وَ لَا أَصَابُوا الطَّيِّبَاتِ مَا لَهُمْ فِي الدُّنْيَا وَ لَا لَهُمْ فِي الْآخِرَةِ مِنْ نَصِيبٍ كُلُّ نَاصِبٍ وَ إِنْ تَعَبَّدَ وَ اجْتَهَدَ مَنْسُوبٌ إِلَى هَذِهِ الْآيَةِ عامِلَةٌ ناصِبَةٌ تَصْلى ناراً حامِيَةً فَكُلُّ نَاصِبٍ مُجْتَهِدٍ فَعَمَلُهُ هَبَاءٌ شِيعَتُنَا يَنْطِقُونَ بِنُورِ اللَّهِ عَزَّ وَ جَلَّ وَ مَنْ يُخَالِفُهُمْ يَنْطِقُونَ بِتَفَلُّتٍ وَ اللَّهِ مَا مِنْ عَبْدٍ مِنْ شِيعَتِنَا يَنَامُ إِلَّا أَصْعَدَ اللَّهُ عَزَّ وَ جَلَّ رُوحَهُ إِلَى السَّمَاءِ فَيُبَارِكُ عَلَيْهَا فَإِنْ كَانَ قَدْ أَتَى عَلَيْهَا أَجَلُهَا جَعَلَهَا فِي كُنُوزِ رَحْمَتِهِ وَ فِي رِيَاضِ جَنَّةٍ وَ فِي ظِلِّ عَرْشِهِ وَ إِنْ كَانَ أَجَلُهَا مُتَأَخِّراً بَعَثَ بِهَا مَعَ أَمَنَتِهِ مِنَ الْمَلَائِكَةِ لِيَرُدُّوهَا إِلَى الْجَسَدِ الَّذِي خَرَجَتْ مِنْهُ لِتَسْكُنَ فِيهِ وَ اللَّهِ إِنَّ حَاجَّكُمْ وَ عُمَّارَكُمْ لَخَاصَّةُ اللَّهِ عَزَّ وَ جَلَّ وَ إِنَّ فُقَرَاءَكُمْ لَأَهْلُ الْغِنَى وَ إِنَّ أَغْنِيَاءَكُمْ لَأَهْلُ الْقَنَاعَةِ وَ إِنَّكُمْ كُلَّكُمْ لَأَهْلُ دَعْوَتِهِ وَ أَهْلُ إِجَابَتِهِ.",
                    "englishText": "259. Ali Bin Ibrahim, from his father, from Ibn Abi ‘Umayr, from Amro Bin Abu Al-Maqdaam who said: I heard Abu Abdullah  saying: ‘I  and my  father  went out until we  arrived in between the Grave and the Pulpit (of the Rasool Allah ﷺ). There was a group of Shites over there, so I  greeted them, and then said: ‘By Allah (azwj)! I  love your aromas, and your spirits, so help me  upon that by being pious and striving. And know that our  Wilayah cannot be achieved except by piety and the striving, and the one from among you who follows a servant (an Imam ); he should emulate what he does. You are the Shites of Allah (azwj), and you are the Helpers of Allah (azwj), and you are the foremost of the former ones, and the foremost of the later ones, and the foremost in the world, and the foremost in the Hereafter (and) to the Paradise. We  have taken your responsibility for the Paradise on the Guarantee of Allah (azwj) Mighty and Majestic, and the guarantee of the Rasool Allah ﷺ. By Allah (azwj)! There are no Levels of the Paradise where there are more Spirits than yours, so compete for the higher Levels. You are the good ones and your women are the good ones. Every Believing woman is a virgin Hourie and every Believer is a Truthful one. And Amir-ul-Momineen  has said to Qanbar: ‘Receive good news, rejoice with the good news, and convey the good news, for, by Allah (azwj), the Rasool Allah ﷺ passed away while he ﷺ was angry with his ﷺ community except for the Shites’. Indeed! For everything there is an honour and the honour of Al-Islam are the Shites. Indeed! For everything there is a pillar and the pillar of Al-Islam are the Shites. Indeed! For everything there is a chief and the chief of the gatherings is the gathering of the Shites. Indeed! For every thing is an Imam, and the Imam of the earth is the land on which the Shites live. By Allah (azwj)! Had you all not been in the earth, an eye would have never ever see herbs. By Allah (azwj)! Had you all not been in the earth, Allah (azwj) would not have Favoured the people who oppose you nor would they have been in any goodness. They would have nothing for them in the world nor any share for them in the Hereafter. Every hostile one (Nasibi), if he were to worship, and struggle, would be attributed to this Verse: “[88:3] Toiling, Hostile one [88:4] Entering into burning fire”. So every Hostile One (Nasibi) who struggles, his deeds would be wasted. Our  Shites speak with the ‘بِنُورِ’ Light of Allah (azwj) Mighty and Majestic, and the one who are opposed to them speak by instinct (biological needs). By Allah (azwj)! There is none from our  Shites who sleeps, except that Allah (azwj) Makes his soul to ascend to the sky to be Blessed. So if its term (death) has come, He (azwj) Makes it to be within the Treasures of His (azwj) Mercy, and in the Gardens of Paradise, and in the Shade of His (azwj) Throne. And if its term (death) has been delayed, He (azwj) sends it back along with the trusted Angels to return it to the body from which it came out to dwell in it. By Allah (azwj) those of you who perform the Hajj and the Umrah are the special ones of Allah (azwj) Mighty and Majestic. And the poor ones among you are the rich ones, and your rich ones are the contented ones. And all of you are the people whom He (azwj) Invited and the people who accepted His (azwj) Call’.",
                    "href": "https://thaqalayn.net/hadith/8/1/259/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "متلف فيه",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 132)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "273": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: More severe…is the poverty",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) مَا أَشَدَّ حُزْنَ النِّسَاءِ وَ أَبْعَدَ فِرَاقَ الْمَوْتِ وَ أَشَدُّ مِنْ ذَلِكَ كُلِّهِ فَقْرٌ يَتَمَلَّقُ صَاحِبُهُ ثُمَّ لَا يُعْطَى شَيْئاً.",
                    "englishText": "273. Ali Bin Ibrahim, from his father, from Al-nawfaly, from Al-Sakuny, who has narrated the following: Abu Abdullah  has said that the Rasool Allah ﷺ said: ‘There is nothing more intense than the grief of a woman, nor anything more remote than the separation of the death, and more intense than all of that is poverty. One flatters his companion, who then does not give him anything’.",
                    "href": "https://thaqalayn.net/hadith/8/1/273/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "ضعيف على الشهور",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 144)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "334": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Truth defeats falsehood",
                    "arabicText": "عَنْهُ عَنْ أَبِيهِ عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) لَيْسَ مِنْ بَاطِلٍ يَقُومُ بِإِزَاءِ الْحَقِّ إِلَّا غَلَبَ الْحَقُّ الْبَاطِلَ وَ ذَلِكَ قَوْلُهُ عَزَّ وَ جَلَّ بَلْ نَقْذِفُ بِالْحَقِّ عَلَى الْباطِلِ فَيَدْمَغُهُ فَإِذا هُوَ زاهِقٌ.",
                    "englishText": "334. From him, from his father, from Yunus Bin Abdul Rahmaan with an unbroken chain, said: Abu Abdullah  said: ‘There is nothing from the falsehood which can stand up to the truth, but the truth will overcome the falsehood, and this is the Statement of the Mighty and Majestic; “[21:18] Nay! We cast the truth against the falsehood, so that it breaks its head, and lo! it vanishes”.",
                    "href": "https://thaqalayn.net/hadith/8/1/334/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "مرفوع",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 205)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "340": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: The question of Sadir from Abu Ja’far AS",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَنَانِ بْنِ سَدِيرٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ حَنَانِ بْنِ سَدِيرٍ عَنْ أَبِيهِ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ (عليه السلام) عَنْهُمَا فَقَالَ يَا أَبَا الْفَضْلِ مَا تَسْأَلُنِي عَنْهُمَا فَوَ اللَّهِ مَا مَاتَ مِنَّا مَيِّتٌ قَطُّ إِلَّا سَاخِطاً عَلَيْهِمَا وَ مَا مِنَّا الْيَوْمَ إِلَّا سَاخِطاً عَلَيْهِمَا يُوصِي بِذَلِكَ الْكَبِيرُ مِنَّا الصَّغِيرَ إِنَّهُمَا ظَلَمَانَا حَقَّنَا وَ مَنَعَانَا فَيْئَنَا وَ كَانَا أَوَّلَ مَنْ رَكِبَ أَعْنَاقَنَا وَ بَثَقَا عَلَيْنَا بَثْقاً فِي الْإِسْلَامِ لَا يُسْكَرُ أَبَداً حَتَّى يَقُومَ قَائِمُنَا أَوْ يَتَكَلَّمَ مُتَكَلِّمُنَا ثُمَّ قَالَ أَمَا وَ اللَّهِ لَوْ قَدْ قَامَ قَائِمُنَا أَوْ تَكَلَّمَ مُتَكَلِّمُنَا لَأَبْدَى مِنْ أُمُورِهِمَا مَا كَانَ يُكْتَمُ وَ لَكَتَمَ مِنْ أُمُورِهِمَا مَا كَانَ يُظْهَرُ وَ اللَّهِ مَا أُسِّسَتْ مِنْ بَلِيَّةٍ وَ لَا قَضِيَّةٍ تَجْرِي عَلَيْنَا أَهْلَ الْبَيْتِ إِلَّا هُمَا أَسَّسَا أَوَّلَهَا فَعَلَيْهِمَا لَعْنَةُ اللَّهِ وَ الْمَلَائِكَةِ وَ النَّاسِ أَجْمَعِينَ.",
                    "englishText": "340. Ali Bin Ibrahim, from his father, from hanaan Bin Sudeyr, and Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, from Hanaan Bin Sudeyr, from his father who said: I asked Abu Ja’far  about the two (Abu Bakr and Umar), so he  said: ‘O Abu Al-Fazl, don’t ask me about these two, for by Allah (azwj), no one from among us  passes away at all except being angry against these two, and there is none from us  today except that he  is angry at them. The old ones bequeath it to the young ones from us . These two have been unjust to us  for our  rights, and prevented us  from our  Fey (Spoils of War – Khums), and first one rode upon our  necks, and caused damage to us  with a damage in Al-Islam which can never be repaired ever until our  Qaim  makes a stand and speaks our  speech’. Then he  said; ‘But, by Allah (azwj), when our  Qaim  makes a stand, or speaks our  speech, he  will expose the matters of these two of what they had concealed, and conceal from their matters what they used to make apparent. By Allah (azwj), nothing has afflicted us  from the afflictions, and what has passed of the difficulties against us , the People  of the Household, except that these two laid the foundations of it at first place, so against these two are the Curses of Allah (azwj), and the Angels, and the people altogether’.",
                    "href": "https://thaqalayn.net/hadith/8/1/340/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "حسن  أو موثق",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 212)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "346": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: The signature of al-Rida AS for his companion",
                    "arabicText": "الْحُسَيْنُ بْنُ مُحَمَّدٍ وَ مُحَمَّدُ بْنُ يَحْيَى جَمِيعاً عَنْ مُحَمَّدِ بْنِ سَالِمِ بْنِ أَبِي سَلَمَةَ عَنِ الْحَسَنِ بْنِ شَاذَانَ الْوَاسِطِيِّ قَالَ كَتَبْتُ إِلَى أَبِي الْحَسَنِ الرِّضَا (عليه السلام) أَشْكُو جَفَاءَ أَهْلِ وَاسِطٍ وَ حَمْلَهُمْ عَلَيَّ وَ كَانَتْ عِصَابَةٌ مِنَ الْعُثْمَانِيَّةِ تُؤْذِينِي فَوَقَّعَ بِخَطِّهِ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى أَخَذَ مِيثَاقَ أَوْلِيَائِنَا عَلَى الصَّبْرِ فِي دَوْلَةِ الْبَاطِلِ فَاصْبِرْ لِحُكْمِ رَبِّكَ فَلَوْ قَدْ قَامَ سَيِّدُ الْخَلْقِ لَقَالُوا يا وَيْلَنا مَنْ بَعَثَنا مِنْ مَرْقَدِنا هذا ما وَعَدَ الرَّحْمنُ وَ صَدَقَ الْمُرْسَلُونَ.",
                    "englishText": "346. Al-Husayn Bin Muhammad, and Muhammad Bin Yahya, together from Muhammad Bin Saalim Bin Abu Salma, from Al-Hassan Bin Shazaan Al-Wasity who said: I wrote to Abu Al-Hassan Al-Ridha  complaining of my alienation from the people of ‘وَاسِطٍ’, and their burdening me, and they were from the Uthmaniyya group, hurting me’. So a reply came in his  handwriting: ‘Surely Allah (azwj) has Taken a Covenant from our  friends for the patience during the government of the falsehood. So be patient for the Judgement of your Lord (azwj). So when the chief of the creatures (Al-Qaim ) makes a stand, they would say: “[36:52] They shall say: O woe to us! who has raised us up from our sleeping-place? This is what the Beneficent Allah promised and the messengers told the truth”.’",
                    "href": "https://thaqalayn.net/hadith/8/1/346/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "مجهول ومنهم من يعده ضعيفا",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 217)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "351": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Leaving a dead body with something heavy in water",
                    "arabicText": "يَحْيَى الْحَلَبِيُّ عَنْ أَبِي الْمُسْتَهِلِّ عَنْ سُلَيْمَانَ بْنِ خَالِدٍ قَالَ سَأَلَنِي أَبُو عَبْدِ اللَّهِ (عليه السلام) فَقَالَ مَا دَعَاكُمْ إِلَى الْمَوْضِعِ الَّذِي وَضَعْتُمْ فِيهِ زَيْداً قَالَ قُلْتُ خِصَالٌ ثَلَاثٌ أَمَّا إِحْدَاهُنَّ فَقِلَّةُ مَنْ تَخَلَّفَ مَعَنَا إِنَّمَا كُنَّا ثَمَانِيَةَ نَفَرٍ وَ أَمَّا الْأُخْرَى فَالَّذِي تَخَوَّفْنَا مِنَ الصُّبْحِ أَنْ يَفْضَحَنَا وَ أَمَّا الثَّالِثَةُ فَإِنَّهُ كَانَ مَضْجَعَهُ الَّذِي كَانَ سَبَقَ إِلَيْهِ فَقَالَ كَمْ إِلَى الْفُرَاتِ مِنَ الْمَوْضِعِ الَّذِي وَضَعْتُمُوهُ فِيهِ قُلْتُ قَذْفَةُ حَجَرٍ فَقَالَ سُبْحَانَ اللَّهِ أَ فَلَا كُنْتُمْ أَوْقَرْتُمُوهُ حَدِيداً وَ قَذَفْتُمُوهُ فِي الْفُرَاتِ وَ كَانَ أَفْضَلَ فَقُلْتُ جُعِلْتُ فِدَاكَ لَا وَ اللَّهِ مَا طُقْنَا لِهَذَا فَقَالَ أَيَّ شَيْ‏ءٍ كُنْتُمْ يَوْمَ خَرَجْتُمْ مَعَ زَيْدٍ قُلْتُ مُؤْمِنِينَ قَالَ فَمَا كَانَ عَدُوُّكُمْ قُلْتُ كُفَّاراً قَالَ فَإِنِّي أَجِدُ فِي كِتَابِ اللَّهِ عَزَّ وَ جَلَّ يَا أَيُّهَا الَّذِينَ آمَنُوا فَإِذا لَقِيتُمُ الَّذِينَ كَفَرُوا فَضَرْبَ الرِّقابِ حَتَّى إِذا أَثْخَنْتُمُوهُمْ فَشُدُّوا الْوَثاقَ فَإِمَّا مَنًّا بَعْدُ وَ إِمَّا فِداءً حَتَّى تَضَعَ الْحَرْبُ أَوْزارَها فَابْتَدَأْتُمْ أَنْتُمْ بِتَخْلِيَةِ مَنْ أَسَرْتُمْ سُبْحَانَ اللَّهِ مَا اسْتَطَعْتُمْ أَنْ تَسِيرُوا بِالْعَدْلِ سَاعَةً.",
                    "englishText": "351. Yahya Al-Halby, from Abu Al-Mustahal, from Suleyman Bin Khalid who said: Abu Abdullah  questioned me: ‘What was the place in which you placed (the body of) Zayd?’ I said, ‘There were three issues. As for one of them, so there were very few of us who were left behind with us, but rather, we were eight persons. As for the other one, so we were afraid from the morning, which would have exposed us. And as for the third, so it was his bed (resting place) which he proceeded to’. So he  said: ‘How far was the Euphrates from the place in which you placed (buried) him?’ I said, ‘A stone’s throw away’. So he  said: ‘Glory be to Allah (azwj)! So why did you all not tie a (piece of) iron to him, and throw him in the Euphrates, and that would have been preferable?’ I said, ‘May I be sacrificed for you , no, by Allah (azwj), we had no way for this’. So he  said: ‘Which thing (were you on) on the day you all came out with Zayd?’ I said, ‘We were Believers’. He  said: ‘Who were your enemies?’ I said, ‘Infidels’. He  said: ‘I  found in the Book of Allah (azwj) Mighty and Majestic: \"[47:4] So when you meet in battle those who disbelieve, then smite the necks until when you have overcome them, then make (them) prisoners, and afterwards either set them free as a favour or let them ransom (themselves) until the war terminates”. You all began by evacuating yourselves from captivity. Glory be to Allah (azwj)! You did not have the ability to travel with the justice even for a while’.",
                    "href": "https://thaqalayn.net/hadith/8/1/351/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "مجهول ويكن عده ف السان",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 225)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "373": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: People of the right are Shi’ah",
                    "arabicText": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ النَّهْدِيِّ عَنْ مُعَاوِيَةَ بْنِ حُكَيْمٍ عَنْ بَعْضِ رِجَالِهِ عَنْ عَنْبَسَةَ بْنِ بِجَادٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ أَمَّا إِنْ كانَ مِنْ أَصْحابِ الْيَمِينِ فَسَلامٌ لَكَ مِنْ أَصْحابِ الْيَمِينِ فَقَالَ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) لِعَلِيٍّ (عليه السلام) هُمْ شِيعَتُكَ فَسَلِمَ وُلْدُكَ مِنْهُمْ أَنْ يَقْتُلُوهُمْ.",
                    "englishText": "373. Al-Husayn Bin Muhammad, from Muhammad Bin Ahmad Al-Nahdy, from Muawiya Bin Hukeym, from one of his men, from Anbasat Bin Bajaad, who has narrated: Abu Abdullah  regarding the Statement of Allah (azwj): “[56:90] And if he is of those on the right hand, [56:91] Then the greeting from those on the right hand”, so he  said: ‘The Rasool Allah ﷺ said to Ali : ‘These are your  Shites from whom your  children would be safe from being killed’.",
                    "href": "https://thaqalayn.net/hadith/8/1/373/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "مرسل بل ضعيف",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 249)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "376": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Hadith of the night journey",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ حَدِيدٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ لَمَّا أُسْرِيَ بِرَسُولِ اللَّهِ (صلى الله عليه وآله) أَصْبَحَ فَقَعَدَ فَحَدَّثَهُمْ بِذَلِكَ فَقَالُوا لَهُ صِفْ لَنَا بَيْتَ الْمَقْدِسِ قَالَ فَوَصَفَ لَهُمْ وَ إِنَّمَا دَخَلَهُ لَيْلًا فَاشْتَبَهَ عَلَيْهِ النَّعْتُ فَأَتَاهُ جَبْرَئِيلُ (عليه السلام) فَقَالَ انْظُرْ هَاهُنَا فَنَظَرَ إِلَى الْبَيْتِ فَوَصَفَهُ وَ هُوَ يَنْظُرُ إِلَيْهِ ثُمَّ نَعَتَ لَهُمْ مَا كَانَ مِنْ عِيرٍ لَهُمْ فِيمَا بَيْنَهُمْ وَ بَيْنَ الشَّامِ ثُمَّ قَالَ هَذِهِ عِيرُ بَنِي فُلَانٍ تَقْدَمُ مَعَ طُلُوعِ الشَّمْسِ يَتَقَدَّمُهَا جَمَلٌ أَوْرَقُ أَوْ أَحْمَرُ قَالَ وَ بَعَثَ قُرَيْشٌ رَجُلًا عَلَى فَرَسٍ لِيَرُدَّهَا قَالَ وَ بَلَغَ مَعَ طُلُوعِ الشَّمْسِ قَالَ قُرْطَةُ بْنُ عَبْدِ عَمْرٍو يَا لَهْفاً أَلَّا أَكُونَ لَكَ جَذَعاً حِينَ تَزْعُمُ أَنَّكَ أَتَيْتَ بَيْتَ الْمَقْدِسِ وَ رَجَعْتَ مِنْ لَيْلَتِكَ.",
                    "englishText": "376. Ali Bin Ibrahim, from his father, from Ahmad Bin Muhammad Bin Abu Nasr, from Abaan Bin Usmaan, from Hadeed, who has narrated the following: Abu Abdullah  has said: ‘When the ascension (Me’raaj) took place with the Rasool Allah ﷺ, in the morning he ﷺ sat and narrated it to them (his ﷺ companions). So they said to him ﷺ, ‘Describe for us Bayt Al-Maqdas’. So he ﷺ described it for them, as he ﷺ had seen it during the night, therefore they remained vague about it. So Jibraeel came to him ﷺ and said: ‘Look over there!’ So he ﷺ looked towards Al-Bayt (Al-Maqdas) and described it to them whilst looking at it. Then he ﷺ described for them the caravan, which was in between them and Syria. Then said: ‘These were the camels of the Clan of so and so and will be arriving with the rise of the sun, led by a red camel’. And the Quresyh then sent a man upon a horse to turn these back, but it still arrived with the rise of the sun. Qurtat Bin Abd Amro said, ‘O a grief that I don’t be for you a trunk (strong enough) when you ﷺ claims that you ﷺ came to Bait Al-Maqdis and returned in the same night (O Prophet ﷺ!).",
                    "href": "https://thaqalayn.net/hadith/8/1/376/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "موثق ولعل فيه سقطا",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 252)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "382": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Prohibition to rise before al-Qa’im",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ رِبْعِيٍّ رَفَعَهُ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ (عليه السلام) قَالَ وَ اللَّهِ لَا يَخْرُجُ وَاحِدٌ مِنَّا قَبْلَ خُرُوجِ الْقَائِمِ (عليه السلام) إِلَّا كَانَ مَثَلُهُ مَثَلَ فَرْخٍ طَارَ مِنْ وَكْرِهِ قَبْلَ أَنْ يَسْتَويَ جَنَاحَاهُ فَأَخَذَهُ الصِّبْيَانُ فَعَبِثُوا بِهِ.",
                    "englishText": "382. Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Rabi’e with an unbroken chain, has narrated the following: Ali  Bin Al-Husayn  has said: ‘By Allah (azwj)! There will not come out any one from us  before the coming out of Al-Qaim  except that his example would be of a nestling trying to come out from its nest before its wings have been formed, so the young boys grab hold of it and play with it’.",
                    "href": "https://thaqalayn.net/hadith/8/1/382/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "مرفوع",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 259)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "387": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Excellence of Bismi Allah (in the name of Allah)",
                    "arabicText": "أَحْمَدُ بْنُ مُحَمَّدٍ الْكُوفِيُّ عَنْ عَلِيِّ بْنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي نَجْرَانَ عَنْ هَارُونَ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قَالَ لِي كَتَمُوا بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ فَنِعْمَ وَ اللَّهِ الْأَسْمَاءُ كَتَمُوهَا كَانَ رَسُولُ اللَّهِ (صلى الله عليه وآله) إِذَا دَخَلَ إِلَى مَنْزِلِهِ وَ اجْتَمَعَتْ عَلَيْهِ قُرَيْشٌ يَجْهَرُ بِبِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ وَ يَرْفَعُ بِهَا صَوْتَهُ فَتُوَلِّي قُرَيْشٌ فِرَاراً فَأَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ فِي ذَلِكَ وَ إِذا ذَكَرْتَ رَبَّكَ فِي الْقُرْآنِ وَحْدَهُ وَلَّوْا عَلى أَدْبارِهِمْ نُفُوراً.",
                    "englishText": "387. Ahmad Bin Muhammad Al-Kufy, from Ali Bin Al-Hassan Bin Ali, from Abdul Rahmaan Bin Abu Najraan, from Haroun, who has said the following: Abu Abdullah  having said to me: ‘They have concealed ‘بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ’ ‘In the Name of Allah (azwj) the Beneficent, the Merciful’. So, by Allah (azwj), they have concealed the Best Name. The Rasool Allah ﷺ, when he  used to enter his ﷺ house, and the Quresyh were gathered against him ﷺ, would say loudly ‘بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ’ ‘In the Name of Allah (azwj), the Beneficent, the Merciful’, and raise his ﷺ voice with it. The Qureysh would then flee. So Allah (azwj) Mighty and Majestic Revealed with regards to that: “[17:46] And We have placed coverings on their hearts and a heaviness in their ears lest they understand it, and when you mention your Lord alone in the Quran they turn their backs in aversion”.’",
                    "href": "https://thaqalayn.net/hadith/8/1/387/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "الظاهر أنه صحيح",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 261)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "389": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: About the words of Allah ‘to ALlah belongs the kingdom’ (3:26)",
                    "arabicText": "عَنْهُ عَنْ إِبْرَاهِيمَ بْنِ أَبِي بَكْرِ بْنِ أَبِي سَمَّاكٍ عَنْ دَاوُدَ بْنِ فَرْقَدٍ عَنْ عَبْدِ الْأَعْلَى مَوْلَى آلِ سَامٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قُلْتُ لَهُ قُلِ اللَّهُمَّ مالِكَ الْمُلْكِ تُؤْتِي الْمُلْكَ مَنْ تَشاءُ وَ تَنْزِعُ الْمُلْكَ مِمَّنْ تَشاءُ أَ لَيْسَ قَدْ آتَى اللَّهُ عَزَّ وَ جَلَّ بَنِي أُمَيَّةَ الْمُلْكَ قَالَ لَيْسَ حَيْثُ تَذْهَبُ إِلَيْهِ إِنَّ اللَّهَ عَزَّ وَ جَلَّ آتَانَا الْمُلْكَ وَ أَخَذَتْهُ بَنُو أُمَيَّةَ بِمَنْزِلَةِ الرَّجُلِ يَكُونُ لَهُ الثَّوْبُ فَيَأْخُذُهُ الْآخَرُ فَلَيْسَ هُوَ لِلَّذِي أَخَذَهُ.",
                    "englishText": "389. From him, from Ibrahim bin Abu Bakr Bin Abu Sammaak, from Dawood Bin Farqad, from Abdul A’ala the slave of the progeny of Saam, who has said: I asked from Abu Abdullah  (about): “[3:26] Say: O Allah, Master of the Kingdom! You give the kingdom to whomsoever You please to and take away the kingdom from whomsoever You please to”. Has not Allah (azwj) Mighty and Majestic Given the kingdom to the Clan of Umayya?’ He  said; ‘This is not as, where you are going with it. Allah (azwj) Gave us  the kingdom and the Clan of Umayya took it away, like the man who has his clothes and another one takes it away from him, so it still does not belong to the one who took it (unlawfully)’.",
                    "href": "https://thaqalayn.net/hadith/8/1/389/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "مجهول وقد يعد ف السان",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 262)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "410": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Fevers can be reduced",
                    "arabicText": "عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ رَفَعَهُ إِلَى أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ الْحُمَّى تَخْرُجُ فِي ثَلَاثٍ فِي الْعَرَقِ وَ الْبَطَنِ وَ الْقَيْ‏ءِ.",
                    "englishText": "410. From him, from Ahmad Bin Muhammad, from Muhammad Bin Khalid with an unbroken chain going up to Abu Abdullah , who has narrated the following: Abu Abdullah  having said: ‘The fever goes out (is cured) in three (ways) – The sweating, and the excretion and the vomiting’.",
                    "href": "https://thaqalayn.net/hadith/8/1/410/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "مرفوع",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 279)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "421": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Ali ibn al-’Abbas",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ هِشَامٍ الْخُرَاسَانِيِّ عَنِ الْمُفَضَّلِ بْنِ عُمَرَ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ (عليه السلام) بِالْكُوفَةِ أَيَّامَ قَدِمَ عَلَى أَبِي الْعَبَّاسِ فَلَمَّا انْتَهَيْنَا إِلَى الْكُنَاسَةِ قَالَ هَاهُنَا صُلِبَ عَمِّي زَيْدٌ رَحِمَهُ اللَّهُ ثُمَّ مَضَى حَتَّى انْتَهَى إِلَى طَاقِ الزَّيَّاتِينَ وَ هُوَ آخِرُ السَّرَّاجِينَ فَنَزَلَ وَ قَالَ انْزِلْ فَإِنَّ هَذَا الْمَوْضِعَ كَانَ مَسْجِدَ الْكُوفَةِ الْأَوَّلَ الَّذِي خَطَّهُ آدَمُ (عليه السلام) وَ أَنَا أَكْرَهُ أَنْ أَدْخُلَهُ رَاكِباً قَالَ قُلْتُ فَمَنْ غَيَّرَهُ عَنْ خِطَّتِهِ قَالَ أَمَّا أَوَّلُ ذَلِكَ الطُّوفَانُ فِي زَمَنِ نُوحٍ (عليه السلام) ثُمَّ غَيَّرَهُ أَصْحَابُ كِسْرَى وَ نُعْمَانَ ثُمَّ غَيَّرَهُ بَعْدُ زِيَادُ بْنُ أَبِي سُفْيَانَ فَقُلْتُ وَ كَانَتِ الْكُوفَةُ وَ مَسْجِدُهَا فِي زَمَنِ نُوحٍ (عليه السلام) فَقَالَ لِي نَعَمْ يَا مُفَضَّلُ وَ كَانَ مَنْزِلُ نُوحٍ وَ قَوْمِهِ فِي قَرْيَةٍ عَلَى مَنْزِلٍ مِنَ الْفُرَاتِ مِمَّا يَلِي غَرْبِيَّ الْكُوفَةِ قَالَ وَ كَانَ نُوحٌ (عليه السلام) رَجُلًا نَجَّاراً فَجَعَلَهُ اللَّهُ عَزَّ وَ جَلَّ نَبِيّاً وَ انْتَجَبَهُ وَ نُوحٌ (عليه السلام) أَوَّلُ مَنْ عَمِلَ سَفِينَةً تَجْرِي عَلَى ظَهْرِ الْمَاءِ قَالَ وَ لَبِثَ نُوحٌ (عليه السلام) فِي قَوْمِهِ أَلْفَ سَنَةٍ إِلَّا خَمْسِينَ عَاماً يَدْعُوهُمْ إِلَى اللَّهِ عَزَّ وَ جَلَّ فَيَهْزَءُونَ بِهِ وَ يَسْخَرُونَ مِنْهُ فَلَمَّا رَأَى ذَلِكَ مِنْهُمْ دَعَا عَلَيْهِمْ فَقَالَ رَبِّ لا تَذَرْ عَلَى الْأَرْضِ مِنَ الْكافِرِينَ دَيَّاراً إِنَّكَ إِنْ تَذَرْهُمْ يُضِلُّوا عِبادَكَ وَ لا يَلِدُوا إِلَّا فاجِراً كَفَّاراً فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَى نُوحٍ أَنِ اصْنَعْ سَفِينَةً وَ أَوْسِعْهَا وَ عَجِّلْ عَمَلَهَا فَعَمِلَ نُوحٌ سَفِينَةً فِي مَسْجِدِ الْكُوفَةِ بِيَدِهِ فَأَتَى بِالْخَشَبِ مِنْ بُعْدٍ حَتَّى فَرَغَ مِنْهَا قَالَ الْمُفَضَّلُ ثُمَّ انْقَطَعَ حَدِيثُ أَبِي عَبْدِ اللَّهِ (عليه السلام) عِنْدَ زَوَالِ الشَّمْسِ فَقَامَ أَبُو عَبْدِ اللَّهِ (عليه السلام) فَصَلَّى الظُّهْرَ وَ الْعَصْرَ ثُمَّ انْصَرَفَ مِنَ الْمَسْجِدِ فَالْتَفَتَ عَنْ يَسَارِهِ وَ أَشَارَ بِيَدِهِ إِلَى مَوْضِعِ دَارِ الدَّارِيِّينَ وَ هُوَ مَوْضِعُ دَارِ ابْنِ حَكِيمٍ وَ ذَاكَ فُرَاتٌ الْيَوْمَ فَقَالَ لِي يَا مُفَضَّلُ وَ هَاهُنَا نُصِبَتْ أَصْنَامُ قَوْمِ نُوحٍ (عليه السلام) يَغُوثَ وَ يَعُوقَ وَ نَسْراً ثُمَّ مَضَى حَتَّى رَكِبَ دَابَّتَهُ فَقُلْتُ جُعِلْتُ فِدَاكَ فِي كَمْ عَمِلَ نُوحٌ سَفِينَتَهُ حَتَّى فَرَغَ مِنْهَا قَالَ فِي دَوْرَيْنِ قُلْتُ وَ كَمِ الدَّوْرَيْنِ قَالَ ثَمَانِينَ سَنَةً قُلْتُ وَ إِنَّ الْعَامَّةَ يَقُولُونَ عَمِلَهَا فِي خَمْسِمِائَةِ عَامٍ فَقَالَ كَلَّا كَيْفَ وَ اللَّهُ يَقُولُ وَ وَحْيِنا قَالَ قُلْتُ فَأَخْبِرْنِي عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ حَتَّى إِذا جاءَ أَمْرُنا وَ فارَ التَّنُّورُ فَأَيْنَ كَانَ مَوْضِعُهُ وَ كَيْفَ كَانَ فَقَالَ كَانَ التَّنُّورُ فِي بَيْتِ عَجُوزٍ مُؤْمِنَةٍ فِي دُبُرِ قِبْلَةِ مَيْمَنَةِ الْمَسْجِدِ فَقُلْتُ لَهُ فَإِنَّ ذَلِكَ مَوْضِعُ زَاوِيَةِ بَابِ الْفِيلِ الْيَوْمَ ثُمَّ قُلْتُ لَهُ وَ كَانَ بَدْءُ خُرُوجِ الْمَاءِ مِنْ ذَلِكَ التَّنُّورِ فَقَالَ نَعَمْ إِنَّ اللَّهَ عَزَّ وَ جَلَّ أَحَبَّ أَنْ يُرِيَ قَوْمَ نُوحٍ آيَةً ثُمَّ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى أَرْسَلَ عَلَيْهِمُ الْمَطَرَ يُفِيضُ فَيْضاً وَ فَاضَ الْفُرَاتُ فَيْضاً وَ الْعُيُونُ كُلُّهُنَّ فَيْضاً فَغَرَّقَهُمُ اللَّهُ عَزَّ ذِكْرُهُ وَ أَنْجَى نُوحاً وَ مَنْ مَعَهُ فِي السَّفِينَةِ فَقُلْتُ لَهُ كَمْ لَبِثَ نُوحٌ فِي السَّفِينَةِ حَتَّى نَضَبَ الْمَاءُ وَ خَرَجُوا مِنْهَا فَقَالَ لَبِثُوا فِيهَا سَبْعَةَ أَيَّامٍ وَ لَيَالِيَهَا وَ طَافَتْ بِالْبَيْتِ أُسْبُوعاً ثُمَّ اسْتَوَتْ عَلَى الْجُودِيِّ وَ هُوَ فُرَاتُ الْكُوفَةِ فَقُلْتُ لَهُ إِنَّ مَسْجِدَ الْكُوفَةِ قَدِيمٌ فَقَالَ نَعَمْ وَ هُوَ مُصَلَّى الْأَنْبِيَاءِ (عليهم السلام) وَ لَقَدْ صَلَّى فِيهِ رَسُولُ اللَّهِ (صلى الله عليه وآله) حِينَ أُسْرِيَ بِهِ إِلَى السَّمَاءِ فَقَالَ لَهُ جَبْرَئِيلُ (عليه السلام) يَا مُحَمَّدُ هَذَا مَسْجِدُ أَبِيكَ آدَمَ (عليه السلام) وَ مُصَلَّى الْأَنْبِيَاءِ (عليهم السلام) فَانْزِلْ فَصَلِّ فِيهِ فَنَزَلَ فَصَلَّى فِيهِ ثُمَّ إِنَّ جَبْرَئِيلَ (عليه السلام) عَرَجَ بِهِ إِلَى السَّمَاءِ.",
                    "englishText": "421. Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Hisham Al-Khurasany, from Al-Mufazzal Bin Umar who said: I was in the presence of Abu Abdullah  at Al-Kufa in the days of Ali Bin Al-Abbas. So when we ended up to Al-Kunasa, he  said: ‘Over there is where they crucified my  uncle Zayd, may Allah (azwj) have Mercy upon him’. Then we went until we ended up at the (market) stall of the oilmen, and it was at the end of the two lamps. So he  descended and said: ‘Descend, for this is the place where the Masjid Al-Kufa used to be at first which Adam  had marked, and I  do not like that I  should enter it riding’. I said, ‘So who was the other one who had marked it?’ He  said: ‘As for the first one, that was the storm during the era of Noah . Then others from the companions of Chosroe and Nu’man, and thereafter Ziyad Bin Abu Sufyan’. So I said, ‘And there was a Masjid at Al-Kufa during the era of Noah ?’ He  said to me; ‘Yes, O Mufazzal. And the houses of Noah  and his  people were in a town, at a place from the Euphrates which follows west of Al-Kufa’. He  said: ‘And Noah  was a carpenter. So Allah (azwj) Made him  a Prophet  and Answered him . And Noah  was the first one to make a ship which flowed upon the back of the water’. He  said: ‘And Noah  lived among his  people for fifty years less a thousand years (950), calling them to Allah (azwj) Mighty and Majestic. However, they derided him  and laughed at him . So when he  saw that from them, he  supplicated against them saying: ‘Lord (azwj)! Do not Leave upon the earth any house of the infidels. If You (azwj) Leave them, they will lead astray Your (azwj) servants, and will not give birth to anyone except the infidel tyrants’. So Allah (azwj) Revealed unto Noah  that he  should make a ship and make it a big one, and hurriedly. So Noah  made a ship in Masjid Al-Kufa by his  hands. He brought the wood from afar until he  finished it. Al-Mufazzal said, ‘Then Abu Abdullah  interrupted the Hadith during the sunset. So Abu Abdullah  stood up and Prayed the Midday Salat (Al-Zohar), and the Afternoon Salat (Al-Asar), then left from the Masjid. He  indicated by his  hand to his  left to a place where there was a house among the houses, and it was the place of the house of Ibn Hakeym, and where is Euphrates today, so he  said to me: ‘O Mufazzal! Over there is where the idols of the people of Noah  were fixed – Yagows, and Yaowq, and Nasraa’. Then he  went and rode upon his  animal. So I said, ‘May I be sacrificed for you , how long did it take for Noah  to build his  ship until he  finished it?’ He  said: ‘In two time periods’. I said, ‘And how long are these two time periods?’ He  said: ‘Eighty years’. I said, ‘The general Muslim are saying that he  built it over five hundred years’. He  said: ‘No! How are they saying this, and by Allah (azwj) it has been Revealed to us ?’ I said, ‘Inform me about the Statement of Allah (azwj): “[23:27] and when Our command is given and the oven overflows” so where is its place and how was it?’ He  said: ‘It was the oven in the house of an elderly believing woman in the direction of the Qiblah, on the right of the Masjid’. I said to him , ‘So that is the place of the corner of the Baab Al-Feel today’. Then I said to him , ‘And that is oven where the water started coming from?’ He  said: ‘Yes. Allah (azwj) Loved to show a sign to the people of Noah . Then Allah (azwj) Sent rain upon them which flooded them with a flood, and the Euphrates overflowed with a flood, and then all the rivers overflowed. Thus Allah (azwj) Drowned all of them and saved Noah  and those who were with him  in the ship’. So I said to him, ‘How long did Noah  remain in the ship until the water subsided, and he  came out from it?’ He  said: ‘He  remained in it for seven days and nights. It circled around the House for a week, then settled upon the Mount Joudy, and it is Euphrates of Al-Kufa’. I said to him , ‘The Masjid of Al-Kufa is old?’ He  said: ‘Yes, and it is a Praying place of Prophets , and the Rasool Allah ﷺ had Prayed in it when he ﷺ Taken on an ascension to the sky. So Jibraeel  said to him : ‘O Muhammad ﷺ! This is a Mosque of your ﷺ father Adam , and a Praying Place of the Prophets ’. So he ﷺ descended and Prayed therein. Then Jibraeel  ascended with him ﷺ to the sky’.",
                    "href": "https://thaqalayn.net/hadith/8/1/421/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "مجهول على الظهر ضعيف على الشهر",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (26/295)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "427": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Noah AS carried eight pairs",
                    "arabicText": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ إِسْمَاعِيلَ الْجُعْفِيِّ وَ عَبْدِ الْكَرِيمِ بْنِ عَمْرٍو وَ عَبْدِ الْحَمِيدِ بْنِ أَبِي الدَّيْلَمِ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ حَمَلَ نُوحٌ (عليه السلام) فِي السَّفِينَةِ الْأَزْوَاجَ الثَّمَانِيَةَ الَّتِي قَالَ اللَّهُ عَزَّ وَ جَلَّ ثَمانِيَةَ أَزْواجٍ مِنَ الضَّأْنِ اثْنَيْنِ وَ مِنَ الْمَعْزِ اثْنَيْنِ وَ مِنَ الْإِبِلِ اثْنَيْنِ وَ مِنَ الْبَقَرِ اثْنَيْنِ فَكَانَ مِنَ الضَّأْنِ اثْنَيْنِ زَوْجٌ دَاجِنَةٌ يُرَبِّيهَا النَّاسُ وَ الزَّوْجُ الْآخَرُ الضَّأْنُ الَّتِي تَكُونُ فِي الْجِبَالِ الْوَحْشِيَّةُ أُحِلَّ لَهُمْ صَيْدُهَا وَ مِنَ الْمَعْزِ اثْنَيْنِ زَوْجٌ دَاجِنَةٌ يُرَبِّيهَا النَّاسُ وَ الزَّوْجُ الْآخَرُ الظَّبْيُ الَّتِي تَكُونُ فِي الْمَفَاوِزِ وَ مِنَ الْإِبِلِ اثْنَيْنِ الْبَخَاتِيُّ وَ الْعِرَابُ وَ مِنَ الْبَقَرِ اثْنَيْنِ زَوْجٌ دَاجِنَةٌ لِلنَّاسِ وَ الزَّوْجُ الْآخَرُ الْبَقَرُ الْوَحْشِيَّةُ وَ كُلُّ طَيْرٍ طَيِّبٍ وَحْشِيٍّ أَوْ إِنْسِيٍّ ثُمَّ غَرِقَتِ الْأَرْضُ.",
                    "englishText": "427. Muhammad Bin Abu Abdullah, from Muhammad Bin Al-Husayn, from Muhammad Bin Sinan, from Ismail Al-Ju’fy and Abdul Kareem Bin Amro, and Abdul Hameed Bin Abu Al-Daylam, who has narrated the following: Abu Abdullah  has said: ‘Noah  carried eighty pairs in the ship about which Allah (azwj) Mighty and Majestic has Said: “[6:143] Eight in pairs - two of sheep and two of goats [6:144] And two of camels and two of cows”. So, from the pairs of the sheep were two sheep which were domestic ones which the people rear (keep), and another pair of sheep which were mountainous and wild sheep which are lawful to be hunted. And from the pair of goats, one was of the domesticated kind which the people rear, and another pair were the antelopes which are found in the wilderness. And from the camels were two ‘’ Al-Bukhaty and the Arabic (camels). And from the cows, was a pair of the kind domesticated to the people and another pair of cows were the wild ones. And every kind of good birds, wild or domesticated. Then the earth submerged’.",
                    "href": "https://thaqalayn.net/hadith/8/1/427/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "ضعيف على الشهور",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 302)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "430": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Another report related to the previous",
                    "arabicText": "مُحَمَّدُ بْنُ أَبِي عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ إِسْمَاعِيلَ بْنِ جَابِرٍ وَ عَبْدِ الْكَرِيمِ بْنِ عَمْرٍو وَ عَبْدِ الْحَمِيدِ بْنِ أَبِي الدَّيْلَمِ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ عَاشَ نُوحٌ (عليه السلام) بَعْدَ الطُّوفَانِ خَمْسَمِائَةِ سَنَةٍ ثُمَّ أَتَاهُ جَبْرَئِيلُ (عليه السلام) فَقَالَ يَا نُوحُ إِنَّهُ قَدِ انْقَضَتْ نُبُوَّتُكَ وَ اسْتَكْمَلْتَ أَيَّامَكَ فَانْظُرْ إِلَى الِاسْمِ الْأَكْبَرِ وَ مِيرَاثِ الْعِلْمِ وَ آثَارِ عِلْمِ النُّبُوَّةِ الَّتِي مَعَكَ فَادْفَعْهَا إِلَى ابْنِكَ سَامٍ فَإِنِّي لَا أَتْرُكُ الْأَرْضَ إِلَّا وَ فِيهَا عَالِمٌ تُعْرَفُ بِهِ طَاعَتِي وَ يُعْرَفُ بِهِ هُدَايَ وَ يَكُونُ نَجَاةً فِيمَا بَيْنَ مَقْبِضِ النَّبِيِّ وَ مَبْعَثِ النَّبِيِّ الْآخَرِ وَ لَمْ أَكُنْ أَتْرُكُ النَّاسَ بِغَيْرِ حُجَّةٍ لِي وَ دَاعٍ إِلَيَّ وَ هَادٍ إِلَى سَبِيلِي وَ عَارِفٍ بِأَمْرِي فَإِنِّي قَدْ قَضَيْتُ أَنْ أَجْعَلَ لِكُلِّ قَوْمٍ هَادِياً أَهْدِي بِهِ السُّعَدَاءَ وَ يَكُونُ حُجَّةً لِي عَلَى الْأَشْقِيَاءِ قَالَ فَدَفَعَ نُوحٌ (عليه السلام) الِاسْمَ الْأَكْبَرَ وَ مِيرَاثَ الْعِلْمِ وَ آثَارَ عِلْمِ النُّبُوَّةِ إِلَى سَامٍ وَ أَمَّا حَامٌ وَ يَافِثُ فَلَمْ يَكُنْ عِنْدَهُمَا عِلْمٌ يَنْتَفِعَانِ بِهِ قَالَ وَ بَشَّرَهُمْ نُوحٌ (عليه السلام) بِهُودٍ (عليه السلام) وَ أَمَرَهُمْ بِاتِّبَاعِهِ وَ أَمَرَهُمْ أَنْ يَفْتَحُوا الْوَصِيَّةَ فِي كُلِّ عَامٍ وَ يَنْظُرُوا فِيهَا وَ يَكُونُ عِيداً لَهُمْ.",
                    "englishText": "430. Muhammad Bin Abu Abdullah, from Muhammad Bin Al-Husayn, from Muhammad Bin Sinan, from Ismail Bin Jabir, and Abdul Kareem Bin Amro, and Abdul Hameed Bin Abu Al-Daylam, who has narrated the following: Abu Abdullah  having said: ‘Noah  lived for five hundred years after the storm. Then Jibraeel  came to him , so he  said: “O Noah ! Your  Prophet-hood has expired, and your  days are complete, so look to the Great Name (Al-Ism Al-Akbar), and inheritance of the Knowledge, and effects of the Knowledge of the Prophet-hood which is with you  and hand these over to your  son Saam , for I (azwj) do not Leave the earth except that there is in it a Knowledgeable one by whom obedience to Me (azwj) can be recognised, and My (azwj) Guidance can be understood, and salvation can be in what is in between the passing away of a Prophet  and Sending of another Prophet  and I (azwj) never Leave the people without a Proof from Me (azwj) calling towards Me (azwj), and guides to My (azwj) Way, and understand My (azwj) Commands, for I (azwj) have Ordained that I (azwj) shall Make for every people a guide who will guide the fortunate ones and will be the Argument from Me (azwj) against the wretched ones”. He  said: ‘So Noah  handed over the Great Name, and inheritance of the Knowledge, and effects of the Knowledge of the Prophet-hood to Saam . And as for Haam, and Yaafas, so there was no knowledge in their possession that could be benefited from’. And Noah  gave them the good news of Hud  and commanded them to be obedient to him , and commanded them that they will open the will during every year, and look into it, and make it to be a day of festivities for themselves’.",
                    "href": "https://thaqalayn.net/hadith/8/1/430/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "ضعيف على الشهور",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 305)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "454": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: When people did what they did",
                    "arabicText": "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ الْكِنْدِيِّ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنِ الْفُضَيْلِ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ إِنَّ النَّاسَ لَمَّا صَنَعُوا مَا صَنَعُوا إِذْ بَايَعُوا أَبَا بَكْرٍ لَمْ يَمْنَعْ أَمِيرَ الْمُؤْمِنِينَ (عليه السلام) مِنْ أَنْ يَدْعُوَ إِلَى نَفْسِهِ إِلَّا نَظَراً لِلنَّاسِ وَتَخَوُّفاً عَلَيْهِمْ أَنْ يَرْتَدُّوا عَنِ الْإِسْلَامِ فَيَعْبُدُوا الْأَوْثَانَ وَ لَا يَشْهَدُوا أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَنَّ مُحَمَّداً رَسُولُ اللَّهِ (صلى الله عليه وآله) وَ كَانَ الْأَحَبَّ إِلَيْهِ أَنْ يُقِرَّهُمْ عَلَى مَا صَنَعُوا مِنْ أَنْ يَرْتَدُّوا عَنْ جَمِيعِ الْإِسْلَامِ وَ إِنَّمَا هَلَكَ الَّذِينَ رَكِبُوا مَا رَكِبُوا فَأَمَّا مَنْ لَمْ يَصْنَعْ ذَلِكَ وَ دَخَلَ فِيمَا دَخَلَ فِيهِ النَّاسُ عَلَى غَيْرِ عِلْمٍ وَ لَا عَدَاوَةٍ لِأَمِيرِ الْمُؤْمِنِينَ (عليه السلام) فَإِنَّ ذَلِكَ لَا يُكْفِرُهُ وَ لَا يُخْرِجُهُ مِنَ الْإِسْلَامِ وَ لِذَلِكَ كَتَمَ عَلِيٌّ (عليه السلام) أَمْرَهُ وَ بَايَعَ مُكْرَهاً حَيْثُ لَمْ يَجِدْ أَعْوَاناً.",
                    "englishText": "454. Humeyd Bin Ziyad, from Al-Hassan Bin Muhammad Al-Kindy, from someone else, from Abaan Bin Usmaan, from Al-Fazel, from Zurara, who has narrated the following: Abu Ja’far  has said that: ‘The people, when they did what they did, they pledged their allegiances to Abu Bakr, nothing prevented Amir-ul- Momineen  calling the people to himself  except that he  looked around at the people and feared for them that they would renege from Al-Islam, and resort to worshipping the idols and not testify that there is no god except Allah (azwj) and that Muhamamd ﷺ is the Rasool Allah ﷺ, and it was more beloved to him  than he  should agree with them upon what they had done rather than them reneging against the whole of Al-Islam. But rather, destroyed is the one who does what they did. So, as for the one who did not do that, and entered into what the people had entered into without knowledge or enmity against Amir-ul- Momineen , so for that they have neither blasphemed nor exited from Al-Islam, and it is for that reason that Ali  concealed his  matter, and had to pledge allegiance unwillingly, when he  did not find any helpers’.",
                    "href": "https://thaqalayn.net/hadith/8/1/454/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "كالوثق",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 326)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "463": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: a messenger from al-Madinah came....",
                    "arabicText": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ سِنَانٍ عَنْ إِسْمَاعِيلَ بْنِ جَابِرٍ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ (عليه السلام) بِمَكَّةَ إِذْ جَاءَهُ رَسُولٌ مِنَ الْمَدِينَةِ فَقَالَ لَهُ مَنْ صَحِبْتَ قَالَ مَا صَحِبْتُ أَحَداً فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ (عليه السلام) أَمَا لَوْ كُنْتُ تَقَدَّمْتُ إِلَيْكَ لَأَحْسَنْتُ أَدَبَكَ ثُمَّ قَالَ وَاحِدٌ شَيْطَانٌ وَ اثْنَانِ شَيْطَانَانِ وَ ثَلَاثٌ صَحْبٌ وَ أَرْبَعَةٌ رُفَقَاءُ.",
                    "englishText": "463. Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Sinan, from Ismail Bin Jabir who said: I was in the presence of Abu Abdullah  at Makkah when a messenger from Al-Medina came to him . So he  said to him: ‘Who did you come with?’ He said, ‘I had no one to accompany me’. Abu Abdullah  said to him: ‘But, if I  had come to see you, I  would have educated you of well manners’. Then said: ‘One is a Satan (la), and two are Satans (la), and three are a company, and four are friends’.",
                    "href": "https://thaqalayn.net/hadith/8/1/463/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "ضعيف على الشهور",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 384)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "467": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Fine supplies during a journey...",
                    "arabicText": "عَلِيٌّ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) عَنْ آبَائِهِ (عليهم السلام) قَالَ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) مِنْ شَرَفِ الرَّجُلِ أَنْ يُطَيِّبَ زَادَهُ إِذَا خَرَجَ فِي سَفَرِهِ.",
                    "englishText": "467. Ali, from his father, from Al-Nowfaly, from Al-Sakuny, who has narrated the following: Abu Abdullah , from his forefathers  having said: ‘The Rasool Allah ﷺ said: ‘It is from the nobility of the man that he would have good provisions when he goes out on a journey’.",
                    "href": "https://thaqalayn.net/hadith/8/1/467/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "ضعيف على الشهور",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 386)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "476": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Epic trials and conditions",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) سَيَأْتِي عَلَى أُمَّتِي زَمَانٌ تَخْبُثُ فِيهِ سَرَائِرُهُمْ وَ تَحْسُنُ فِيهِ عَلَانِيَتُهُمْ طَمَعاً فِي الدُّنْيَا وَ لَا يُرِيدُونَ بِهِ مَا عِنْدَ اللَّهِ رَبِّهِمْ يَكُونُ دِينُهُمْ رِيَاءً لَا يُخَالِطُهُمْ خَوْفٌ يَعُمُّهُمُ اللَّهُ مِنْهُ بِعِقَابٍ فَيَدْعُونَهُ دُعَاءَ الْغَرِيقِ فَلَا يَسْتَجِيبُ لَهُمْ.",
                    "englishText": "476. Ali Bin Ibrahim, from his father, from Al-Nowfaly, from Al-Sakuny, who has narrated the following: Abu Abdullah  has said that the Rasool Allah ﷺ said: ‘There will come a time upon my ﷺ community when they will be ugly in their inner selves and beautiful in their appearances. They will be greedy for what is in the world and will not be intending what is in the Presence of Allah (azwj), their Lord (azwj). Their Religion would have become a (matter of) show-off. Fear will not have entered into them. Allah (azwj) would Prevail over them with Punishment. So they would be supplicating by the supplication of the Drowning One (Du’a Al-Ghareek), so He (azwj) will not Answer to them’.",
                    "href": "https://thaqalayn.net/hadith/8/1/476/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "ضعيف على الشهور",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 400)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "477": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Hadith of Jurists and Scholars",
                    "arabicText": "عَنْهُ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ (عليه السلام) كَانَتِ الْفُقَهَاءُ وَ الْعُلَمَاءُ إِذَا كَتَبَ بَعْضُهُمْ إِلَى بَعْضٍ كَتَبُوا بِثَلَاثَةٍ لَيْسَ مَعَهُنَّ رَابِعَةٌ مَنْ كَانَتْ هِمَّتُهُ آخِرَتَهُ كَفَاهُ اللَّهُ هَمَّهُ مِنَ الدُّنْيَا وَ مَنْ أَصْلَحَ سَرِيرَتَهُ أَصْلَحَ اللَّهُ عَلَانِيَتَهُ وَ مَنْ أَصْلَحَ فِيمَا بَيْنَهُ وَ بَيْنَ اللَّهِ عَزَّ وَ جَلَّ أَصْلَحَ اللَّهُ تَبَارَكَ وَ تَعَالَى فِيمَا بَيْنَهُ وَ بَيْنَ النَّاسِ.",
                    "englishText": "477. From him, from his father, from Al-Nowfaly, from Al-Sakuny, who has narrated the following: Abu Abdullah  has said that the Amir-ul- Momineen  said: ‘When the jurists and the scholars used to write to (deal with) each other, they did so in three ways, and there was no fourth. The one who thought of his Hereafter, Allah (azwj) Sufficed for his concerns of the world. And the one who corrected himself in secret, Allah (azwj) Corrected him publicly. And the one who corrected with regards to what was in between him and Allah (azwj), Allah (azwj) Blessed and High Corrected with regards to what was in between him and the people’.",
                    "href": "https://thaqalayn.net/hadith/8/1/477/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "ضعيف على الشهور",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 401)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "479": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: There will come a time on people....",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ (عليه السلام) قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) سَيَأْتِي عَلَى النَّاسِ زَمَانٌ لَا يَبْقَى مِنَ الْقُرْآنِ إِلَّا رَسْمُهُ وَ مِنَ الْإِسْلَامِ إِلَّا اسْمُهُ يُسَمَّوْنَ بِهِ وَ هُمْ أَبْعَدُ النَّاسِ مِنْهُ مَسَاجِدُهُمْ عَامِرَةٌ وَ هِيَ خَرَابٌ مِنَ الْهُدَى فُقَهَاءُ ذَلِكَ الزَّمَانِ شَرُّ فُقَهَاءَ تَحْتَ ظِلِّ السَّمَاءِ مِنْهُمْ خَرَجَتِ الْفِتْنَةُ وَ إِلَيْهِمْ تَعُودُ.",
                    "englishText": "479. Ali Bin Ibrahim, from his father, from Al-Nowfaly, from Al-Sakuny, who has narrated the following: Abu Abdullah  has said that the Amir-ul- Momineen  said: ‘The Rasool Allah ﷺ said: ‘There will come upon the people a time when nothing will remain from the Quran except for its image, and nothing from Al-Islam except for its name. They will be named by it (as Muslims) but they would be far from it. Their Masjid will be well built but would be ruins in matters of guidance. The Jurists of that era would be the most evil jurists under the shadow of the sky. The strife (Fitna) would commence from them and end up to them’.",
                    "href": "https://thaqalayn.net/hadith/8/1/479/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "ضعيف على الشهور",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 402)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "485": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: The Jurist of the people of Basrah",
                    "arabicText": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ زَيْدٍ الشَّحَّامِ قَالَ دَخَلَ قَتَادَةُ بْنُ دِعَامَةَ عَلَى أَبِي جَعْفَرٍ (عليه السلام) فَقَالَ يَا قَتَادَةُ أَنْتَ فَقِيهُ أَهْلِ الْبَصْرَةِ فَقَالَ هَكَذَا يَزْعُمُونَ فَقَالَ أَبُو جَعْفَرٍ (عليه السلام) بَلَغَنِي أَنَّكَ تُفَسِّرُ الْقُرْآنَ فَقَالَ لَهُ قَتَادَةُ نَعَمْ فَقَالَ لَهُ أَبُو جَعْفَرٍ (عليه السلام) بِعِلْمٍ تُفَسِّرُهُ أَمْ بِجَهْلٍ قَالَ لَا بِعِلْمٍ فَقَالَ لَهُ أَبُو جَعْفَرٍ (عليه السلام) فَإِنْ كُنْتَ تُفَسِّرُهُ بِعِلْمٍ فَأَنْتَ أَنْتَ وَ أَنَا أَسْأَلُكَ قَالَ قَتَادَةُ سَلْ قَالَ أَخْبِرْنِي عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ فِي سَبَإٍ وَ قَدَّرْنا فِيهَا السَّيْرَ سِيرُوا فِيها لَيالِيَ وَ أَيَّاماً آمِنِينَ فَقَالَ قَتَادَةُ ذَلِكَ مَنْ خَرَجَ مِنْ بَيْتِهِ بِزَادٍ حَلَالٍ وَ رَاحِلَةٍ وَ كِرَاءٍ حَلَالٍ يُرِيدُ هَذَا الْبَيْتَ كَانَ آمِناً حَتَّى يَرْجِعَ إِلَى أَهْلِهِ فَقَالَ أَبُو جَعْفَرٍ (عليه السلام) نَشَدْتُكَ اللَّهَ يَا قَتَادَةُ هَلْ تَعْلَمُ أَنَّهُ قَدْ يَخْرُجُ الرَّجُلُ مِنْ بَيْتِهِ بِزَادٍ حَلَالٍ وَ رَاحِلَةٍ وَ كِرَاءٍ حَلَالٍ يُرِيدُ هَذَا الْبَيْتَ فَيُقْطَعُ عَلَيْهِ الطَّرِيقُ فَتُذْهَبُ نَفَقَتُهُ وَ يُضْرَبُ مَعَ ذَلِكَ ضَرْبَةً فِيهَا اجْتِيَاحُهُ قَالَ قَتَادَةُ اللَّهُمَّ نَعَمْ فَقَالَ أَبُو جَعْفَرٍ (عليه السلام) وَيْحَكَ يَا قَتَادَةُ إِنْ كُنْتَ إِنَّمَا فَسَّرْتَ الْقُرْآنَ مِنْ تِلْقَاءِ نَفْسِكَ فَقَدْ هَلَكْتَ وَ أَهْلَكْتَ وَ إِنْ كُنْتَ قَدْ أَخَذْتَهُ مِنَ الرِّجَالِ فَقَدْ هَلَكْتَ وَ أَهْلَكْتَ وَيْحَكَ يَا قَتَادَةُ ذَلِكَ مَنْ خَرَجَ مِنْ بَيْتِهِ بِزَادٍ وَ رَاحِلَةٍ وَ كِرَاءٍ حَلَالٍ يَرُومُ هَذَا الْبَيْتَ عَارِفاً بِحَقِّنَا يَهْوَانَا قَلْبُهُ كَمَا قَالَ اللَّهُ عَزَّ وَ جَلَّ فَاجْعَلْ أَفْئِدَةً مِنَ النَّاسِ تَهْوِي إِلَيْهِمْ وَ لَمْ يَعْنِ الْبَيْتَ فَيَقُولَ إِلَيْهِ فَنَحْنُ وَ اللَّهِ دَعْوَةُ إِبْرَاهِيمَ (عليه السلام) الَّتِي مَنْ هَوَانَا قَلْبُهُ قُبِلَتْ حَجَّتُهُ وَ إِلَّا فَلَا يَا قَتَادَةُ فَإِذَا كَانَ كَذَلِكَ كَانَ آمِناً مِنْ عَذَابِ جَهَنَّمَ يَوْمَ الْقِيَامَةِ قَالَ قَتَادَةُ لَا جَرَمَ وَ اللَّهِ لَا فَسَّرْتُهَا إِلَّا هَكَذَا فَقَالَ أَبُو جَعْفَرٍ (عليه السلام) وَيْحَكَ يَا قَتَادَةُ إِنَّمَا يَعْرِفُ الْقُرْآنَ مَنْ خُوطِبَ بِهِ.",
                    "englishText": "485. A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Muhammad Bin Sinan, from Zayd Al-Shahaam who said: Qatada Bin Da’ama came up to Abu Ja’far , so he  said: ‘O Qatada! Are you a Faqih (Jurist) of the people of Basra?’ He said, ‘That is what they are alleging’. Abu Ja’far  said: ‘It has reached me  that you are explaining the Quran’. Qatada said to him , ‘Yes’. So Abu Ja’far  said to him: ‘You are explaining it by knowledge or by ignorance?’ He said, ‘No, by knowledge’. So Abu Ja’far  said to him: ‘So if you are explaining by knowledge, so ‘you are’ ‘who you are’ and I  would like to ask you’. Qatada said, ‘Ask’. He  said: ‘Inform me  about the Statement of Allah (azwj) Mighty and Majestic in (the Chapter) Saba: “[34:18] and We apportioned the journey therein: Travel through them nights and days, secure”. Qatada said, ‘That is for the one who goes out from his house with lawful provisions, and camel rented lawfully intending this House (Kabah). He would be safe until he returns back to his family’. So Abu Ja’far  said: ‘I  hold you to Allah (azwj), O Qatada! Do you know that if the man comes out from his house with lawful provisions, and a camel rented lawfully, intending this House, he could get cut off (by bandits) on the road, and his provisions would be lost and he could be injured due to that?’ Qatada said, ‘Our Allah (azwj), Yes!’ So Abu Ja’far  said: ‘Woe be unto you! But rather, you are explaining the Quran from your own free will, so you are destroyed and causing others to be destroyed. And if you have taken it from the men (others), you have been destroyed and so have they. Woe be unto you! (But) that is for the one who comes out from his house with provisions, and lawful means of transportation aspiring for this House while having recognised our  rights, loving us  with his heart, just as Allah (azwj) Mighty and Majestic has Said: “[14:37] therefore make the hearts of some people yearn towards them” and it does not mean the House, for He (azwj) is Saying ‘towards them’. So we  are, by Allah (azwj), the supplication of Ibrahim  towards whom  if one loves with one’s heart, his Pilgrimage would be Accepted, otherwise it will not be, O Qatada! So if it is like that, he would be safe from the Punishment of Hell on the Day of Judgement’. Qatada said, ‘No offence. By Allah (azwj), I will not explain it except like this’. So Abu Ja’far  said: ‘Woe be unto you, O Qatada! But rather, you should understand the Quran from the ones  who have been addressed by it’.",
                    "href": "https://thaqalayn.net/hadith/8/1/485/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "ضعيف على الشهور",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 407)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "487": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: The Companions of al-Qa'im are three hundred and some",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مَنْصُورِ بْنِ يُونُسَ عَنْ إِسْمَاعِيلَ بْنِ جَابِرٍ عَنْ أَبِي خَالِدٍ عَنْ أَبِي جَعْفَرٍ (عليه السلام) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ فَاسْتَبِقُوا الْخَيْراتِ أَيْنَ ما تَكُونُوا يَأْتِ بِكُمُ اللَّهُ جَمِيعاً قَالَ الْخَيْرَاتُ الْوَلَايَةُ وَ قَوْلُهُ تَبَارَكَ وَ تَعَالَى أَيْنَ ما تَكُونُوا يَأْتِ بِكُمُ اللَّهُ جَمِيعاً يَعْنِي أَصْحَابَ الْقَائِمِ الثَّلَاثَمِائَةِ وَ الْبِضْعَةَ عَشَرَ رَجُلًا قَالَ وَ هُمْ وَ اللَّهِ الْأُمَّةُ الْمَعْدُودَةُ قَالَ يَجْتَمِعُونَ وَ اللَّهِ فِي سَاعَةٍ وَاحِدَةٍ قَزَعٌ كَقَزَعِ الْخَرِيفِ.",
                    "englishText": "487. Ali Bin Ibrahim, from his father, from Ibn Abi ‘Umayr, from Mansour Bin Yunus, from Ismail Bin Jabir, from Abu Khalid, who has narrated the following: Abu Ja’far  regarding the Statement of Allah (azwj) Mighty and Majestic: “[2:148] therefore hasten to (do) good works; wherever you are, Allah will bring you all together”. He  said: ‘Good works is a reference to Al-Wilayah, and the Words of the Blessed and the High: “wherever you are, Allah will bring you all together” mean the companions of Al-Qaim , three hundred and some ten men’. He  said: ‘And they are, by Allah (azwj), a numbered community’. He  said: ‘By Allah (azwj) they would gather together in a single moment, like clouds in the autumn’.",
                    "href": "https://thaqalayn.net/hadith/8/1/487/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "حسن أو موثوق",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 412)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "489": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: The Earth is wrapped up...",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) عَلَيْكُمْ بِالسَّفَرِ بِاللَّيْلِ فَإِنَّ الْأَرْضَ تُطْوَى بِاللَّيْلِ.",
                    "englishText": "489. Ali Bin Ibrahim, from his father, from Al-Nowfaly, from Al-Sakuny, who has narrated the following: Abu Abdullah  has said: ‘The Rasool Allah ﷺ said: ‘It is on you to travel at night, for the ground folds up at night’.",
                    "href": "https://thaqalayn.net/hadith/8/1/489/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "ضعيف على الشهور",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 414)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "496": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Instruction to vist each other",
                    "arabicText": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ أَبِي الْجَهْمِ عَنْ أَبِي خَدِيجَةَ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) كَمْ بَيْنَكَ وَ بَيْنَ الْبَصْرَةِ قُلْتُ فِي الْمَاءِ خَمْسٌ إِذَا طَابَتِ الرِّيحُ وَ عَلَى الظَّهْرِ ثَمَانٍ وَ نَحْوُ ذَلِكَ فَقَالَ مَا أَقْرَبَ هَذَا تَزَاوَرُوا وَ يَتَعَاهَدُ بَعْضُكُمْ بَعْضاً فَإِنَّهُ لَا بُدَّ يَوْمَ الْقِيَامَةِ مِنْ أَنْ يَأْتِيَ كُلُّ إِنْسَانٍ بِشَاهِدٍ يَشْهَدُ لَهُ عَلَى دِينِهِ وَ قَالَ إِنَّ الْمُسْلِمَ إِذَا رَأَى أَخَاهُ كَانَ حَيَاةً لِدِينِهِ إِذَا ذَكَرَ اللَّهَ عَزَّ وَ جَلَّ .",
                    "englishText": "496. A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Al-Jaham, from Abu Khadija who said: Abu Abdullah  said to me; ‘How much (distance is there) between you and Al-Basra?’ I said, ‘It is five (days) by the water (sea) if the wind is good, and upon the back (of the earth) eight days or approximate to that’. So he  said: ‘This is not near. Visit each other frequently for there will not be an escape on the Day of Judgement from each human being to bring a witness who would testify for him upon his Religion’. And said: ‘If a Muslims sees his brother, it is a revival for his Religion if he Mentions Allah (azwj) (during their meeting)’.",
                    "href": "https://thaqalayn.net/hadith/8/1/496/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "مجهول وقيل ضعيف",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 419)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "502": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: One the Day of 'Uhud, faced defeat...",
                    "arabicText": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْحُسَيْنِ أَبِي الْعَلَاءِ الْخَفَّافِ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ لَمَّا انْهَزَمَ النَّاسُ يَوْمَ أُحُدٍ عَنِ النَّبِيِّ (صلى الله عليه وآله) انْصَرَفَ إِلَيْهِمْ بِوَجْهِهِ وَ هُوَ يَقُولُ أَنَا مُحَمَّدٌ أَنَا رَسُولُ اللَّهِ لَمْ أُقْتَلْ وَ لَمْ أَمُتْ فَالْتَفَتَ إِلَيْهِ فُلَانٌ وَ فُلَانٌ فَقَالَا الْآنَ يَسْخَرُ بِنَا أَيْضاً وَ قَدْ هُزِمْنَا وَ بَقِيَ مَعَهُ عَلِيٌّ (عليه السلام) وَ سِمَاكُ بْنُ خَرَشَةَ أَبُو دُجَانَةَ رَحِمَهُ اللَّهُ فَدَعَاهُ النَّبِيُّ (صلى الله عليه وآله) فَقَالَ يَا أَبَا دُجَانَةَ انْصَرِفْ وَ أَنْتَ فِي حِلٍّ مِنْ بَيْعَتِكَ فَأَمَّا عَلِيٌّ فَأَنَا هُوَ وَ هُوَ أَنَا فَتَحَوَّلَ وَ جَلَسَ بَيْنَ يَدَيِ النَّبِيِّ (صلى الله عليه وآله) وَ بَكَى وَ قَالَ لَا وَ اللَّهِ وَ رَفَعَ رَأْسَهُ إِلَى السَّمَاءِ وَ قَالَ لَا وَ اللَّهِ لَا جَعَلْتُ نَفْسِي فِي حِلٍّ مِنْ بَيْعَتِي إِنِّي بَايَعْتُكَ فَإِلَى مَنْ أَنْصَرِفُ يَا رَسُولَ اللَّهِ إِلَى زَوْجَةٍ تَمُوتُ أَوْ وَلَدٍ يَمُوتُ أَوْ دَارٍ تَخْرَبُ وَ مَالٍ يَفْنَى وَ أَجَلٍ قَدِ اقْتَرَبَ فَرَقَّ لَهُ النَّبِيُّ (صلى الله عليه وآله) فَلَمْ يَزَلْ يُقَاتِلُ حَتَّى أَثْخَنَتْهُ الْجِرَاحَةُ وَ هُوَ فِي وَجْهٍ وَ عَلِيٌّ (عليه السلام) فِي وَجْهٍ فَلَمَّا أُسْقِطَ احْتَمَلَهُ عَلِيٌّ (عليه السلام) فَجَاءَ بِهِ إِلَى النَّبِيِّ (صلى الله عليه وآله) فَوَضَعَهُ عِنْدَهُ فَقَالَ يَا رَسُولَ اللَّهِ أَ وَفَيْتُ بِبَيْعَتِي قَالَ نَعَمْ وَ قَالَ لَهُ النَّبِيُّ (صلى الله عليه وآله) خَيْراً وَ كَانَ النَّاسُ يَحْمِلُونَ عَلَى النَّبِيِّ (صلى الله عليه وآله) الْمَيْمَنَةَ فَيَكْشِفُهُمْ عَلِيٌّ (عليه السلام) فَإِذَا كَشَفَهُمْ أَقْبَلَتِ الْمَيْسَرَةُ إِلَى النَّبِيِّ (صلى الله عليه وآله) فَلَمْ يَزَلْ كَذَلِكَ حَتَّى تَقَطَّعَ سَيْفُهُ بِثَلَاثِ قِطَعٍ فَجَاءَ إِلَى النَّبِيِّ (صلى الله عليه وآله فَطَرَحَهُ بَيْنَ يَدَيْهِ وَ قَالَ هَذَا سَيْفِي قَدْ تَقَطَّعَ فَيَوْمَئِذٍ أَعْطَاهُ النَّبِيُّ (صلى الله عليه وآله) ذَا الْفَقَارِ وَ لَمَّا رَأَى النَّبِيُّ (صلى الله عليه وآله) اخْتِلَاجَ سَاقَيْهِ مِنْ كَثْرَةِ الْقِتَالِ رَفَعَ رَأْسَهُ إِلَى السَّمَاءِ وَ هُوَ يَبْكِي وَ قَالَ يَا رَبِّ وَعَدْتَنِي أَنْ تُظْهِرَ دِينَكَ وَ إِنْ شِئْتَ لَمْ يُعْيِكَ فَأَقْبَلَ عَلِيٌّ (عليه السلام) إِلَى النَّبِيِّ (صلى الله عليه وآله) فَقَالَ يَا رَسُولَ اللَّهِ أَسْمَعُ دَوِيّاً شَدِيداً وَ أَسْمَعُ أَقْدِمْ حَيْزُومُ وَ مَا أَهُمُّ أَضْرِبُ أَحَداً إِلَّا سَقَطَ مَيِّتاً قَبْلَ أَنْ أَضْرِبَهُ فَقَالَ هَذَا جَبْرَئِيلُ وَ مِيكَائِيلُ وَ إِسْرَافِيلُ فِي الْمَلَائِكَةِ ثُمَّ جَاءَ جَبْرَئِيلُ (عليه السلام) فَوَقَفَ إِلَى جَنْبِ رَسُولِ اللَّهِ (صلى الله عليه وآله) فَقَالَ يَا مُحَمَّدُ إِنَّ هَذِهِ لَهِيَ الْمُوَاسَاةُ فَقَالَ إِنَّ عَلِيّاً مِنِّي وَ أَنَا مِنْهُ فَقَالَ جَبْرَئِيلُ وَ أَنَا مِنْكُمَا ثُمَّ انْهَزَمَ النَّاسُ فَقَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) لِعَلِيٍّ (عليه السلام) يَا عَلِيُّ امْضِ بِسَيْفِكَ حَتَّى تُعَارِضَهُمْ فَإِنْ رَأَيْتَهُمْ قَدْ رَكِبُوا الْقِلَاصَ وَ جَنَبُوا الْخَيْلَ فَإِنَّهُمْ يُرِيدُونَ مَكَّةَ وَ إِنْ رَأَيْتَهُمْ قَدْ رَكِبُوا الْخَيْلَ وَ هُمْ يَجْنُبُونَ الْقِلَاصَ فَإِنَّهُمْ يُرِيدُونَ الْمَدِينَةَ فَأَتَاهُمْ عَلِيٌّ (عليه السلام) فَكَانُوا عَلَى الْقِلَاصِ فَقَالَ أَبُو سُفْيَانَ لِعَلِيٍّ (عليه السلام) يَا عَلِيُّ مَا تُرِيدُ هُوَ ذَا نَحْنُ ذَاهِبُونَ إِلَى مَكَّةَ فَانْصَرِفْ إِلَى صَاحِبِكَ فَأَتْبَعَهُمْ جَبْرَئِيلُ (عليه السلام) فَكُلَّمَا سَمِعُوا وَقْعَ حَافِرِ فَرَسِهِ جَدُّوا فِي السَّيْرِ وَ كَانَ يَتْلُوهُمْ فَإِذَا ارْتَحَلُوا قَالُوا هُوَ ذَا عَسْكَرُ مُحَمَّدٍ قَدْ أَقْبَلَ فَدَخَلَ أَبُو سُفْيَانَ مَكَّةَ فَأَخْبَرَهُمُ الْخَبَرَ وَ جَاءَ الرُّعَاةُ وَ الْحَطَّابُونَ فَدَخَلُوا مَكَّةَ فَقَالُوا رَأَيْنَا عَسْكَرَ مُحَمَّدٍ كُلَّمَا رَحَلَ أَبُو سُفْيَانَ نَزَلُوا يَقْدُمُهُمْ فَارِسٌ عَلَى فَرَسٍ أَشْقَرَ يَطْلُبُ آثَارَهُمْ فَأَقْبَلَ أَهْلُ مَكَّةَ عَلَى أَبِي سُفْيَانَ يُوَبِّخُونَهُ وَ رَحَلَ النَّبِيُّ (صلى الله عليه وآله) وَ الرَّايَةُ مَعَ عَلِيٍّ (عليه السلام) وَ هُوَ بَيْنَ يَدَيْهِ فَلَمَّا أَنْ أَشْرَفَ بِالرَّايَةِ مِنَ الْعَقَبَةِ وَ رَآهُ النَّاسُ نَادَى عَلِيٌّ (عليه السلام) أَيُّهَا النَّاسُ هَذَا مُحَمَّدٌ لَمْ يَمُتْ وَ لَمْ يُقْتَلْ فَقَالَ صَاحِبُ الْكَلَامِ الَّذِي قَالَ الْآنَ يَسْخَرُ بِنَا وَ قَدْ هُزِمْنَا هَذَا عَلِيٌّ وَ الرَّايَةُ بِيَدِهِ حَتَّى هَجَمَ عَلَيْهِمُ النَّبِيُّ (صلى الله عليه وآله) وَ نِسَاءُ الْأَنْصَارِ فِي أَفْنِيَتِهِمْ عَلَى أَبْوَابِ دُورِهِمْ وَ خَرَجَ الرِّجَالُ إِلَيْهِ يَلُوذُونَ بِهِ وَ يَثُوبُونَ إِلَيْهِ وَ النِّسَاءُ نِسَاءُ الْأَنْصَارِ قَدْ خَدَشْنَ الْوُجُوهَ وَ نَشَرْنَ الشُّعُورَ وَ جَزَزْنَ النَّوَاصِيَ وَ خَرَقْنَ الْجُيُوبَ وَ حَزَمْنَ الْبُطُونَ عَلَى النَّبِيِّ (صلى الله عليه وآله) فَلَمَّا رَأَيْنَهُ قَالَ لَهُنَّ خَيْراً وَ أَمَرَهُنَّ أَنْ يَسْتَتِرْنَ وَ يَدْخُلْنَ مَنَازِلَهُنَّ وَ قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ وَعَدَنِي أَنْ يُظْهِرَ دِينَهُ عَلَى الْأَدْيَانِ كُلِّهَا وَ أَنْزَلَ اللَّهُ عَلَى مُحَمَّدٍ (صلى الله عليه وآله) وَ ما مُحَمَّدٌ إِلَّا رَسُولٌ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ أَ فَإِنْ ماتَ أَوْ قُتِلَ انْقَلَبْتُمْ عَلى أَعْقابِكُمْ وَ مَنْ يَنْقَلِبْ عَلى عَقِبَيْهِ فَلَنْ يَضُرَّ اللَّهَ شَيْئاً الْآيَةَ.",
                    "englishText": "502. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al-Hakam, from Al-Husayn Abu Al-A’ala Al-Khaffaf, who has narrated the following: Abu Abdullah  has said: ‘When the people were defeated on the Day of Ohad and fled from the Prophet ﷺ, he ﷺ turned towards them with his ﷺ face and was saying: ‘I ﷺ am Muhammad ﷺ! I ﷺ am the Rasool Allah ﷺ! I ﷺ have neither been killed nor have I ﷺ died’. So and so, and so and so (Abu Bakr and Umar) turned towards him ﷺ saying, ‘Now he ﷺ is mocking with us as well and we have been defeated. And there remained with him ﷺ Ali  and Samaak Bin Kharsha Abu Dujana (ar), may Allah (azwj) have Mercy on him. So the Prophet ﷺ called him (ar) over and said: ‘O Abu Dujana! Leave, for you (ar) are free from your pledge of allegiance. As for Ali , so I ﷺ am him  and he  is me ﷺ’. So he came over and sat down in front of the Prophet ﷺ and wept, and said, ‘No, by Allah (azwj)!’ And he (ar) raised his (ar) head towards the sky and said, ‘No, by Allah (azwj)! I (ar) will not make myself free from my pledge of allegiance. I (ar) gave my (ar) pledge of allegiance to you ﷺ, so where shall I (ar) go, to a wife who will die, or a son who will die, or a house which will be ruined and wealth which will be destroyed, and a term (death) which comes nearer?’ So the Prophet ﷺ left him (ar), and he (ar) did not stop fighting until he was weakened by the wounds and he (ar) was on one side of him ﷺ and Ali  was on the other side of him ﷺ. So when he (ar) dropped, Ali  carried him (ar) to the Prophet ﷺ and placed him (ar) in his ﷺ presence. So he (ar) said, ‘O Rasool Allah ﷺ, have I (ar) been loyal to my (ar) pledge of allegiance?’ He ﷺ said: ‘Yes’. And the Prophet ﷺ said good things for him (ar). And the people were attacking the Prophet ﷺ from the right, so Ali  defended him ﷺ. So when he  defended him ﷺ, they attacked the Prophet ﷺ from the left. That situation did not cease until his  sword broke into three pieces. So he  came to the Prophet ﷺ. He  displayed it in front him ﷺ and said: ‘This is my  sword which has broken. Thus, it was on that day that the Prophet ﷺ gave him  Za Al-Fiqar (Zulfiqar). And when the Prophet ﷺ saw that (Ali ) was exhausted due to the frequency of the fighting, he ﷺ raised his ﷺ head towards the sky and he wept and said: ‘O Lord (azwj)! You (azwj) Promised me ﷺ that You (azwj) would be Making Your (azwj) Religion to prevail, and if You (azwj) so Desire, it would not Tire You (azwj)’. Ali  turned towards the Prophet ﷺ and said: ‘O Rasool Allah ﷺ! I  heard a loud rumble and heard the galloping of Hayzoum (Horse of Jibraeel), and I  did not attack to strike anyone except that he would fall dead before I  struck him. So he ﷺ said: ‘This was Jibraeel and Mikaeel, and Israfeel among the Angels’. Then Jibraeel  went and paused to the side of the Rasool Allah ﷺ. He said: ‘O Muhammad ﷺ, this is the comfort’. So he ﷺ said: ‘Ali  is from me , and I ﷺ am from him ’. So Jibraeel said: ‘And I am from both of you . Then the people (enemy) were defeated. So the Rasool Allah ﷺ said to Ali : ‘O Ali ! Go with your  sword until you are opposite to them. If you  see them riding the camels and the horses are by their side, then they are intending to go to Makkah. And if you  see them to be riding the horses and their camels are by their sides, so they are intending to go to Al-Medina. Ali  came up to them, and they were upon their camels, so Abu Sufyan said to Ali , ‘O Ali ! What do you  want. That is where we are going, to Makkah. So leave and go to your  companion ﷺ’. Jibraeel followed them, and when they heard the galloping of his horse, they strived to move faster, and he kept following them. So when they moved, they said, ‘It is the army of Muhammad ﷺ which is coming’. Abu Sufyan entered Makkah and informed them of the news. The shepherds and the woodcutters came. So they entered Makkah. They said, ‘We saw the army of Muhammad ﷺ!’ All of them left. Abu Sufyan descended at Makkah and followed their footsteps horse to the horse. The people of Makkah came and addressed Abu Sufyan and reproached him. And the Prophet ﷺ moved and the flag was with Ali  and he  was in front of him ﷺ. So when he  came up with the flag while moving in front and when they reached ‘Al-Uqba’, and the people saw him , Ali  called out: ‘O you people! This is Muhammad ﷺ. He ﷺ never died and he ﷺ was never killed!’ So the one who had said, ‘He ﷺ is mocking us and we have been defeated’ (Abu Bakr or Umar)’, said, ‘This is Ali  and flag is in his  hands’, until the Prophet ﷺ moved towards them, and the women of the Helpers were in their courtyards and on the doorways of their houses, and the men came out to him ﷺ returning from their flight and escape. The women of the Helpers had scratched their faces, and spread their hair, and placed dust upon their foreheads, and had torn the sides of their dresses, and tied their abdomens for (the grief for) Prophet ﷺ. So when he ﷺ saw them, he ﷺ said good things for them and told them to cover themselves up and enter their respective houses. And he ﷺ said: ‘Allah (azwj) Promised me ﷺ that He (azwj) would Make His (azwj) Religion to prevail over all the Religions’. And Allah (azwj) Revealed unto Muhammad ﷺ: “[3:144] Muhammad is but a messenger, messengers (the like of whom) have passed away before him; if then he dies or is killed will you turn back upon your heels? And whoever turns back upon his heels, he will by no means do harm to Allah in the least”, the Verse.",
                    "href": "https://thaqalayn.net/hadith/8/1/502/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "حسن وربما قيل صحيح",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 431)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "504": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: 'Come to you fed up with fighting...",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبَانٍ عَنِ الْفَضْلِ أَبِي الْعَبَّاسِ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ أَوْ جاؤُكُمْ حَصِرَتْ صُدُورُهُمْ أَنْ يُقاتِلُوكُمْ أَوْ يُقاتِلُوا قَوْمَهُمْ قَالَ نَزَلَتْ فِي بَنِي مُدْلِجٍ لِأَنَّهُمْ جَاءُوا إِلَى رَسُولِ اللَّهِ (صلى الله عليه وآله) فَقَالُوا إِنَّا قَدْ حَصِرَتْ صُدُورُنَا أَنْ نَشْهَدَ أَنَّكَ رَسُولُ اللَّهِ فَلَسْنَا مَعَكَ وَ لَا مَعَ قَوْمِنَا عَلَيْكَ قَالَ قُلْتُ كَيْفَ صَنَعَ بِهِمْ رَسُولُ اللَّهِ (صلى الله عليه وآله) قَالَ وَاعَدَهُمْ إِلَى أَنْ يَفْرُغَ مِنَ الْعَرَبِ ثُمَّ يَدْعُوهُمْ فَإِنْ أَجَابُوا وَ إِلَّا قَاتَلَهُمْ.",
                    "englishText": "504. Ali Bin Ibrahim, from his father, from Ahmad Bin Muhammad Bin Abu Nasr, from Abaan, from Al-Fazl Abu Al-Abbas, who has narrated the following: Abu Abdullah  regarding the Statement of Allah (azwj): “[4:90] or who come to you, their hearts shrinking from fighting you or fighting their own people”, he  said: ‘Revealed with regards to the Clan of Mudlaj because they had come to the Rasool Allah ﷺ, so they said, ‘There are restrictions in our chests that we should testify that you ﷺ are the Rasool Allah ﷺ, for we are neither with you ﷺ nor are we with our people against you ﷺ’. So I said, ‘How did the Rasool Allah ﷺ deal with them?’ He  said; ‘He ﷺ said that he ﷺ would leave them until he ﷺ was free from dealing with the Arabs, then he ﷺ would call them (to Al-Islam), to see if they answered or else he ﷺ would fight against them’.",
                    "href": "https://thaqalayn.net/hadith/8/1/504/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "حسن أو موثوق",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 449)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "506": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Was better for this nation...",
                    "arabicText": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ أَبِي الصَّبَّاحِ بْنِ عَبْدِ الْحَمِيدِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ وَ اللَّهِ لَلَّذِي صَنَعَهُ الْحَسَنُ بْنُ عَلِيٍّ (عليه السلام) كَانَ خَيْراً لِهَذِهِ الْأُمَّةِ مِمَّا طَلَعَتْ عَلَيْهِ الشَّمْسُ وَ اللَّهِ لَقَدْ نَزَلَتْ هَذِهِ الْآيَةُ أَ لَمْ تَرَ إِلَى الَّذِينَ قِيلَ لَهُمْ كُفُّوا أَيْدِيَكُمْ وَ أَقِيمُوا الصَّلاةَ وَ آتُوا الزَّكاةَ إِنَّمَا هِيَ طَاعَةُ الْإِمَامِ وَ طَلَبُوا الْقِتَالَ فَلَمَّا كُتِبَ عَلَيْهِمُ الْقِتَالُ مَعَ الْحُسَيْنِ (عليه السلام) قالُوا رَبَّنا لِمَ كَتَبْتَ عَلَيْنَا الْقِتالَ لَوْ لا أَخَّرْتَنا إِلى أَجَلٍ قَرِيبٍ نُجِبْ دَعْوَتَكَ وَ نَتَّبِعِ الرُّسُلَ أَرَادُوا تَأْخِيرَ ذَلِكَ إِلَى الْقَائِمِ (عليه السلام).",
                    "englishText": "506. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Sinan, from Al-Al-Sabbaah Bin Abdul Hameed, from Muhammad Bin Muslim, who has narrated the following: Abu Ja’far  has said: ‘By Allah (azwj), that which Al-Hassan Bin Ali  did was better for this community from all that upon which the sun rises. By Allah (azwj), this Verse had been Revealed: “[4:77] Have you not seen those to whom it was said: Withhold your hands, and keep up prayer and pay the poor-rate, but rather, it is the obedience to the Imam , and they sought to fight, but when fighting is prescribed for them alongside Al-Husayn  they say: Our Lord! why hast Thou ordained fighting for us? Wherefore didst Thou not grant us a delay to a near end?” we would have responded to Your (azwj) Call and we would have followed the Messengers . They intended to delay that to Al-Qaim ’.",
                    "href": "https://thaqalayn.net/hadith/8/1/506/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "ضعيف على الشهور",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 455)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "522": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: You must not overburden",
                    "arabicText": "عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عُمَرَ بْنِ حَنْظَلَةَ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ يَا عُمَرُ لَا تَحْمِلُوا عَلَى شِيعَتِنَا وَ ارْفُقُوا بِهِمْ فَإِنَّ النَّاسَ لَا يَحْتَمِلُونَ مَا تَحْمِلُونَ.",
                    "englishText": "522. From him, from Ahmad Bin Muhammad, from Ali Bin Al-Hakam, from Umar Bin Hanzala, who has reported the following: Abu Abdullah  has said: ‘O Umar, do not place a burden upon our  Shites, and be kind to them, for the people cannot bear what you can bear’.",
                    "href": "https://thaqalayn.net/hadith/8/1/522/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "حسن كالصحيح وقد يعد صحيحا",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 487)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "524": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: \"Our Lord, show us\" (41:29)",
                    "arabicText": "يُونُسُ عَنْ سَوْرَةَ بْنِ كُلَيْبٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) فِي قَوْلِ اللَّهِ تَبَارَكَ وَ تَعَالَى رَبَّنا أَرِنَا الَّذَيْنِ أَضَلَّانا مِنَ الْجِنِّ وَ الْإِنْسِ نَجْعَلْهُما تَحْتَ أَقْدامِنا لِيَكُونا مِنَ الْأَسْفَلِينَ قَالَ يَا سَوْرَةُ هُمَا وَ اللَّهِ هُمَا ثَلَاثاً وَ اللَّهِ يَا سَوْرَةُ إِنَّا لَخُزَّانُ عِلْمِ اللَّهِ فِي السَّمَاءِ وَ إِنَّا لَخُزَّانُ عِلْمِ اللَّهِ فِي الْأَرْضِ.",
                    "englishText": "524. Yunus, from Sowrat Bin Kuleyb, who has reported the following: Abu Abdullah  regarding the statement of Allah (azwj) Blessed and High: “[41:29] Our Lord! show us those who led us astray from among the jinn and the men that we may trample them under our feet so that they may be of the lowest”, he  said: ‘O Sowrat! Those two (Abu Bakr and Umar), by Allah (azwj) those two (Abu Bakr and Umar) three times over. By Allah (azwj), O Sowrat, we  are the Treasurers of the Knowledge of Allah (azwj) in the sky and we  are the Treasurers of the Knowledge of Allah (azwj) in the earth’.",
                    "href": "https://thaqalayn.net/hadith/8/1/524/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "مجهول ويكن أن يعد حسنا",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 488)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "529": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: The dream of a believing person",
                    "arabicText": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ غَالِبٍ عَنْ جَابِرِ بْنِ يَزِيدَ عَنْ أَبِي جَعْفَرٍ (عليه السلام) أَنَّ رَسُولَ اللَّهِ كَانَ يَقُولُ إِنَّ رُؤْيَا الْمُؤْمِنِ تُرِفُّ بَيْنَ السَّمَاءِ وَ الْأَرْضِ عَلَى رَأْسِ صَاحِبِهَا حَتَّى يُعَبِّرَهَا لِنَفْسِهِ أَوْ يُعَبِّرَهَا لَهُ مِثْلُهُ فَإِذَا عُبِّرَتْ لَزِمَتِ الْأَرْضَ فَلَا تَقُصُّوا رُؤْيَاكُمْ إِلَّا عَلَى مَنْ يَعْقِلُ.",
                    "englishText": "529. A number of our companions, from Sahl Bin Ziyad and Ali Bin Ibrahim, from his father together, from Ibn Mahboub, from Abdullah Bin Ghalib, from Jabir Bin Yazeed, who has narrated the following: Abu Ja’far  said that the Rasool Allah ﷺ had said: ‘The dream of the Believer floats in between the sky and the earth over the head of its dreamer until he interprets it for himself, or it is interpreted for him by someone like him. So when it gets interpreted, it comes to the ground. So do not narrate your dreams except to the one who understand’.",
                    "href": "https://thaqalayn.net/hadith/8/1/529/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "حسن لا يقصر عن الصحيح",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 492)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "535": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: What was the anwser that you received?",
                    "arabicText": "ابْنُ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ بُرَيْدٍ الْكُنَاسِيِّ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ (عليه السلام) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ يَوْمَ يَجْمَعُ اللَّهُ الرُّسُلَ فَيَقُولُ ما ذا أُجِبْتُمْ قالُوا لا عِلْمَ لَنا قَالَ فَقَالَ إِنَّ لِهَذَا تَأْوِيلًا يَقُولُ مَا ذَا أُجِبْتُمْ فِي أَوْصِيَائِكُمُ الَّذِينَ خَلَّفْتُمُوهُمْ عَلَى أُمَمِكُمْ قَالَ فَيَقُولُونَ لَا عِلْمَ لَنَا بِمَا فَعَلُوا مِنْ بَعْدِنَا.",
                    "englishText": "535. Ibn Mahboub, from Hisham Bin Salim, from Bureyd Al-Kunasy who said: I asked Abu Ja’far  about the Statement of Allah (azwj) Mighty and Majestic: “[5:109] On the day when Allah will assemble the messengers, then say: What answer were you given? They shall say: We have no knowledge, surely Thou art the great Knower of the unseen things”. So he  said; ‘There is an explanation for this. He (azwj) will say: “What response were you  given with regards to your  successors  whom you ﷺ left behind among your  communities?’ So they  will say: ‘We have no knowledge of what they did from after us ’.",
                    "href": "https://thaqalayn.net/hadith/8/1/535/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "مجهول على الشهور",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 494)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "541": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Iblees gave allegiance to Abu Bakr",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ إِبْرَاهِيمَ بْنِ عُمَرَ الْيَمَانِيِّ عَنْ سُلَيْمِ بْنِ قَيْسٍ الْهِلَالِيِّ قَالَ سَمِعْتُ سَلْمَانَ الْفَارِسِيَّ رَضِيَ اللَّهُ عَنْهُ يَقُولُ لَمَّا قُبِضَ رَسُولُ اللَّهِ (صلى الله عليه وآله) وَ صَنَعَ النَّاسُ مَا صَنَعُوا وَ خَاصَمَ أَبُو بَكْرٍ وَ عُمَرُ وَ أَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ الْأَنْصَارَ فَخَصَمُوهُمْ بِحُجَّةِ عَلِيٍّ (عليه السلام) قَالُوا يَا مَعْشَرَ الْأَنْصَارِ قُرَيْشٌ أَحَقُّ بِالْأَمْرِ مِنْكُمْ لِأَنَّ رَسُولَ اللَّهِ (صلى الله عليه وآله) مِنْ قُرَيْشٍ وَ الْمُهَاجِرِينَ مِنْهُمْ إِنَّ اللَّهَ تَعَالَى بَدَأَ بِهِمْ فِي كِتَابِهِ وَ فَضَّلَهُمْ وَ قَدْ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْأَئِمَّةُ مِنْ قُرَيْشٍ قَالَ سَلْمَانُ رَضِيَ اللَّهُ عَنْهُ فَأَتَيْتُ عَلِيّاً (عليه السلام) وَ هُوَ يُغَسِّلُ رَسُولَ اللَّهِ (صلى الله عليه وآله) فَأَخْبَرْتُهُ بِمَا صَنَعَ النَّاسُ وَ قُلْتُ إِنَّ أَبَا بَكْرٍ السَّاعَةَ عَلَى مِنْبَرِ رَسُولِ اللَّهِ (صلى الله عليه وآله) وَ اللَّهِ مَا يَرْضَى أَنْ يُبَايِعُوهُ بِيَدٍ وَاحِدَةٍ إِنَّهُمْ لَيُبَايِعُونَهُ بِيَدَيْهِ جَمِيعاً بِيَمِينِهِ وَ شِمَالِهِ فَقَالَ لِي يَا سَلْمَانُ هَلْ تَدْرِي مَنْ أَوَّلُ مَنْ بَايَعَهُ عَلَى مِنْبَرِ رَسُولِ اللَّهِ (صلى الله عليه وآله) قُلْتُ لَا أَدْرِي إِلَّا أَنِّي رَأَيْتُ فِي ظُلَّةِ بَنِي سَاعِدَةَ حِينَ خَصَمَتِ الْأَنْصَارُ وَ كَانَ أَوَّلَ مَنْ بَايَعَهُ بَشِيرُ بْنُ سَعْدٍ وَ أَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ ثُمَّ عُمَرُ ثُمَّ سَالِمٌ قَالَ لَسْتُ أَسْأَلُكَ عَنْ هَذَا وَ لَكِنْ تَدْرِي أَوَّلَ مَنْ بَايَعَهُ حِينَ صَعِدَ عَلَى مِنْبَرِ رَسُولِ اللَّهِ (صلى الله عليه وآله) قُلْتُ لَا وَ لَكِنِّي رَأَيْتُ شَيْخاً كَبِيراً مُتَوَكِّئاً عَلَى عَصَاهُ بَيْنَ عَيْنَيْهِ سَجَّادَةٌ شَدِيدُ التَّشْمِيرِ صَعِدَ إِلَيْهِ أَوَّلَ مَنْ صَعِدَ وَ هُوَ يَبْكِي وَ يَقُولُ الْحَمْدُ لِلَّهِ الَّذِي لَمْ يُمِتْنِي مِنَ الدُّنْيَا حَتَّى رَأَيْتُكَ فِي هَذَا الْمَكَانِ ابْسُطْ يَدَكَ فَبَسَطَ يَدَهُ فَبَايَعَهُ ثُمَّ نَزَلَ فَخَرَجَ مِنَ الْمَسْجِدِ فَقَالَ عَلِيٌّ (عليه السلام) هَلْ تَدْرِي مَنْ هُوَ قُلْتُ لَا وَ لَقَدْ سَاءَتْنِي مَقَالَتُهُ كَأَنَّهُ شَامِتٌ بِمَوْتِ النَّبِيِّ (صلى الله عليه وآله) فَقَالَ ذَاكَ إِبْلِيسُ لَعَنَهُ اللَّهُ أَخْبَرَنِي رَسُولُ اللَّهِ (صلى الله عليه وآله) أَنَّ إِبْلِيسَ وَ رُؤَسَاءَ أَصْحَابِهِ شَهِدُوا نَصْبَ رَسُولِ اللَّهِ (صلى الله عليه وآله) إِيَّايَ لِلنَّاسِ بِغَدِيرِ خُمٍّ بِأَمْرِ اللَّهِ عَزَّ وَ جَلَّ فَأَخْبَرَهُمْ أَنِّي أَوْلَى بِهِمْ مِنْ أَنْفُسِهِمْ وَ أَمَرَهُمْ أَنْ يُبَلِّغَ الشَّاهِدُ الْغَائِبَ فَأَقْبَلَ إِلَى إِبْلِيسَ أَبَالِسَتُهُ وَ مَرَدَةُ أَصْحَابِهِ فَقَالُوا إِنَّ هَذِهِ أُمَّةٌ مَرْحُومَةٌ وَ مَعْصُومَةٌ وَ مَا لَكَ وَ لَا لَنَا عَلَيْهِمْ سَبِيلٌ قَدْ أُعْلِمُوا إِمَامَهُمْ وَ مَفْزَعَهُمْ بَعْدَ نَبِيِّهِمْ فَانْطَلَقَ إِبْلِيسُ لَعَنَهُ اللَّهُ كَئِيباً حَزِيناً وَ أَخْبَرَنِي رَسُولُ اللَّهِ (صلى الله عليه وآله) أَنَّهُ لَوْ قُبِضَ أَنَّ النَّاسَ يُبَايِعُونَ أَبَا بَكْرٍ فِي ظُلَّةِ بَنِي سَاعِدَةَ بَعْدَ مَا يَخْتَصِمُونَ ثُمَّ يَأْتُونَ الْمَسْجِدَ فَيَكُونُ أَوَّلَ مَنْ يُبَايِعُهُ عَلَى مِنْبَرِي إِبْلِيسُ لَعَنَهُ اللَّهُ فِي صُورَةِ رَجُلٍ شَيْخٍ مُشَمِّرٍ يَقُولُ كَذَا وَ كَذَا ثُمَّ يَخْرُجُ فَيَجْمَعُ شَيَاطِينَهُ وَ أَبَالِسَتَهُ فَيَنْخُرُ وَ يَكْسَعُ وَ يَقُولُ كَلَّا زَعَمْتُمْ أَنْ لَيْسَ لِي عَلَيْهِمْ سَبِيلٌ فَكَيْفَ رَأَيْتُمْ مَا صَنَعْتُ بِهِمْ حَتَّى تَرَكُوا أَمْرَ اللَّهِ عَزَّ وَ جَلَّ وَ طَاعَتَهُ وَ مَا أَمَرَهُمْ بِهِ رَسُولُ اللَّهِ (صلى الله عليه وآله).",
                    "englishText": "541. Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Ibrahim Bin Amro Al-Yamani, from Suleym Bin Qays Al-Hilali who said: I heard Salman Al-Farsy (ar) saying: ‘When the Rasool Allah ﷺ passed away, and the people did what they did, and Abu Bakr and Umar, and Abu Ubeyda Bin Al-Jarrah disputed with the Helpers, they disputed with them by the ‘بِحُجَّةِ’ rights of Ali . They said, ‘O group of Helpers! Qureysh are more deserving of the Command than you are because the Rasool Allah ﷺ is from Qureysh and the Emigrant are from them. Allah (azwj) the High has Begun by them in His (azwj) Book and has Preferred them, and the Rasool Allah ﷺ has said that the Imams  are going to be from Qureysh’. Salman (ar) said. ‘So I (ar) came to Ali  and he  was washing (the body of) the Rasool Allah ﷺ. I informed him of what the people had done and I said, ‘At this time, Abu Bakr is upon the Pulpit of the Rasool Allah ﷺ, and by Allah (azwj), they are not happy to pledge their allegiances to him with one hand, they are pledging their allegiances by both, their right hands and their left’. So he  said to me; ‘O Salman (ar)! Do you know the one who pledged his allegiance to him upon the Pulpit of the Rasool Allah ﷺ?’ I (ar) said, ‘I (ar) do not know except that I (ar) saw in the shadow of the Clan of Sa’ada where the Helpers were disputing, and the one who was the first to pledged his allegiance to him was Basheer Bin Sa’ad, and Abu Ubeyda Bin Al-Jarrah, then Umar, then Saalim’. He  said; ‘I  did not ask you (ar) about this, but do you (ar) know the first one who pledged his allegiance when he ascended upon the Pulpit of the Rasool Allah ﷺ?’ I (ar) said, ‘No, but I (ar) saw an old man leaning upon his walking stick, with a mark of prostration between his eyes due to the intensity of Al-Tashmir (prostrations) climb up to him and he was weeping and saying, ‘Praise be to Allah (azwj) Who did not Cause me to die from the world until I saw you in this place. Extend your hand’. So he extended his hand, and he pledged his allegiance to him. Then he descended and went out from the Masjid’. So Ali  said; ‘Do you know who he was?’ I said, ‘No, but his speech had displeased me, as if he was gloating at the passing away of the Prophet ﷺ’. So he  said; ‘That was Iblees (la), may Allah (azwj) Curse him (la). The Rasool Allah ﷺ informed me  that Iblees (la) and the chiefs of his (la) companions witnessed the Messenger ﷺ establishing me  to the people at Ghadeer Khumm by the Command of Allah (azwj), so he ﷺ told them that I  was higher to them than their own selves and commanded them that those who were present should make it reach to the absentees. So the devils and the castaways companions of his (la) turned towards Iblees (la) and said, ‘This community is a Blessed community and is infallible, and there is neither for you (la) nor for us (la) a way against them, for they have come to know their Imam , and their shelter after their Prophet ﷺ. So Iblees (la) , may Allah (azwj) Curse him (la) went away bleak and in grief. And the Messenger ﷺ informed me  that when he ﷺ passes away, the people would be pledging their allegiances to Abu Bakr in the shade of the Clan of Sa’ada after their quarrelling, then they would be coming to the Masjid, so the first one who would be pledging his allegiance upon my ﷺ Pulpit would be Iblees (la) may Allah (azwj) Curse him (la) in the image of an old man with mark of prostration, saying such and such. Then he (la) will go out and gather his (la) Satans and devils and excitedly say to them, ‘All of you (la) thought that there was no way for me (la) against them, so how do you (la) see what I (la) have done with them, to the extent that they had left the Command of Allah (azwj) Mighty and Majestic, and being obedient to Him (azwj), and what the Rasool Allah ﷺ has commanded them for’.",
                    "href": "https://thaqalayn.net/hadith/8/1/541/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "متلف فيه",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 504)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "551": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Sermon of 'Amir al-Mu'minin, Ali AS",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ عَلِيٍّ جَمِيعاً عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ وَ أَحْمَدُ بْنُ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ عَلِيِّ بْنِ الْحَسَنِ التَّيْمِيِّ وَ عَلِيُّ بْنُ الْحُسَيْنِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ جَمِيعاً عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنِ الْمُنْذِرِ بْنِ جَيْفَرٍ عَنِ الْحَكَمِ بْنِ ظُهَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ جَرِيرٍ الْعَبْدِيِّ عَنِ الْأَصْبَغِ بْنِ نُبَاتَةَ قَالَ أَتَى أَمِيرَ الْمُؤْمِنِينَ (عليه السلام) عَبْدُ اللَّهِ بْنُ عُمَرَ وَ وُلْدُ أَبِي بَكْرٍ وَ سَعْدُ بْنُ أَبِي وَقَّاصٍ يَطْلُبُونَ مِنْهُ التَّفْضِيلَ لَهُمْ فَصَعِدَ الْمِنْبَرَ وَ مَالَ النَّاسُ إِلَيْهِ فَقَالَ الْحَمْدُ لِلَّهِ وَلِيِّ الْحَمْدِ وَ مُنْتَهَى الْكَرَمِ لَا تُدْرِكُهُ الصِّفَاتُ وَ لَا يُحَدُّ بِاللُّغَاتِ وَ لَا يُعْرَفُ بِالْغَايَاتِ وَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَ أَنَّ مُحَمَّداً رَسُولَ اللَّهِ (صلى الله عليه وآله) نَبِيُّ الْهُدَى وَ مَوْضِعُ التَّقْوَى وَ رَسُولُ الرَّبِّ الْأَعْلَى جَاءَ بِالْحَقِّ مِنْ عِنْدِ الْحَقِّ لِيُنْذِرَ بِالْقُرْآنِ الْمُنِيرِ وَ الْبُرْهَانِ الْمُسْتَنِيرِ فَصَدَعَ بِالْكِتَابِ الْمُبِينِ وَ مَضَى عَلَى مَا مَضَتْ عَلَيْهِ الرُّسُلُ الْأَوَّلُونَ أَمَّا بَعْدُ أَيُّهَا النَّاسُ فَلَا يَقُولَنَّ رِجَالٌ قَدْ كَانَتِ الدُّنْيَا غَمَرَتْهُمْ فَاتَّخَذُوا الْعَقَارَ وَ فَجَّرُوا الْأَنْهَارَ وَ رَكِبُوا أَفْرَهَ الدَّوَابِّ وَ لَبِسُوا أَلْيَنَ الثِّيَابِ فَصَارَ ذَلِكَ عَلَيْهِمْ عَاراً وَ شَنَاراً إِنْ لَمْ يَغْفِرْ لَهُمُ الْغَفَّارُ إِذَا مَنَعْتُهُمْ مَا كَانُوا فِيهِ يَخُوضُونَ وَ صَيَّرْتُهُمْ إِلَى مَا يَسْتَوْجِبُونَ فَيَفْقِدُونَ ذَلِكَ فَيَسْأَلُونَ وَ يَقُولُونَ ظَلَمَنَا ابْنُ أَبِي طَالِبٍ وَ حَرَمَنَا وَ مَنَعَنَا حُقُوقَنَا فَاللَّهُ عَلَيْهِمُ الْمُسْتَعَانُ مَنِ اسْتَقْبَلَ قِبْلَتَنَا وَ أَكَلَ ذَبِيحَتَنَا وَ آمَنَ بِنَبِيِّنَا وَ شَهِدَ شَهَادَتَنَا وَ دَخَلَ فِي دِينِنَا أَجْرَيْنَا عَلَيْهِ حُكْمَ الْقُرْآنِ وَ حُدُودَ الْإِسْلَامِ لَيْسَ لِأَحَدٍ عَلَى أَحَدٍ فَضْلٌ إِلَّا بِالتَّقْوَى أَلَا وَ إِنَّ لِلْمُتَّقِينَ عِنْدَ اللَّهِ تَعَالَى أَفْضَلَ الثَّوَابِ وَ أَحْسَنَ الْجَزَاءِ وَ الْمَآبِ لَمْ يَجْعَلِ اللَّهُ تَبَارَكَ وَ تَعَالَى الدُّنْيَا لِلْمُتَّقِينَ ثَوَاباً وَ مَا عِنْدَ اللَّهِ خَيْرٌ لِلْأَبْرَارِ انْظُرُوا أَهْلَ دِينِ اللَّهِ فِيمَا أَصَبْتُمْ فِي كِتَابِ اللَّهِ وَ تَرَكْتُمْ عِنْدَ رَسُولِ اللَّهِ (صلى الله عليه وآله) وَ جَاهَدْتُمْ بِهِ فِي ذَاتِ اللَّهِ أَ بِحَسَبٍ أَمْ بِنَسَبٍ أَمْ بِعَمَلٍ أَمْ بِطَاعَةٍ أَمْ زَهَادَةٍ وَ فِيمَا أَصْبَحْتُمْ فِيهِ رَاغِبِينَ فَسَارِعُوا إِلَى مَنَازِلِكُمْ رَحِمَكُمُ اللَّهُ الَّتِي أُمِرْتُمْ بِعِمَارَتِهَا الْعَامِرَةِ الَّتِي لَا تَخْرَبُ الْبَاقِيَةِ الَّتِي لَا تَنْفَدُ الَّتِي دَعَاكُمْ إِلَيْهَا وَ حَضَّكُمْ عَلَيْهَا وَ رَغَّبَكُمْ فِيهَا وَ جَعَلَ الثَّوَابَ عِنْدَهُ عَنْهَا فَاسْتَتِمُّوا نِعَمَ اللَّهِ عَزَّ ذِكْرُهُ بِالتَّسْلِيمِ لِقَضَائِهِ وَ الشُّكْرِ عَلَى نَعْمَائِهِ فَمَنْ لَمْ يَرْضَ بِهَذَا فَلَيْسَ مِنَّا وَ لَا إِلَيْنَا وَ إِنَّ الْحَاكِمَ يَحْكُمُ بِحُكْمِ اللَّهِ وَ لَا خَشْيَةَ عَلَيْهِ مِنْ ذَلِكَ أُولَئِكَ هُمُ الْمُفْلِحُونَ [وَ فِي نُسْخَةٍ وَ لَا وَحْشَةَ وَ أُولَئِكَ لَا خَوْفٌ عَلَيْهِمْ وَ لَا هُمْ يَحْزَنُونَ] وَ قَالَ وَ قَدْ عَاتَبْتُكُمْ بِدِرَّتِيَ الَّتِي أُعَاتِبُ بِهَا أَهْلِي فَلَمْ تُبَالُوا وَ ضَرَبْتُكُمْ بِسَوْطِيَ الَّذِي أُقِيمُ بِهِ حُدُودَ رَبِّي فَلَمْ تَرْعَوُوا أَ تُرِيدُونَ أَنْ أَضْرِبَكُمْ بِسَيْفِي أَمَا إِنِّي أَعْلَمُ الَّذِي تُرِيدُونَ وَ يُقِيمُ أَوَدَكُمْ وَ لَكِنْ لَا أَشْتَرِي صَلَاحَكُمْ بِفَسَادِ نَفْسِي بَلْ يُسَلِّطُ اللَّهُ عَلَيْكُمْ قَوْماً فَيَنْتَقِمُ لِي مِنْكُمْ فَلَا دُنْيَا اسْتَمْتَعْتُمْ بِهَا وَ لَا آخِرَةَ صِرْتُمْ إِلَيْهَا فَبُعْداً وَ سُحْقاً لِأَصْحَابِ السَّعِيرِ.",
                    "englishText": "551. Ali Bin Ibrahim, from his father, and Muhammad Bin Ali, together from ismail Bin Mahran, and Ahmad Bin Muhammad Bin Ahmad, from Ali Bin Al-hassan Al-Taymi, and Ali Bin Al-Husayn, from Ahmad Bin muhammad Bin Khalid, together from Ismail Bin Mahran, from Al-Munzar Bin Jayfar, from Al-Hakam Bin Zaheer, from Abdullah Bin Jareer Al-Abdy, from Al-Asbagh Bin Nubata who said: ‘There came to Amir-ul-Momineen , Abdullah Bin Umar and a son of Abu Bakr, and Sa’d bin Abu Waqqas, seeking from him  the preferential treatment for themselves. So he  ascended the Pulpit, and the people turned their attention towards him . So he  said: ‘The Praise is due to Allah (azwj) to Whom belongs all Praise, and Who is extremely Generous. The descriptions do not fathom Him (azwj) nor is He (azwj) limited by the languages, nor can He (azwj) be understood by the wildest imaginations. And I  testify that there is no god except Allah (azwj), One with no associates to Him (azwj), and that Muhammad ﷺ is the Messenger ﷺ of Allah (azwj), a Prophet ﷺ of Guidance and a place for the piety, and a Messenger ﷺ of the Highest Lord (azwj) who ﷺ came with the Truth from the Presence of the Truth, to warn by the Enlightening Quran and the Illuminating Proof. So he ﷺ declared by the Manifest Book and passed away upon what the former Messengers ﷺ had passed away. Having said that, O you people! Do not speak of the men who were immersed in the world, and acquired properties, and made canals to flow, and rode plenty of animals, and cLuthed themselves with soft cLuthing, for that would became a source of shame and ignominy for them if the Forgiver does not Forgive them. If I  were to prevent them from what they used to be in (affluent lifestyle) and take them to what is necessary for them, they would lose all that and they would be saying that the son  of Abu Talib  has been unjust to us and has prohibited us and prevented us from our rights. So, Allah (azwj) is the Helper against the one who (Prays) in our direction (Qiblah), and eats the animals slaughtered by us, and believes by our Prophet ﷺ, and testifies to what we testify, and enters our Religion, we  will apply upon him the Judgements of the Quran, and the Limits of Al-Islam. There is no preference for anyone over anyone else except by the piety. Indeed! The pious ones have the highest Rewards in the Presence of Allah (azwj) the High, and the best Recompense and the Return. Allah (azwj) did not Make the world to be for the pious ones as a form of Reward, and what is in the Possession of Allah (azwj) is better for the righteous. People of the religion of Allah (azwj)! Consider what you find in the Book of Allah (azwj) and what you leave in the presence of the Rasool Allah ﷺ and what you have been striving by for the Sake of Allah (azwj), either by nobility, or by lineage, or by deeds, or by obedience, or devotion, and regarding what you were interested in. So rush to your destinations, may Allah (azwj) have mercy upon you, which you have been Commanded to construct. Assets, which will not spoil and will remain, and will not diminish. The dwellings to which you have received invitations for, and are being encouraged to acquire, and recommended to be interested in, and the Rewards are Made to be in His (azwj) Presence. So seek the completion of the Bounties of Allah (azwj) by the submission to His (azwj) Judgement, and the appreciation for His (azwj) Favours. The one, who is unhappy with this, is not from us , nor is he to us . The rulers who judge by the Judgement of Allah (azwj), without being anxious from that, those are the successful ones’. (And in another copy: ‘They are not anxious, and those are the ones who have no fear upon them, nor shall they grieve’). And he  said: ‘And I  will discipline you with my  whip which I discipline my  family with, so do not worry, and I  will be striking you by my whip by which I  establish the Limits of my  Lord (azwj). So do not be scared. Do you want that I  should strike you by my  sword? But rather, I  am more knowing of that which you want, and how to straighten your unevenness. But, I  will not buy your correction in exchange for spoiling myself . However, Allah (azwj) will Make a people to overcome you and will exact my  Revenge from you all. So you will have no world that you can enjoy in, and no Hereafter that you can look forward to. Thus, remote and crushed are the companions of the blazing Fire’.",
                    "href": "https://thaqalayn.net/hadith/8/1/551/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "مجهول لكنها معروفة",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 534)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "557": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Astronomer for Nimrod...",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي أَيُّوبَ الْخَزَّازِ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) أَنَّ آزَرَ أَبَا إِبْرَاهِيمَ (عليه السلام) كَانَ مُنَجِّماً لِنُمْرُودَ وَ لَمْ يَكُنْ يَصْدُرُ إِلَّا عَنْ أَمْرِهِ فَنَظَرَ لَيْلَةً فِي النُّجُومِ فَأَصْبَحَ وَ هُوَ يَقُولُ لِنُمْرُودَ لَقَدْ رَأَيْتُ عَجَباً قَالَ وَ مَا هُوَ قَالَ رَأَيْتُ مَوْلُوداً يُولَدُ فِي أَرْضِنَا يَكُونُ هَلَاكُنَا عَلَى يَدَيْهِ وَ لَا يَلْبَثُ إِلَّا قَلِيلًا حَتَّى يُحْمَلَ بِهِ قَالَ فَتَعَجَّبَ مِنْ ذَلِكَ وَ قَالَ هَلْ حَمَلَتْ بِهِ النِّسَاءُ قَالَ لَا قَالَ فَحَجَبَ النِّسَاءَ عَنِ الرِّجَالِ فَلَمْ يَدَعِ امْرَأَةً إِلَّا جَعَلَهَا فِي الْمَدِينَةِ لَا يُخْلَصُ إِلَيْهَا وَ وَقَعَ آزَرُ بِأَهْلِهِ فَعَلِقَتْ بِإِبْرَاهِيمَ (عليه السلام) فَظَنَّ أَنَّهُ صَاحِبُهُ فَأَرْسَلَ إِلَى نِسَاءٍ مِنَ الْقَوَابِلِ فِي ذَلِكَ الزَّمَانِ لَا يَكُونُ فِي الرَّحِمِ شَيْ‏ءٌ إِلَّا عَلِمْنَ بِهِ فَنَظَرْنَ فَأَلْزَمَ اللَّهُ عَزَّ وَ جَلَّ مَا فِي الرَّحِمِ إِلَى الظَّهْرِ فَقُلْنَ مَا نَرَى فِي بَطْنِهَا شَيْئاً وَ كَانَ فِيمَا أُوتِيَ مِنَ الْعِلْمِ أَنَّهُ سَيُحْرَقُ بِالنَّارِ وَ لَمْ يُؤْتَ عِلْمَ أَنَّ اللَّهَ تَعَالَى سَيُنْجِيهِ قَالَ فَلَمَّا وَضَعَتْ أُمُّ إِبْرَاهِيمَ أَرَادَ آزَرُ أَنْ يَذْهَبَ بِهِ إِلَى نُمْرُودَ لِيَقْتُلَهُ فَقَالَتْ لَهُ امْرَأَتُهُ لَا تَذْهَبْ بِابْنِكَ إِلَى نُمْرُودَ فَيَقْتُلَهُ دَعْنِي أَذْهَبْ بِهِ إِلَى بَعْضِ الْغِيرَانِ أَجْعَلْهُ فِيهِ حَتَّى يَأْتِيَ عَلَيْهِ أَجَلُهُ وَ لَا تَكُونَ أَنْتَ الَّذِي تَقْتُلُ ابْنَكَ فَقَالَ لَهَا فَامْضِي بِهِ قَالَ فَذَهَبَتْ بِهِ إِلَى غَارٍ ثُمَّ أَرْضَعَتْهُ ثُمَّ جَعَلَتْ عَلَى بَابِ الْغَارِ صَخْرَةً ثُمَّ انْصَرَفَتْ عَنْهُ قَالَ فَجَعَلَ اللَّهُ عَزَّ وَ جَلَّ رِزْقَهُ فِي إِبْهَامِهِ فَجَعَلَ يَمَصُّهَا فَيَشْخُبُ لَبَنُهَا وَ جَعَلَ يَشِبُّ فِي الْيَوْمِ كَمَا يَشِبُّ غَيْرُهُ فِي الْجُمْعَةِ وَ يَشِبُّ فِي الْجُمْعَةِ كَمَا يَشِبُّ غَيْرُهُ فِي الشَّهْرِ وَ يَشِبُّ فِي الشَّهْرِ كَمَا يَشِبُّ غَيْرُهُ فِي السَّنَةِ فَمَكَثَ مَا شَاءَ اللَّهُ أَنْ يَمْكُثَ ثُمَّ إِنَّ أُمَّهُ قَالَتْ لِأَبِيهِ لَوْ أَذِنْتَ لِي حَتَّى أَذْهَبَ إِلَى ذَلِكَ الصَّبِيِّ فَعَلْتُ قَالَ فَافْعَلِي فَذَهَبَتْ فَإِذَا هِيَ بِإِبْرَاهِيمَ (عليه السلام) وَ إِذَا عَيْنَاهُ تَزْهَرَانِ كَأَنَّهُمَا سِرَاجَانِ قَالَ فَأَخَذَتْهُ فَضَمَّتْهُ إِلَى صَدْرِهَا وَ أَرْضَعَتْهُ ثُمَّ انْصَرَفَتْ عَنْهُ فَسَأَلَهَا آزَرُ عَنْهُ فَقَالَتْ قَدْ وَارَيْتُهُ فِي التُّرَابِ فَمَكَثَتْ تَفْعَلُ فَتَخْرُجُ فِي الْحَاجَةِ وَ تَذْهَبُ إِلَى إِبْرَاهِيمَ (عليه السلام) فَتَضُمُّهُ إِلَيْهَا وَ تُرْضِعُهُ ثُمَّ تَنْصَرِفُ فَلَمَّا تَحَرَّكَ أَتَتْهُ كَمَا كَانَتْ تَأْتِيهِ فَصَنَعَتْ بِهِ كَمَا كَانَتْ تَصْنَعُ فَلَمَّا أَرَادَتِ الِانْصِرَافَ أَخَذَ بِثَوْبِهَا فَقَالَتْ لَهُ مَا لَكَ فَقَالَ لَهَا اذْهَبِي بِي مَعَكِ فَقَالَتْ لَهُ حَتَّى أَسْتَأْمِرَ أَبَاكَ قَالَ فَأَتَتْ أُمُّ إِبْرَاهِيمَ (عليه السلام) آزَرَ فَأَعْلَمَتْهُ الْقِصَّةَ فَقَالَ لَهَا ائْتِينِي بِهِ فَأَقْعِدِيهِ عَلَى الطَّرِيقِ فَإِذَا مَرَّ بِهِ إِخْوَتُهُ دَخَلَ مَعَهُمْ وَ لَا يُعْرَفُ قَالَ وَ كَانَ إِخْوَةُ إِبْرَاهِيمَ (عليه السلام) يَعْمَلُونَ الْأَصْنَامَ وَ يَذْهَبُونَ بِهَا إِلَى الْأَسْوَاقِ وَ يَبِيعُونَهَا قَالَ فَذَهَبَتْ إِلَيْهِ فَجَاءَتْ بِهِ حَتَّى أَقْعَدَتْهُ عَلَى الطَّرِيقِ وَ مَرَّ إِخْوَتُهُ فَدَخَلَ مَعَهُمْ فَلَمَّا رَآهُ أَبُوهُ وَقَعَتْ عَلَيْهِ الْمَحَبَّةُ مِنْهُ فَمَكَثَ مَا شَاءَ اللَّهُ قَالَ فَبَيْنَمَا إِخْوَتُهُ يَعْمَلُونَ يَوْماً مِنَ الْأَيَّامِ الْأَصْنَامَ إِذَا أَخَذَ إِبْرَاهِيمُ (عليه السلام) الْقَدُومَ وَ أَخَذَ خَشَبَةً فَنَجَرَ مِنْهَا صَنَماً لَمْ يَرَوْا قَطُّ مِثْلَهُ فَقَالَ آزَرُ لِأُمِّهِ إِنِّي لَأَرْجُو أَنْ نُصِيبَ خَيْراً بِبَرَكَةِ ابْنِكِ هَذَا قَالَ فَبَيْنَمَا هُمْ كَذَلِكَ إِذَا أَخَذَ إِبْرَاهِيمُ الْقَدُومَ فَكَسَرَ الصَّنَمَ الَّذِي عَمِلَهُ فَفَزِعَ أَبُوهُ مِنْ ذَلِكَ فَزَعاً شَدِيداً فَقَالَ لَهُ أَيَّ شَيْ‏ءٍ عَمِلْتَ فَقَالَ لَهُ إِبْرَاهِيمُ (عليه السلام) وَ مَا تَصْنَعُونَ بِهِ فَقَالَ آزَرُ نَعْبُدُهُ فَقَالَ لَهُ إِبْرَاهِيمُ (عليه السلام) أَ تَعْبُدُونَ ما تَنْحِتُونَ فَقَالَ آزَرُ لِأُمِّهِ هَذَا الَّذِي يَكُونُ ذَهَابُ مُلْكِنَا عَلَى يَدَيْهِ.",
                    "englishText": "558. Ali Bin Ibrahim, from his father, from Ibn Abi ‘Umayr, from Hisham Bin salim, from Abu Ayyub Al-Khazzaz, from Abu Baseer, who has said the following: Abu Abdullah  having said that: ‘Azar, the father of Ibrahim  was an astrologer for Nimrod (la) and he (la) never passed a law except after seeking his advice. So he looked at the stars one night, and in the morning he said to Nimrod (la), ‘I have seen something strange’. He (la) said, ‘And what is it?’ He said, ‘I saw a newborn being born in our land. Our destruction will be by his  hands. It will not be long after him  being conceived’. So he (la) was astounded by that and said, ‘Has the woman fallen pregnant with him  yet?’ He said, ‘Not yet’. So he (la) separated the women from the men. He (la) did not leave a single woman except that he (la) made her to be in the city, with no man being allowed to be alone with her. Azar copulated with his wife and Ibrahim  was conceived. He thought that he  might be the one. So he sent for the women from the midwives of that time, that if there is anything in her womb they should notify him. They examined her. So Allah (azwj) Mighty and Majestic Made what was in her womb to be transferred to the back. So they said, ‘We did not see anything in her tummy’. And what was in his knowledge was that he  would be burnt by the fire, and did not know that Allah (azwj) the High would be Rescuing him ’. He  said: ‘So when the mother of Ibrahim  gave birth to him , Azar wanted to go with him  to Nimrod (la) to be killed. So his wife said to him, ‘Do not go with your son  to Nimrod (la) for he (la) will kill him . I shall go with him  to one of the caves and leave him  there until his  death comes to him , and you will not become the one to have killed your own son’. So he said to her, ‘Take him ’. So she went with him  to a cave, then placed him  in it, and placed a rock to block the entrance of the cave. Then she left him . He  said: ‘Allah (azwj) Mighty and Majestic Made his  sustenance to be in his  thumb. He  would suck it and milk would flow from it. He  grew in a day like others grow in a week, and grew in a week like others grow in a month, and grew in a month like others grow in a year. So that situation remained for as long as Allah (azwj) Desired it to remain. Then his  mother said to his  father, ‘If you allow me, I shall go to that child’. So he allowed her. So she went there and there was Ibrahim . His  eyes lit up like two lanterns. She grabbed him  and pressed him  to her bosom, and fed him . Then she left him there. Azar asked her about him , so she said, ‘I have hidden (buried) him in the soil’. She waited, and she would come out for her need, and go to Ibrahim , hold him  to her bosom, feed him , and leave him . So when he  started moving, she would still come to him  and do as she had done before. So when she wanted to leave, he  grabbed her robe. She said to him , ‘What is the matter?’ He  said to her: ‘Take me  with you’. She said, ‘Not until your father orders me to’. He  said: ‘The mother of Ibrahim  came to Azar. She related to him the story. He said to her, ‘Bring him  to me. Make him  to be seated upon the road, so when his  brothers pass by, make him  enter with them, and he  will not be noticed’. He  said: ‘And the brothers of Ibrahim  used to carve the idols and would go with these to the markets and sell them. So she went to him , and came with him  until she made him  to sit upon the road. And his  brothers passed by, he  entered with them. So when his  father saw him , he was overwhelmed with the love for him . And so the situation remained as such for as long as Allah (azwj) Desired it to’. He  said; ‘One day from the days during which, his  brothers were in the middle of carving the idols, Ibrahim  took the tool, and took a piece of wood, and carved such an idol from it the like of which they had never seen before at all. So Azar said to his  mother, ‘I hope that we receive good luck from the blessings of this son  of yours’. He  said; ‘So when they were in the middle of that, Ibrahim  grabbed hold of the tool and broke the idol which he  had carved. So his  father got scared and was overcome with severe panic. He said to him , ‘What would you  have done with it?’ Ibrahim  said to him: ‘And what would you have done with it?’ Azar said, ‘People would have worshipped it’. So Ibrahim  said to him: ‘Are you worshipping what you yourself have carved?’ So Azar said to his  mother, ‘This is the one due to whom our kingdom would go away, by his  hands’.",
                    "href": "https://thaqalayn.net/hadith/8/1/557/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "ضعيف على الشهور",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 547)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "569": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: About a 9:128",
                    "arabicText": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ يَحْيَى بْنِ الْمُبَارَكِ عَنْ عَبْدِ اللَّهِ بْنِ جَبَلَةَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ هَكَذَا أَنْزَلَ اللَّهُ تَبَارَكَ وَ تَعَالَى لَقَدْ جَاءَنَا رَسُولٌ مِنْ أَنْفُسِنَا عَزِيزٌ عَلَيْهِ مَا عَنِتْنَا حَرِيصٌ عَلَيْنَا بِالْمُؤْمِنِينَ رَءُوفٌ رَحِيمٌ.",
                    "englishText": "570. A number of our companions, from Sahl Bin Ziyad, from Yahya Bin Al-Mubarak, from Abdullah Bin Jabalat, from Is’haq Bin Ammar, who has said: Abu Abdullah  has said: ‘This is how Allah (azwj), Blessed and High Revealed it: “[9:128] Certainly a Messenger has come to us from among ourselves; grievous to him is our falling into distress, full of concern for us; to the believers (he is) compassionate”. (Imam  indicating the Tahreef in the Holy Quran)",
                    "href": "https://thaqalayn.net/hadith/8/1/569/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "ضعيف على الشهور",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 565)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "579": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Use these three items...",
                    "arabicText": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ مَحْبُوبٍ عَنْ رَجُلٍ قَالَ دَخَلَ رَجُلٌ عَلَى أَبِي عَبْدِ اللَّهِ (عليه السلام) وَ هُوَ يَشْتَكِي عَيْنَيْهِ فَقَالَ لَهُ أَيْنَ أَنْتَ عَنْ هَذِهِ الْأَجْزَاءِ الثَّلَاثَةِ الصَّبِرِ وَ الْكَافُورِ وَ الْمُرِّ فَفَعَلَ الرَّجُلُ ذَلِكَ فَذَهَبَتْ عَنْهُ.",
                    "englishText": "580. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Mahboub, from a man who said: ‘A man came up to Abu Abdullah  and he was complaining about his eyes, so he  said to him: ‘Where are you from these three parts – the Aloe, the Camphor, and the Myrrh’. The man did that, and it (illness) went away from him’.",
                    "href": "https://thaqalayn.net/hadith/8/1/579/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "مرفوع",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 583)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "594": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: People of the cave were old...",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) لِرَجُلٍ مَا الْفَتَى عِنْدَكُمْ فَقَالَ لَهُ الشَّابُّ فَقَالَ لَا الْفَتَى الْمُؤْمِنُ إِنَّ أَصْحَابَ الْكَهْفِ كَانُوا شُيُوخاً فَسَمَّاهُمُ اللَّهُ عَزَّ وَ جَلَّ فِتْيَةً بِإِيمَانِهِمْ.",
                    "englishText": "595. Ali Bin Ibrahim, by an unbroken chain, said: ‘Abu Abdullah  said to a man: ‘What are considered to be the young ones (Al-Fati) among you?’ He said to him , ‘The youth’. So he  said; ‘No! Al-Fati is the Believer. The Companions of the Cave (As’haab Al-Kahf) were old people, Allah (azwj) Mighty and Majestic Called them ‘Young men’ due to their belief’.",
                    "href": "https://thaqalayn.net/hadith/8/1/594/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "متلف فيه",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 606)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "595": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Distance of our journeys further apart...",
                    "arabicText": "مُحَمَّدٌ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنْ سَدِيرٍ قَالَ سَأَلَ رَجُلٌ أَبَا جَعْفَرٍ (عليه السلام) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ فَقالُوا رَبَّنا باعِدْ بَيْنَ أَسْفارِنا وَ ظَلَمُوا أَنْفُسَهُمْ فَقَالَ هَؤُلَاءِ قَوْمٌ كَانَ لَهُمْ قُرًى مُتَّصِلَةٌ يَنْظُرُ بَعْضُهُمْ إِلَى بَعْضٍ وَ أَنْهَارٌ جَارِيَةٌ وَ أَمْوَالٌ ظَاهِرَةٌ فَكَفَرُوا بِأَنْعُمِ اللَّهِ وَ غَيَّرُوا مَا بِأَنْفُسِهِمْ فَأَرْسَلَ اللَّهُ عَزَّ وَ جَلَّ عَلَيْهِمْ سَيْلَ الْعَرِمِ فَغَرَّقَ قُرَاهُمْ وَ أَخْرَبَ دِيَارَهُمْ وَ أَذْهَبَ بِأَمْوَالِهِمْ وَ أَبْدَلَهُمْ مَكَانَ جَنَّاتِهِمْ جَنَّتَيْنِ ذَوَاتَيْ أُكُلٍ خَمْطٍ وَ أَثْلٍ وَ شَيْ‏ءٍ مِنْ سِدْرٍ قَلِيلٍ ثُمَّ قَالَ اللَّهُ عَزَّ وَ جَلَّ ذلِكَ جَزَيْناهُمْ بِما كَفَرُوا وَ هَلْ نُجازِي إِلَّا الْكَفُورَ.",
                    "englishText": "596. Muhammad, from Ahmad Bin Muhammad, from Ibn Mahboub, from Jameel Bin Salih, from Sadeyr who said: ‘A man asked Abu Ja’far  about the Statement of Allah (azwj) Mighty and Majestic: “[34:19] And they said: O our Lord! make spaces to be longer between our journeys; and they were unjust to themselves”. He  said: ‘They were a people who live in two inter-connected villages and were able to see each other, and rivers which flowed, and phenomenal wealth. They denied the Favours of Allah (azwj) and changed what was in themselves, so Allah (azwj) Mighty and Majestic Sent the flood of Al-Aram against them. Their two villages were submerged, and their houses were spoilt, and their wealth was gone. It changed their plantations into two plantations to be only with the edible plants of bitter tamarisk (a troublesome weed) and a few Lutus trees. Then Allah (azwj) Mighty and Majestic Said: “[34:17] This We requited them with because they disbelieved; and We do not punish any but the ungrateful”.",
                    "href": "https://thaqalayn.net/hadith/8/1/595/1",
                    "grading": {
                        "gradeEnglish": "Acceptable",
                        "gradeArabic": "مرفوع",
                        "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16 / 606)",
                        "author": "Allamah Baqir al-Majlisi"
                    }
                }
            }
        }
    }
]