{
  "Volume #4": {
    "Book #1": {
      "Chapter #1": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 4: Virtue of Charity",
          "Link": "https://thaqalayn.net/hadith/4/1/1/1",
          "Arabic Text": "1ـ عَلِيُّ بْنُ إِبْرَاهِيمَ بْنِ هَاشِمٍ عَنْ أَبِيهِ عَنِ الْحُسَيْنِ بْنِ يَزِيدَ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ قَالَ رَسُولُ الله (صلَّى اللهُ عَلَيْهِ وَآلِه) الصَّدَقَةُ تَدْفَعُ مِيتَةَ السَّوْءِ.",
          "English Text": "1. Ali ibn Ibrahim ibn Hashim has narrated from his father, from al-Husayn ibn Yazid af-Nawfafiy from al-Sakuniy who has said the following: “Abu ‘Abd Allah , has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ’Charity dispels wicked forms of death.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف ضعيف على المشهور    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/125)"
          }
        }
      },
      "Chapter #2": {
        "Hadith #8": {
          "Title": "Al-Kafi - Volume 4: Giving Charity Repels Misfortune",
          "Link": "https://thaqalayn.net/hadith/4/1/2/8",
          "Arabic Text": "8ـ عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَبْدِ الله عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ غَيْرِ وَاحِدٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنِ الْحَسَنِ بْنِ الْجَهْمِ قَالَ قَالَ أَبُو الْحَسَنِ (عَلَيْهِ السَّلاَم) لإِسْمَاعِيلَ بْنِ مُحَمَّدٍ وَذَكَرَ لَهُ أَنَّ ابْنَهُ صَدَّقَ عَنْهُ قَالَ إِنَّهُ رَجُلٌ قَالَ فَمُرْهُ أَنْ يَتَصَدَّقَ وَلَوْ بِالْكِسْرَةِ مِنَ الْخُبْزِ ثُمَّ قَالَ قَالَ أَبُو جَعْفَرٍ (عَلَيْهِ السَّلاَم) إِنَّ رَجُلاً مِنْ بَنِي إِسْرَائِيلَ كَانَ لَهُ ابْنٌ وَكَانَ لَهُ مُحِبّاً فَأُتِيَ فِي مَنَامِهِ فَقِيلَ لَهُ إِنَّ ابْنَكَ لَيْلَةَ يَدْخُلُ بِأَهْلِهِ يَمُوتُ قَالَ فَلَمَّا كَانَ تِلْكَ اللَّيْلَةُ وَبَنَى عَلَيْهِ أَبُوهُ تَوَقَّعَ أَبُوهُ ذَلِكَ فَأَصْبَحَ ابْنُهُ سَلِيماً فَأَتَاهُ أَبُوهُ فَقَالَ لَهُ يَا بُنَيَّ هَلْ عَمِلْتَ الْبَارِحَةَ شَيْئاً مِنَ الْخَيْرِ قَالَ لا إِلاَّ أَنَّ سَائِلاً أَتَى الْبَابَ وَقَدْ كَانُوا ادَّخَرُوا لِي طَعَاماً فَأَعْطَيْتُهُ السَّائِلَ فَقَالَ بِهَذَا دَفَعَ الله عَنْكَ.",
          "English Text": "8. Ali ibn Muhammad ibn ‘Abd Allah has narrated from Ahmad ibn Muhammad from more than one narrator from Ali ibn Asbat from al-Hassan ibn al-Jahm who has said the following: “Abu al-Hassan , once in response to the words of Isma‘il ibn Muhammad that his son had given charity on his behalf and that he is a man, said this. ‘Ask him to give charity, even if it is only a small piece of bread.’ The Imam then said that abu Ja‘far , has said, ‘A man in banu Israel had a son whom he loved a great deal. In his dream, he was told, “One night, after going to bed with his wife, your son will die.” His father helped him to get married and when that night came, he was concerned about his dream. In the morning he found his son safe and alive. He went to him and asked, “Son, did you do any good deed last night?” He replied, “No, except that a beggar came to the door last night. They had spared some food for me, and I gave it to the beggar.” He then said, “Because of this, (Allah) has repelled misfortune from you.””’ ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالموثق   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/129)"
          }
        }
      },
      "Chapter #10": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 4: Giving Charity to Bedouins and People Who Live in Desolate Areas",
          "Link": "https://thaqalayn.net/hadith/4/1/10/3",
          "Arabic Text": "3ـ أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنِ الْحَكَمِ بْنِ مِسْكِينٍ عَنْ عَمْرِو بْنِ أَبِي نَصْرٍ قَالَ قُلْتُ لأَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) إِنَّ أَهْلَ السَّوَادِ يَقْتَحِمُونَ عَلَيْنَا وَفِيهِمُ الْيَهُودُ وَالنَّصَارَى وَالْمَجُوسُ فَنَتَصَدَّقُ عَلَيْهِمْ فَقَالَ نَعَمْ. ",
          "English Text": "3. Ahmad ibn Muhammad has narrated from Muhammad ibn Ali from al-Hakam ibn Miskin from ‘Amr ibn abu Nasr who has said the following: “I once asked abu ‘Abd Allah , ‘People who live in wilderness come to us. Among them are Jews, Christian and Zoroastrians. Can we give them charity?’ The Imam replied, ‘Yes, you ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول ويحتمل الضعف    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/141)"
          }
        }
      },
      "Chapter #17": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 4: Unpleasantness of Begging",
          "Link": "https://thaqalayn.net/hadith/4/1/17/3",
          "Arabic Text": "3ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ النَّضْرِ رَفَعَهُ قَالَ قَالَ رَسُولُ الله (صلَّى اللهُ عَلَيْهِ وَآلِه) الأَيْدِي ثَلاثٌ يَدُ الله الْعُلْيَا وَيَدُ الْمُعْطِي الَّتِي تَلِيهَا وَيَدُ الْمُعْطَى أَسْفَلُ الأَيْدِي فَاسْتَعِفُّوا عَنِ السُّؤَالِ مَا اسْتَطَعْتُمْ إِنَّ الأَرْزَاقَ دُونَهَا حُجُبٌ فَمَنْ شَاءَ قَنَى حَيَاءَهُ وَأَخَذَ رِزْقَهُ وَمَنْ شَاءَ هَتَكَ الْحِجَابَ وَأَخَذَ رِزْقَهُ وَالَّذِي نَفْسِي بِيَدِهِ لأَنْ يَأْخُذَ أَحَدُكُمْ حَبْلاً ثُمَّ يَدْخُلَ عَرْضَ هَذَا الْوَادِي فَيَحْتَطِبَ حَتَّى لا يَلْتَقِيَ طَرَفَاهُ ثُمَّ يَدْخُلَ بِهِ السُّوقَ فَيَبِيعَهُ بِمُدٍّ مِنْ تَمْرٍ وَيَأْخُذَ ثُلُثَهُ وَيَتَصَدَّقَ بِثُلُثَيْهِ خَيْرٌ لَهُ مِنْ أَنْ يَسْأَلَ النَّاسَ أَعْطَوْهُ أَوْ حَرَمُوهُ.",
          "English Text": "3. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid, from his father, from Ahmad ibn al-Nadr in a marfu‘ manner has said the following: “The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘Hands are of three kinds: The hands of Allah are the upper hands, the hands of a benevolent person are next in rank, and the hands of recipient of a favor are the lowest in rank. You should abstain from pleading for help (financial) as much as you can. Sustenance is behind a curtain (barrier); therefore, one may protect his dignity to find his sustenance or tear it down to find his sustenance. I swear by the One in whose hand is my life. One of you picks up a rope and goes in the valley to collect firewood. He works hard and collects so much that the length of the rope hardly reaches around the bunch of his collection. He then brings it to the market and sells it for a mud (a certain amount) of dates, saves one-third, and gives the rest in charity. This is better for him than pleading before people for financial help who may give it to him or turn him away empty-handed.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/147)"
          }
        },
        "Hadith #8": {
          "Title": "Al-Kafi - Volume 4: Unpleasantness of Begging",
          "Link": "https://thaqalayn.net/hadith/4/1/17/8",
          "Arabic Text": "8ـ وَرُوِيَ عَنْ لُقْمَانَ أَنَّهُ قَالَ لابْنِهِ يَا بُنَيَّ ذُقْتُ الصَّبْرَ وَأَكَلْتُ لِحَاءَ الشَّجَرِ فَلَمْ أَجِدْ شَيْئاً هُوَ أَمَرُّ مِنَ الْفَقْرِ فَإِنْ بُلِيتَ بِهِ يَوْماً وَلا تُظْهِرِ النَّاسَ عَلَيْهِ فَيَسْتَهِينُوكَ وَلا يَنْفَعُوكَ بِشَيْ‏ءٍ ارْجِعْ إِلَى الَّذِي ابْتَلاكَ بِهِ فَهُوَ أَقْدَرُ عَلَى فَرَجِكَ وَسَلْهُ مَنْ ذَا الَّذِي سَأَلَهُ فَلَمْ يُعْطِهِ أَوْ وَثِقَ بِهِ فَلَمْ يُنْجِهِ. ",
          "English Text": "8. “It is narrated that Luqman said to his son, ‘Son, I have tested patience and have consumed tree barks for food. I have not found anything as bitter as poverty. If you ever face poverty, do not tell people about it; you will seem insignificant in their sight and they will be of no benefit to you. You must turn to the One who has placed it upon you as a trial. He has all the power to grant you relief, but you must ask Him for help. No one asking Him for help is ever turned away empty-handed, and no one who has placed his trust in Him is ever abandoned.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " سكت عنه   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/149)"
          }
        }
      },
      "Chapter #18": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 4: Embarrassing the Recipient of a Favor",
          "Link": "https://thaqalayn.net/hadith/4/1/18/2",
          "Arabic Text": "2ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ الله رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلاَم) الْمَنُّ يَهْدِمُ الصَّنِيعَةَ. ",
          "English Text": "2. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah in a marfu‘ manner the following: “Abu ‘Abd Allah , has said, ‘Embarrassing a recipient, after giving charity destroys the virtue of this benevolent deed.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/149)"
          }
        }
      },
      "Chapter #19": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 4: Giving Charity After an Appeal From a Recipient",
          "Link": "https://thaqalayn.net/hadith/4/1/19/2",
          "Arabic Text": "2ـ أَحْمَدُ بْنُ إِدْرِيسَ وَغَيْرُهُ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ أَحْمَدَ بْنِ نُوحِ بْنِ عَبْدِ الله عَنِ الذُّهْلِيِّ رَفَعَهُ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ الْمَعْرُوفُ ابْتِدَاءٌ وَأَمَّا مَنْ أَعْطَيْتَهُ بَعْدَ الْمَسْأَلَةِ فَإِنَّمَا كَافَيْتَهُ بِمَا بَذَلَ لَكَ مِنْ وَجْهِهِ يَبِيتُ لَيْلَتَهُ أَرِقاً مُتَمَلْمِلاً يَمْثُلُ بَيْنَ الرَّجَاءِ وَالْيَأْسِ لا يَدْرِي أَيْنَ يَتَوَجَّهُ لِحَاجَتِهِ ثُمَّ يَعْزِمُ بِالْقَصْدِ لَهَا فَيَأْتِيكَ وَقَلْبُهُ يَرْجُفُ وَفَرَائِصُهُ تَرْعُدُ قَدْ تَرَى دَمَهُ فِي وَجْهِهِ لا يَدْرِي أَ يَرْجِعُ بِكَأْبَةٍ أَمْ بِفَرَحٍ.",
          "English Text": "2. Ahmad ibn Idris and others have narrated from Muhammad ibn Ahmad from Ahmad ibn Nuh ibn ‘Abd Allah from al-Dhuhliy in a marfu‘ who has said the following: “Abu ‘Abd Allah , has said that charity is that which is given before an appeal by the recipient. Giving charity after an appeal by the recipient is compensation for using the dignity of his face when he appealed and his passing the night worried and anxious in hope and despair without knowing which direction to go for his needs. He then decides to come before you with his heart beating fast and his muscles shaking. You can see (the color of) his blood on his face. He does not know whether he will turn back sadly or with happiness.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/150)"
          }
        }
      },
      "Chapter #20": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 4: Benevolent Assistance (Optional Charity as Opposed to Compulsory Ones)",
          "Link": "https://thaqalayn.net/hadith/4/1/20/2",
          "Arabic Text": "2ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ دَاوُدَ الرَّقِّيِّ عَنْ أَبِي حَمْزَةَ الثُّمَالِيِّ قَالَ قَالَ أَبُو جَعْفَرٍ (عَلَيْهِ السَّلاَم) إِنَّ الله عَزَّ وَجَلَّ جَعَلَ لِلْمَعْرُوفِ أَهْلاً مِنْ خَلْقِهِ حَبَّبَ إِلَيْهِمْ فَعَالَهُ وَوَجَّهَ لِطُلاَّبِ الْمَعْرُوفِ الطَّلَبَ إِلَيْهِمْ وَيَسَّرَ لَهُمْ قَضَاءَهُ كَمَا يَسَّرَ الْغَيْثَ لِلأَرْضِ الْمُجْدِبَةِ لِيُحْيِيَهَا وَيُحْيِيَ بِهِ أَهْلَهَا وَإِنَّ الله جَعَلَ لِلْمَعْرُوفِ أَعْدَاءً مِنْ خَلْقِهِ بَغَّضَ إِلَيْهِمُ الْمَعْرُوفَ وَبَغَّضَ إِلَيْهِمْ فَعَالَهُ وَحَظَرَ عَلَى طُلاَّبِ الْمَعْرُوفِ الطَّلَبَ إِلَيْهِمْ وَحَظَرَ عَلَيْهِمْ قَضَاءَهُ كَمَا يُحَرِّمُ الْغَيْثَ عَلَى الأَرْضِ الْمُجْدِبَةِ لِيُهْلِكَهَا وَيُهْلِكَ أَهْلَهَا وَمَا يَعْفُو الله أَكْثَرُ.",
          "English Text": "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Hassan ibn Mahbub from Dawud al-Riqqiy from abu Hamzah al-Thumaliy who has said the following: “Abu Ja‘far , has said, ‘Allah, the Most Majestic, the Most Glorious, has created a people to actuate Benevolent Assistance. He has made the doing of Benevolent Assistance beloved to them and has directed the recipients of Benevolent Assistance toward them to seek help. He has made the doing of Benevolent Assistance easy for them just as abundant rain eases the barren land to come alive and give life to its inhabitants. Also as enemies of Benevolent Assistance Allah has created a creature. He has made it to seem abhorrent to them as well as the doing of Benevolent Assistance. He has prohibited those who seek Benevolent Assistance to appeal for help before such creatures, and He has prohibited these creatures to provide such assistance, just as He prohibits abundant rain to fall on barren land to destroy it and its inhabitants; however, Allah’s forgiveness is greater.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مختلف فيه  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/152)"
          }
        }
      },
      "Chapter #21": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 4: The Virtue of Benevolent Assistance",
          "Link": "https://thaqalayn.net/hadith/4/1/21/3",
          "Arabic Text": "3ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى وَأَحْمَدَ بْنِ أَبِي عَبْدِ الله جَمِيعاً عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنْ سَعْدَانَ بْنِ مُسْلِمٍ عَنْ أَبِي يَقْظَانَ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ رَأَيْتُ الْمَعْرُوفَ كَاسْمِهِ وَلَيْسَ شَيْ‏ءٌ أَفْضَلَ مِنَ الْمَعْرُوفِ إِلاَّ ثَوَابُهُ وَذَلِكَ يُرَادُ مِنْهُ وَلَيْسَ كُلُّ مَنْ يُحِبُّ أَنْ يَصْنَعَ الْمَعْرُوفَ إِلَى النَّاسِ يَصْنَعُهُ وَلَيْسَ كُلُّ مَنْ يَرْغَبُ فِيهِ يَقْدِرُ عَلَيْهِ وَلا كُلُّ مَنْ يَقْدِرُ عَلَيْهِ يُؤْذَنُ لَهُ فِيهِ فَإِذَا اجْتَمَعَتِ الرَّغْبَةُ وَالْقُدْرَةُ وَالإِذْنُ فَهُنَالِكَ تَمَّتِ السَّعَادَةُ لِلطَّالِبِ وَالْمَطْلُوبِ إِلَيْهِ. وَرَوَاهُ أَحْمَدُ بْنُ أَبِي عَبْدِ الله عَنِ ابْنِ فَضَّالٍ عَنْ أَبِي جَمِيلَةَ عَنْ مُحَمَّدِ بْنِ مَرْوَانَ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) مِثْلَهُ.",
          "English Text": "3. A number of our people have narrated from Ahmad ibn Muhammad ibn ‘Isa and Ahmad ibn abu ‘Abd Allah all from Muhammad ibn Khalid from Sa‘dan ibn Muslim from abu Yaqzan who has said the following: “Abu ‘Abd Allah , has said, ‘I see Benevolent Assistance is as good as its name. No other thing is better than providing Benevolent Assistance except the reward for it, which one has in one’s intention thereby. Not everyone who loves Benevolent Assistance provides such charity. Not everyone who loves to provide Benevolent Assistance is able to do so, and not everyone who loves to provide Benevolent Assistance has permission to do so. When all three conditions - the desire, the ability and permission - to provide Benevolent Assistance come together, only then will the goal and the means materialize.” (Ahmad ibn ‘Abd Allah has narrated from ibn Faddal from abu Jamilah from Muhammad ibn Marwan from abu ‘Abd Allah , a similar Hadith.)",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول وسنده الثاني ضعيف   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/154)"
          }
        }
      },
      "Chapter #23": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 4: Providing Benevolent Assistance Repels Wicked Encounters",
          "Link": "https://thaqalayn.net/hadith/4/1/23/3",
          "Arabic Text": "3ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي الْمَغْرَاءِ عَنْ عَبْدِ الله بْنِ سُلَيْمَانَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ (عَلَيْهِ السَّلاَم) يَقُولُ إِنَّ صَنَائِعَ الْمَعْرُوفِ تَدْفَعُ مَصَارِعَ السُّوءِ. ",
          "English Text": "3. Ali ibn Ibrahim has narrated from his father from Muhammad ibn Yahya from ibn abu al-Mighra’ from ‘Abd Allah ibn Sulayman who has said the following: “I heard abu Ja‘far , say, ‘Providing Benevolent Assistance repels wicked encounters.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول أو حسن    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/156)"
          }
        }
      },
      "Chapter #24": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 4: Providers of Benevolent Assistance Will be Identified as Such on the Day of Judgment",
          "Link": "https://thaqalayn.net/hadith/4/1/24/2",
          "Arabic Text": "2ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ أَبِي عَبْدِ الله الْبَرْقِيِّ عَنْ بَعْضِ أَصْحَابِنَا رَفَعَهُ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ أَهْلُ الْمَعْرُوفِ فِي الدُّنْيَا هُمْ أَهْلُ الْمَعْرُوفِ فِي الآخِرَةِ يُقَالُ لَهُمْ إِنَّ ذُنُوبَكُمْ قَدْ غُفِرَتْ لَكُمْ فَهِبُوا حَسَنَاتِكُمْ لِمَنْ شِئْتُمْ.",
          "English Text": "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from abu ‘Abd Allah al-Barqiy from certain individuals of our people in a marfu‘ manner who has said the following: “Abu ‘Abd Allah , has said that providers of Benevolent Assistance will be as such on the Day of Judgment also. They will receive the news, ‘Your sins are all forgiven. You may give away your good deeds as gifts to whomever you like.”’ ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/157)"
          }
        }
      },
      "Chapter #29": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 4: Providing a Loan",
          "Link": "https://thaqalayn.net/hadith/4/1/29/1",
          "Arabic Text": "1ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مَنْصُورِ بْنِ يُونُسَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ مَكْتُوبٌ عَلَى بَابِ الْجَنَّةِ الصَّدَقَةُ بِعَشَرَةٍ وَالْقَرْضُ بِثَمَانِيَةَ عَشَرَ وَفِي رِوَايَةٍ أُخْرَى بِخَمْسَةَ عَشَرَ.",
          "English Text": "1. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from Mansur ibn Yunus from Ishaq ibn ‘Ammar who has said the following: “Abu ‘ Abd Allah , has said, ‘There is a writing on the door of Paradise that says: ‘Charity for ten “rewards” and loan for eighteen “rewards.”’ In another Hadith it is said, ‘Loan for fifteen “rewards.”” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " حسن أو موثق وآخره مرسل   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/162)"
          }
        }
      },
      "Chapter #34": {
        "Hadith #11": {
          "Title": "Al-Kafi - Volume 4: Understanding Generosity and Munificence",
          "Link": "https://thaqalayn.net/hadith/4/1/34/11",
          "Arabic Text": "11ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ الله رَفَعَهُ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ (عَلَيْهِ السَّلاَم) لابْنِهِ الْحَسَنِ (عَلَيْهِ السَّلاَم) يَا بُنَيَّ مَا السَّمَاحَةُ قَالَ الْبَذْلُ فِي الْيُسْرِ وَالْعُسْرِ.",
          "English Text": "11. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah in a marfu‘ manner saying: “’Amir al-Mu’minin , once asked his son, al-Hassan , ‘My son, what is generosity?’ He replied, ‘It is providing assistance in both easy and difficult conditions.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/170)"
          }
        },
        "Hadith #13": {
          "Title": "Al-Kafi - Volume 4: Understanding Generosity and Munificence",
          "Link": "https://thaqalayn.net/hadith/4/1/34/13",
          "Arabic Text": "13ـ عَلِيُّ بْنُ إِبْرَاهِيمَ رَفَعَهُ قَالَ أَوْحَى الله عَزَّ وَجَلَّ إِلَى مُوسَى (عَلَيْهِ السَّلاَم) أَنْ لا تَقْتُلِ السَّامِرِيَّ فَإِنَّهُ سَخِيٌّ.",
          "English Text": "13. Ali ibn Ibrahim has narrated in a marfu‘ manner saying: “He (the Imam) has said, ‘Allah the Most Majestic, the Most Glorious, sent revelation to Moses and told him not to kill the Samiriy because he was a generous person.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/170)"
          }
        }
      },
      "Chapter #35": {
        "Hadith #8": {
          "Title": "Al-Kafi - Volume 4: Spending on Deserving Causes",
          "Link": "https://thaqalayn.net/hadith/4/1/35/8",
          "Arabic Text": "8ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ عُمَرَ بْنِ أُذَيْنَةَ رَفَعَهُ إِلَى أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) أَوْ أَبِي جَعْفَرٍ (عَلَيْهِ السَّلاَم) قَالَ يُنْزِلُ الله الْمَعُونَةَ مِنَ السَّمَاءِ إِلَى الْعَبْدِ بِقَدْرِ الْمَئُونَةِ فَمَنْ أَيْقَنَ بِالْخَلَفِ سَخَتْ نَفْسُهُ بِالنَّفَقَةِ.",
          "English Text": "8. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from ‘Umar ibn ‘Udhaynah in a marfu‘ manner from who has said the following: “Abu ‘Abd Allah or abu Ja‘far, ‘Alayhim al-Salam, has said, ‘Allah sends help from Heaven equal to the amount of expenditure. When one is certain about (Allah’s) replacing what is spent, his soul allows him to spend generously.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/173)"
          }
        }
      },
      "Chapter #37": {
        "Hadith #14": {
          "Title": "Al-Kafi - Volume 4: Rare Ahadith about Charity",
          "Link": "https://thaqalayn.net/hadith/4/1/37/14",
          "Arabic Text": "14ـ مُحَمَّدُ بْنُ عَلِيٍّ عَنْ مَعْمَرٍ رَفَعَهُ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ صَلَوَاتُ الله عَلَيْهِ فِي بَعْضِ خُطَبِهِ إِنَّ أَفْضَلَ الْفِعَالِ صِيَانَةُ الْعِرْضِ بِالْمَالِ.",
          "English Text": "14. Muhammad ibn Ali has narrated from Mu’ammar in a marfu‘ manner from ’Amir al-Mu’minin , who has said the following: “In one of his speeches, ’Amir al-Mu’minin , has said, ‘The best deed is protecting one’s dignity by means of wealth.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/179)"
          }
        }
      },
      "Chapter #38": {
        "Hadith #7": {
          "Title": "Al-Kafi - Volume 4: Virtue of Serving Food",
          "Link": "https://thaqalayn.net/hadith/4/1/38/7",
          "Arabic Text": "7ـ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ الْحَكَمِ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ مِنْ أَحَبِّ الأَعْمَالِ إِلَى الله عَزَّ وَجَلَّ إِشْبَاعُ جَوْعَةِ الْمُؤْمِنِ أَوْ تَنْفِيسُ كُرْبَتِهِ أَوْ قَضَاءُ دَيْنِهِ.",
          "English Text": "7. Muhammad ibn Isma‘il has narrated from al-Fadl ibn Shadhan from Ibn Abi ‘Umayr from Hisham ibn al-Hakam who has said the following: “Abu ‘Abd Allah , has said that of the most beloved deeds in the sight of Allah, the Most Majestic, the Most Glorious, is satisfying the hunger of a believer, relieving his suffering, or paying off his debts.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول كالصحيح   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/181)"
          }
        }
      },
      "Chapter #39": {
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 4: The Excellence of Moderation",
          "Link": "https://thaqalayn.net/hadith/4/1/39/4",
          "Arabic Text": "4ـ عَلِيُّ بْنُ مُحَمَّدٍ رَفَعَهُ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ صَلَوَاتُ الله عَلَيْهِ الْقَصْدُ مَثْرَاةٌ وَالسَّرَفُ مَتْوَاةٌ.",
          "English Text": "4. Ali ibn Muhammad has narrated in a marfu‘ manner who has said the following: “’Amir al-Mu’minin , has said, ‘Moderation leads to increase, and extravagance leads to destruction.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/183)"
          }
        },
        "Hadith #12": {
          "Title": "Al-Kafi - Volume 4: The Excellence of Moderation",
          "Link": "https://thaqalayn.net/hadith/4/1/39/12",
          "Arabic Text": "12ـ أَحْمَدُ بْنُ عَبْدِ الله عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ الله عَنْ مُحَمَّدِ بْنِ عَلِيٍّ الصَّيْرَفِيِّ عَنِ ابْنِ سِنَانٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ قَالَ رَسُولُ الله (صلَّى اللهُ عَلَيْهِ وَآلِه) مَنِ اقْتَصَدَ فِي مَعِيشَتِهِ رَزَقَهُ الله وَمَنْ بَذَّرَ حَرَمَهُ الله.",
          "English Text": "12. Ahmad ibn ‘Abd Allah has narrated from Ahmad ibn abu ‘Abd Allah from Muhammad ibn Ali (al-Sayrafiy) from ibn Sinan who has said the following: “Abu ‘Abd Allah , has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘Whoever maintains moderation, Allah grants him sustenance, but He deprives one who spends excessively.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف على الظاهر    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/185)"
          }
        }
      },
      "Chapter #41": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 4: Providing Water for Drinking",
          "Link": "https://thaqalayn.net/hadith/4/1/41/1",
          "Arabic Text": "1ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ طَلْحَةَ بْنِ زَيْدٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ صَلَوَاتُ الله عَلَيْهِ أَوَّلُ مَا يُبْدَأُ بِهِ فِي الآخِرَةِ صَدَقَةُ الْمَاءِ يَعْنِي فِي الأَجْرِ.",
          "English Text": "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Yahya from Talhah ibn Zayd who has said the following: “ Abu ‘ Abd Allah , has said that ’Amir al-Mu’minin , has said, ‘The first charity for which one will be rewarded in the next life is providing water for drinking. ‘“",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " كالموثق    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/188)"
          }
        }
      },
      "Chapter #42": {
        "Hadith #5": {
          "Title": "Al-Kafi - Volume 4: Charity for Descendents of al-Hashim and the People of Their Household (Servants) and Compensation to Them",
          "Link": "https://thaqalayn.net/hadith/4/1/42/5",
          "Arabic Text": "5ـ حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ إِسْمَاعِيلَ بْنِ الْفَضْلِ الْهَاشِمِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلاَم) عَنِ الصَّدَقَةِ الَّتِي حُرِّمَتْ عَلَى بَنِي هَاشِمٍ مَا هِيَ قَالَ هِيَ الزَّكَاةُ قُلْتُ فَتَحِلُّ صَدَقَةُ بَعْضِهِمْ عَلَى بَعْضٍ قَالَ نَعَمْ.",
          "English Text": "5. Hamid ibn Ziyad has narrated from (ibn) Sama‘ah, from more than one person from Aban ibn ‘Uthman from Isma‘il ibn al-Fadl al- Hashimiy who has said the following: “I once asked abu ‘Abd Allah , about charity which it is not lawful for children of al- Hashim to receive. The Imam replied, ‘It is zakat.’ I then asked, ‘Can they receive zakat from each other?’ He replied, ‘Yes, they can do so. ’’’(This Hadith is best explained by Fatwa). ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " كالموثق   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/191)"
          }
        },
        "Hadith #6": {
          "Title": "Al-Kafi - Volume 4: Charity for Descendents of al-Hashim and the People of Their Household (Servants) and Compensation to Them",
          "Link": "https://thaqalayn.net/hadith/4/1/42/6",
          "Arabic Text": "6ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ وَمُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ أَحْمَدَ بْنِ عَائِذٍ عَنْ أَبِي خَدِيجَةَ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ أَعْطُوا الزَّكَاةَ مَنْ أَرَادَهَا مِنْ بَنِي هَاشِمٍ فَإِنَّهَا تَحِلُّ لَهُمْ وَإِنَّمَا تَحْرُمُ عَلَى النَّبِيِّ (صلَّى اللهُ عَلَيْهِ وَآلِه) وَالإِمَامِ الَّذِي مِنْ بَعْدِهِ وَالأَئِمَّةِ صَلَوَاتُ الله عَلَيْهِمْ أَجْمَعِينَ.",
          "English Text": "6. Al-Husayn ibn Muhammad has narrated from Mu’alla’ ibn Muhammad and Muhammad ibn Yahya from Ahmad ibn Muhammad aff from Afi ibn al-Washsha’ from Ahmad ibn ‘ A”Iddah (waiting period) from abu Khadijah who has narrated the foiiowing: “Abu ‘ Abd Allah , has said, ‘You can pay Zakat to banu Hashim who want it because it is lawful for them. It is unlawful only for the Holy prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to your cause and for the Imam after him and to ’A’immah ‘Alayhim al-Salam.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مختلف فيه  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/191)"
          }
        },
        "Hadith #10": {
          "Title": "Al-Kafi - Volume 4: Charity for Descendents of al-Hashim and the People of Their Household (Servants) and Compensation to Them",
          "Link": "https://thaqalayn.net/hadith/4/1/42/10",
          "Arabic Text": "10ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ ثَعْلَبَةَ بْنِ مَيْمُونٍ قَالَ كَانَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلاَم) يَسْأَلُ شِهَاباً مِنْ زَكَاتِهِ لِمَوَالِيهِ وَإِنَّمَا حُرِّمَتِ الزَّكَاةُ عَلَيْهِمْ دُونَ مَوَالِيهِمْ. ",
          "English Text": "10. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Muhammad ibn Isma‘il from Tha’labah ibn Maymun who has said the following: “Abu ‘Abd Allah , would ask Shihab (ibn ‘Abd Rabbihi) to pay zakat due from him to his (Imam’s) servants. It is not permissible for them (’A’immah) to receive zakat, but it is permissible for their servants.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " كالصحيح  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/192)"
          }
        }
      }
    },
    "Book #2": {
      "Chapter #1": {
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 4: The Excellence of Fast and Fasting",
          "Link": "https://thaqalayn.net/hadith/4/2/1/4",
          "Arabic Text": "4ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مُوسَى بْنِ بَكْرٍ قَالَ لِكُلِّ شَيْ‏ءٍ زَكَاةٌ وَزَكَاةُ الأَجْسَادِ الصَّوْمُ.",
          "English Text": "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Musa ibn Bakr who has said the following: “He (the Imam) , said, ‘Everything has a cleanser; the cleanser for bodies is fasting.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف لكنه معتبر    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/199)"
          }
        },
        "Hadith #13": {
          "Title": "Al-Kafi - Volume 4: The Excellence of Fast and Fasting",
          "Link": "https://thaqalayn.net/hadith/4/2/1/13",
          "Arabic Text": "13ـ عَلِيٌّ عَنْ أَبِيهِ وَمُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ أَوْحَى الله عَزَّ وَجَلَّ إِلَى مُوسَى (عَلَيْهِ السَّلاَم) مَا يَمْنَعُكَ مِنْ مُنَاجَاتِي فَقَالَ يَا رَبِّ أُجِلُّكَ عَنِ الْمُنَاجَاةِ لِخُلُوفِ فَمِ الصَّائِمِ فَأَوْحَى الله عَزَّ وَجَلَّ إِلَيْهِ يَا مُوسَى لَخُلُوفُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدِي مِنْ رِيحِ الْمِسْكِ.",
          "English Text": "13. Ali has narrated from his father and Muhammad ibn Isma‘il from al-Fadl ibn Shadhan all from Ibn Abi ‘Umayr from certain individuals of our people who have said the following: “Abu ‘Abd Allah , has said that Allah, the Most Majestic, the Most Glorious, sent revelation to Moses, thereby asking him, ‘What keeps you from speaking to Me?’ Moses replied, ‘It is to keep away the bad breath of fasting in order to respect your glory.’ Allah, the Most Majestic, the Most Glorious, then sent him revelation that said, ‘O Moses, bad breath of a fasting person is more beloved to Me than musk.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " حسن ويمكن أن يعد صحيحا    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/203)"
          }
        }
      },
      "Chapter #5": {
        "Hadith #6": {
          "Title": "Al-Kafi - Volume 4: The Words to Say When the Month of Ramadan is About to Begin",
          "Link": "https://thaqalayn.net/hadith/4/2/5/6",
          "Arabic Text": "5ـ يُونُسُ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ إِذَا حَضَرَ شَهْرُ رَمَضَانَ فَقُلِ اللهمَّ قَدْ حَضَرَ شَهْرُ رَمَضَانَ وَقَدِ افْتَرَضْتَ عَلَيْنَا صِيَامَهُ وَأَنْزَلْتَ فِيهِ الْقُرْآنَ هُدًى لِلنَّاسِ وَبَيِّنَاتٍ مِنَ الْهُدَى وَالْفُرْقَانِ اللهمَّ أَعِنَّا عَلَى صِيَامِهِ اللهمَّ تَقَبَّلْهُ مِنَّا وَسَلِّمْنَا فِيهِ وَتَسَلَّمْهُ مِنَّا فِي يُسْرٍ مِنْكَ وَعَافِيَةٍ إِنَّكَ عَلَى كُلِّ شَيْ‏ءٍ قَدِيرٌ يَا أَرْحَمَ الرَّاحِمِينَ.",
          "English Text": "6. Yunus has narrated from Ali ibn abu Hamzah, from abu Basir who has said the following: “Abu ‘Abd Allah , has said that when the month of Ramadan begins, say this, ‘O Allah, the month of Ramadan has begun and You have made it obligatory upon us to fast during this month. You have revealed Your book in it as guidance for people, as the most clear guidance and means of discernment (between right and wrong). O Allah, help us to fast during this month. O Allah, accept it from us, grant us protection therein, receive it back from us with ease and good health. You have power over all things, O most Merciful, most Beneficent.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " السند مجهولن   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/224)"
          }
        }
      },
      "Chapter #6": {
        "Hadith #9": {
          "Title": "Al-Kafi - Volume 4: Verifying the Rise of the New Moon and Finding Witnesses for It",
          "Link": "https://thaqalayn.net/hadith/4/2/6/9",
          "Arabic Text": "9ـ أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ بَكْرٍ وَمُحَمَّدُ بْنُ أَبِي صُهْبَانَ عَنْ حَفْصٍ عَنْ عَمْرِو بْنِ سَالِمٍ وَمُحَمَّدِ بْنِ زِيَادِ بْنِ عِيسَى عَنْ هَارُونَ بْنِ خَارِجَةَ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلاَم) عُدَّ شَعْبَانَ تِسْعَةً وَعِشْرِينَ يَوْماً فَإِنْ كَانَتْ مُتَغَيِّمَةً فَأَصْبِحْ صَائِماً فَإِنْ كَانَتْ صَاحِيَةً وَتَبَصَّرْتَهُ وَلَمْ تَرَ شَيْئاً فَأَصْبِحْ مُفْطِراً.",
          "English Text": "9. Ahmad ibn Muhammad has narrated from Bakr and Muhammad ibn abu Suhban from Hafs ibn al-Bakhtariy from ‘Umar (‘Amr) ibn Salim and Muhammad ibn Ziyad ibn ‘Isa from Harun ibn Kharijah who has said the following: “Abu ‘Abd Allah , has said, ‘Count of the month of al-Sha‘ban twenty nine days; if it is cloudy then fast, but if it is clear and you looked but did not see anything, you can remain without fasting.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول صحيح على الظاه ر  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/230)"
          }
        }
      },
      "Chapter #7": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 4: The Rare Ahadith",
          "Link": "https://thaqalayn.net/hadith/4/2/7/1",
          "Arabic Text": "1ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ صَالِحِ بْنِ أَبِي حَمَّادٍ عَنِ ابْنِ سِنَانٍ عَنْ حُذَيْفَةَ بْنِ مَنْصُورٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ شَهْرُ رَمَضَانَ ثَلاثُونَ يَوْماً لا يَنْقُصُ أَبَداً. وَعَنْهُ عَنِ الْحَسَنِ بْنِ الْحُسَيْنِ عَنِ ابْنِ سِنَانٍ عَنْ حُذَيْفَةَ مِثْلَهُ.",
          "English Text": "1. Ali ibn Muhammad has narrated from Salih ibn abu Hammad from ibn Sinan from Hudhayfah ibn Mansur who has said the following: “Abu ‘ Abd Allah , has said, ‘The month of Ramadan is thirty days and it never is less.”’ (Fatwa best explains this Hadith, however according to science, a lunar (synodic) month is 29 days, 12 hours, and approximately 44 minutes) It is narrated from him (narrator of previous Hadith) from al-Hassan ibn al-Husayn from ibn Sinan from Hudhayfah a similar Hadith. ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " السندان ضعيفان    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/231)"
          }
        }
      },
      "Chapter #11": {
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 4: Disciplines During Fasting",
          "Link": "https://thaqalayn.net/hadith/4/2/11/4",
          "Arabic Text": "4ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ أَبِي أَيُّوبَ عَنِ الْفُضَيْلِ بْنِ يَسَارٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ إِذَا صَامَ أَحَدُكُمُ الثَّلاثَةَ الأَيَّامِ مِنَ الشَّهْرِ فَلا يُجَادِلَنَّ أَحَداً وَلا يَجْهَلْ وَلا يُسْرِعْ إِلَى الْحَلْفِ وَالأَيْمَانِ بِالله فَإِنْ جَهِلَ عَلَيْهِ أَحَدٌ فَلْيَتَحَمَّلْ.",
          "English Text": "4. A number of our people have narrated from Sahl ibn Ziyad from al-Hassan ibn Mahbub, from abu Ayyub, from al-Fudayl ibn Yasar who has said the following: “Abu ‘Abd Allah , has said that if anyone of you fasts for three days of a month, you should not quarrel with anyone or act ignorantly. He should not be hasty to swear or to swear by Allah, and if anyone else may act ignorantly, he should exercise forbearance.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف على المشهور ومعتمد عند ي  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/248)"
          }
        }
      },
      "Chapter #13": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 4: Excellence of Fasting in the Month of Shaman, Continuing Such Fast to Connect it with the Month of Ramadan, and Three Days of Fasting Every Month",
          "Link": "https://thaqalayn.net/hadith/4/2/13/2",
          "Arabic Text": "2ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ يُونُسَ عَنْ عُمَرَ بْنِ أَبَانٍ عَنِ الْمُفَضَّلِ بْنِ عُمَرَ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلاَم) يَقُولُ صَوْمُ شَعْبَانَ وَشَهْرِ رَمَضَانَ مُتَتَابِعَيْنِ تَوْبَةٌ مِنَ الله.",
          "English Text": "2. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa ibn ‘Ubayd from Yunus from ‘Umar ibn Aban from al-Mufaddal ibn ‘Umar who has said the following: “I heard abu ‘Abd Allah , say, ‘Fasting during the month of Sha‘ban and the month of Ramadan in a continuous manner is returning to Allah.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مختلف فيه   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/255)"
          }
        },
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 4: Excellence of Fasting in the Month of Shaman, Continuing Such Fast to Connect it with the Month of Ramadan, and Three Days of Fasting Every Month",
          "Link": "https://thaqalayn.net/hadith/4/2/13/4",
          "Arabic Text": "4ـ أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْحُسَيْنِ بْنِ عُلْوَانَ عَنْ عَمْرِو بْنِ خَالِدٍ عَنْ أَبِي جَعْفَرٍ (عَلَيْهِ السَّلاَم) قَالَ كَانَ رَسُولُ الله (صلَّى اللهُ عَلَيْهِ وَآلِه) يَصُومُ شَعْبَانَ وَرَمَضَانَ يَصِلُهُمَا وَيَنْهَى النَّاسَ أَنْ يَصِلُوهُمَا وَكَانَ يَقُولُ هُمَا شَهْرَا الله وَهُمَا كَفَّارَةٌ لِمَا قَبْلَهُمَا وَلِمَا بَعْدَهُمَا مِنَ الذُّنُوبِ.",
          "English Text": "4. Ahmad ibn Muhammad has narrated from al-Husayn ibn Sa‘id from al-Husayn ibn ‘Ulwan from ‘Amr ibn Khalid who has said the following: “Abu Ja’far , has said, ‘The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, would fast during the month of Sha‘ban and the month of Ramadan and continue fasting. He (the Messenger of Allah) prohibited people to continue fasting without a break (after sunset). He also said, ‘These two are the months of Allah and this (fasting in the two months) is expiation of the sins before and after these two months.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " موثق وقد يعد ضعيفا    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/256)"
          }
        },
        "Hadith #12": {
          "Title": "Al-Kafi - Volume 4: Excellence of Fasting in the Month of Shaman, Continuing Such Fast to Connect it with the Month of Ramadan, and Three Days of Fasting Every Month",
          "Link": "https://thaqalayn.net/hadith/4/2/13/12",
          "Arabic Text": "12ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ يُونُسَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ قَالَ إِنَّمَا يُصَامُ يَوْمُ الأَرْبِعَاءِ لأَنَّهُ لَمْ تُعَذَّبْ أُمَّةٌ فِيمَا مَضَى إِلاَّ فِي يَوْمِ الأَرْبِعَاءِ وَسَطِ الشَّهْرِ فَيُسْتَحَبُّ أَنْ يُصَامَ ذَلِكَ الْيَوْمُ.",
          "English Text": "12. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa ibn ‘Ubayd from Yunus from Ishaq ibn ‘Ammar who has said the following: “Abu ‘Abd Allah , has said that there is fasting on Wednesday because for all nations upon which torment descended, it occurred on a Wednesday in the middle of the month. It is desirable to fast on that day.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " موثق على الظه ر   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/259)"
          }
        }
      },
      "Chapter #15": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 4: The Prayer to Say During Breakfast after Sunset",
          "Link": "https://thaqalayn.net/hadith/4/2/15/2",
          "Arabic Text": "2ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ إِسْحَاقَ عَنْ سَعْدَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ تَقُولُ فِي كُلِّ لَيْلَةٍ مِنْ شَهْرِ رَمَضَانَ عِنْدَ الإِفْطَارِ إِلَى آخِرِهِ الْحَمْدُ لله الَّذِي أَعَانَنَا فَصُمْنَا وَرَزَقَنَا فَأَفْطَرْنَا اللهمَّ تَقَبَّلْ مِنَّا وَأَعِنَّا عَلَيْهِ وَسَلِّمْنَا فِيهِ وَتَسَلَّمْهُ مِنَّا فِي يُسْرٍ مِنْكَ وَعَافِيَةٍ الْحَمْدُ لله الَّذِي قَضَى عَنَّا يَوْماً مِنْ شَهْرِ رَمَضَانَ. ",
          "English Text": "2. Al-Husayn ibn Muhammad has narrated from Ahmad ibn Ishaq from Sa‘dan from abu Basir who has said the following: “Abu ‘Abd Allah , has said that every night in the month of Ramadan during breakfast after sunset, say this prayer, ‘All praise belongs to Allah who has helped us to fast and has granted us sustenance to break our fast. O Allah, accept it from us and help us to do it, keep us safe in this month, receive it from us with ease from You and good health. All praise belongs to Allah who completed one day of the month of Ramadan for us.”’ ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول وربما يعد حسن ا  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/261)"
          }
        }
      },
      "Chapter #16": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 4: Fasting Continuously and All the Time",
          "Link": "https://thaqalayn.net/hadith/4/2/16/3",
          "Arabic Text": "3ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَمُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَفْصِ بْنِ الْبَخْتَرِيِّ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ الْمُوَاصِلُ فِي الصِّيَامِ يَصُومُ يَوْماً وَلَيْلَةً وَيُفْطِرُ فِي السَّحَرِ.",
          "English Text": "3. Ali ibn Ibrahim has narrated from his father from Ahmad ibn Muhammad from Muhammad ibn ‘Isma‘il has narrated from al-Fadl ibn Shadhan from all from Ibn Abi ‘Umayr and Hafs ibn al-Bakhtariy who has said the following: “Abu ‘Abd Allah , has said, ‘One’s fasting in a connected manner takes place when one fasts one day and night and takes breakfast in Sahar (in the morning before dawn) instead.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " حسن لا يقصر عن الصحيح   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/262)"
          }
        }
      },
      "Chapter #17": {
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 4: The Case of One Who Eats or Drinks but Has Doubts About Its Taking Place before or after Dawn",
          "Link": "https://thaqalayn.net/hadith/4/2/17/4",
          "Arabic Text": "4ـ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عِيصِ بْنِ الْقَاسِمِ قَالَ سَأَلْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلاَم) عَنْ رَجُلٍ خَرَجَ فِي شَهْرِ رَمَضَانَ وَأَصْحَابُهُ يَتَسَحَّرُونَ فِي بَيْتٍ فَنَظَرَ إِلَى الْفَجْرِ وَنَادَاهُمْ فَكَفَّ بَعْضُهُمْ وَظَنَّ بَعْضُهُمْ أَنَّهُ يَسْخَرُ فَأَكَلَ فَقَالَ يُتِمُّ صَوْمَهُ وَيَقْضِي.",
          "English Text": "4. Muhammad ibn ‘Isma‘il has narrated from al-Fadl ibn Shadhan from Safwan ibn Yahya from ‘Is ibn al-Qasim who has said the following: “I once asked abu ‘Abd Allah , about a man who along with his friends go for Suhur (breakfast in the morning before dawn) in a house. He looks toward dawn and asks them to stop eating. Certain ones among them stop and others think that he is joking and he eats. He (the Imam) said, ‘He completes that fast and makes its Qada’ (compensatory fast) also.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول كالصحيح    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/264)"
          }
        }
      },
      "Chapter #22": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 4: The Case of One Who Knowingly Eats or Is Involved in Carnal Relation During the Month of Ramadan",
          "Link": "https://thaqalayn.net/hadith/4/2/22/2",
          "Arabic Text": "2ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَمُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) أَنَّهُ سُئِلَ عَنْ رَجُلٍ أَفْطَرَ يَوْماً مِنْ شَهْرِ رَمَضَانَ مُتَعَمِّداً فَقَالَ إِنَّ رَجُلاً أَتَى النَّبِيَّ (صلَّى اللهُ عَلَيْهِ وَآلِه) فَقَالَ هَلَكْتُ يَا رَسُولَ الله فَقَالَ مَا لَكَ فَقَالَ النَّارَ يَا رَسُولَ الله قَالَ وَمَا لَكَ قَالَ وَقَعْتُ عَلَى أَهْلِي قَالَ تَصَدَّقْ وَاسْتَغْفِرْ فَقَالَ الرَّجُلُ فَوَ الَّذِي عَظَّمَ حَقَّكَ مَا تَرَكْتُ فِي الْبَيْتِ شَيْئاً لا قَلِيلاً وَلا كَثِيراً قَالَ فَدَخَلَ رَجُلٌ مِنَ النَّاسِ بِمِكْتَلٍ مِنْ تَمْرٍ فِيهِ عِشْرُونَ صَاعاً يَكُونُ عَشَرَةَ أَصْوُعٍ بِصَاعِنَا فَقَالَ لَهُ رَسُولُ الله (صلَّى اللهُ عَلَيْهِ وَآلِه) خُذْ هَذَا التَّمْرَ فَتَصَدَّقْ بِهِ فَقَالَ يَا رَسُولَ الله عَلَى مَنْ أَتَصَدَّقُ بِهِ وَقَدْ أَخْبَرْتُكَ أَنَّهُ لَيْسَ فِي بَيْتِي قَلِيلٌ وَلا كَثِيرٌ قَالَ فَخُذْهُ وَأَطْعِمْهُ عِيَالَكَ وَاسْتَغْفِرِ الله قَالَ فَلَمَّا خَرَجْنَا قَالَ أَصْحَابُنَا إِنَّهُ بَدَأَ بِالْعِتْقِ فَقَالَ أَعْتِقْ أَوْ صُمْ أَوْ تَصَدَّقْ.",
          "English Text": "2. Ali ibn Ibrahim has narrated from his father from and Muhammad ibn ‘Isma‘il has narrated from al-Fadl ibn Shadhan from all from Ibn Abi ‘Umayr from Jamil ibn Darraj who has said the following: “I once asked abu ‘Abd Allah , about a man who purposely destroys one day of the fast of the month of Ramadan. He (the Imam) said, ‘Once a man came to the Holy prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, and said, “O Messenger of Allah!” He (the Messenger of Allah) replied, “What is the matter with you?” He replied, “I fell on my wife.” He (the Messenger of Allah) said, “Give charity and repent.” He (the man) said, “I swear by the One who has made your right great, there is nothing in my house small and very little or large and a great deal.” He (the Imam) said that a man then came with a massive bushel of dates which was twenty Sa‘, each of which was equal to ten of our Sa‘. The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, said to him (the man), “Take this and give it as charity.” He (the man) said, “O Messenger of Allah, to whom should I give this charity when I have told you that in my house there is nothing little or a great deal.” He (the Messenger of Allah) said, “Take it and feed your family and ask Allah for forgiveness.’” He (the narrator) has said that when we came out (of the meeting) our people told us that expiation is to set free a slave saying, ‘Set free a slave, fast or give charity.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " حسن لا يقصر عن الصحيح   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/272)"
          }
        },
        "Hadith #8": {
          "Title": "Al-Kafi - Volume 4: The Case of One Who Knowingly Eats or Is Involved in Carnal Relation During the Month of Ramadan",
          "Link": "https://thaqalayn.net/hadith/4/2/22/8",
          "Arabic Text": "8ـ حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ الله قَالَ سَأَلْتُهُ عَنْ رَجُلٍ أَفْطَرَ يَوْماً مِنْ شَهْرِ رَمَضَانَ مُتَعَمِّداً قَالَ يَتَصَدَّقُ بِعِشْرِينَ صَاعاً وَيَقْضِي مَكَانَهُ.",
          "English Text": "8. Humayd ibn Yazid has narrated from al-Hassan ibn Muhammad ibn Sama‘ah from more than one person from Aban ibn ‘Uthman from ‘Abd al-Rahman ibn abu ‘Abd Allah who has said the following: “I once asked him (the Imam) , about a man who destroys his fast in the month of Ramadan purposely. He (the Imam) said, ‘He is required to give twenty Sa‘ in charity and make Qada’ (compensatory fast) that fast.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالموثق   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/275)"
          }
        }
      },
      "Chapter #27": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 4: The Case of a Fasting Person’s Vomiting, Nauseating or Burping",
          "Link": "https://thaqalayn.net/hadith/4/2/27/3",
          "Arabic Text": "3ـ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) فِي الَّذِي يَذْرَعُهُ الْقَيْ‏ءُ وَهُوَ صَائِمٌ قَالَ يُتِمُّ صَوْمَهُ وَلا يَقْضِي.",
          "English Text": "3. Muhammad ibn ‘Isma‘il has narrated from al-Fadl ibn Shadhan, from Ibn Abi ‘Umayr, from Mu‘awiyah who has said the following: “Abu ‘Abd Allah , has said, ‘One who feels like vomiting must complete his fast and there is no Qada’ (compensatory fast) on him.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول كالصحيح   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/286)"
          }
        }
      },
      "Chapter #41": {
        "Hadith #5": {
          "Title": "Al-Kafi - Volume 4: Remedy and Compensatory Fast for the Missed Fasting During the Month of Ramadan",
          "Link": "https://thaqalayn.net/hadith/4/2/41/5",
          "Arabic Text": "5ـ حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ الله قَالَ سَأَلْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلاَم) عَنْ قَضَاءِ شَهْرِ رَمَضَانَ فِي ذِي الْحِجَّةِ أَ وَأَقْطَعُهُ قَالَ اقْضِهِ فِي ذِي الْحِجَّةِ وَاقْطَعْهُ إِنْ شِئْتَ.",
          "English Text": "5. Humayd ibn Ziyad has narrated from ibn Sama‘ah from more than one person from Aban from ‘Abd al-Rahman ibn abu ‘Abd Allah who has said the following: “This is concerning my question before abu ‘Abd Allah , about making Qada’ (compensatory fast) of fast of the month of Ramadan in the month of Dhul al-Hajjah and to discontinue it. He (the Imam) said, ‘You can make its Qada’ (compensatory fast) in Dhul al-Hajjah and discontinue if you like.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالموثق    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/313)"
          }
        }
      },
      "Chapter #42": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 4: The Case of One Who Wakes up in the Morning with an Intention to Fast, but Who Does Not Do So or Vice Versa when Fasting Is a Compensatory Fast for the Missed Fast in the Month of Ramadan or Other Days",
          "Link": "https://thaqalayn.net/hadith/4/2/42/3",
          "Arabic Text": "3ـ أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ الْعَبَّاسِ بْنِ مَعْرُوفٍ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنِ ابْنِ سِنَانٍ عَنْ عَمَّارِ بْنِ مَرْوَانَ عَنْ سَمَاعَةَ بْنِ مِهْرَانَ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) فِي قَوْلِهِ الصَّائِمُ بِالْخِيَارِ إِلَى زَوَالِ الشَّمْسِ قَالَ ذَلِكَ فِي الْفَرِيضَةِ فَأَمَّا النَّافِلَةُ فَلَهُ أَنْ يُفْطِرَ أَيَّ سَاعَةٍ شَاءَ إِلَى غُرُوبِ الشَّمْسِ.",
          "English Text": "3. Ahmad ibn Muhammad from has narrated from al-‘Abbas ibn Ma‘ruf from Safwan ibn Yahya from ibn Sinan from ‘Ammar ibn Marwan from Sama‘ah ibn Mehran who has said the following: “The words of abu ‘Abd Allah , ‘A fasting person has the choice until Zawal (declining of the sun toward the west at noontime)’ is about obligatory fast. In the case of optional fast one has the choice to stop fasting any time up to sunset.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف على المشهور معتمد عند ي   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/315)"
          }
        }
      },
      "Chapter #48": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 4: Undesirability (unlawfulness) of Fast on a Journey",
          "Link": "https://thaqalayn.net/hadith/4/2/48/3",
          "Arabic Text": "3ـ أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَبْدِ الْمَلِكِ بْنِ عُتْبَةَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ يَحْيَى بْنِ أَبِي الْعَلاءِ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ الصَّائِمُ فِي السَّفَرِ فِي شَهْرِ رَمَضَانَ كَالْمُفْطِرِ فِيهِ فِي الْحَضَرِ ثُمَّ قَالَ إِنَّ رَجُلاً أَتَى النَّبِيَّ (صلَّى اللهُ عَلَيْهِ وَآلِه) فَقَالَ يَا رَسُولَ الله أَصُومُ شَهْرَ رَمَضَانَ فِي السَّفَرِ فَقَالَ لا فَقَالَ يَا رَسُولَ الله إِنَّهُ عَلَيَّ يَسِيرٌ فَقَالَ رَسُولُ الله (صلَّى اللهُ عَلَيْهِ وَآلِه) إِنَّ الله عَزَّ وَجَلَّ تَصَدَّقَ عَلَى مَرْضَى أُمَّتِي وَمُسَافِرِيهَا بِالإِفْطَارِ فِي شَهْرِ رَمَضَانَ أَ يُعْجِبُ أَحَدَكُمْ لَوْ تَصَدَّقَ بِصَدَقَةٍ أَنْ تُرَدَّ عَلَيْهِ.",
          "English Text": "3. Ahmad ibn Muhammad from Ali ibn al-Hakam from ‘Abd al-Malik ibn ‘Utbah from Ishaq ibn ‘Ammar from Yahya ibn abu al-‘Ala’ who has said the following: “Abu ‘Abd Allah , has said, ‘One who fasts on a journey in the month of Ramadan is like one who invalidates his fast while at home.’ He (the Imam) then said, ‘Once a man came to the Holy prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, and asked, “O Messenger of Allah, can I fast in the month of Ramadan on a journey?” He (the Messenger of Allah) replied, “No, you cannot fast on a journey.” He said, “O Messenger of Allah, it is very easy for me.” The Messenger of Allah said, “Allah, most Majestic, most Glorious, has given charity to those of my followers who are on a journey and those who are not in a good health to stop fasting in the month of Ramadan. Does it make any of you feel happy to reject a charity granted to you?””’ ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " موثق على الظه ر   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/327)"
          }
        }
      },
      "Chapter #50": {
        "Hadith #7": {
          "Title": "Al-Kafi - Volume 4: Those Who Do or Do Not Have to Break Their Fast on a Journey",
          "Link": "https://thaqalayn.net/hadith/4/2/50/7",
          "Arabic Text": "7ـ حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ عَنْ عِدَّةٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ (عَلَيْهِ السَّلاَم) قَالَ قُلْتُ الرَّجُلُ يُشَيِّعُ أَخَاهُ فِي شَهْرِ رَمَضَانَ الْيَوْمَ وَالْيَوْمَيْنِ قَالَ يُفْطِرُ وَيَقْضِي قِيلَ لَهُ فَذَلِكَ أَفْضَلُ أَوْ يُقِيمُ وَلا يُشَيِّعُهُ قَالَ يُشَيِّعُهُ وَيُفْطِرُ فَإِنَّ ذَلِكَ حَقٌّ عَلَيْهِ. ",
          "English Text": "7. Humayd ibn Ziyad has narrated from Sama‘ah, from ‘Iddah from Aban ibn ‘Uthman from Zurarah who has said the following: “I once asked abu ‘Abd Allah , about a man who escorts his brother in the month of Ramadan for a distance of one day’s journey or two days’. He (the Imam) said, ‘He should stop fasting and complete its Qada’ (compensatory fast).’ It then was asked, ‘Is escorting more virtuous or staying home to fast is more virtuous? 5 He (the Imam) said, ‘Escorting and stopping the fast is more virtuous; it is a right on him.”’ ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالموثق    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/331)"
          }
        }
      },
      "Chapter #52": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 4: The Case of One Who Begins a Journey or Returns from a Journey in the Month of Ramadan",
          "Link": "https://thaqalayn.net/hadith/4/2/52/2",
          "Arabic Text": "2ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ عُبَيْدِ بْنِ زُرَارَةَ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ إِذَا خَرَجَ الرَّجُلُ فِي شَهْرِ رَمَضَانَ بَعْدَ الزَّوَالِ أَتَمَّ الصِّيَامَ فَإِذَا خَرَجَ قَبْلَ الزَّوَالِ أَفْطَرَ.",
          "English Text": "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal from ibn Bukayr from ‘Ubayd ibn Zurarah who has said the following: “Abu ‘Abd Allah , has said, ‘If one comes out for a journey in the month of Ramadan after Zawal (declining of the sun toward the west at noontime) one is required to complete his fast. If one comes out before Zawal (declining of the sun toward the west at noontime), then one must stop fasting.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " موثق معتبر    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/334)"
          }
        }
      },
      "Chapter #54": {
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 4: The Case of One Who Involves Himself in Carnal Relations with His Wife on a Journey or Returns from a Journey in the Month of Ramadan",
          "Link": "https://thaqalayn.net/hadith/4/2/54/4",
          "Arabic Text": "4ـ حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ أَبِي الْعَبَّاسِ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) فِي الرَّجُلِ يُسَافِرُ وَمَعَهُ جَارِيَةٌ فِي شَهْرِ رَمَضَانَ هَلْ يَقَعُ عَلَيْهَا قَالَ نَعَمْ.",
          "English Text": "4. Humayd ibn Ziyad has narrated from al-Hassan ibn Muhammad ibn Sama‘ah from more than one person from Aban ibn ‘Uthman from abu al-‘Abbas who has said the following: “This is about a man who experiences sexual relation with a slave-girl while on a journey in the month of Ramadan. Abu ‘Abd Allah , has said, ‘It is not harmful.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالموثق   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/338)"
          }
        }
      },
      "Chapter #56": {
        "Hadith #5": {
          "Title": "Al-Kafi - Volume 4: The Case of One Who Owes Fasting of Two Consecutive Months but an Obstacle Prevents Him",
          "Link": "https://thaqalayn.net/hadith/4/2/56/5",
          "Arabic Text": "5ـ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ مَنْصُورِ بْنِ حَازِمٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) أَنَّهُ قَالَ فِي رَجُلٍ صَامَ فِي ظِهَارٍ شَعْبَانَ ثُمَّ أَدْرَكَهُ شَهْرُ رَمَضَانَ قَالَ يَصُومُ رَمَضَانَ وَيَسْتَأْنِفُ الصَّوْمَ فَإِنْ هُوَ صَامَ فِي الظِّهَارِ فَزَادَ فِي النِّصْفِ يَوْماً قَضَى بَقِيَّتَهُ.",
          "English Text": "5. Muhammad ibn ‘Isma‘il has narrated from al-Fadl ibn Shadhan from Safwan ibn Yahya from Mansur who has said the following: “About a man who fasts because of Zihar in the month of al-Sha‘ban, then the month of Ramadan comes; abu ‘Abd Allah , has said, ‘He is required to fast the month of Ramadan, then resume the fast. If because of Zihar he fasted for more than half by one day he completes only Qada’ (compensatory fast) of the rest.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول كالصحيح   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/347)"
          }
        }
      },
      "Chapter #58": {
        "Hadith #10": {
          "Title": "Al-Kafi - Volume 4: The Case of One Who Vows to Fast a Certain Day or for Thanksgiving",
          "Link": "https://thaqalayn.net/hadith/4/2/58/10",
          "Arabic Text": "10ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ زُرَارَةَ قَالَ إِنَّ أُمِّي كَانَتْ جَعَلَتْ عَلَى نَفْسِهَا لله عَلَيْهَا نَذْراً إِنْ كَانَ الله رَدَّ عَلَيْهَا بَعْضَ وُلْدِهَا مِنْ شَيْ‏ءٍ كَانَتْ تَخَافُ عَلَيْهِ أَنْ تَصُومَ ذَلِكَ الْيَوْمَ الَّذِي يَقْدَمُ فِيهِ مَا بَقِيَتْ فَخَرَجَتْ مَعَنَا مُسَافِرَةً إِلَى مَكَّةَ فَأَشْكَلَ عَلَيْنَا لَمْ نَدْرِ أَ تَصُومُ أَمْ تُفْطِرُ فَسَأَلْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلاَم) عَنْ ذَلِكَ وَأَخْبَرْتُهُ بِمَا جَعَلَتْ عَلَى نَفْسِهَا فَقَالَ لا تَصُومُ فِي السَّفَرِ قَدْ وَضَعَ الله عَنْهَا حَقَّهُ وَتَصُومُ هِيَ مَا جَعَلَتْ عَلَى نَفْسِهَا قَالَ قُلْتُ مَا تَرَى إِذَا هِيَ قَدِمَتْ وَتَرَكَتْ ذَلِكَ فَقَالَ إِنِّي أَخَافُ أَنْ تَرَى فِي الَّذِي نَذَرَتْ مَا تَكْرَهُ. ",
          "English Text": "10. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal ibn Bukayr from Zurarah who has said the following: “My mother had placed upon herself from Allah to fast a certain day if Allah returned one of her children safely from the danger of which she was afraid, and she would then fast the day her child came back. She did not stay; instead came out with us for Makkah and it became difficult for us because we did not know whether she was required to fast or not. I then asked abu ‘Abd Allah , about it and explained to him (the Imam) what she had done. He (the Imam) said, ’She is not required to fast on a journey. Allah has exempted her of His rights: why then must she fast because of what she has placed from Allah upon herself?’ I then asked him (the Imam), ‘What will happen if she did not do it at all?’ He (the Imam) said, ’If so, I fear for her to experience in the matter for which she had vowed to see what she may dislike.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " موثق في قوة الصحيح    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/354)"
          }
        }
      },
      "Chapter #61": {
        "Hadith #7": {
          "Title": "Al-Kafi - Volume 4: Fasting on Ninth of Dhul Hajjah and on Tenth of Muharram",
          "Link": "https://thaqalayn.net/hadith/4/2/61/7",
          "Arabic Text": "7ـ وَعَنْهُ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ أَبَانٍ عَنْ عَبْدِ الْمَلِكِ قَالَ سَأَلْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلاَم) عَنْ صَوْمِ تَاسُوعَاءَ وَعَاشُورَاءَ مِنْ شَهْرِ الْمُحَرَّمِ فَقَالَ تَاسُوعَاءُ يَوْمٌ حُوصِرَ فِيهِ الْحُسَيْنُ (عَلَيْهِ السَّلاَم) وَأَصْحَابُهُ رَضِيَ الله عَنْهُمْ بِكَرْبَلاءَ وَاجْتَمَعَ عَلَيْهِ خَيْلُ أَهْلِ الشَّامِ وَأَنَاخُوا عَلَيْهِ وَفَرِحَ ابْنُ مَرْجَانَةَ وَعُمَرُ بْنُ سَعْدٍ بِتَوَافُرِ الْخَيْلِ وَكَثْرَتِهَا وَاسْتَضْعَفُوا فِيهِ الْحُسَيْنَ صَلَوَاتُ الله عَلَيْهِ وَأَصْحَابَهُ رَضِيَ الله عَنْهُمْ وَأَيْقَنُوا أَنْ لا يَأْتِيَ الْحُسَيْنَ (عَلَيْهِ السَّلاَم) نَاصِرٌ وَلا يُمِدَّهُ أَهْلُ الْعِرَاقِ بِأَبِي الْمُسْتَضْعَفُ الْغَرِيبُ ثُمَّ قَالَ وَأَمَّا يَوْمُ عَاشُورَاءَ فَيَوْمٌ أُصِيبَ فِيهِ الْحُسَيْنُ (عَلَيْهِ السَّلاَم) صَرِيعاً بَيْنَ أَصْحَابِهِ وَأَصْحَابُهُ صَرْعَى حَوْلَهُ عُرَاةً أَ فَصَوْمٌ يَكُونُ فِي ذَلِكَ الْيَوْمِ كَلاَّ وَرَبِّ الْبَيْتِ الْحَرَامِ مَا هُوَ يَوْمَ صَوْمٍ وَمَا هُوَ إِلاَّ يَوْمُ حُزْنٍ وَمُصِيبَةٍ دَخَلَتْ عَلَى أَهْلِ السَّمَاءِ وَأَهْلِ الأَرْضِ وَجَمِيعِ الْمُؤْمِنِينَ وَيَوْمُ فَرَحٍ وَسُرُورٍ لابْنِ مَرْجَانَةَ وَآلِ زِيَادٍ وَأَهْلِ الشَّامِ غَضِبَ الله عَلَيْهِمْ وَعَلَى ذُرِّيَّاتِهِمْ وَذَلِكَ يَوْمٌ بَكَتْ عَلَيْهِ جَمِيعُ بِقَاعِ الأَرْضِ خَلا بُقْعَةِ الشَّامِ فَمَنْ صَامَهُ أَوْ تَبَرَّكَ بِهِ حَشَرَهُ الله مَعَ آلِ زِيَادٍ مَمْسُوخُ الْقَلْبِ مَسْخُوطٌ عَلَيْهِ وَمَنِ ادَّخَرَ إِلَى مَنْزِلِهِ ذَخِيرَةً أَعْقَبَهُ الله تَعَالَى نِفَاقاً فِي قَلْبِهِ إِلَى يَوْمِ يَلْقَاهُ وَانْتَزَعَ الْبَرَكَةَ عَنْهُ وَعَنْ أَهْلِ بَيْتِهِ وَوُلْدِهِ وَشَارَكَهُ الشَّيْطَانُ فِي جَمِيعِ ذَلِكَ. ",
          "English Text": "7. It is narrated from him (narrator of previous Hadith) from Muhammad ibn al-Husayn from Muhammad ibn Sinan from Aban from ‘Abd al-Malik who has said the following: “I once asked abu ‘Abd Allah , about the fast on the day of ‘Ashura’ of the month of Muharram. He (the Imam) said, ‘Tasu‘a’ (ninth of Muharram) was the day when they had surrounded al-Husayn , and his friends, may Allah be pleased with them, in Karbala’. The horsemen of al-Sham had come together against him , and had taken him under siege. Ibn Marjanah and ‘Umar ibn Sa‘d were happy because of the huge number of horsemen on their side, and they made al-Husayn , and his friends, may Allah be pleased with them, very weak. They became certain that no one will come to help al-Husayn , and people of Iraq will not support him. I pray to Allah to keep my soul in service for the cause of my great-grandfather who had very few supporters.’ He (the Imam) then said, ‘The day of ‘Ashura’ is the day on which al-Husayn , was murdered and his friends around him were all murdered and looted. How can there be fast on that day! No, by the Lord of the sacred house there is no fasting on such a day. It is only a day of mourning and lamentation that came upon the inhabitants of the sky and earth and all believing people. It is a day of happiness and joy for ibn Marjanah and family of Ziyad and people of al-Sham, may Allah subject them to His anger as well as their offspring. This was a day when all locations of earth wept except al-Sham. Those who fast on this day or take it for blessing will be raised, by Allah, with the family of Ziyad with their hearts metamorphosed and subjected to anger. Whoever seeks any saving for their homes on this day will be made by Allah as a seed of hypocrisy in his heart up to the Day of Judgment, blessing is removed thereof, from his family, and children. Satan will share him in all of such savings.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " سكت عنه   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/362)"
          }
        }
      },
      "Chapter #62": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 4: Fasting on ‘Id Days and during the Bright Days of the Month: 11, 12 and 13",
          "Link": "https://thaqalayn.net/hadith/4/2/62/3",
          "Arabic Text": "3ـ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى وَابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ سَأَلْتُ أَبَا الْحَسَنِ (عَلَيْهِ السَّلاَم) عَنِ الْيَوْمَيْنِ اللَّذَيْنِ بَعْدَ الْفِطْرِ أَ يُصَامَانِ أَمْ لا فَقَالَ أَكْرَهُ لَكَ أَنْ تَصُومَهُمَا. ",
          "English Text": "3. Muhammad ibn ‘Isma‘il has narrated from al-Fadl ibn Shadhan from Safwan ibn Yahya and Ibn Abi ‘Umayr from ‘Abd al-Rahman ibn al-Hajjaj who has said the following: “I once asked abu al-Hassan , about the case of the two days after al-Fitr; if fasting is permissible therein. He (the Imam) said, ‘I do not like for you to fast on those days.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول كالصحيح    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/363)"
          }
        }
      },
      "Chapter #66": {
        "Hadith #5": {
          "Title": "Al-Kafi - Volume 4: The Preferable Items to Use for Breakfast after Sunset",
          "Link": "https://thaqalayn.net/hadith/4/2/66/5",
          "Arabic Text": "5ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ إِبْرَاهِيمَ بْنِ مِهْزَمٍ عَنْ طَلْحَةَ بْنِ زَيْدٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ كَانَ رَسُولُ الله (صلَّى اللهُ عَلَيْهِ وَآلِه) يُفْطِرُ عَلَى التَّمْرِ فِي زَمَنِ التَّمْرِ وَعَلَى الرُّطَبِ فِي زَمَنِ الرُّطَبِ.",
          "English Text": "5. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from Ibrahim ibn Mehzam from Talhah ibn Zayd who has said the following: “Abu ‘Abd Allah , has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, would use dates for breakfast after sunset, if it was the season of dates, or fresh dates if it was the season of fresh dates.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف على المشهور لكنه قوي   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/374)"
          }
        }
      },
      "Chapter #67": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 4: Ghusl (bath) in the Month of Ramadan",
          "Link": "https://thaqalayn.net/hadith/4/2/67/2",
          "Arabic Text": "2ـ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ مَنْصُورِ بْنِ حَازِمٍ عَنْ سُلَيْمَانَ بْنِ خَالِدٍ قَالَ سَأَلْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلاَم) كَمْ أَغْتَسِلُ فِي شَهْرِ رَمَضَانَ لَيْلَةً قَالَ لَيْلَةَ تِسْعَ عَشْرَةَ وَلَيْلَةَ إِحْدَى وَعِشْرِينَ وَثَلاثٍ وَعِشْرِينَ قَالَ قُلْتُ فَإِنْ شَقَّ عَلَيَّ قَالَ فِي إِحْدَى وَعِشْرِينَ وَثَلاثٍ وَعِشْرِينَ قُلْتُ فَإِنْ شَقَّ عَلَيَّ قَالَ حَسْبُكَ الآنَ.",
          "English Text": "2. Muhammad ibn Isma‘il has narrated from al-Fadl ibn Shadhan from Safwan ibn Yahya from Mansur ibn Hazim from Sulayman ibn Khalid who has said the following: “I once asked abu ‘ Abd Allah , on how many nights should one take a shower in the month of Ramadan?’ He (the Imam) replied, ‘It is on the nineteenth, twenty- first and twenty-third nights.’ I then said, ‘What if even this much becomes difficult for me?’ He then said, ‘Take a shower on the twenty- first and twenty-third nights.’ I then said, ‘What happens if this becomes difficult for me?’ He (the Imam) said, ‘Now it is enough.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول كالصحيح   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/375)"
          }
        },
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 4: Ghusl (bath) in the Month of Ramadan",
          "Link": "https://thaqalayn.net/hadith/4/2/67/3",
          "Arabic Text": "3ـ صَفْوَانُ بْنُ يَحْيَى عَنْ عِيصِ بْنِ الْقَاسِمِ قَالَ سَأَلْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلاَم) عَنِ اللَّيْلَةِ الَّتِي يُطْلَبُ فِيهَا مَا يُطْلَبُ مَتَى الْغُسْلُ فَقَالَ مِنْ أَوَّلِ اللَّيْلِ وَإِنْ شِئْتَ حَيْثُ تَقُومُ مِنْ آخِرِهِ وَسَأَلْتُهُ عَنِ الْقِيَامِ فَقَالَ تَقُومُ فِي أَوَّلِهِ وَآخِرِهِ.",
          "English Text": "3. Safwan ibn Yahya has narrated from ‘Is ibn al-Qasim who has said the following: “I once asked abu ‘Abd Allah , about the night during which one can appeal before Allah for one’s needs when it is the time for a shower. He (the Imam) replied, ‘It is at the beginning of the night, or if you like, at the end of the night as you wake up.’ I then asked about al-Qiyam (rising up) (for salat [prayer]). He said, ‘You may rise in the beginning or toward the end of the night.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول كالصحيح   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/375)"
          }
        }
      },
      "Chapter #71": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 4: Saying Takbir (Allah Is Great Beyond Description) in the First Night of Shawwal",
          "Link": "https://thaqalayn.net/hadith/4/2/71/1",
          "Arabic Text": "1ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ الله عَنْ أَبِيهِ عَنْ خَلَفِ بْنِ حَمَّادٍ عَنْ سَعِيدٍ النَّقَّاشِ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلاَم) لِي أَمَا إِنَّ فِي الْفِطْرِ تَكْبِيراً وَلَكِنَّهُ مَسْتُورٌ قَالَ قُلْتُ وَأَيْنَ هُوَ قَالَ فِي لَيْلَةِ الْفِطْرِ فِي الْمَغْرِبِ وَالْعِشَاءِ الآخِرَةِ وَفِي صَلاةِ الْفَجْرِ وَفِي صَلاةِ الْعِيدِ ثُمَّ يُقْطَعُ قَالَ قُلْتُ كَيْفَ أَقُولُ قَالَ تَقُولُ الله أَكْبَرُ الله أَكْبَرُ لا إِلَهَ إِلاَّ الله وَالله أَكْبَرُ الله أَكْبَرُ وَلله الْحَمْدُ الله أَكْبَرُ عَلَى مَا هَدَانَا وَهُوَ قَوْلُ الله عَزَّ وَجَلَّ وَلِتُكْمِلُوا الْعِدَّةَ يَعْنِي الصِّيَامَ وَلِتُكَبِّرُوا الله عَلى‏ ما هَداكُمْ. عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ خَلَفِ بْنِ حَمَّادٍ مِثْلَهُ.",
          "English Text": "1. Ali ibn Muhammad has narrated from Ahmad ibn abu ‘Abd Allah from his father from Khalaf ibn Hammad from Sa‘id al-Naqqash who has said the following: “Abu ‘Abd Allah , said to me, ‘On al-Fitr (first day of the month of Shawwal), there is Takbir (saying ‘Allah is great beyond description’), and it is Mastur (masnun) optional.’ I (the narrator) then asked, ‘Where is it?’ He (the Imam) replied, ‘It is during the night of al-Fitr, in Maghrib and ‘Isha’, in salat (prayer) and in salat (prayer) of ‘Id, and then it is discontinued.’ I (the narrator) then asked, ‘How do I say it?’ He (the Imam) replied, say, ‘Allah is great beyond description, Allah is great beyond description, only Allah deserves worship, Allah is great beyond description, Allah is great beyond description, All praise belongs to Allah, Allah is great beyond description; He has granted us guidance. This is in the words of Allah, most Majestic, most Glorious, “So you can complete the number (fasting)’, (2:182) and say, ‘Allah is great beyond description; He had granted you guidance.””” NOTE: A number of our people have narrated from Sahl ibn Ziyad from Ali ibn Asbat from Khalaf ibn Hammad a similar Hadith. ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول وسنده الثاني ضعيف   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/405)"
          }
        }
      },
      "Chapter #73": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 4: People’s Obligation after Having Proof of the New Moon on the Day of ‘Id after Completion of Fasting",
          "Link": "https://thaqalayn.net/hadith/4/2/73/2",
          "Arabic Text": "2ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ رَفَعَهُ قَالَ إِذَا أَصْبَحَ النَّاسُ صِيَاماً وَلَمْ يَرَوُا الْهِلالَ وَجَاءَ قَوْمٌ عُدُولٌ يَشْهَدُونَ عَلَى الرُّؤْيَةِ فَلْيُفْطِرُوا وَلْيَخْرُجُوا مِنَ الْغَدِ أَوَّلَ النَّهَارِ إِلَى عِيدِهِمْ. ",
          "English Text": "2. Muhammad ibn Yahya has narrated from Muhammad ibn Ahmad in a marfu‘ manner who has said the following: “He (the Imam) , has said, ‘If people are fasting and have not seen the new moon, then a just people come and testify to their seeing the new moon they must discontinue fasting and on the morning of the next day come out for their ‘Id.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/410)"
          }
        }
      },
      "Chapter #75": {
        "Hadith #7": {
          "Title": "Al-Kafi - Volume 4: Al-Fitrah Charity Due to Fasting",
          "Link": "https://thaqalayn.net/hadith/4/2/75/7",
          "Arabic Text": "7ـ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ لا بَأْسَ بِأَنْ يُعْطِيَ الرَّجُلُ عَنْ عِيَالِهِ وَهُمْ غُيَّبٌ عَنْهُ وَيَأْمُرَهُمْ فَيُعْطُونَ عَنْهُ وَهُوَ غَائِبٌ عَنْهُمْ.",
          "English Text": "7. Muhammad ibn ‘Isma‘il has narrated from al-Fadl ibn Shadhan from Ibn Abi ‘Umayr from Jamil ibn Darraj who has said the following: “Abu ‘Abd Allah , has said, ‘It is not harmful to pay al-Fitrah for one’s dependents who are not present, and one can instruct his dependents to pay for him in case one is not present.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول كالصحيح    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/417)"
          }
        },
        "Hadith #15": {
          "Title": "Al-Kafi - Volume 4: Al-Fitrah Charity Due to Fasting",
          "Link": "https://thaqalayn.net/hadith/4/2/75/15",
          "Arabic Text": "15ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ رَفَعَهُ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ سُئِلَ عَنْ رَجُلٍ فِي الْبَادِيَةِ لا يُمْكِنُهُ الْفِطْرَةُ قَالَ يَتَصَدَّقُ بِأَرْبَعَةِ أَرْطَالٍ مِنْ لَبَنٍ.",
          "English Text": "15. Ali ibn Ibrahim has narrated from his father from in a marfu‘ manner who has said the following: “I once asked abu ‘ Abd Allah , about a man who lives in a remote village and is not able to pay al-Fitrah. He (the Imam) said, ’He is required to pay by four Artal of milk.”’ ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/422)"
          }
        },
        "Hadith #20": {
          "Title": "Al-Kafi - Volume 4: Al-Fitrah Charity Due to Fasting",
          "Link": "https://thaqalayn.net/hadith/4/2/75/20",
          "Arabic Text": "20ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ رَفَعَهُ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ يُؤَدِّي الرَّجُلُ زَكَاةَ الْفِطْرَةِ عَنْ مُكَاتَبِهِ وَرَقِيقِ امْرَأَتِهِ وَعَبْدِهِ النَّصْرَانِيِّ وَالْمَجُوسِيِّ وَمَا أَغْلَقَ عَلَيْهِ بَابَهُ.",
          "English Text": "20. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad in a marfu‘ manner who has said the following: “Abu ‘Abd Allah , has said, ‘It is permissible to pay Zakat al-Fitrah to a slave who has contracted his freedom, slave of one’s wife, his own Christian, Zoroastrian slave and those who have closed the door on themselves.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/423)"
          }
        }
      },
      "Chapter #81": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 4: One Becomes 111, in Ptikaf or Finds Hayd (menses)",
          "Link": "https://thaqalayn.net/hadith/4/2/81/1",
          "Arabic Text": "1ـ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ إِذَا مَرِضَ الْمُعْتَكِفُ وَطَمِثَتِ الْمَرْأَةُ الْمُعْتَكِفَةُ فَإِنَّهُ يَأْتِي بَيْتَهُ ثُمَّ يُعِيدُ إِذَا بَرَأَ وَيَصُومُ. وَفِي رِوَايَةٍ أُخْرَى عَنْهُ لَيْسَ عَلَى الْمَرِيضِ ذَلِكَ.",
          "English Text": "1. Muhammad ibn ‘Isma‘il has narrated from al-Fadl ibn Shadhan from Safwan ibn Yahya from ‘Abd al-Rahman ibn al-Hajjaj who has said the following: “Abu ‘Abd Allah , has said, ‘If one in the state of Ttikaf becomes ill or a female begins to experience Hayd (menses); they can go home then after getting well perform the ’ Ttikaf again and fast.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول كالصحيح  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/435)"
          }
        }
      }
    },
    "Book #3": {
      "Chapter #3": {
        "Hadith #7": {
          "Title": "Al-Kafi - Volume 4: The First Thing of Lands that Allah Created Was the Site of the House and How Was What He First Created",
          "Link": "https://thaqalayn.net/hadith/4/3/3/7",
          "Arabic Text": "7ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ أَبِي زُرَارَةَ التَّمِيمِيِّ عَنْ أَبِي حَسَّانَ عَنْ أَبِي جَعْفَرٍ (عَلَيْهِ السَّلاَم) قَالَ لَمَّا أَرَادَ الله عَزَّ وَجَلَّ أَنْ يَخْلُقَ الأَرْضَ أَمَرَ الرِّيَاحَ فَضَرَبْنَ وَجْهَ الْمَاءِ حَتَّى صَارَ مَوْجاً ثُمَّ أَزْبَدَ فَصَارَ زَبَداً وَاحِداً فَجَمَعَهُ فِي مَوْضِعِ الْبَيْتِ ثُمَّ جَعَلَهُ جَبَلاً مِنْ زَبَدٍ ثُمَّ دَحَا الأَرْضَ مِنْ تَحْتِهِ وَهُوَ قَوْلُ الله عَزَّ وَجَلَّ إِنَّ أَوَّلَ بَيْتٍ وُضِعَ لِلنَّاسِ لَلَّذِي بِبَكَّةَ مُبارَكاً. وَرَوَاهُ أَيْضاً عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ أَبِي بَكْرٍ الْحَضْرَمِيِّ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) مِثْلَهُ.",
          "English Text": "7. A number of our people have narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Sayf ibn ‘Amirah from abu Zurarah al-Tamimiy from abu Hassan who has said the following: “Abu Ja’far , has said, ‘When Allah, the Most Majestic, the Most Glorious, decided to create the earth, He commanded the air to stir the surface of the water to raise waves, which then turned into scum that was collected on the site of the House. He then made it a mountain of scum, then He extended the earth from underneath the House and that is what Allah, the Most Majestic, the Most Glorious, has spoken of, “The first house established for people was that which is in Bakkah, the blessed one.” (3:95)’” This is narrated from Sayf ibn ‘Amirah from abu Bakr al-Hadramiy from abu ‘Abd Allah  also. ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول وسنده الخير حسن  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/12)"
          }
        }
      },
      "Chapter #5": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 4: The Reason for the Sacred Area and Why It Is This Much",
          "Link": "https://thaqalayn.net/hadith/4/3/5/1",
          "Arabic Text": "1ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ قَالَ سَأَلْتُ أَبَا الْحَسَنِ الرِّضَا (عَلَيْهِ السَّلاَم) عَنِ الْحَرَمِ وَأَعْلامِهِ كَيْفَ صَارَ بَعْضُهَا أَقْرَبَ مِنْ بَعْضٍ وَبَعْضُهَا أَبْعَدَ مِنْ بَعْضٍ فَقَالَ إِنَّ الله عَزَّ وَجَلَّ لَمَّا أَهْبَطَ آدَمَ مِنَ الْجَنَّةِ هَبَطَ عَلَى أَبِي قُبَيْسٍ فَشَكَا إِلَى رَبِّهِ الْوَحْشَةَ وَأَنَّهُ لا يَسْمَعُ مَا كَانَ يَسْمَعُهُ فِي الْجَنَّةِ فَأَهْبَطَ الله عَزَّ وَجَلَّ عَلَيْهِ يَاقُوتَةً حَمْرَاءَ فَوَضَعَهَا فِي مَوْضِعِ الْبَيْتِ فَكَانَ يَطُوفُ بِهَا آدَمُ فَكَانَ ضَوْؤُهَا يَبْلُغُ مَوْضِعَ الأَعْلامِ فَيُعَلَّمُ الأَعْلامُ عَلَى ضَوْئِهَا وَجَعَلَهُ الله حَرَماً. عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ أَبِي هَمَّامٍ إِسْمَاعِيلَ بْنِ هَمَّامٍ الْكِنْدِيِّ عَنْ أَبِي الْحَسَنِ الرِّضَا (عَلَيْهِ السَّلاَم) نَحْوَ هَذَا.",
          "English Text": "1. Ali ibn Ibrahim has narrated from his father from Ahmad ibn Muhammad ibn abu Nasr who has said the following: “I once asked abu al-Hassan, al-Rida , about the Sacred Area, about its landmarks and why certain ones of its landmarks are closer than others, and others are farther?’ He (the Imam) replied, ’When Allah, the Most Majestic, the Most Glorious, sent Adam down from paradise, he landed on abu Qubays (hill). He complained before his Lord against loneliness and that he does not hear what he used to hear in paradise. Allah, the Most Majestic, the Most Glorious, then sent for him a piece of red ruby. He placed it on the site of the House. Adam walked around it. The light from it fell on certain surrounding sites of the landmarks which are distinguished as such (the landmarks). Allah made them the boundary of the Sacred Area.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " حسن والسند الثاني صحيح   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/18)"
          }
        }
      },
      "Chapter #9": {
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 4: The Invasion of Tubba‘ and People of Elephant Against the House; ‘Abd al-Muttalib Digs the Well of Zamzam, Quraysh Destroys al-Ka‘bah and Rebuilds It and Hajjaj Destroys al-Ka‘bah and Rebuilds It",
          "Link": "https://thaqalayn.net/hadith/4/3/9/4",
          "Arabic Text": "4ـ عَلِيُّ بْنُ إِبْرَاهِيمَ وَغَيْرُهُ بِأَسَانِيدَ مُخْتَلِفَةٍ رَفَعُوهُ قَالُوا إِنَّمَا هَدَمَتْ قُرَيْشٌ الْكَعْبَةَ لأَنَّ السَّيْلَ كَانَ يَأْتِيهِمْ مِنْ أَعْلَى مَكَّةَ فَيَدْخُلُهَا فَانْصَدَعَتْ وَسُرِقَ مِنَ الْكَعْبَةِ غَزَالٌ مِنْ ذَهَبٍ رِجْلاهُ مِنْ جَوْهَرٍ وَكَانَ حَائِطُهَا قَصِيراً وَكَانَ ذَلِكَ قَبْلَ مَبْعَثِ النَّبِيِّ (صلَّى اللهُ عَلَيْهِ وَآلِه) بِثَلاثِينَ سَنَةً فَأَرَادَتْ قُرَيْشٌ أَنْ يَهْدِمُوا الْكَعْبَةَ وَيَبْنُوهَا وَيَزِيدُوا فِي عَرْصَتِهَا ثُمَّ أَشْفَقُوا مِنْ ذَلِكَ وَخَافُوا إِنْ وَضَعُوا فِيهَا الْمَعَاوِلَ أَنْ تَنْزِلَ عَلَيْهِمْ عُقُوبَةٌ فَقَالَ الْوَلِيدُ بْنُ الْمُغِيرَةِ دَعُونِي أَبْدَأُ فَإِنْ كَانَ لله رِضًا لَمْ يُصِبْنِي شَيْ‏ءٌ وَإِنْ كَانَ غَيْرَ ذَلِكَ كَفَفْنَا فَصَعِدَ عَلَى الْكَعْبَةِ وَحَرَّكَ مِنْهُ حَجَراً فَخَرَجَتْ عَلَيْهِ حَيَّةٌ وَانْكَسَفَتِ الشَّمْسُ فَلَمَّا رَأَوْا ذَلِكَ بَكَوْا وَتَضَرَّعُوا وَقَالُوا اللهمَّ إِنَّا لا نُرِيدُ إِلاَّ الإِصْلاحَ فَغَابَتْ عَنْهُمُ الْحَيَّةُ فَهَدَمُوهُ وَنَحَّوْا حِجَارَتَهُ حَوْلَهُ حَتَّى بَلَغُوا الْقَوَاعِدَ الَّتِي وَضَعَهَا إِبْرَاهِيمُ (عَلَيْهِ السَّلاَم) فَلَمَّا أَرَادُوا أَنْ يَزِيدُوا فِي عَرْصَتِهِ وَحَرَّكُوا الْقَوَاعِدَ الَّتِي وَضَعَهَا إِبْرَاهِيمُ (عَلَيْهِ السَّلاَم) أَصَابَتْهُمْ زَلْزَلَةٌ شَدِيدَةٌ وَظُلْمَةٌ فَكَفُّوا عَنْهُ وَكَانَ بُنْيَانُ إِبْرَاهِيمَ الطُّوْلُ ثَلاثُونَ ذِرَاعاً وَالْعَرْضُ اثْنَانِ وَعِشْرُونَ ذِرَاعاً وَالسَّمْكُ تِسْعَةُ أَذْرُعٍ فَقَالَتْ قُرَيْشٌ نَزِيدُ فِي سَمْكِهَا فَبَنَوْهَا فَلَمَّا بَلَغَ الْبِنَاءُ إِلَى مَوْضِعِ الْحَجَرِ الأَسْوَدِ تَشَاجَرَتْ قُرَيْشٌ فِي وَضْعِهِ فَقَالَ كُلُّ قَبِيلَةٍ نَحْنُ أَوْلَى بِهِ نَحْنُ نَضَعُهُ فَلَمَّا كَثُرَ بَيْنَهُمْ تَرَاضَوْا بِقَضَاءِ مَنْ يَدْخُلُ مِنْ بَابِ بَنِي شَيْبَةَ فَطَلَعَ رَسُولُ الله (صلَّى اللهُ عَلَيْهِ وَآلِه) فَقَالُوا هَذَا الأَمِينُ قَدْ جَاءَ فَحَكَّمُوهُ فَبَسَطَ رِدَاءَهُ وَقَالَ بَعْضُهُمْ كِسَاءٌ طَارُونِيٌّ كَانَ لَهُ وَوَضَعَ الْحَجَرَ فِيهِ ثُمَّ قَالَ يَأْتِي مِنْ كُلِّ رَبْعٍ مِنْ قُرَيْشٍ رَجُلٌ فَكَانُوا عُتْبَةَ بْنَ رَبِيعَةَ بْنِ عَبْدِ شَمْسٍ وَالأَسْوَدَ بْنَ الْمُطَّلِبِ مِنْ بَنِي أَسَدِ بْنِ عَبْدِ الْعُزَّى وَأَبُو حُذَيْفَةَ بْنَ الْمُغِيرَةِ مِنْ بَنِي مَخْزُومٍ وَقَيْسَ بْنَ عَدِيٍّ مِنْ بَنِي سَهْمٍ فَرَفَعُوهُ وَوَضَعَهُ النَّبِيُّ (صلَّى اللهُ عَلَيْهِ وَآلِه) فِي مَوْضِعِهِ وَقَدْ كَانَ بَعَثَ مَلِكُ الرُّومِ بِسَفِينَةٍ فِيهَا سُقُوفٌ وَآلاتٌ وَخَشَبٌ وَقَوْمٌ مِنَ الْفَعَلَةِ إِلَى الْحَبَشَةِ لِيُبْنَى لَهُ هُنَاكَ بِيعَةٌ فَطَرَحَتْهَا الرِّيحُ إِلَى سَاحِلِ الشَّرِيعَةِ فَبُطِحَتْ فَبَلَغَ قُرَيْشاً خَبَرُهَا فَخَرَجُوا إِلَى السَّاحِلِ فَوَجَدُوا مَا يَصْلُحُ لِلْكَعْبَةِ مِنْ خَشَبٍ وَزِينَةٍ وَغَيْرِ ذَلِكَ فَابْتَاعُوهُ وَصَارُوا بِهِ إِلَى مَكَّةَ فَوَافَقَ ذَرْعُ ذَلِكَ الْخَشَبِ الْبِنَاءَ مَا خَلا الْحِجْرَ فَلَمَّا بَنَوْهَا كَسَوْهَا الْوَصَائِدَ وَهِيَ الأَرْدِيَةُ.",
          "English Text": "4. Ali ibn Ibrahim and others have narrated through various chains of narrators have narrated in a marfu‘ manner the following: “They have said that Quraysh had demolished al-Ka‘bah because of flood that would come from the upper part of Makkah and enter al-Ka‘bah. Damages would take place and a deer made of gold with its legs made of diamond was stolen. The walls were not high enough. This happened thirty years before Allah commanded His prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, to rise. Quraysh wanted to demolish al-Ka‘bah to rebuild and increase the size of its floor, but they were afraid of the coming of misfortune upon them because of using spades and shovels to dig. Al-Walid ibn al-Mughirah said, ‘Allow me to try. If Allah is happy I will not be hurt; otherwise we will stop the work.’ He climbed on al-Ka‘bah and moved a stone there, a serpent came upon him, and the sun became dark. When they saw this, they cried and pleaded, saying, ‘O Lord, we only want to repair.’ The serpent disappeared; they demolished and removed the stones until they could see the foundations that Ibrahim had set. When they wanted to increase the size of its floor and moved the foundations that Ibrahim had put in place, a severe earthquake took place with darkness. They then gave up on the idea of increasing its floor. The length of the foundation that Ibrahim had set was thirty yards, its width twenty-two yards and its height nine yards. Quraysh wanted to increase its height. When the walls reached up to the Black Stone, they disagreed about setting it in place. Each tribe said that it had the right to set it in place. When the disagreement increased, they then decided to settle their disagreement by the first person entering through the door of banu Shaybah. The Messenger of Allah appeared to them through that door and they said, ‘This is al-Amin (most trusted person) coming to you.’ They asked him to decide the case; he then spread his gown, and someone said, ‘It is a Taruniy’ (name of a particular fabric). He placed the Black Stone on it and said, ‘One person from each Rab‘ (block of city) should come forward.’ The people who came forward were, ‘Utbah ibn Rabi‘ah ibn ‘Abd al- Shams, al-Aswad ibn al-Muttalib from banu Asad ibn ‘Abd al-‘Uzza’, abu Hudhayfah ibn al-Mughirah from banu Makhzum and Qays ibn ‘Adiy from banu Sahm. They lifted up the Black Stone and the Holy Prophet set it in its place. On the other hand, the king of Rome had sent a ship with building material and builders to Ethiopia to built a temple for him there. The wind had blown the ship to the shore where it had run aground. Quraysh learned about it. They went to the shore and found certain materials useful for al-Ka‘bah, like wood, decorative materials and other things. They bought them and brought them to Makkah. The length of the wood was of the same measure as needed except al-Hijr. When they built it, they covered it with al-Wasa’id (a certain kind of fabric) which were in gowns.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/57)"
          }
        },
        "Hadith #6": {
          "Title": "Al-Kafi - Volume 4: The Invasion of Tubba‘ and People of Elephant Against the House; ‘Abd al-Muttalib Digs the Well of Zamzam, Quraysh Destroys al-Ka‘bah and Rebuilds It and Hajjaj Destroys al-Ka‘bah and Rebuilds It",
          "Link": "https://thaqalayn.net/hadith/4/3/9/6",
          "Arabic Text": "6ـ عَلِيُّ بْنُ إِبْرَاهِيمَ وَغَيْرُهُ رَفَعُوهُ قَالَ كَانَ فِي الْكَعْبَةِ غَزَالانِ مِنْ ذَهَبٍ وَخَمْسَةُ أَسْيَافٍ فَلَمَّا غَلَبَتْ خُزَاعَةُ جُرْهُمَ عَلَى الْحَرَمِ أَلْقَتْ جُرْهُمُ الأَسْيَافَ وَالْغَزَالَيْنِ فِي بِئْرِ زَمْزَمَ وَأَلْقَوْا فِيهَا الْحِجَارَةَ وَطَمُّوهَا وَعَمَّوْا أَثَرَهَا فَلَمَّا غَلَبَ قُصَيٌّ عَلَى خُزَاعَةَ لَمْ يَعْرِفُوا مَوْضِعَ زَمْزَمَ وَعَمِيَ عَلَيْهِمْ مَوْضِعُهَا فَلَمَّا غَلَبَ عَبْدُ الْمُطَّلِبِ وَكَانَ يُفْرَشُ لَهُ فِي فِنَاءِ الْكَعْبَةِ وَلَمْ يَكُنْ يُفْرَشُ لأَحَدٍ هُنَاكَ غَيْرَهُ فَبَيْنَمَا هُوَ نَائِمٌ فِي ظِلِّ الْكَعْبَةِ فَرَأَى فِي مَنَامِهِ أَتَاهُ آتٍ فَقَالَ لَهُ احْفِرْ بَرَّةَ قَالَ وَمَا بَرَّةُ ثُمَّ أَتَاهُ فِي الْيَوْمِ الثَّانِي فَقَالَ احْفِرْ طِيبَةَ ثُمَّ أَتَاهُ فِي الْيَوْمِ الثَّالِثِ فَقَالَ احْفِرْ الْمَصُونَةَ قَالَ وَمَا الْمَصُونَةُ ثُمَّ أَتَاهُ فِي الْيَوْمِ الرَّابِعِ فَقَالَ احْفِرْ زَمْزَمَ لا تَنْزَحْ وَلا تَذُمَّ تَسْقِي الْحَجِيجَ الأَعْظَمَ عِنْدَ الْغُرَابِ الأَعْصَمِ عِنْدَ قَرْيَةِ النَّمْلِ وَكَانَ عِنْدَ زَمْزَمَ حَجَرٌ يَخْرُجُ مِنْهُ النَّمْلُ فَيَقَعُ عَلَيْهِ الْغُرَابُ الأَعْصَمُ فِي كُلِّ يَوْمٍ يَلْتَقِطُ النَّمْلَ فَلَمَّا رَأَى عَبْدُ الْمُطَّلِبِ هَذَا عَرَفَ مَوْضِعَ زَمْزَمَ فَقَالَ لِقُرَيْشٍ إِنِّي أُمِرْتُ فِي أَرْبَعِ لَيَالٍ فِي حَفْرِ زَمْزَمَ وَهِيَ مَأْثُرَتُنَا وَعِزُّنَا فَهَلُمُّوا نَحْفِرْهَا فَلَمْ يُجِيبُوهُ إِلَى ذَلِكَ فَأَقْبَلَ يَحْفِرُهَا هُوَ بِنَفْسِهِ وَكَانَ لَهُ ابْنٌ وَاحِدٌ وَهُوَ الْحَارِثُ وَكَانَ يُعِينُهُ عَلَى الْحَفْرِ فَلَمَّا صَعُبَ ذَلِكَ عَلَيْهِ تَقَدَّمَ إِلَى بَابِ الْكَعْبَةِ ثُمَّ رَفَعَ يَدَيْهِ وَدَعَا الله عَزَّ وَجَلَّ وَنَذَرَ لَهُ إِنْ رَزَقَهُ عَشْرَ بَنِينَ أَنْ يَنْحَرَ أَحَبَّهُمْ إِلَيْهِ تَقَرُّباً إِلَى الله عَزَّ وَجَلَّ فَلَمَّا حَفَرَ وَبَلَغَ الطَّوِيَّ طَوِيَّ إِسْمَاعِيلَ وَعَلِمَ أَنَّهُ قَدْ وَقَعَ عَلَى الْمَاءِ كَبَّرَ وَكَبَّرَتْ قُرَيْشٌ وَقَالُوا يَا أَبَا الْحَارِثِ هَذِهِ مَأْثُرَتُنَا وَلَنَا فِيهَا نَصِيبٌ قَالَ لَهُمْ لَمْ تُعِينُونِي عَلَى حَفْرِهَا هِيَ لِي وَلِوُلْدِي إِلَى آخِرِ الأَبَدِ.",
          "English Text": "6. Ali ibn Ibrahim and others in a marfu‘ manner have narrated the following: “He (the Imam) , has said that in al-Ka‘bah there were two gazelles made of gold and five swords. When Khuza‘ah dominated Jurhum in the Sacred area, Jurhum threw the two deer and the swords in the well of Zamzam. They threw stones in it, filled it up and disguised its marks. When Qusay dominated Khuza‘ah, they did not know where Zamzam was, so it remained unknown to them. When ‘Abd al-Muttalib became dominant, furnishings for him were arranged in the shadow of the walls of al-Ka‘bah, and this was not done for anyone before. Once, when he was sleeping in the shadow of al-Ka‘bah, he saw in his dream that someone came and said to him, ‘Dig ‘Barrah.’ He asked, ‘What is Barrah?’ Next day he came in his dream and said, ‘Dig ‘Taybah.’ On the third day, he came in his dream and said, ‘Dig ‘Al-Masunah.’ He asked what is al-Masunah?’ Then on the fourth day, he came in his dream and said, ‘Dig ‘Zamzam,’ which will not dry up and will not be disliked. Great people performing Hajj will drink thereby near the red-footed crows that land near the colony of ants.’ There was a rock near Zamzam, on which red-footed crows would land every day to pick up ants for food. The ants had their colony under the rock near Zamzam. When ‘ Abd al-Muttalib saw this, he recognized the place of Zamzam. He then said to Quraysh, ‘I am told in four nights in my dream to dig Zamzam. It is our heritage and an honor for us; come, so we together dig the well.’ They declined his call and he himself began to dig the well and his only son, al-Harith, helped him in the digging. When digging became difficult, he moved to the door of al-Ka‘bah, raised his hands, pleaded before Allah, the Most Majestic, the Most Glorious, and made a vow. In his vow he had said that if Allah will give him ten sons, he will offer the most beloved one among them as a sacrificial offering as an act of moving closer to Allah, the Most Majestic, the Most Glorious. When he in his digging reached the walls of the well built by Isma‘il, he came to know of his reaching the water. He said Takhir (Allah is great beyond description) and Quraysh also said Takhir (Allah is great beyond description), saying, ‘O abu al-Harith, this is of our heritage and we have a share in it.’ He replied, ‘You did not help me, so you do not have any share in it, and it is for me and my children forever.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/60)"
          }
        }
      },
      "Chapter #11": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 4: The Rare Ahadith",
          "Link": "https://thaqalayn.net/hadith/4/3/11/1",
          "Arabic Text": "1ـ مُحَمَّدُ بْنُ عَقِيلٍ عَنِ الْحَسَنِ بْنِ الْحُسَيْنِ عَنْ عَلِيِّ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَسَنِ عَنْ مُحَمَّدِ بْنِ يَزِيدَ الرِّفَاعِيِّ رَفَعَهُ أَنَّ أَمِيرَ الْمُؤْمِنِينَ (عَلَيْهِ السَّلاَم) سُئِلَ عَنِ الْوُقُوفِ بِالْجَبَلِ لِمَ لَمْ يَكُنْ فِي الْحَرَمِ فَقَالَ لأَنَّ الْكَعْبَةَ بَيْتُهُ وَالْحَرَمَ بَابُهُ فَلَمَّا قَصَدُوهُ وَافِدِينَ وَقَفَهُمْ بِالْبَابِ يَتَضَرَّعُونَ قِيلَ لَهُ فَالْمَشْعَرُ الْحَرَامُ لِمَ صَارَ فِي الْحَرَمِ قَالَ لأَنَّهُ لَمَّا أَذِنَ لَهُمْ بِالدُّخُولِ وَقَفَهُمْ بِالْحِجَابِ الثَّانِي فَلَمَّا طَالَ تَضَرُّعُهُمْ بِهَا أَذِنَ لَهُمْ لِتَقْرِيبِ قُرْبَانِهِمْ فَلَمَّا قَضَوْا تَفَثَهُمْ تَطَهَّرُوا بِهَا مِنَ الذُّنُوبِ الَّتِي كَانَتْ حِجَاباً بَيْنَهُمْ وَبَيْنَهُ أَذِنَ لَهُمْ بِالزِّيَارَةِ عَلَى الطَّهَارَةِ قِيلَ لَهُ فَلِمَ حُرِّمَ الصِّيَامُ أَيَّامَ التَّشْرِيقِ قَالَ لأَنَّ الْقَوْمَ زُوَّارُ الله وَهُمْ فِي ضِيَافَتِهِ وَلا يَجْمُلُ بِمُضِيفٍ أَنْ يُصَوِّمَ أَضْيَافَهُ قِيلَ لَهُ فَالتَّعَلُّقُ بِأَسْتَارِ الْكَعْبَةِ لأَيِّ مَعْنًى هُوَ قَالَ مَثَلُ رَجُلٍ لَهُ عِنْدَ آخَرَ جِنَايَةٌ وَذَنْبٌ فَهُوَ يَتَعَلَّقُ بِثَوْبِهِ يَتَضَرَّعُ إِلَيْهِ وَيَخْضَعُ لَهُ أَنْ يَتَجَافَى عَنْ ذَنْبِهِ.",
          "English Text": "1. Muhammad ibn ‘Aqil has narrated from al-Hassan ibn al-Husayn from Ali ibn ‘Isa from Ali ibn al-Hassan from Muhammad ibn Yazid aI-Rifa’ ‘iy who in a marfu‘ manner has narrated from ’Amir al-Mu’minin the following: “’Amir al-Mu’minin was asked about staying on the hill, why it is not inside the Sacred area (al- Haram)?’ He (the Imam) replied, ‘It is because al-Ka‘bah is His house and al-Haram (the sacred area) is its door. When people wanted to come to His House, He made them stand, wait at the door and appeal for permission.’ It was asked from him, ‘Why is al-Mash‘ar al-Haram part of al-Haram?’ He (the Imam) replied, ‘It is because when permission was given to come, He made them to stop on the second barrier but when their pleading prolonged, permission was granted to them to move their offerings closer. When they cleaned themselves with it, they became clean of sins, which were as barriers between them, and He granted permission to visit (His House) in a clean condition.’ It was then asked, ‘Why is fasting during the bright days not permissible?’ He (the Imam) replied, ‘It is because people are Allah’s visitors, they are His guests and it is not nice for a host that his guests remain fasting.’ He was asked, ‘Why should one hold to the curtains of al-Ka‘bah and what does it mean?’ He (the Imam) replied, ‘It is like one who has committed a crime against another person; thus he holds to his clothes and expresses humility before him to forgive him his sins and crime.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع مجهول    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/67)"
          }
        }
      },
      "Chapter #17": {
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 4: Detestability of Taking Soil and Pebbles from the House",
          "Link": "https://thaqalayn.net/hadith/4/3/17/4",
          "Arabic Text": "4ـ حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانٍ عَنْ زَيْدٍ الشَّحَّامِ قَالَ قُلْتُ لأَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) أَخْرُجُ مِنَ الْمَسْجِدِ وَفِي ثَوْبِي حَصَاةٌ قَالَ فَرُدَّهَا أَوِ اطْرَحْهَا فِي مَسْجِدٍ. ",
          "English Text": "4. Humayd ibn Ziyad has narrated from ibn Sama‘ah and from more than one person from Aban from Zayd al-Shahham who has said the following: “I once asked abu ‘Abd Allah , about the pebbles that I find with me after coming out of the Masjid. He (the Imam) said, ‘Return them or throw in the Masjid.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالموثق    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/79)"
          }
        }
      },
      "Chapter #21": {
        "Hadith #18": {
          "Title": "Al-Kafi - Volume 4: Hunting in al-Haram (the sacred area) and The Expiation for the Same",
          "Link": "https://thaqalayn.net/hadith/4/3/21/18",
          "Arabic Text": "18ـ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ مَنْصُورِ بْنِ حَازِمٍ قَالَ قُلْتُ لأَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) أُهْدِيَ لَنَا طَائِرٌ مَذْبُوحٌ بِمَكَّةَ فَأَكَلَهُ أَهْلُنَا فَقَالَ لا يَرَى بِهِ أَهْلُ مَكَّةَ بَأْساً قُلْتُ فَأَيُّ شَيْ‏ءٍ تَقُولُ أَنْتَ قَالَ عَلَيْهِمْ ثَمَنُهُ.",
          "English Text": "18. Muhammad ibn ‘Isma‘il has narrated from al-Fadl ibn Shadhan from Safwan ibn Yahya from Mansur ibn Flazim who has said the following: “I once asked abu ‘Abd Allah , about the case of a slaughtered bird given to us as gift in Makkah, if I can use it for food with my family. He (the Imam) said, ‘People of Makkah do not think it is harmful.’ I then asked, ‘What do you say about it?’ He (the Imam) said, ‘They owe its prices.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول كالصحيح    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/93)"
          }
        },
        "Hadith #19": {
          "Title": "Al-Kafi - Volume 4: Hunting in al-Haram (the sacred area) and The Expiation for the Same",
          "Link": "https://thaqalayn.net/hadith/4/3/21/19",
          "Arabic Text": "19ـ بَعْضُ أَصْحَابِنَا عَنْ أَبِي جَرِيرٍ الْقُمِّيِّ قَالَ قُلْتُ لأَبِي الْحَسَنِ (عَلَيْهِ السَّلاَم) نَشْتَرِي الصُّقُورَ فَنُدْخِلُهَا الْحَرَمَ فَلَنَا ذَلِكَ فَقَالَ كُلُّ مَا أُدْخِلَ الْحَرَمَ مِنَ الطَّيْرِ مِمَّا يَصُفُّ جَنَاحَهُ فَقَدْ دَخَلَ مَأْمَنَهُ فَخَلِّ سَبِيلَهُ.",
          "English Text": "19. Certain persons of our people have narrated from abu Jarir al-Qummiy who has said the following: “I once asked abu al-Hassan , about the case of our buying hawks and taking them to al-Haram (the sacred area), if we owe anything. He (the Imam) said, ‘If one takes any of the birds that when flying, flap their wing, he has taken them to their sanctuary, and should leave them there.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " سكت عنه  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/94)"
          }
        }
      },
      "Chapter #28": {
        "Hadith #8": {
          "Title": "Al-Kafi - Volume 4: The Excellence of Hajj and ‘Umrah, and the Reward Thereof",
          "Link": "https://thaqalayn.net/hadith/4/3/28/8",
          "Arabic Text": "8ـ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ رِبْعِيِّ بْنِ عَبْدِ الله عَنِ الْفُضَيْلِ بْنِ يَسَارٍ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ (عَلَيْهِ السَّلاَم) يَقُولُ قَالَ رَسُولُ الله (صلَّى اللهُ عَلَيْهِ وَآلِه) لا يُحَالِفُ الْفَقْرُ وَالْحُمَّى مُدْمِنَ الْحَجِّ وَالْعُمْرَةِ.",
          "English Text": "8. Muhammad ibn Isma‘il has narrated from al-Fadl ibn Shadhan from Hammad ibn ‘Isa from Rib’iy ibn ‘Abd Allah from al-Fudayl ibn Yasar who has said the following: “I heard abu Ja‘far , say, ‘The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, “Chronic poverty and fever cannot come with al-Hajj and al-‘Umrah.’”” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول كالصحيح   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/124)"
          }
        },
        "Hadith #9": {
          "Title": "Al-Kafi - Volume 4: The Excellence of Hajj and ‘Umrah, and the Reward Thereof",
          "Link": "https://thaqalayn.net/hadith/4/3/28/9",
          "Arabic Text": "9ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبِي أَيُّوبَ عَنْ سَعْدٍ الإِسْكَافِ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ (عَلَيْهِ السَّلاَم) يَقُولُ إِنَّ الْحَاجَّ إِذَا أَخَذَ فِي جَهَازِهِ لَمْ يَخْطُ خُطْوَةً فِي شَيْ‏ءٍ مِنْ جَهَازِهِ إِلاَّ كَتَبَ الله عَزَّ وَجَلَّ لَهُ عَشْرَ حَسَنَاتٍ وَمَحَا عَنْهُ عَشْرَ سَيِّئَاتٍ وَرَفَعَ لَهُ عَشْرَ دَرَجَاتٍ حَتَّى يَفْرُغَ مِنْ جَهَازِهِ مَتَى مَا فَرَغَ فَإِذَا اسْتَقْبَلَتْ بِهِ رَاحِلَتُهُ لَمْ تَضَعْ خُفّاً وَلَمْ تَرْفَعْهُ إِلاَّ كَتَبَ الله عَزَّ وَجَلَّ لَهُ مِثْلَ ذَلِكَ حَتَّى يَقْضِيَ نُسُكَهُ فَإِذَا قَضَى نُسُكَهُ غَفَرَ الله لَهُ ذُنُوبَهُ وَكَانَ ذَا الْحِجَّةِ وَالْمُحَرَّمَ وَصَفَرَ وَشَهْرَ رَبِيعٍ الأَوَّلِ أَرْبَعَةَ أَشْهُرٍ تُكْتَبُ لَهُ الْحَسَنَاتُ وَلا تُكْتَبُ عَلَيْهِ السَّيِّئَاتُ إِلاَّ أَنْ يَأْتِيَ بِمُوجِبَةٍ فَإِذَا مَضَتِ الأَرْبَعَةُ الأَشْهُرِ خُلِطَ بِالنَّاسِ.",
          "English Text": "9. A number of our people have narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from abu Ayyub from Sa‘d al-Iskaf who has said the following: “I heard abu Ja’far , say, ‘When a pilgrim (al-Hajj) prepares his supplies for Hajj, for every step that he walks for the preparation, Allah, most Majestic, most Glorious, writes down for him ten good deeds, deletes ten sins and raises for him ten degrees until his preparation is complete, whenever it happens. When his animal for transportation moves, for every step lifted up or placed on the ground Allah, the Most Majestic, the Most Glorious, writes down for him the same number of good deeds until all of the acts of Hajj are complete, at which point Allah forgives his sins. During the months of Dhu al-Hajj ah, al-Muharram, Safar, Rabi’ al-Awwal, which are four months, good deeds are written for him. No evil deed is written against him until he in fact commits one (a major sin). After these four months he is mixed with people.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مختلف فيه   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/124)"
          }
        }
      },
      "Chapter #36": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 4: Forcing People to Perform al-Hajj",
          "Link": "https://thaqalayn.net/hadith/4/3/36/1",
          "Arabic Text": "1ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَفْصِ بْنِ الْبَخْتَرِيِّ وَهِشَامِ بْنِ سَالِمٍ وَمُعَاوِيَةَ بْنِ عَمَّارٍ وَغَيْرِهِمْ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ لَوْ أَنَّ النَّاسَ تَرَكُوا الْحَجَّ لَكَانَ عَلَى الْوَالِي أَنْ يُجْبِرَهُمْ عَلَى ذَلِكَ وَعَلَى الْمُقَامِ عِنْدَهُ وَلَوْ تَرَكُوا زِيَارَةَ النَّبِيِّ (صلَّى اللهُ عَلَيْهِ وَآلِه) لَكَانَ عَلَى الْوَالِي أَنْ يُجْبِرَهُمْ عَلَى ذَلِكَ وَعَلَى الْمُقَامِ عِنْدَهُ فَإِنْ لَمْ يَكُنْ لَهُمْ أَمْوَالٌ أَنْفَقَ عَلَيْهِمْ مِنْ بَيْتِ مَالِ الْمُسْلِمِينَ.",
          "English Text": "1. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from Hafs af-Bakhtariy and Hisham ibn Salim and Mu‘awiyah ibn ‘Ammar and others who has said the following: “Abu ‘Abd Allah , has said that if people neglect performing al-Hajj, the authorities will force them to perform al-Hajj and to reside therein. If people neglect visiting the Holy Prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, the authorities will force them to do so and reside there. If they will not be able to bear the expenses, the authorities will pay for them from the public treasury.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " حسنه الفضلء   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/155)"
          }
        }
      },
      "Chapter #38": {
        "Hadith #17": {
          "Title": "Al-Kafi - Volume 4: What Suffices for Hajjata al-Islam and What Does Not Suffice? (The following Chapter is best explained by fatwa).",
          "Link": "https://thaqalayn.net/hadith/4/3/38/17",
          "Arabic Text": "17ـ مُحَمَّدُ بْنُ يَحْيَى رَفَعَهُ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ سُئِلَ عَنْ رَجُلٍ مَاتَ وَلَهُ ابْنٌ لَمْ يَدْرِ أَ حَجَّ أَبُوهُ أَمْ لا قَالَ يَحُجُّ عَنْهُ فَإِنْ كَانَ أَبُوهُ قَدْ حَجَّ كُتِبَ لأَبِيهِ نَافِلَةً وَلِلابْنِ فَرِيضَةً وَإِنْ كَانَ أَبُوهُ لَمْ يَحُجَّ كُتِبَ لأَبِيهِ فَرِيضَةً وَلِلابْنِ نَافِلَةً.",
          "English Text": "17. Muhammad ibn Yahya has narrated from in a marfu‘ manner who has said the following: “I once asked abu ‘Abd Allah , about a man who dies and has a son who does not know if his father has performed al-Hajj or not. He (the Imam) said, ‘He performs al-Hajj on his behalf, if his father has performed al-Hajj, it is written as optional al-Hajj for him and an obligatory al-Hajj for his son; and if his father has not performed al-Hajj, it is written obligatory for his father and optional for the son.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/166)"
          }
        }
      },
      "Chapter #40": {
        "Hadith #5": {
          "Title": "Al-Kafi - Volume 4: The Case of One Who Borrows to Perform al-Hajj",
          "Link": "https://thaqalayn.net/hadith/4/3/40/5",
          "Arabic Text": "5ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ عَنْ غَيْرِ وَاحِدٍ قَالَ قُلْتُ لأَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) يَكُونُ عَلَيَّ الدَّيْنُ فَيَقَعُ فِي يَدِيَ الدَّرَاهِمُ فَإِنْ وَزَّعْتُهَا بَيْنَهُمْ لَمْ يَبْقَ شَيْ‏ءٌ أَ فَأَحُجُّ بِهَا أَوْ أُوَزِّعُهَا بَيْنَ الْغُرَّامِ فَقَالَ تَحُجُّ بِهَا وَادْعُ الله أَنْ يَقْضِيَ عَنْكَ دَيْنَكَ.",
          "English Text": "5. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from Mu‘awiyah ibn Wahab from more than one person who has said the following: “I once asked abu ‘Abd Allah , about the debt that I owe and I have a certain amount of dirham, which if I divide among the creditors, not anything will be left for al-Hajj expenses. He (the Imam) said, ‘Perform al-Hajj with it and appeal before Allah to pay off your debts.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالحسن   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/169)"
          }
        }
      },
      "Chapter #41": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 4: The Extra in the Expenses of al-Hajj",
          "Link": "https://thaqalayn.net/hadith/4/3/41/2",
          "Arabic Text": "2ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْبَرْقِيِّ عَنْ شَيْخٍ رَفَعَ الْحَدِيثَ إِلَى أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ قَالَ لَهُ يَا فُلانُ أَقْلِلِ النَّفَقَةَ فِي الْحَجِّ تَنْشَطْ لِلْحَجِّ وَلا تُكْثِرِ النَّفَقَةَ فِي الْحَجِّ فَتَمَلَّ الْحَجَّ.",
          "English Text": "2. A number of our people have narrated from Ahmad ibn Muhammad from al-Barqiy from a Shaykh narrating it in a marfu’ manner has said the following: “Abu ‘Abd Allah , has said that he (the Imam) said to him (the narrator), ‘O so and so, reduce the expenses of al-Hajj; you will be more motivated for al-Hajj. You must not be an over- spender; that will reduce your interest in performing al-Hajj. ‘“",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/170)"
          }
        }
      },
      "Chapter #51": {
        "Hadith #7": {
          "Title": "Al-Kafi - Volume 4: Kinds of al-Hajj",
          "Link": "https://thaqalayn.net/hadith/4/3/51/7",
          "Arabic Text": "7ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ وَابْنِ أَبِي نَجْرَانَ عَنْ صَفْوَانَ الْجَمَّالِ قَالَ قُلْتُ لأَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) إِنَّ بَعْضَ النَّاسِ يَقُولُ جَرِّدِ الْحَجَّ وَبَعْضَ النَّاسِ يَقُولُ اقْرُنْ وَسُقْ وَبَعْضَ النَّاسِ يَقُولُ تَمَتَّعْ بِالْعُمْرَةِ إِلَى الْحَجِّ فَقَالَ لَوْ حَجَجْتُ أَلْفَ عَامٍ لَمْ أَقْرُنْهَا إِلاَّ مُتَمَتِّعاً.",
          "English Text": "7. Certain persons of our people have narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from ibn abu Najran from Safwan al-Jammal who has said the following: “I once asked abu ‘ Abd Allah , about the case of certain people who say that one must perform al-Hajj alone, others say to make it Qiran and drive the offering animal, and still others say to take advantage between al-‘Umrah and al-Hajj. He (the Imam) , said, ‘If I will perform al-Hajj for a thousand years I will not make it Qiran. I will only perform advantageous al- Hajj (al-Hajj al-Tamattu‘ ).’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " سكت عنه   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/189)"
          }
        },
        "Hadith #10": {
          "Title": "Al-Kafi - Volume 4: Kinds of al-Hajj",
          "Link": "https://thaqalayn.net/hadith/4/3/51/10",
          "Arabic Text": "10ـ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَفْصِ بْنِ الْبَخْتَرِيِّ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ الْمُتْعَةُ وَالله أَفْضَلُ وَبِهَا نَزَلَ الْقُرْآنُ وَجَرَتِ السُّنَّةُ.",
          "English Text": "10. Muhammad ibn ‘Isma‘il has narrated from al-Fadl ibn Shadhan from Ibn Abi ‘Umayr from Hafs ibn al-Bakhtariy who has said the following: “Abu ‘Abd Allah , has said, ‘Al-Hajj al-Tamattu‘ (advantageous) by Allah is better. Quran had come down about it and the Sunnah has run in this way.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول كالصحيح  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/190)"
          }
        }
      },
      "Chapter #57": {
        "Hadith #8": {
          "Title": "Al-Kafi - Volume 4: Manner of Performing al-Hajj by the Inhabitants of Makkah and Those in Its Neighborhood",
          "Link": "https://thaqalayn.net/hadith/4/3/57/8",
          "Arabic Text": "8ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَمَّنْ أَخْبَرَهُ عَنْ أَبِي جَعْفَرٍ (عَلَيْهِ السَّلاَم) قَالَ مَنْ دَخَلَ مَكَّةَ بِحَجَّةٍ عَنْ غَيْرِهِ ثُمَّ أَقَامَ سَنَةً فَهُوَ مَكِّيٌّ فَإِذَا أَرَادَ أَنْ يَحُجُّ عَنْ نَفْسِهِ أَوْ أَرَادَ أَنْ يَعْتَمِرَ بَعْدَ مَا انْصَرَفَ مِنْ عَرَفَةَ فَلَيْسَ لَهُ أَنْ يُحْرِمَ بِمَكَّةَ وَلَكِنْ يَخْرُجُ إِلَى الْوَقْتِ وَكُلَّمَا حَوَّلَ رَجَعَ إِلَى الْوَقْتِ.",
          "English Text": "8. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Hariz from those whom he has mentioned who has said the following: “Abu Ja‘far , has said, ‘If one enters Makkah to perform al-Hajj for others then remains in Makkah for one year, he is considered as one of the people of Makkah. If he wants to perform al-Hajj for himself or wants to perform al-‘Umrah after returning from ‘Arafat, he cannot then assume the state of Ihram in Makkah. He must go out to a Miqat (place for assuming the state of Ihram) and every time he changes, he is required to go to a Miqat (place for assuming the state of Ihram).”’ ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل معتبر    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/207)"
          }
        }
      },
      "Chapter #67": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 4: The Case of One Who Performs al-Hajj on Behalf of Someone but Has Done So on Behalf of another Person",
          "Link": "https://thaqalayn.net/hadith/4/3/67/2",
          "Arabic Text": "2ـ مُحَمَّدُ بْنُ يَحْيَى رَفَعَهُ قَالَ سُئِلَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلاَم) عَنْ رَجُلٍ أَعْطَى رَجُلاً مَالاً يَحُجُّ عَنْهُ فَحَجَّ عَنْ نَفْسِهِ فَقَالَ هِيَ عَنْ صَاحِبِ الْمَالِ.",
          "English Text": "2. Muhammad ibn Yahya in a marfu‘ manner has narrated the following: “Abu ‘Abd Allah , was once asked about a man who receives a certain amount to perform al-Hajj for another person, but he performs al-Hajj for himself. He (the Imam) said, ‘It is for the owner of the asset.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/225)"
          }
        }
      },
      "Chapter #74": {
        "Hadith #9": {
          "Title": "Al-Kafi - Volume 4: Mawaqit (Places Designated for Commencing) al-’Ihram",
          "Link": "https://thaqalayn.net/hadith/4/3/74/9",
          "Arabic Text": "9ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَبْدِ الله بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ مَنْ أَقَامَ بِالْمَدِينَةِ شَهْراً وَهُوَ يُرِيدُ الْحَجَّ ثُمَّ بَدَا لَهُ أَنْ يَخْرُجَ فِي غَيْرِ طَرِيقِ أَهْلِ الْمَدِينَةِ الَّذِي يَأْخُذُونَهُ فَلْيَكُنْ إِحْرَامُهُ مِنْ مَسِيرَةِ سِتَّةِ أَمْيَالٍ فَيَكُونُ حِذَاءَ الشَّجَرَةِ مِنَ الْبَيْدَاءِ وَفِي رِوَايَةٍ أُخْرَى يُحْرِمُ مِنَ الشَّجَرَةِ ثُمَّ يَأْخُذُ أَيَّ طَرِيقٍ شَاءَ.",
          "English Text": "9. A number of our people have narrated from Ahmad ibn Muhammad from al-Fiassan ibn Mahbub from ‘Abd Allah ibn Sinan who has said the following: “Abu ‘Abd Allah , has said, ‘One who stays in al-Madinah for one month, then wants to perform al-Hajj; but he decides to travel from a road other than the road of the people of al- Madinah, his Ihram is from a distance of six miles, parallel to al-Shajarah in al-Bayda’. In another Hadith it says that one assumes the state of Ihram from al-Shajarah and travels whichever way he wants.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " صحيح وآخره مرسل  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/238)"
          }
        }
      },
      "Chapter #75": {
        "Hadith #7": {
          "Title": "Al-Kafi - Volume 4: The Case of One Who Commences (assumes) al-’Ihram Before the Designated Place",
          "Link": "https://thaqalayn.net/hadith/4/3/75/7",
          "Arabic Text": "7ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي جَعْفَرٍ (عَلَيْهِ السَّلاَم) قَالَ مَنْ أَحْرَمَ دُونَ الْوَقْتِ وَأَصَابَ مِنَ النِّسَاءِ وَالصَّيْدِ فَلا شَيْ‏ءَ عَلَيْهِ.",
          "English Text": "7. Ali ibn Ibrahim has narrated from his father from Hammad from Hariz from certain persons of our people who has said the following: “If one assumes the state of Ihram before Miqat (place for assuming the state of Ihram) and then involves with woman or hunting, there is nothing upon him.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالحسن   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/241)"
          }
        }
      },
      "Chapter #76": {
        "Hadith #5": {
          "Title": "Al-Kafi - Volume 4: The Case of One Who Passes the Designated Place for al-’Ihram or Enters Makkah Without al-’Ihram",
          "Link": "https://thaqalayn.net/hadith/4/3/76/5",
          "Arabic Text": "5ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ زُرَارَةَ عَنْ أُنَاسٍ مِنْ أَصْحَابِنَا حَجُّوا بِامْرَأَةٍ مَعَهُمْ فَقَدِمُوا إِلَى الْوَقْتِ وَهِيَ لا تُصَلِّي فَجَهِلُوا أَنَّ مِثْلَهَا يَنْبَغِي أَنْ يُحْرِمَ فَمَضَوْا بِهَا كَمَا هِيَ حَتَّى قَدِمُوا مَكَّةَ وَهِيَ طَامِثٌ حَلالٌ فَسَأَلُوا النَّاسَ فَقَالُوا تَخْرُجُ إِلَى بَعْضِ الْمَوَاقِيتِ فَتُحْرِمُ مِنْهُ وَكَانَتْ إِذَا فَعَلَتْ لَمْ تُدْرِكِ الْحَجَّ فَسَأَلُوا أَبَا جَعْفَرٍ (عَلَيْهِ السَّلاَم) فَقَالَ تُحْرِمُ مِنْ مَكَانِهَا قَدْ عَلِمَ الله نِيَّتَهَا.",
          "English Text": "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad, from ibn Faddal from ibn Bukayr from Zurarah from certain persons of our people who performed al-Hajj with a woman with them. They arrived at Miqat (place for assuming the state of Ihram) and she did not perform Salat (prayer). They did not know that one like her must assume the state of Ihram; so they continued on their journey with her in the same condition, until they arrived in Makkah and she experienced Hayd (menses) and without Ihram. They asked people about it and they said that she must go to any one of Miqat to assume the state of Ihram; but in so doing she could not be in time for al-Hajj. They asked abu Ja‘far , and he (the Imam) said, ‘She must assume the state of Ihram from where she is, Allah had full knowledge of her intention.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالموثق  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/244)"
          }
        },
        "Hadith #8": {
          "Title": "Al-Kafi - Volume 4: The Case of One Who Passes the Designated Place for al-’Ihram or Enters Makkah Without al-’Ihram",
          "Link": "https://thaqalayn.net/hadith/4/3/76/8",
          "Arabic Text": "8ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَحَدِهِمَا (عَلَيْهِما السَّلاَم) فِي رَجُلٍ نَسِيَ أَنْ يُحْرِمَ أَوْ جَهِلَ وَقَدْ شَهِدَ الْمَنَاسِكَ كُلَّهَا وَطَافَ وَسَعَى قَالَ تُجْزِئُهُ نِيَّتُهُ إِذَا كَانَ قَدْ نَوَى ذَلِكَ فَقَدْ تَمَّ حَجُّهُ وَإِنْ لَمْ يُهِلَّ وَقَالَ فِي مَرِيضٍ أُغْمِيَ عَلَيْهِ حَتَّى أَتَى الْوَقْتَ فَقَالَ يُحْرِمُ مِنْهُ.",
          "English Text": "8. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from Jamil ibn Darraj from certain persons of our people who has said the following: “If one forgets to assume the state of Ihram or is ignorant, attends all places for performing the acts of al-Hajj such as Tawaf, Sa‘y between al-Safa’ and al-Marwah and so on, one of the two Imam, (abu Ja’far or abu ‘Abd Allah), ‘Alayhim al-Salam, has said, ‘His intention is sufficient. If he had such intention, his Hajj is complete even though he did not say Talbiyah.’ About the case of a man who fainted due to illness until Miqat (place for assuming the state of Ihram), he (the Imam) said, ‘He must assume the state of Ihram.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالحسن   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/245)"
          }
        }
      },
      "Chapter #78": {
        "Hadith #6": {
          "Title": "Al-Kafi - Volume 4: Matters that Suffice for Ghusl (bath) for al-’Ihram and Those Which Do Not Suffice",
          "Link": "https://thaqalayn.net/hadith/4/3/78/6",
          "Arabic Text": "6ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي جَعْفَرٍ (عَلَيْهِ السَّلاَم) فِي رَجُلٍ اغْتَسَلَ لإِحْرَامِهِ ثُمَّ قَلَّمَ أَظْفَارَهُ قَالَ يَمْسَحُهَا بِالْمَاءِ وَلا يُعِيدُ الْغُسْلَ.",
          "English Text": "6. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from Jamil ibn Darraj from certain persons of his people who has said the following: “About a man who takes Ghusl (bath) for Ihram then trims his fingernails, abu Ja‘far , has said, ‘He should wipe them with water and he is not required to take Ghusl (bath) again.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالحسن    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/252)"
          }
        }
      },
      "Chapter #79": {
        "Hadith #8": {
          "Title": "Al-Kafi - Volume 4: Matters Permissible in the State of al-’ Ihram after Shower, Such as Perfume, Hunting and Others Before Talbiyah (Here I am O Lord, to obey Your command)",
          "Link": "https://thaqalayn.net/hadith/4/3/79/8",
          "Arabic Text": "8ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَحَدِهِمَا (عَلَيْهِما السَّلاَم) فِي رَجُلٍ صَلَّى الظُّهْرَ فِي مَسْجِدِ الشَّجَرَةِ وَعَقَدَ الإِحْرَامَ ثُمَّ مَسَّ طِيباً أَوْ صَادَ صَيْداً أَوْ وَاقَعَ أَهْلَهُ قَالَ لَيْسَ عَلَيْهِ شَيْ‏ءٌ مَا لَمْ يُلَبِّ.",
          "English Text": "8. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from Ibn Abi ‘Umayr from Jamil ibn Darraj from certain persons of our people who have said the following: “I once asked one of the two Imam, (abu Ja’far or abu ‘Abd Allah), ‘Alayhim al-Salam, about a man who performs al-Zuhr in Masjid al-Shajarah, assumes the state of Ihram, then touches perfumes, or a prey or involves in sexual relation. He (the Imam) said, ‘There is nothing on him because of such things before his saying Talbiyah.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالحسن   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/255)"
          }
        }
      },
      "Chapter #81": {
        "Hadith #5": {
          "Title": "Al-Kafi - Volume 4: Chapter of al-Talbiyah (Here I am O Lord, to obey Your command)",
          "Link": "https://thaqalayn.net/hadith/4/3/81/5",
          "Arabic Text": "5ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ رَفَعَهُ قَالَ إِنَّ رَسُولَ الله (صلَّى اللهُ عَلَيْهِ وَآلِه) لَمَّا أَحْرَمَ أَتَاهُ جَبْرَئِيلُ (عَلَيْهِ السَّلاَم) فَقَالَ لَهُ مُرْ أَصْحَابَكَ بِالْعَجِّ وَالثَّجِّ وَالْعَجُّ رَفْعُ الصَّوْتِ بِالتَّلْبِيَةِ وَالثَّجُّ نَحْرُ الْبُدْنِ وَقَالَ قَالَ جَابِرُ بْنُ عَبْدِ الله مَا بَلَغْنَا الرَّوْحَاءَ حَتَّى بَحَّتْ أَصْوَاتُنَا.",
          "English Text": "5. Ali ibn Ibrahim has narrated from his father from Hammad from Hariz in a marfu‘ manner who has said the following: “He (the Imam) has said, ‘When the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, assumed the state of Ihram, then Jibril ‘Alayhi al-Salam, came to him. He said, “Instruct your followers to do al-‘Ajj and al-Thajj, meaning raising their voices with Talbiyah and offer camel as sacrificial offering.” Jabir ibn ‘Abd Allah has said that as soon as we arrived at al-Rawha, our voices became harsh.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/267)"
          }
        },
        "Hadith #8": {
          "Title": "Al-Kafi - Volume 4: Chapter of al-Talbiyah (Here I am O Lord, to obey Your command)",
          "Link": "https://thaqalayn.net/hadith/4/3/81/8",
          "Arabic Text": "8ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ الله عَنِ ابْنِ فَضَّالٍ عَنْ رِجَالٍ شَتَّى عَنْ أَبِي جَعْفَرٍ (عَلَيْهِ السَّلاَم) قَالَ قَالَ رَسُولُ الله (صلَّى اللهُ عَلَيْهِ وَآلِه) مَنْ لَبَّى فِي إِحْرَامِهِ سَبْعِينَ مَرَّةً إِيمَاناً وَاحْتِسَاباً أَشْهَدَ الله لَهُ أَلْفَ أَلْفِ مَلَكٍ بِبَرَاءَةٍ مِنَ النَّارِ وَبَرَاءَةٍ مِنَ النِّفَاقِ. ",
          "English Text": "8. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from ibn Faddal from many men who have said the following: “Abu Ja‘far , has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has stated this Hadith. ‘Whoever says Talbiyah seventy times out of belief and considering it a good deed Allah makes a million angels to bear witness to his freedom from the fire and hypocrisy.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " كالموثق   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/268)"
          }
        }
      },
      "Chapter #83": {
        "Hadith #9": {
          "Title": "Al-Kafi - Volume 4: The Dress in the State of al-Thram and Detestable Dress in Such State",
          "Link": "https://thaqalayn.net/hadith/4/3/83/9",
          "Arabic Text": "9ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ لا تَلْبَسْ ثَوْباً لَهُ أَزْرَارٌ وَأَنْتَ مُحْرِمٌ إِلاَّ أَنْ تَنْكُسَهُ وَلا ثَوْباً تَدَرَّعُهُ وَلا سَرَاوِيلَ إِلاَّ أَنْ لا يَكُونَ لَكَ إِزَارٌ وَلا خُفَّيْنِ إِلاَّ أَنْ لا يَكُونَ لَكَ نَعْلانِ قَالَ وَسَأَلْتُهُ عَنِ الْمُحْرِمِ يُقَارِنُ بَيْنَ ثِيَابِهِ الَّتِي أَحْرَمَ فِيهَا وَغَيْرِهَا قَالَ لا بَأْسَ بِذَلِكَ إِذَا كَانَتْ طَاهِرَةً.",
          "English Text": "9. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from Hammad from af-Halabiy who has said the following: “I once asked abu ‘Abd Allah , about the cloths that one wears in the state of Ihram if it is two pieces. He (the Imam) said, ‘Yes, and three pieces to protect himself against heat and cold if he wants . ‘“ ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " سكت عنه  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/281)"
          }
        }
      },
      "Chapter #85": {
        "Hadith #8": {
          "Title": "Al-Kafi - Volume 4: Kinds of Dresses and Ornaments Permissible or Detestable for a Female Pilgrim in the State of al-’ Ihram",
          "Link": "https://thaqalayn.net/hadith/4/3/85/8",
          "Arabic Text": "8ـ حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ إِسْمَاعِيلَ بْنِ الْفَضْلِ قَالَ سَأَلْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلاَم) عَنِ الْمَرْأَةِ هَلْ تَصْلُحُ لَهَا أَنْ تَلْبَسَ ثَوْباً حَرِيراً وَهِيَ مُحْرِمَةٌ قَالَ لا وَلَهَا أَنْ تَلْبَسَهُ فِي غَيْرِ إِحْرَامِهَا.",
          "English Text": "8. Humayd ibn Ziyad has narrated from al-Hassan ibn Sama‘ah from more than one person from Aban ibn ‘Uthman from ‘Isma‘il ibn al-Fadl who has said the following: “I once asked abu ‘Abd Allah , about the case of a woman if she can use silk clothes in the state of Ihram. He (the Imam) said, ‘No, but she can use them in times other than her being in the state of Ihram.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " كالموثق  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/293)"
          }
        },
        "Hadith #11": {
          "Title": "Al-Kafi - Volume 4: Kinds of Dresses and Ornaments Permissible or Detestable for a Female Pilgrim in the State of al-’ Ihram",
          "Link": "https://thaqalayn.net/hadith/4/3/85/11",
          "Arabic Text": "11ـ حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانٍ عَنْ مُحَمَّدٍ الْحَلَبِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلاَم) عَنِ الْمَرْأَةِ إِذَا أَحْرَمَتْ أَ تَلْبَسُ السَّرَاوِيلَ قَالَ نَعَمْ إِنَّمَا تُرِيدُ بِذَلِكَ السُّتْرَةَ. ",
          "English Text": "11. Humayd ibn Ziyad has narrated from ibn Sama‘ah from more than one person from Aban ibn ‘Uthman from al-Halabiy who has said the following: “I once asked abu ‘Abd Allah , about the case of a woman who is in the state of Ihram: if she can wear trousers. He (the Imam) said, ‘Yes, she can do so because she needs it for covering.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالموثق    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/293)"
          }
        }
      },
      "Chapter #86": {
        "Hadith #6": {
          "Title": "Al-Kafi - Volume 4: The Case of Dresses not Permissible to Use in the State of al-’Ihram, but a Pilgrim Faces an Emergency Condition",
          "Link": "https://thaqalayn.net/hadith/4/3/86/6",
          "Arabic Text": "6ـ حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانٍ عَنْ عَبْدِ الرَّحْمَنِ عَنْ حُمْرَانَ عَنْ أَبِي جَعْفَرٍ (عَلَيْهِ السَّلاَم) قَالَ الْمُحْرِمُ يَلْبَسُ السَّرَاوِيلَ إِذَا لَمْ يَكُنْ مَعَهُ إِزَارٌ وَيَلْبَسُ الْخُفَّيْنِ إِذَا لَمْ يَكُنْ مَعَهُ نَعْلٌ. ",
          "English Text": "6. Humayd ibn Ziyad has narrated from al-Hassan ibn Muhammad ibn Sama‘ah from more than one person from ‘Abd al-Rahman from Humran who has said the following: “Abu Ja’far , has said, ‘One in the state of Ihram can wear trousers if one does not find loincloth and al-Khuffayn (shoes) if one cannot find Na’l (sandals). ‘“(Fatwa best explains this Hadith) ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالموثق أو كالحسن   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/297)"
          }
        }
      },
      "Chapter #90": {
        "Hadith #11": {
          "Title": "Al-Kafi - Volume 4: Use of Shadow in the State of al-’Ihram",
          "Link": "https://thaqalayn.net/hadith/4/3/90/11",
          "Arabic Text": "11ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى الْحَلَبِيِّ عَنِ الْمُعَلَّى بْنِ خُنَيْسٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ لا يَسْتَتِرُ الْمُحْرِمُ مِنَ الشَّمْسِ بِثَوْبٍ وَلا بَأْسَ أَنْ يَسْتَتِرَ بَعْضَهُ بِبَعْضٍ.",
          "English Text": "11. A number of our people have narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Nadr ibn Suwayd from Yahya al-Halabiy from Mu ‘alia’ ibn Khunays who has said the following: “Abu ‘Abd Allah , has said, ‘A man in the state of Ihram must not cover himself from the sun with a cloth; but it is not harmful to cover one part by the other part of his body.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مختلف فيه   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/305)"
          }
        }
      },
      "Chapter #92": {
        "Hadith #11": {
          "Title": "Al-Kafi - Volume 4: Use of Perfumes in the State of al-’Ihram",
          "Link": "https://thaqalayn.net/hadith/4/3/92/11",
          "Arabic Text": "11ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى بْنِ عِمْرَانَ الْحَلَبِيِّ عَنِ الْمُعَلَّى أَبِي عُثْمَانَ عَنْ مُعَلَّى بْنِ خُنَيْسٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ كُرِهَ أَنْ يَنَامَ الْمُحْرِمُ عَلَى فِرَاشٍ أَصْفَرَ أَوْ عَلَى مِرْفَقَةٍ صَفْرَاءَ.",
          "English Text": "11. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan from ‘Abd Allah ibn Sinan who has said the following: “Abu ‘Abd Allah , has said, ‘You must not touch any fragrance while you are in the state of Ihram, or anything in which there is saffron, and do not taste any food with saffron in it.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مختلف فيه    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/311)"
          }
        },
        "Hadith #16": {
          "Title": "Al-Kafi - Volume 4: Use of Perfumes in the State of al-’Ihram",
          "Link": "https://thaqalayn.net/hadith/4/3/92/16",
          "Arabic Text": "16ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْعَبَّاسِ بْنِ مَعْرُوفٍ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ قَالَ سَأَلْتُ ابْنَ أَبِي عُمَيْرٍ عَنِ التُّفَّاحِ وَالأُتْرُجِّ وَالنَّبِقِ وَمَا طَابَ رِيحُهُ قَالَ تُمْسِكُ عَنْ شَمِّهِ وَتَأْكُلُهُ.",
          "English Text": "16. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ahmad ibn al-Hassan from ‘Amr ibn Sa‘id from Musaddiq ibn Sadaqah from ‘Ammar ibn Musa who has said the following: “I once asked abu ‘Abd Allah , about a man who is in the state of Ihram and eats citron. He (the Imam) said, ‘Yes, he can eat.’ I then said, ‘It has nice fragrance.’ He (the Imam) said, ‘Citron is food and it is not a fragrance.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " صحيح موقوف  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/312)"
          }
        }
      },
      "Chapter #94": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 4: Treatment of Patients in the State of al-’Ihram, Such as Wounds and So On",
          "Link": "https://thaqalayn.net/hadith/4/3/94/2",
          "Arabic Text": "2ـ عَلِيٌّ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَمَّنْ أَخْبَرَهُ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ مَرَّ رَسُولُ الله (صلَّى اللهُ عَلَيْهِ وَآلِه) عَلَى كَعْبِ بْنِ عُجْرَةَ وَالْقَمْلُ يَتَنَاثَرُ مِنْ رَأْسِهِ وَهُوَ مُحْرِمٌ فَقَالَ لَهُ أَ تُؤْذِيكَ هَوَامُّكَ فَقَالَ نَعَمْ فَأُنْزِلَتْ هَذِهِ الآيَةُ فَمَنْ كانَ مِنْكُمْ مَرِيضاً أَوْ بِهِ أَذىً مِنْ رَأْسِهِ فَفِدْيَةٌ مِنْ صِيامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍ فَأَمَرَهُ رَسُولُ الله (صلَّى اللهُ عَلَيْهِ وَآلِه) أَنْ يَحْلِقَ وَجَعَلَ الصِّيَامَ ثَلاثَةَ أَيَّامٍ وَالصَّدَقَةَ عَلَى سِتَّةِ مَسَاكِينَ لِكُلِّ مِسْكِينٍ مُدَّيْنِ وَالنُّسُكَ شَاةً قَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلاَم) وَكُلُّ شَيْ‏ءٍ مِنَ الْقُرْآنِ أَوْ فَصَاحِبُهُ بِالْخِيَارِ يَخْتَارُ مَا شَاءَ وَكُلُّ شَيْ‏ءٍ مِنَ الْقُرْآنِ فَمَنْ لَمْ يَجِدْ كَذَا فَعَلَيْهِ كَذَا فَالأُولَى الْخِيَارُ.",
          "English Text": "2. Ali has narrated from his father from Hammad from Hariz from those who narrated to him who has said the following: “Abu ‘Abd Allah , has said, ‘The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, passed by Ka‘b ibn ‘Ujrah. Lice spread from his head and he was in the state of Ihram. He (the Messenger of Allah) asked, ‘Do your bugs annoy you?’ He replied, ‘Yes, they annoy me.’ This verse of al-Quran was then revealed. ‘Those of you who become ill or find annoyance in their head expiate it by fasting or charity or an act of worship.’ (2:195) The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, commanded him to shave his head and made the fasting to be three days, charity to six destitute people two mud (a certain measurement) for each one and one sheep as an act of worship.’ Abu ‘Abd Allah , has said, ‘Wherever in al-Quran it is ‘or’ it is a reference to one’s having the choice to do what he likes, and wherever in al-Quran it says, ‘if one does not find then so and so’, then the first preference is one’s having the choice.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل معتبر   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/316)"
          }
        }
      },
      "Chapter #95": {
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 4: The Case of Drawing Blood, Cutting Nails or Hair while in the Sate of al-’ Ihram",
          "Link": "https://thaqalayn.net/hadith/4/3/95/4",
          "Arabic Text": "4ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَمَّنْ أَخْبَرَهُ عَنْ أَبِي جَعْفَرٍ (عَلَيْهِ السَّلاَم) فِي مُحْرِمٍ قَلَّمَ ظُفُراً قَالَ يَتَصَدَّقُ بِكَفٍّ مِنْ طَعَامٍ قَالَ ظُفُرَيْنِ قَالَ كَفَّيْنِ قُلْتُ ثَلاثَةً قَالَ ثَلاثَةِ أَكُفٍّ قُلْتُ أَرْبَعَةً قَالَ أَرْبَعَةِ أَكُفٍّ قُلْتُ خَمْسَةً قَالَ عَلَيْهِ دَمٌ يُهَرِيقُهُ فَإِنْ قَصَّ عَشَرَةً أَوْ أَكْثَرَ مِنْ ذَلِكَ فَلَيْسَ عَلَيْهِ إِلاَّ دَمٌ يُهَرِيقُهُ.",
          "English Text": "4. Ali ibn Ibrahim has narrated from his father from Hammad from Hariz from those who narrated to him who has said the following: “I once asked abu Ja‘far , about a man who in the state of Ihram cuts his nails. He (the Imam) said, ‘He must give one handfuls (one meal) of food as charity, two handfuls of food for cutting two nails, three handful of food for cutting three nails, four handfuls of food for cutting four nails, and one animal to be slaughtered as offering for cutting five nails. If one cuts ten or more nails he is required to offer only one animal as offering.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل معتبر    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/321)"
          }
        }
      },
      "Chapter #97": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 4: Things, Which Can Be Killed, and the Obligatory Expiation for It",
          "Link": "https://thaqalayn.net/hadith/4/3/97/1",
          "Arabic Text": "1ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَمَّنْ أَخْبَرَهُ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ كُلُّ مَا خَافَ الْمُحْرِمُ عَلَى نَفْسِهِ مِنَ السِّبَاعِ وَالْحَيَّاتِ وَغَيْرِهَا فَلْيَقْتُلْهُ فَإِنْ لَمْ يُرِدْكَ فَلا تُرِدْهُ.",
          "English Text": "1. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Hariz from those who narrated to him who has said the following: “Abu ‘ Abd Allah , has said, ‘If one in the state of Ihram is afraid of beasts or snakes and so on, one can kill them, however, if they do not attack, one must not attack them.”’ ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل معتب ر   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/325)"
          }
        }
      },
      "Chapter #99": {
        "Hadith #7": {
          "Title": "Al-Kafi - Volume 4: Disciplines to Maintain in the State of al-’Ihram",
          "Link": "https://thaqalayn.net/hadith/4/3/99/7",
          "Arabic Text": "7ـ حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانٍ عَنْ زُرَارَةَ قَالَ سَأَلْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلاَم) هَلْ يَحُكُّ الْمُحْرِمُ رَأْسَهُ وَيَغْتَسِلُ بِالْمَاءِ قَالَ يَحُكُّ رَأْسَهُ مَا لَمْ يَتَعَمَّدْ قَتْلَ دَابَّةٍ وَلا بَأْسَ بِأَنْ يَغْتَسِلَ بِالْمَاءِ وَيَصُبَّ عَلَى رَأْسِهِ مَا لَمْ يَكُنْ مُلَبِّداً فَإِنْ كَانَ مُلَبِّداً فَلا يُفِيضُ عَلَى رَأْسِهِ الْمَاءَ إِلاَّ مِنَ الاحْتِلامِ.",
          "English Text": "7. Humayd ibn Ziyad has narrated from ibn Sama‘ah from more than one person from Aban from Zurarah who has said the following: “I once asked abu ‘Abd Allah , about a man who is in the state of Ihram; if he can scratch his head and wash it with water. He (the Imam) said, ‘He can scratch his head as long as he is certain of not killing a moving thing but it is not harmful to wash with water unless one’s head is treated with talbid (a medicine against lice), in which case one must not pour water over his head except because of wet-dream.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالموثق    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/331)"
          }
        }
      },
      "Chapter #103": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 4: The Case of One Who Involves in Carnal Relations with His Wife Before Completing the Acts of His al-Hajj",
          "Link": "https://thaqalayn.net/hadith/4/3/103/2",
          "Arabic Text": "2ـ عَلِيٌّ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ أَبَانِ بْنِ عُثْمَانَ رَفَعَهُ إِلَى أَحَدِهِمَا (عَلَيْهِما السَّلاَم) قَالَ مَعْنَى يُفَرَّقُ بَيْنَهُمَا أَيْ لا يَخْلُوَانِ وَأَنْ يَكُونَ مَعَهُمَا ثَالِثٌ.",
          "English Text": "2. Ali has narrated from his father from Hammad from Aban ibn ‘Uthman in a marfu‘ manner who has said the following: “One of the two Imam, (abu Ja’far or abu ‘Abd Allah), ‘Alayhim al-Salam, has said, ‘The meaning of separating them is that they must not stay together without a third person being with them.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/348)"
          }
        }
      },
      "Chapter #104": {
        "Hadith #5": {
          "Title": "Al-Kafi - Volume 4: The Case of One Who Kisses His Wife or Looks at Her With or Without Lust, or Looks at Someone Else",
          "Link": "https://thaqalayn.net/hadith/4/3/104/5",
          "Arabic Text": "5ـ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ سَأَلْتُ أَبَا الْحَسَنِ (عَلَيْهِ السَّلاَم) عَنِ الْمُحْرِمِ يَعْبَثُ بِأَهْلِهِ حَتَّى يُمْنِيَ مِنْ غَيْرِ جِمَاعٍ أَوْ يَفْعَلُ ذَلِكَ فِي شَهْرِ رَمَضَانَ مَا ذَا عَلَيْهِمَا قَالَ عَلَيْهِمَا جَمِيعاً الْكَفَّارَةُ مِثْلُ مَا عَلَى الَّذِي يُجَامِعُ.",
          "English Text": "5. Muhammad ibn ‘Isma‘il has narrated from al-Fadl ibn Shadhan from Safwan from ‘Abd al-Rahman ibn al-Hajjaj who has said the following: “I once asked abu al-Hassan , about a man who is in the state of Ihram and plays with his wife until he discharges semen without intercourse; or if it is in the month of Ramadan what he will owe. He (the Imam) said, ‘There is kaffarah (expiation) on both of them just as for sexual intercourse.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول كالصحيح    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/354)"
          }
        },
        "Hadith #9": {
          "Title": "Al-Kafi - Volume 4: The Case of One Who Kisses His Wife or Looks at Her With or Without Lust, or Looks at Someone Else",
          "Link": "https://thaqalayn.net/hadith/4/3/104/9",
          "Arabic Text": "9ـ أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ النَّهْدِيِّ عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنِ الْحُسَيْنِ بْنِ حَمَّادٍ قَالَ سَأَلْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلاَم) عَنِ الْمُحْرِمِ يُقَبِّلُ أُمَّهُ قَالَ لا بَأْسَ هَذِهِ قُبْلَةُ رَحْمَةٍ إِنَّمَا يُكْرَهُ قُبْلَةُ الشَّهْوَةِ.",
          "English Text": "9. Ahmad ibn Muhammad from has narrated from Muhammad ibn Ahmad al-Nahdiy from Muhammad ibn al-Walid from Aban ibn ‘Uthman from al-Husayn ibn Hammad who has said the following: “I once asked abu ‘Abd Allah , about a man who is in the state of Ihram and his mother kisses him. He (the Imam) said, ‘It is not harmful; it is a kiss of blessing, only kissing with lust is despised.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مختلف فيه   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/356)"
          }
        }
      },
      "Chapter #109": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 4: Expiation for Hunting Wild Animals in the State of al-’ Ihram",
          "Link": "https://thaqalayn.net/hadith/4/3/109/2",
          "Arabic Text": "2ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ مُحَمَّدٍ عَنْ دَاوُدَ الرَّقِّيِّ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) فِي الرَّجُلِ يَكُونُ عَلَيْهِ بَدَنَةٌ وَاجِبَةٌ فِي فِدَاءٍ قَالَ إِذَا لَمْ يَجِدْ بَدَنَةً فَسَبْعُ شِيَاهٍ فَإِنْ لَمْ يَقْدِرْ صَامَ ثَمَانِيَةَ عَشَرَ يَوْماً.",
          "English Text": "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Al-Husayn ibn Muhammad from Dawud al-Riqqiy who has said the following: “I once asked abu ‘Abd Allah , about a man who owes one badanah as obligatory ransom. He (the Imam) said, ‘If he cannot find one badanah, then it is seven sheep; and if he cannot afford then he must fast for eighteen days.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مختلف فيه    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/371)"
          }
        },
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 4: Expiation for Hunting Wild Animals in the State of al-’ Ihram",
          "Link": "https://thaqalayn.net/hadith/4/3/109/3",
          "Arabic Text": "3ـ أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) فِي قَوْلِ الله عَزَّ وَجَلَّ أَوْ عَدْلُ ذلِكَ صِياماً قَالَ يُثَمِّنُ قِيمَةَ الْهَدْيِ طَعَاماً ثُمَّ يَصُومُ لِكُلِّ مُدٍّ يَوْماً فَإِذَا زَادَتِ الأَمْدَادُ عَلَى شَهْرَيْنِ فَلَيْسَ عَلَيْهِ أَكْثَرُ مِنْهُ.",
          "English Text": "3. Ahmad ibn Muhammad has narrated from al-Hassan ibn Ali ibn Faddal from ibn Bukayr from certain persons of our people who has said the following: “This is about the words of Allah, most Majestic, most Glorious, ‘. . . or equivalent of it fasting.’ (5:95) Abu ‘Abd Allah , has said, ‘The offering animal is evaluated with food stuff, then for every mud (a certain measurement) he fasts one day. If the number of mud (a certain measurement) is above the number of days in two months, more than two months fasting is not obligatory on him.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالموثق    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/372)"
          }
        },
        "Hadith #5": {
          "Title": "Al-Kafi - Volume 4: Expiation for Hunting Wild Animals in the State of al-’ Ihram",
          "Link": "https://thaqalayn.net/hadith/4/3/109/5",
          "Arabic Text": "5ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) فِي مُحْرِمٍ قَتَلَ نَعَامَةً قَالَ عَلَيْهِ بَدَنَةٌ فَإِنْ لَمْ يَجِدْ فَإِطْعَامُ سِتِّينَ مِسْكِيناً وَقَالَ إِنْ كَانَ قِيمَةُ الْبَدَنَةِ أَكْثَرَ مِنْ إِطْعَامِ سِتِّينَ مِسْكِيناً لَمْ يَزِدْ عَلَى إِطْعَامِ سِتِّينَ مِسْكِيناً وَإِنْ كَانَ قِيمَةُ الْبَدَنَةِ أَقَلَّ مِنْ إِطْعَامِ سِتِّينَ مِسْكِيناً لَمْ يَكُنْ عَلَيْهِ إِلاَّ قِيمَةُ الْبَدَنَةِ.",
          "English Text": "5. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from Jamil from certain persons of our people who has said the following: “About a man who in the state of Ihram kills an ostrich, abu ‘Abd Allah , has said, ‘He must pay one badanah; if he cannot afford then he must feed sixty destitute people.’ He (the Imam) said, ‘If the value of badanah is more than feeding sixty destitute people, it is not obligatory to feed more than sixty; if its value is less than the cost of feeding sixty destitute, he only owes the value of badanah.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالحسن  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/372)"
          }
        }
      },
      "Chapter #112": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 4: The Differences in Hunting on Land and in the Sea and Lawful Hunting in the State of al-’ Ihram",
          "Link": "https://thaqalayn.net/hadith/4/3/112/1",
          "Arabic Text": "1ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَمَّنْ أَخْبَرَهُ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ لا بَأْسَ بِأَنْ يَصِيدَ الْمُحْرِمُ السَّمَكَ وَيَأْكُلَ مَالِحَهُ وَطَرِيَّهُ وَيَتَزَوَّدَ وَقَالَ أُحِلَّ لَكُمْ صَيْدُ الْبَحْرِ وَطَعامُهُ مَتاعاً لَكُمْ قَالَ مَالِحُهُ الَّذِي يَأْكُلُونَ وَفَصْلُ مَا بَيْنَهُمَا كُلُّ طَيْرٍ يَكُونُ فِي الآجَامِ يَبِيضُ فِي الْبَرِّ وَيُفْرِخُ فِي الْبَرِّ فَهُوَ مِنْ صَيْدِ الْبَرِّ وَمَا كَانَ مِنْ صَيْدِ الْبَرِّ يَكُونُ فِي الْبَرِّ وَيَبِيضُ فِي الْبَحْرِ وَيُفْرِخُ فِي الْبَحْرِ فَهُوَ مِنْ صَيْدِ الْبَحْرِ.",
          "English Text": "1. Ali ibn Ibrahim has narrated from his father from Hammad from Hariz from those whom he has mentioned who has said the following: “Abu ‘ Abd Allah , has said, ‘It is not harmful to catch fish while one is in the state of Ihram and use it for food, regardless if it is salty or fresh. Allah, most Majestic, most Glorious, has said, “Hunting from the sea is made lawful for you and sea food is for your supplies.” (5:97) He (the Imam) has said, ‘The salty one is what you use for food. The difference in between is that every bird in the jungle that lays egg on land and hatches on land is of the hunting prey on land. Of the hunting subject on land those which lay eggs in the sea and hatch in the sea are of the objects of hunting from the sea.”’ ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالحسن   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/385)"
          }
        },
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 4: The Differences in Hunting on Land and in the Sea and Lawful Hunting in the State of al-’ Ihram",
          "Link": "https://thaqalayn.net/hadith/4/3/112/4",
          "Arabic Text": "4ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَمَّنْ أَخْبَرَهُ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) فِي مُحْرِمٍ قَتَلَ جَرَادَةً قَالَ يُطْعِمُ تَمْرَةً وَالتَّمْرَةُ خَيْرٌ مِنْ جَرَادَةٍ.",
          "English Text": "4. Ali ibn Ibrahim has narrated from his father from Hammad from Hariz from those whom he has mentioned who has said the following: “About a man who kills a locust while in the state of Ihram, abu ‘Abd Allah , has said, ‘He must feed a date (to a destitute person), even though a date is better than a locust.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالحسن   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/386)"
          }
        }
      },
      "Chapter #115": {
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 4: The Rare Ahadith",
          "Link": "https://thaqalayn.net/hadith/4/3/115/4",
          "Arabic Text": "4ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ رَفَعَهُ فِي قَوْلِهِ تَعَالَى تَنالُهُ أَيْدِيكُمْ وَرِماحُكُمْ قَالَ مَا تَنَالُهُ الأَيْدِي الْبَيْضُ وَالْفِرَاخُ وَمَا تَنَالُهُ الرِّمَاحُ فَهُوَ مَا لا تَصِلُ إِلَيْهِ الأَيْدِي.",
          "English Text": "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad in a mafu’ manner about the words of Allah, most High: “This is about the meaning of the words of Allah, most Majestic, most Glorious, ‘That which their hands and spears achieve.’ (5:95) He (the Imam) , has said what hands achieve is a reference to the eggs and chicks. ‘What your spears achieve’ is a reference to that which hands do not reach.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (17/394)"
          }
        },
        "Hadith #7": {
          "Title": "Al-Kafi - Volume 4: The Rare Ahadith",
          "Link": "https://thaqalayn.net/hadith/4/3/115/7",
          "Arabic Text": "7ـ مُحَمَّدُ بْنُ يَحْيَى رَفَعَهُ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) فِي رَجُلٍ أَكَلَ مِنْ لَحْمِ صَيْدٍ لا يَدْرِي مَا هُوَ وَهُوَ مُحْرِمٌ قَالَ عَلَيْهِ دَمُ شَاةٍ.",
          "English Text": "7. Muhammad ibn Yahya has narrated from in a marfu‘ manner the following: “About a man who in the state of Ihram eats of the flesh of a prey and does not know what it is, abu ‘Abd Allah , has said, ’He owes one sheep.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/395)"
          }
        }
      },
      "Chapter #116": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 4: Entering the Sacred Area",
          "Link": "https://thaqalayn.net/hadith/4/3/116/2",
          "Arabic Text": "2ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ صَالِحِ بْنِ السِّنْدِيِّ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حُسَيْنِ بْنِ الْمُخْتَارِ عَنْ أَبِي عُبَيْدَةَ قَالَ زَامَلْتُ أَبَا جَعْفَرٍ (عَلَيْهِ السَّلاَم) فِيمَا بَيْنَ مَكَّةَ وَالْمَدِينَةِ فَلَمَّا انْتَهَى إِلَى الْحَرَمِ اغْتَسَلَ وَأَخَذَ نَعْلَيْهِ بِيَدَيْهِ ثُمَّ مَشَى فِي الْحَرَمِ سَاعَةً. مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْحُسَيْنِ بْنِ الْمُخْتَارِ مِثْلَهُ.",
          "English Text": "2. Ali ibn Ibrahim has narrated from Salih ibn al-Sindiy from Hammad ibn ‘Isa from Husayn ibn al-Mukhtar from abu ‘Ubaydah who has said the following: “I once accompanied abu Ja‘far , during a journey between Makkah and al-Madinah. When he arrived in al-Haram (the sacred area), he took a shower, then took his shoes in his hand and walked into al-Haram (the sacred area) for an hour.” Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Ali ibn al-Hakam from al- Husayn ibn al-Mukhtar a similar Hadith. ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول وسنده الثاني موثق    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/5)"
          }
        }
      },
      "Chapter #118": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 4: Entering Makkah",
          "Link": "https://thaqalayn.net/hadith/4/3/118/2",
          "Arabic Text": "2ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ طَلْحَةَ بْنِ زَيْدٍ عَنْ جَعْفَرٍ عَنْ أَبِيهِ عَنْ عَلِيٍّ (عَلَيْهِ السَّلاَم) أَنَّهُ كَانَ إِذَا قَدِمَ مَكَّةَ بَدَأَ بِمَنْزِلِهِ قَبْلَ أَنْ يَطُوفَ.",
          "English Text": "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Yahya, from Talhah ibn Zayd from Ja’far from his father, recipients of divine supreme covenant, who has said the following: “’Amir al-Mu’minin , after arriving in Makkah, first, would go to his lodging before performing Tawaf.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف على المشهور وقد يعد موثقا   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/9)"
          }
        },
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 4: Entering Makkah",
          "Link": "https://thaqalayn.net/hadith/4/3/118/3",
          "Arabic Text": "3ـ حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ مُحَمَّدٍ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ الله قَالَ إِنَّ الله عَزَّ وَجَلَّ يَقُولُ فِي كِتَابِهِ وَطَهِّرْ بَيْتِيَ لِلطَّائِفِينَ وَالْقَائِمِينَ وَالرُّكَّعِ السُّجُودِ فَيَنْبَغِي لِلْعَبْدِ أَنْ لا يَدْخُلَ مَكَّةَ إِلاَّ وَهُوَ طَاهِرٌ قَدْ غَسَلَ عَرَقَهُ وَالأَذَى وَتَطَهَّرَ.",
          "English Text": "3. Humayd ibn Ziyad has narrated from ibn Sama‘ah from more than one person from Aban ibn ‘Uthman from Muhammad al-Halabiy who has said the following: “Abu ‘Abd Allah , has said that Allah, the Most Majestic, the Most Glorious, has said in His book, ‘Cleanse My house for those who perform Tawaf, and Ttikaf, those who do Ruku‘ and those who do Sajdah therein.’ (22:28) A servant (of Allah) should not enter Makkah without cleansing, washing his perspiration and so on and without purification.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالموثق    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/9)"
          }
        }
      },
      "Chapter #120": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 4: Prayers in Front of the Black Stone and During Touching the Same",
          "Link": "https://thaqalayn.net/hadith/4/3/120/3",
          "Arabic Text": "3ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَمَّنْ ذَكَرَهُ عَنْ أَبِي جَعْفَرٍ (عَلَيْهِ السَّلاَم) قَالَ إِذَا دَخَلْتَ الْمَسْجِدَ الْحَرَامَ وَحَاذَيْتَ الْحَجَرَ الأَسْوَدَ فَقُلْ أَشْهَدُ أَنْ لا إِلَهَ إِلاَّ الله وَحْدَهُ لا شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ آمَنْتُ بِالله وَكَفَرْتُ بِالطَّاغُوتِ وَبِاللاَّتِ وَالْعُزَّى وَبِعِبَادَةِ الشَّيْطَانِ وَبِعِبَادَةِ كُلِّ نِدٍّ يُدْعَى مِنْ دُونِ الله ثُمَّ ادْنُ مِنَ الْحَجَرِ وَاسْتَلِمْهُ بِيَمِينِكَ ثُمَّ تَقُولُ بِسْمِ الله وَالله أَكْبَرُ اللهمَّ أَمَانَتِي أَدَّيْتُهَا وَمِيثَاقِي تَعَاهَدْتُهُ لِتَشْهَدَ عِنْدَكَ لِي بِالْمُوَافَاةِ. ",
          "English Text": "3. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Hariz from those whom he has mentioned who has said the following: “Abu Ja’far , has said, ‘When you enter Masjid al-Haram (the Sacred Masjid) and are parallel with the Black Stone, say, “I testify that no one deserves worship except Allah, who is One and has no partners and I testify that Muhammad is His servant and His messenger. I have believed in the existence of Allah, and have rejected al-Taghut, al-Lat, al-‘Uzza’, worshipping Satan and worshipping anything that is considered similar to Allah.’ Then go near the Black Stone, touch it with your right hand and say, ‘In the name of Allah and Allah is great beyond description. O Allah, I have returned my trust and (I reaffirm) my covenant that I had undertaken, so bear witness for me before You to my standing up by my commitment and covenant.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالحسن  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/17)"
          }
        }
      },
      "Chapter #122": {
        "Hadith #6": {
          "Title": "Al-Kafi - Volume 4: The Crowded Situation Around the Black Stone",
          "Link": "https://thaqalayn.net/hadith/4/3/122/6",
          "Arabic Text": "6ـ حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ مُحَمَّدٍ الْحَلَبِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلاَم) عَنِ الْحَجَرِ إِذَا لَمْ أَسْتَطِعْ مَسَّهُ وَكَثُرَ الزِّحَامُ فَقَالَ أَمَّا الشَّيْخُ الْكَبِيرُ وَالضَّعِيفُ وَالْمَرِيضُ فَمُرَخَّصٌ وَمَا أُحِبُّ أَنْ تَدَعَ مَسَّهُ إِلاَّ أَنْ لا تَجِدَ بُدّاً.",
          "English Text": "6. Humayd ibn Ziyad has narrated from Sama‘ah from more than one person from Aban ibn ‘Uthman from Muhammad al-Halabiy who has said the following: “I once asked abu ‘Abd Allah , about the case of the Black Stone if one cannot touch it because of the crowd. He (the Imam) said, ‘Old people, the weak ones and those suffering from illness are excused. I do not like your ignoring to touch the Black Stone, unless you cannot find any opportunity to touch it.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالموثق  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/19)"
          }
        }
      },
      "Chapter #129": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 4: The Case of One Who Stands in Need of Something During Tawaf, or Something Affects Him",
          "Link": "https://thaqalayn.net/hadith/4/3/129/2",
          "Arabic Text": "2ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَحَدِهِمَا (عَلَيْهِما السَّلاَم) فِي الرَّجُلِ يُحْدِثُ فِي طَوَافِ الْفَرِيضَةِ وَقَدْ طَافَ بَعْضَهُ قَالَ يَخْرُجُ فَيَتَوَضَّأُ فَإِنْ كَانَ جَازَ النِّصْفَ بَنَى عَلَى طَوَافِهِ وَإِنْ كَانَ أَقَلَّ مِنَ النِّصْفِ أَعَادَ الطَّوَافَ.",
          "English Text": "2. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from certain persons of our people who has said the following: “One of the two Imam, (abu Ja’far or abu ‘Abd Allah), ‘Alayhim al-Salam, has said, if during obligatory Tawaf one’s wudu’ becomes invalid when he has performed a certain parts of Tawaf. he must take wudu’, and if he has performed more than half of Tawaf; he can continue from where he has left; but if what is performed is less than half he must perform Tawaf again.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " حسن وموافق للمشهور   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/33)"
          }
        }
      },
      "Chapter #135": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 4: The Case of One Who Commences al-Sa‘y Before Tawaf or Performs Tawaf but Delays al-Sa‘y",
          "Link": "https://thaqalayn.net/hadith/4/3/135/2",
          "Arabic Text": "2ـ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ مَنْصُورِ بْنِ حَازِمٍ قَالَ سَأَلْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلاَم) عَنْ رَجُلٍ طَافَ بَيْنَ الصَّفَا وَالْمَرْوَةِ قَبْلَ أَنْ يَطُوفَ بِالْبَيْتِ فَقَالَ يَطُوفُ بِالْبَيْتِ ثُمَّ يَعُودُ إِلَى الصَّفَا وَالْمَرْوَةِ فَيَطُوفُ بَيْنَهُمَا.",
          "English Text": "2. Muhammad ibn ‘Isma’il has narrated from al-Fadl ibn Shadhan from Safwan ibn Yahya from Mansur ibn Hazim who has said the following: “I once asked abu ‘Abd Allah , about a man who performs Tawaf (Sa‘y) between al- Safa’ and al-Marwah before Tawaf around the House. He (the Imam) said, ‘He must go back to perform Tawaf around the House, then return to perform Sa‘y between al-Safa’ and al-Marwah.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول كالصحيح   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/46)"
          }
        }
      },
      "Chapter #137": {
        "Hadith #6": {
          "Title": "Al-Kafi - Volume 4: Two Rak‘at salat (Prayer) after Tawaf; the Time for and Recitation of It and Prayers",
          "Link": "https://thaqalayn.net/hadith/4/3/137/6",
          "Arabic Text": "6ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ بَعْضِ أَصْحَابِنَا قَالَ قَالَ أَحَدُهُمَا (عَلَيْهِما السَّلاَم) يُصَلِّي الرَّجُلُ رَكْعَتَيِ الطَّوَافِ طَوَافِ الْفَرِيضَةِ وَالنَّافِلَةِ بِقُلْ هُوَ الله أَحَدٌ وَقُلْ يَا أَيُّهَا الْكَافِرُونَ.",
          "English Text": "6. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from Jamil ibn Darraj from certain persons of our people who has said the following: “One of the two Imam, (abu Ja’far or abu ‘Abd Allah), ‘Alayhim al-Salam, has said, ‘Man should perform the two Rak‘at Salat (prayer) after obligatory or optional Tawaf with Qul Huwa Allahu Ahad and Surah (Chapter) 109.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالحسن   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/53)"
          }
        }
      },
      "Chapter #138": {
        "Hadith #5": {
          "Title": "Al-Kafi - Volume 4: Mistakes During Two Rak‘at Salat (Prayer) After Tawaf",
          "Link": "https://thaqalayn.net/hadith/4/3/138/5",
          "Arabic Text": "5ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عِيسَى عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) أَنَّهُ قَالَ فِي رَجُلٍ طَافَ طَوَافَ الْفَرِيضَةِ وَنَسِيَ الرَّكْعَتَيْنِ حَتَّى طَافَ بَيْنَ الصَّفَا وَالْمَرْوَةِ قَالَ يُعَلِّمُ ذَلِكَ الْمَوْضِعَ ثُمَّ يَعُودُ فَيُصَلِّي الرَّكْعَتَيْنِ ثُمَّ يَعُودُ إِلَى مَكَانِهِ.",
          "English Text": "5. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from Hammad ibn ‘Isa from those whom he has mentioned who has said the following: “A man performs obligatory Tawaf but he forgets the two Rak‘at Salat (prayer) until his performing Tawaf (Sa‘y) between al-Safa’ and al-Marwah. Abu ‘Abd Allah , has said, ‘He must mark the place and then go back to perform the two Rak‘at and return to his place where he had left to complete it.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالحسن  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/55)"
          }
        }
      },
      "Chapter #142": {
        "Hadith #9": {
          "Title": "Al-Kafi - Volume 4: Sa‘y Between al-Safa’ and al-Marwah and the Prayers to Say",
          "Link": "https://thaqalayn.net/hadith/4/3/142/9",
          "Arabic Text": "9ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ مَالِكِ بْنِ عَطِيَّةَ عَنْ سَعِيدٍ الأَعْرَجِ قَالَ سَأَلْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلاَم) عَنْ رَجُلٍ تَرَكَ شَيْئاً مِنَ الرَّمَلِ فِي سَعْيِهِ بَيْنَ الصَّفَا وَالْمَرْوَةِ قَالَ لا شَيْ‏ءَ عَلَيْهِ وَرُوِيَ أَنَّ الْمَسْعَى كَانَ أَوْسَعَ مِمَّا هُوَ الْيَوْمَ وَلَكِنَّ النَّاسَ ضَيَّقُوهُ.",
          "English Text": "9. A number of our people have narrated from Ahmad ibn Muhammad from al-Hassan ibn Mahbub from Malik ibn ‘Atiyyah from Sa‘id al-’A‘raj who has said the following: “I once asked abu ‘Abd Allah , about a man who did not walk faster between the two signs during Sa‘y of al-Safa’ and al-Marwah. He (the Imam) replied, ‘It is not necessary for him to do anything.’ It is narrated that the area of “al-Mas‘a (the area for Sa‘y)’” was greater than it is today. People have reduced this area.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " صحيح وآخره مرسل   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/74)"
          }
        }
      },
      "Chapter #146": {
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 4: Taqsir (Trimming something from One’s Hair or Nails After Completing Sa‘y) of One Who Is for al-Hajj al-Tamattu‘ (advantageous) and Coming Out of the State of Ihram",
          "Link": "https://thaqalayn.net/hadith/4/3/146/4",
          "Arabic Text": "4ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ وَحَفْصِ بْنِ الْبَخْتَرِيِّ وَغَيْرِهِمَا عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) فِي مُحْرِمٍ يُقَصِّرُ مِنْ بَعْضٍ وَلا يُقَصِّرُ مِنْ بَعْضٍ قَالَ يُجْزِئُهُ.",
          "English Text": "4. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from Jamil ibn Darraj and Flafs ibn al-Bakhtariy and other than these two who has said the following: “About a man who performs Taqsir (cutting some hair or finger nails and so on) of certain parts but not of other parts, he (the Imam) said, ‘It is sufficient for him.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " حسنه الفضلء   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/80)"
          }
        }
      },
      "Chapter #149": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 4: The Limits of Time for Performing al-Hajj al-Tamattu",
          "Link": "https://thaqalayn.net/hadith/4/3/149/3",
          "Arabic Text": "3ـ أَحْمَدُ بْنُ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ بَعْضِ أَصْحَابِنَا أَنَّهُ سَأَلَ أَبَا عَبْدِ الله (عَلَيْهِ السَّلاَم) عَنِ الْمُتْعَةِ مَتَى تَكُونُ قَالَ يَتَمَتَّعُ مَا ظَنَّ أَنَّهُ يُدْرِكُ النَّاسَ بِمِنًى.",
          "English Text": "3. Ahmad ibn Muhammad has narrated from ibn Faddal from ibn Bukayr form certain persons of our people who have said the following: “I once asked abu ‘Abd Allah , about a man who is for al-Hajj al-Tamattu‘ (advantageous) when can he commence it? He (the Imam) said, ‘He can begin at a time within which he must have confidence to catch up with people in Mina.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالموثق  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/89)"
          }
        }
      },
      "Chapter #151": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 4: The Obligations of Woman Experiencing Menses During the Acts of Her al-Hajj",
          "Link": "https://thaqalayn.net/hadith/4/3/151/1",
          "Arabic Text": "1ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ أَبِي عُمَيْرٍ عَنْ حَفْصِ بْنِ الْبَخْتَرِيِّ عَنِ الْعَلاءِ بْنِ صَبِيحٍ وَعَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ وَعَلِيِّ بْنِ رِئَابٍ وَعَبْدِ الله بْنِ صَالِحٍ كُلُّهُمْ يَرْوُونَهُ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ الْمَرْأَةُ الْمُتَمَتِّعَةُ إِذَا قَدِمَتْ مَكَّةَ ثُمَّ حَاضَتْ تُقِيمُ مَا بَيْنَهَا وَبَيْنَ التَّرْوِيَةِ فَإِنْ طَهُرَتْ طَافَتْ بِالْبَيْتِ وَسَعَتْ بَيْنَ الصَّفَا وَالْمَرْوَةِ وَإِنْ لَمْ تَطْهُرْ إِلَى يَوْمِ التَّرْوِيَةِ اغْتَسَلَتْ وَاحْتَشَتْ ثُمَّ سَعَتْ بَيْنَ الصَّفَا وَالْمَرْوَةِ ثُمَّ خَرَجَتْ إِلَى مِنًى فَإِذَا قَضَتِ الْمَنَاسِكَ وَزَارَتِ الْبَيْتَ طَافَتْ بِالْبَيْتِ طَوَافاً لِعُمْرَتِهَا ثُمَّ طَافَتْ طَوَافاً لِلْحَجِّ ثُمَّ خَرَجَتْ فَسَعَتْ فَإِذَا فَعَلَتْ ذَلِكَ فَقَدْ أَحَلَّتْ مِنْ كُلِّ شَيْ‏ءٍ يُحِلُّ مِنْهُ الْمُحْرِمُ إِلاَّ فِرَاشَ زَوْجِهَا فَإِذَا طَافَتْ أُسْبُوعاً آخَرَ حَلَّ لَهَا فِرَاشُ زَوْجِهَا.",
          "English Text": "1. A number of our people have narrated from Ahmad ibn Muhammad from ibn ‘Isa form Muhammad Ibn Abi ‘Umayr Hafs ibn al- Bakhtariy from al-‘Ala’ ibn Sabih and ‘Abd al-Rahman ibn al-Hajjaj and Ali ibn Ri’ab and ‘Abd Allah ibn Salih all who has said the following: “Abu ‘Abd Allah , has said, ‘If a woman who is for al-Hajj al-Tamattu‘ (advantageous), enters Makkah and experiences Hayd (menses), she must wait until al-Tarwiyah (eight of Dhu al-Hajjah); if she becomes clean, she must perform Tawaf around the House and Sa‘y between al-Safa’ and al-Marwah. She must take Ghusl (bath), fill up with cotton. If she does not become clean until al-Tarwiyah (eight of Dhu al-Hajjah), then she performs Sa‘y between al-Safa’ and al-Marwah. Then she must go to Mina’ to complete the acts, perform Ziyarat of the House, perform Tawaf around the House, one Tawaf for her al-‘Umrah and then one Tawaf for her al-Hajj, then she must perform Sa‘y between al-Safa’ and al-Marwah. When she does this she comes out of the state of Ihram and all things unlawful for her in the state of Ihram become lawful for her except the bed of her husband, and when she performs another seven times Tawaf, the bed of her husband also becomes lawful for her.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " صحيح الفضلء    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/92)"
          }
        }
      },
      "Chapter #154": {
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 4: The Rare Ahadith",
          "Link": "https://thaqalayn.net/hadith/4/3/154/4",
          "Arabic Text": "4ـ حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ فُضَيْلِ بْنِ يَسَارٍ عَنْ أَبِي جَعْفَرٍ (عَلَيْهِ السَّلاَم) قَالَ إِذَا طَافَتِ الْمَرْأَةُ طَوَافَ النِّسَاءِ وَطَافَتْ أَكْثَرَ مِنَ النِّصْفِ فَحَاضَتْ نَفَرَتْ إِنْ شَاءَتْ.",
          "English Text": "4. Humayd ibn Ziyad has narrated from ibn Sama‘ah from more than one person from Aban ibn ‘Uthman from Fudayl ibn Yasar who has said the following: “Abu Ja‘far , has said, ‘If a woman has performed Tawaf al-Nisa’, more than half of it, then begins experiencing Hayd (menses), she can leave if she wanted.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالموثق   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/101)"
          }
        }
      },
      "Chapter #161": {
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 4: Leaving for Mina",
          "Link": "https://thaqalayn.net/hadith/4/3/161/4",
          "Arabic Text": "4ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ إِذَا تَوَجَّهْتَ إِلَى مِنًى فَقُلِ اللهمَّ إِيَّاكَ أَرْجُو وَإِيَّاكَ أَدْعُو فَبَلِّغْنِي أَمَلِي وَأَصْلِحْ لِي عَمَلِي. ",
          "English Text": "4. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from Mu‘awiyah ibn ‘Ammar who has said the following: “Abu ‘Abd Allah , has said, ‘When you are ready to move toward Mina 5 then say, ‘O Lord, before You I place my hopes and before You I appeal, to lead me toward what I hope to achieve and make my deeds useful.’”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " سكت عنه   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/116)"
          }
        }
      },
      "Chapter #163": {
        "Hadith #5": {
          "Title": "Al-Kafi - Volume 4: Departure from Mina to ‘Arafat and Its Boundaries",
          "Link": "https://thaqalayn.net/hadith/4/3/163/5",
          "Arabic Text": "5ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَفْصِ بْنِ الْبَخْتَرِيِّ وَهِشَامِ بْنِ الْحَكَمِ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) أَنَّهُ قِيلَ لَهُ أَيُّمَا أَفْضَلُ الْحَرَمُ أَوْ عَرَفَةُ فَقَالَ الْحَرَمُ فَقِيلَ وَكَيْفَ لَمْ تَكُنْ عَرَفَاتٌ فِي الْحَرَمِ فَقَالَ هَكَذَا جَعَلَهَا الله عَزَّ وَجَلَّ.",
          "English Text": "5. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from Hafs ibn al-Bakhtariy and Hisham ibn al-Hakam who has said the following: “Abu ‘Abd Allah , was asked, ‘Is ‘Arafat, more important or al-Haram (the sacred area)?’ He (the Imam) said, ‘Al-Haram (the sacred area) is more important.’ It was asked, ‘Why is ‘Arafat not in al-Haram (the sacred area)?’ He (the Imam) said, ‘This is how Allah, most Majestic, most Glorious, has made it.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " حسن الفضلء    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/119)"
          }
        }
      },
      "Chapter #169": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 4: The Case of One Who Does Not Know About Staying in Al-Mash‘ar",
          "Link": "https://thaqalayn.net/hadith/4/3/169/3",
          "Arabic Text": "3ـ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ قُلْتُ لأَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) مَا تَقُولُ فِي رَجُلٍ أَفَاضَ مِنْ عَرَفَاتٍ فَأَتَى مِنًى قَالَ فَلْيَرْجِعْ فَيَأْتِي جَمْعاً فَيَقِفُ بِهَا وَإِنْ كَانَ النَّاسُ قَدْ أَفَاضُوا مِنْ جَمْعٍ.",
          "English Text": "3. Muhammad ibn ‘Isma’il has narrated from al-Fadl ibn Shadhan from Safwan ibn Yahya Mu‘awiyah ibn ‘Ammar who has said the following: “I once asked abu ‘Abd Allah , about a man who leaves ‘Arafat and comes to Mina 5 . He (the Imam) said, ‘He must go back to al-Jam‘ (place of assembly) to stay there even if all people may have already left al-Jam‘ (place of assembly ). ‘“ ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول كالصحيح   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/133)"
          }
        }
      },
      "Chapter #170": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 4: The Case of One Who Departs Al-Muzdalifah In Haste Before Dawn",
          "Link": "https://thaqalayn.net/hadith/4/3/170/3",
          "Arabic Text": "3ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَحَدِهِمَا (عَلَيْهِما السَّلاَم) قَالَ لا بَأْسَ بِأَنْ يُفِيضَ الرَّجُلُ بِلَيْلٍ إِذَا كَانَ خَائِفاً.",
          "English Text": "3. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from Jamil ibn Darraj from certain persons of our people who has said the following: “One of the two Imam, (abu Ja’far or abu ‘Abd Allah), ‘Alayhim al-Salam, has said ‘It is not harmful for a man who is afraid to leave during the night.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالحسن    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/136)"
          }
        }
      },
      "Chapter #171": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 4: The Case of One Who Misses Al-Hajj",
          "Link": "https://thaqalayn.net/hadith/4/3/171/1",
          "Arabic Text": "عدة من أصحابنا، عن أحمد بن محمد، وسهل بن زياد، عن الحسن بن محبوب عن داود الرقي قال: كنت مع أبي عبدالله عليه السلام بمنى إذا جاء رجل فقال: إن قوما قدموا يوم النحر وقد فاتهم الحج فقال: نسأل الله العافية وأرى أن يهريق كل واحد منهم دم شاة ويحلون وعليهم الحج من قابل إن انصرفوا إلى بلادهم وإن أقاموا حتى تمضي أيام التشريق بمكة ثم يخرجوا إلى وقت أهل مكة وأحرموا منه و اعتمروا فليس عليهم الحج من قابل.",
          "English Text": "1. A number of our people have narrated from Ahmad ibn Muhammad from and Sahl ibn Ziyad from al-Hassan ibn Mahbub from Dawud al-Riqqiy who has said the following: “Once I was with abu ‘ Abd Allah , in Mina 5 when a man came and asked about a people who arrived on the day of al-Nahr (slaughtering the offering) and they had missed their Hajj. He (the Imam) said, ‘We ask well-being from Allah and I say that every one of them must slaughter one sheep and come out of the state of Ihram. They owe Hajj in future if they go home. If they wait in Makkah until the days of Tashriq (11, 12 and 13 of Dhu al-Hajjah) are over, then go out to Miqat (place for assuming the state of Ihram) of the people of Makkah, assume the state of Ihram to perform al-‘Umrah, then they will not owe any Hajj in future. ‘“",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مختلف فيه   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/137)"
          }
        }
      },
      "Chapter #181": {
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 4: Preferable Matters About offering Sacrifice, Permissible and Non-Permissible Matters",
          "Link": "https://thaqalayn.net/hadith/4/3/181/4",
          "Arabic Text": "4ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ قَالَ حَدَّثَنِي مَنْ سَمِعَهُ يَقُولُ ضَحِّ بِكَبْشٍ أَسْوَدَ أَقْرَنَ فَحْلٍ فَإِنْ لَمْ تَجِدْ أَسْوَدَ فَأَقْرَنُ فَحْلٌ يَأْكُلُ فِي سَوَادٍ وَيَشْرَبُ فِي سَوَادٍ وَيَنْظُرُ فِي سَوَادٍ.",
          "English Text": "4. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from Hammad from al-Halabiy who has said the following: “Al-Halabiy has said that narrated to him, the one who had heard from him (the Imam) ‘Alayhi al- Salam, say, ‘You must slaughter as offering a black ram that has horns and if you cannot find a black ram, then find one that has black eyes and mouth.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالحسن  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/162)"
          }
        },
        "Hadith #8": {
          "Title": "Al-Kafi - Volume 4: Preferable Matters About offering Sacrifice, Permissible and Non-Permissible Matters",
          "Link": "https://thaqalayn.net/hadith/4/3/181/8",
          "Arabic Text": "8ـ أَبَانٌ عَنْ عَبْدِ الرَّحْمَنِ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) أَنَّهُ قَالَ الْكَبْشُ فِي أَرْضِكُمْ أَفْضَلُ مِنَ الْجَزُورِ.",
          "English Text": "8. Aban has narrated from ‘Abd al- Rahman who has said the following: “Abu ‘Abd Allah , has said, ‘In your land a ram is more preferred than al-Jazur (camel).”’ ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالموثق   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/165)"
          }
        }
      },
      "Chapter #183": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 4: The Case of Sacrificial Animal Destroyed Before Offering and Using Its Meat for Food",
          "Link": "https://thaqalayn.net/hadith/4/3/183/1",
          "Arabic Text": "1ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَمَّنْ أَخْبَرَهُ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ كُلُّ مَنْ سَاقَ هَدْياً تَطَوُّعاً فَعَطِبَ هَدْيُهُ فَلا شَيْ‏ءَ عَلَيْهِ يَنْحَرُهُ وَيَأْخُذُ نَعْلَ التَّقْلِيدِ فَيَغْمِسُهَا فِي الدَّمِ وَيَضْرِبُ بِهِ صَفْحَةَ سَنَامِهِ وَلا بَدَلَ عَلَيْهِ وَمَا كَانَ مِنْ جَزَاءِ صَيْدٍ أَوْ نَذْرٍ فَعَطِبَ فَعَلَ مِثْلَ ذَلِكَ وَعَلَيْهِ الْبَدَلُ وَكُلُّ شَيْ‏ءٍ إِذَا دَخَلَ الْحَرَمَ فَعَطِبَ فَلا بَدَلَ عَلَى صَاحِبِهِ تَطَوُّعاً أَوْ غَيْرَهُ.",
          "English Text": "1. Ali ibn Ibrahim has narrated from his father from Hammad from Hariz from those who narrated to him who has said the following: “Abu ‘Abd Allah , has said, ‘Whoever drives an offering animal optionally and it is damaged, he is not obligated for anything in this matter. He slaughters it and takes away the shove off its neck, stains it with blood, applies against its hump and he does not owe any replacement for it. Any offering animal, which is as expiation and penalty because of hunting or a vow and becomes damaged, he must do with it as the case above but he owes its replacement. Everything that enters al-Haram (the sacred area) and becomes damaged, the owner does not owe any replacement for it, regardless of being optional or otherwise.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالحسن  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/170)"
          }
        }
      },
      "Chapter #185": {
        "Hadith #8": {
          "Title": "Al-Kafi - Volume 4: Manner of Slaughtering",
          "Link": "https://thaqalayn.net/hadith/4/3/185/8",
          "Arabic Text": "8ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي هَاشِمٍ الْبَجَلِيِّ عَنْ أَبِي خَدِيجَةَ قَالَ رَأَيْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلاَم) وَهُوَ يَنْحَرُ بَدَنَتَهُ مَعْقُولَةً يَدُهَا الْيُسْرَى ثُمَّ يَقُومُ مِنْ جَانِبِ يَدِهَا الْيُمْنَى وَيَقُولُ بِسْمِ الله وَالله أَكْبَرُ اللهمَّ هَذَا مِنْكَ وَلَكَ اللهمَّ تَقَبَّلْهُ مِنِّي ثُمَّ يَطْعُنُ فِي لَبَّتِهَا ثُمَّ يُخْرِجُ السِّكِّينَ بِيَدِهِ فَإِذَا وَجَبَتْ قَطَعَ مَوْضِعَ الذَّبْحِ بِيَدِهِ. ",
          "English Text": "8. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from ‘Abd al-Rahman ibn abu al-Hashim al-Bajaliy from abu Khadijah who has said the following: “I saw abu ‘Abd Allah , slaughtering a badanah with its left front leg tied down. He (the Imam) then stood up on the right side and said, ‘In the name of Allah, Allah is greater than can be described. O Lord, this is from You and for You. O Lord, accept it from me.’ He (the Imam) then caused a cut in the upper part of its chest. He (the Imam) then took out the knife with his hand. When it was on the ground he (the Imam) made a cut in the place for Dhabh.” NOTE: Fatwa best explains the following Chapters. ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مختلف فيه  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/179)"
          }
        }
      },
      "Chapter #186": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 4: Using the Meat of the Offering for Food, Giving as Charity and Taking Out of Mina",
          "Link": "https://thaqalayn.net/hadith/4/3/186/2",
          "Arabic Text": "2ـ حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ الله عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) فِي قَوْلِ الله تَعَالَى فَإِذا وَجَبَتْ جُنُوبُها قَالَ إِذَا وَقَعَتْ عَلَى الأَرْضِ فَكُلُوا مِنْها وَأَطْعِمُوا الْقانِعَ وَالْمُعْتَرَّ قَالَ الْقَانِعُ الَّذِي يَرْضَى بِمَا أَعْطَيْتَهُ وَلا يَسْخَطُ وَلا يَكْلَحُ وَلا يَلْوِي شِدْقَهُ غَضَباً وَالْمُعْتَرُّ الْمَارُّ بِكَ لِتُطْعِمَهُ.",
          "English Text": "2. Humayd ibn Ziyad has narrated from ibn Sama‘ah from more than one person from Aban ibn ‘Uthman from ‘Abd al-Rahman ibn abu ‘Abd Allah who has said the following: “This is about the words of Allah, most Majestic, most Glorious, ‘When their sides reach the ground.’ (22:36) Abu ‘Abd Allah , has said that it means when they fall on the ground. ‘. . . use it for food and feed thereof to those contented and those who ask.’ (22:36) He (the Imam) said that al-Qani‘ are those who become gratified, do not become angry, frown or twist the corner of their mouths out of anger and al-Mu‘tar is one who passes by so you feed him.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالموثق   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/180)"
          }
        }
      },
      "Chapter #187": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 4: The Hide of the Offering Animals",
          "Link": "https://thaqalayn.net/hadith/4/3/187/2",
          "Arabic Text": "2ـ وَفِي رِوَايَةِ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ يُنْتَفَعُ بِجِلْدِ الأُضْحِيَّةِ وَيُشْتَرَى بِهِ الْمَتَاعُ وَإِنْ تُصُدِّقَ بِهِ فَهُوَ أَفْضَلُ وَقَالَ نَحَرَ رَسُولُ الله (صلَّى اللهُ عَلَيْهِ وَآلِه) بَدَنَةً وَلَمْ يُعْطِ الْجَزَّارِينَ جُلُودَهَا وَلا قَلائِدَهَا وَلا جِلالَهَا وَلَكِنْ تَصَدَّقَ بِهِ وَلا تُعْطِ السَّلاَّخَ مِنْهَا شَيْئاً وَلَكِنْ أَعْطِهِ مِنْ غَيْرِ ذَلِكَ. ",
          "English Text": "2. In the narration of Mu’awiyah ibn ‘Ammar from abu ‘Abd Allah , it is said that the hide of animal for offering can be used for beneficial purposes or purchase thereby goods, but to give them as charity is better. He (the Imam) said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, slaughtered a badanah and did not give its hide to butchers or the decorative items but gave them as charity. You must not give the hide to those who skin animals, but give them from other things.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل ، حسن كالصحيح  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/184)"
          }
        }
      },
      "Chapter #188": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 4: Shaving and Trimming One’s Nails or Hair",
          "Link": "https://thaqalayn.net/hadith/4/3/188/3",
          "Arabic Text": "3ـ حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ الله عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ كَانَ رَسُولُ الله (صلَّى اللهُ عَلَيْهِ وَآلِه) يَوْمَ النَّحْرِ يَحْلِقُ رَأْسَهُ وَيُقَلِّمُ أَظْفَارَهُ وَيَأْخُذُ مِنْ شَارِبِهِ وَمِنْ أَطْرَافِ لِحْيَتِهِ.",
          "English Text": "3. Humayd ibn Ziyad has narrated from ibn Sama‘ah from more than one person from Aban ibn ‘Uthman from ‘Abd al-Rahman ibn abu ‘Abd Allah who has said the following: “Abu ‘Abd Allah , has said, ‘The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, on the day of al-Nahr (slaughtering the offering, 10th of Dhu al-Hajjah) shaved his head, cut his finger nails, trimmed his mustache and the sides (edges) of his beard.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالموثق   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/185)"
          }
        }
      },
      "Chapter #190": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 4: The Prohibited Matters that Become Lawful for One after Shaving and Before Performing Tawaf of Ziyarat",
          "Link": "https://thaqalayn.net/hadith/4/3/190/3",
          "Arabic Text": "3ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ يَقْطِينٍ عَنْ يُونُسَ مَوْلَى عَلِيٍّ عَنْ أَبِي أَيُّوبَ الْخَزَّازِ قَالَ رَأَيْتُ أَبَا الْحَسَنِ (عَلَيْهِ السَّلاَم) بَعْدَ مَا ذَبَحَ حَلَقَ ثُمَّ ضَمَّدَ رَأْسَهُ بِمِسْكٍ وَزَارَ الْبَيْتَ وَعَلَيْهِ قَمِيصٌ وَكَانَ مُتَمَتِّعاً. عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ يُونُسَ عَنْ أَبِي أَيُّوبَ نَحْوَهُ.",
          "English Text": "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Hassan ibn Ali ibn Yaqtin from Yunus Mawla’ Ali from abu Ayyub al-Khazzaz who has said the following: “I saw abu al-Hassan , after slaughtering his offering and shaving applied musk to his head and visited the House wearing a shirt and he (the Imam) was for al-Tamattu‘ (advantageous).” NOTE: Ali ibn Ibrahim has narrated from his father from ‘Isma‘il ibn Marrar from Yunus from abu Ayyub a similar Hadith. ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " صحيح والثاني مجهول   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/192)"
          }
        }
      },
      "Chapter #191": {
        "Hadith #15": {
          "Title": "Al-Kafi - Volume 4: The Obligation of Fasting for One Who Performs al-Hajj al-Tamattu’ but Cannot Find an Offering",
          "Link": "https://thaqalayn.net/hadith/4/3/191/15",
          "Arabic Text": "15ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ رَفَعَهُ فِي قَوْلِه�� عَزَّ وَجَلَّ فَمَنْ لَمْ يَجِدْ فَصِيامُ ثَلاثَةِ أَيَّامٍ فِي الْحَجِّ وَسَبْعَةٍ إِذا رَجَعْتُمْ تِلْكَ عَشَرَةٌ كامِلَةٌ قَالَ كَمَالُهَا كَمَالُ الأُضْحِيَّةِ.",
          "English Text": "15. Ali ibn Ibrahim has narrated from his father from in a marfu‘ manner the following: “This is about the words of Allah, most Majestic, most Glorious, ‘If he cannot find (offering) he must fast three days in al-Hajj and seven days when you return and this becomes ten complete.’ (2:196) He (the Imam) , said that completing fasting is completing the offering obligation.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/199)"
          }
        }
      },
      "Chapter #194": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 4: The Case of One Who Spends the Nights in Mina",
          "Link": "https://thaqalayn.net/hadith/4/3/194/3",
          "Arabic Text": "3ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلٍ عَنْ بَعْضِ أَصْحَابِنَا فِي رَجُلٍ زَارَ الْبَيْتَ فَنَامَ فِي الطَّرِيقِ قَالَ إِنْ بَاتَ بِمَكَّةَ فَعَلَيْهِ دَمٌ وَإِنْ كَانَ قَدْ خَرَجَ مِنْهَا فَلَيْسَ عَلَيْهِ شَيْ‏ءٌ وَلَوْ أَصْبَحَ دُونَ مِنًى. وَفِي رِوَايَةٍ أُخْرَى عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) فِي الرَّجُلِ يَزُورُ فَيَنَامُ دُونَ مِنًى قَالَ إِذَا جَازَ عَقَبَةَ الْمَدَنِيِّينَ فَلا بَأْسَ أَنْ يَنَامَ.",
          "English Text": "3. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from Jamil from certain persons of our people from a man who has said the following: “This is about a man who visits the House and sleeps on the way. He (the Imam) , has said, ‘If he passes the night in Makkah, he owes one animal for offering, but if he is out of Makkah, then it is not harmful even if it becomes dawn before reaching Mina’.’” In another Hadith from abu ‘Abd Allah , about a man who sleeps near Mina’, has said, ‘If he crosses ‘Aqabah al-Madaniyin, then it is not harmful if he sleeps.’ ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالحسن  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/206)"
          }
        },
        "Hadith #5": {
          "Title": "Al-Kafi - Volume 4: The Case of One Who Spends the Nights in Mina",
          "Link": "https://thaqalayn.net/hadith/4/3/194/5",
          "Arabic Text": "5ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنِ ابْنِ بُكَيْرٍ عَمَّنْ أَخْبَرَهُ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) أَنَّهُ قَالَ لا تَدْخُلُوا مَنَازِلَكُمْ بِمَكَّةَ إِذَا زُرْتُمْ يَعْنِي أَهْلَ مَكَّةَ. ",
          "English Text": "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Hassan ibn Ali from ibn Bukayr from those who narrated to him who has said the following: “Abu ‘Abd Allah , has said, ‘You must not enter your lodgings when you visit the House, meaning thereby people of Makkah.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالموثق   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/207)"
          }
        }
      },
      "Chapter #198": {
        "Hadith #7": {
          "Title": "Al-Kafi - Volume 4: Departure from Mina the First and the Last",
          "Link": "https://thaqalayn.net/hadith/4/3/198/7",
          "Arabic Text": "7ـ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ إِذَا نَفَرْتَ فِي النَّفْرِ الأَوَّلِ فَإِنْ شِئْتَ أَنْ تُقِيمَ بِمَكَّةَ وَتَبِيتَ بِهَا فَلا بَأْسَ بِذَلِكَ قَالَ وَقَالَ إِذَا جَاءَ اللَّيْلُ بَعْدَ النَّفْرِ الأَوَّلِ فَبِتْ بِمِنًى وَلَيْسَ لَكَ أَنْ تَخْرُجَ مِنْهَا حَتَّى تُصْبِحَ.",
          "English Text": "7. Muhammad ibn ‘Isma‘il has narrated from al-Fadl ibn Shadhan from Safwan ibn Yahya from Mu‘awiyah ibn ‘Ammar who has said the following: “Abu ‘Abd Allah , has said, ‘If you like to depart during the first chance for departure to stay in Makkah it is not harmful.’ He (the Imam) said, ‘When night falls after the first chance for departure then you must stay in Mina’; you cannot go out until morning.”’ ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول كالصحيح   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/215)"
          }
        }
      },
      "Chapter #200": {
        "Hadith #7": {
          "Title": "Al-Kafi - Volume 4: Performing Salat (prayer) in Complete Form in the Two Sacred Places",
          "Link": "https://thaqalayn.net/hadith/4/3/200/7",
          "Arabic Text": "7ـ حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ مِسْمَعٍ عَنْ أَبِي إِبْرَاهِيمَ (عَلَيْهِ السَّلاَم) قَالَ كَانَ أَبِي يَرَى لِهَذَيْنِ الْحَرَمَيْنِ مَا لا يَرَاهُ لِغَيْرِهِمَا وَيَقُولُ إِنَّ الإِتْمَامَ فِيهِمَا مِنَ الأَمْرِ الْمَذْخُورِ.",
          "English Text": "7. Humayd ibn Ziyad from ibn Sama‘ah from more than one person from Aban ibn ‘Uthman from Misma’ who has said the following: “Abu Ibrahim , has said, ‘My father , would see for these two al- Haram (the sacred area) what he would not see for other places and say that performing Salat (prayer) therein in complete form is of the saving matters.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالموثق   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/220)"
          }
        }
      },
      "Chapter #208": {
        "Hadith #6": {
          "Title": "Al-Kafi - Volume 4: The Months in Which Al-’Umrah Is Preferable and the Case of One Who Assumes the State of Ihram in One Month and Comes Out of Such State in another Month",
          "Link": "https://thaqalayn.net/hadith/4/3/208/6",
          "Arabic Text": "6ـ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ الْمُعْتَمِرُ يَعْتَمِرُ فِي أَيِّ شُهُورِ السَّنَةِ شَاءَ وَأَفْضَلُ الْعُمْرَةِ عُمْرَةُ رَجَبٍ.",
          "English Text": "6. Muhammad ibn Isma‘il has narrated from al-Fadl ibn Shadhan from Safwan ibn Yahya from Mu‘awiyah ibn ‘Ammar who has said the following: “Abu ‘Abd Allah , has said that one may perform al-‘Umrah during any month of the year. The excellent al-‘Umrah is during the month of Rajab.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول كالصحيح  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/236)"
          }
        }
      },
      "Chapter #209": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 4: Discontinuation of Talbiyah (Here I Am, O Lord, to obey Your command) in the State of Ihram and What One Should Do",
          "Link": "https://thaqalayn.net/hadith/4/3/209/2",
          "Arabic Text": "2ـ حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ (عَلَيْهِ السَّلاَم) قَالَ يُقْطَعُ تَلْبِيَةُ الْمُعْتَمِرِ إِذَا دَخَلَ الْحَرَمَ.",
          "English Text": "2. Humayd ibn Ziyad has narrated from ibn Sama‘ah from more than one person from Aban from Zurarah who has said the following: “Abu Ja‘far , has said, ‘One who is performing al-‘Umrah must discontinue al- Talbiyah (here I am, O Lord, to obey Your command) when he enters al-Haram (the sacred area).’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالموثق  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/237)"
          }
        }
      },
      "Chapter #210": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 4: The Case of One Who During Al-’Umrah Is Involved in Carnal Relations With His Wife and the Expiation Therefor",
          "Link": "https://thaqalayn.net/hadith/4/3/210/3",
          "Arabic Text": "3ـ حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانٍ عَنْ زُرَارَةَ قَالَ قَالَ مَنْ جَاءَ بِهَدْيٍ فِي عُمْرَةٍ فِي غَيْرِ حَجٍّ فَلْيَنْحَرْهُ قَبْلَ أَنْ يَحْلِقَ رَأْسَهُ.",
          "English Text": "3. Humayd ibn Ziyad has narrated from ibn Sama‘ah from more than one person from Aban from Zurarah who has said the following: “He (the Imam) , has said, ‘One who brings an animal for offering in al-‘Umrah without al-Hajj must slaughter it before shaving his head.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالموثق    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/240)"
          }
        },
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 4: The Case of One Who During Al-’Umrah Is Involved in Carnal Relations With His Wife and the Expiation Therefor",
          "Link": "https://thaqalayn.net/hadith/4/3/210/4",
          "Arabic Text": "4ـ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ الْمُعْتَمِرُ إِذَا سَاقَ الْهَدْيَ يَحْلِقُ قَبْلَ أَنْ يَذْبَحَ.",
          "English Text": "4. Muhammad ibn ‘Isma’il has narrated from al-Fadl ibn Shadhan from Safwan ibn Yahya from Mu‘awiyah ibn ‘Ammar who has said the following: “Abu ‘Abd Allah , has said, ‘One who drives an animal for offering in al-‘Umrah without al-Hajj must slaughter it before shaving.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول كالصحيح   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/241)"
          }
        }
      },
      "Chapter #212": {
        "Hadith #7": {
          "Title": "Al-Kafi - Volume 4: The Rare Ahadith",
          "Link": "https://thaqalayn.net/hadith/4/3/212/7",
          "Arabic Text": "7ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) قَالَ سَأَلَهُ رَجُلٌ فِي الْمَسْجِدِ الْحَرَامِ مَنْ أَعْظَمُ النَّاسِ وِزْراً فَقَالَ مَنْ يَقِفُ بِهَذَيْنِ الْمَوْقِفَيْنِ عَرَفَةَ وَالْمُزْدَلِفَةِ وَسَعَى بَيْنَ هَذَيْنِ الْجَبَلَيْنِ ثُمَّ طَافَ بِهَذَا الْبَيْتِ وَصَلَّى خَلْفَ مَقَامِ إِبْرَاهِيمَ (عَلَيْهِ السَّلاَم) ثُمَّ قَالَ فِي نَفْسِهِ أَوْ ظَنَّ أَنَّ الله لَمْ يَغْفِرْ لَهُ فَهُوَ مِنْ أَعْظَمِ النَّاسِ وِزْراً.",
          "English Text": "7. Ali ibn Ibrahim has narrated from his father from Ahmad ibn Muhammad ibn abu Nasr from certain individuals of our people who has said the following: “A man in Masjid al-Haram (the Sacred Masjid) asked abu ‘Abd Allah, Alayhi al-Salam, about the greatest sin. He (the Imam) replied, ‘If one attends these two places, ‘Arafah and al-Muzdalifah, performs Sa‘y between these two hills, performs Tawaf around this House, performs salat (prayer) behind Maqam of Ibrahim  then says to himself or thinks that Allah does not forgive his sins, he has, of all people, sinned the most.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالحسن  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/245)"
          }
        },
        "Hadith #15": {
          "Title": "Al-Kafi - Volume 4: The Rare Ahadith",
          "Link": "https://thaqalayn.net/hadith/4/3/212/15",
          "Arabic Text": "15ـ حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) فِي قَوْلِ الله جَلَّ ثَنَاؤُهُ ثُمَّ لْيَقْضُوا تَفَثَهُمْ قَالَ هُوَ مَا يَكُونُ مِنَ الرَّجُلِ فِي إِحْرَامِهِ فَإِذَا دَخَلَ مَكَّةَ فَتَكَلَّمَ بِكَلامٍ طَيِّبٍ كَانَ ذَلِكَ كَفَّارَةً لِذَلِكَ الَّذِي كَانَ مِنْهُ.",
          "English Text": "15. Humayd ibn Ziyad has narrated from ibn Sama‘ah from more than one person from Aban from abu Basir who has said the following: “Abu ‘Abd Allah , has said the following about the words of Allah, glorious is whose praise, ‘They should spruce up.’ He (the Imam) said that this is about what one may have had in the state of Ihram. When he enters Makkah, he should speak proper words and this will be considered as expiation for what he has had in the state of Ihram.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالموثق   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/248)"
          }
        }
      },
      "Chapter #220": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 4: Visiting Al-Baqi",
          "Link": "https://thaqalayn.net/hadith/4/3/220/1",
          "Arabic Text": "1ـ إِذَا أَتَيْتَ الْقَبْرَ الَّذِي بِالْبَقِيعِ فَاجْعَلْهُ بَيْنَ يَدَيْكَ ثُمَّ تَقُولُ السَّلامُ عَلَيْكُمْ أَئِمَّةَ الْهُدَى السَّلامُ عَلَيْكُمْ أَهْلَ التَّقْوَى السَّلامُ عَلَيْكُمُ الْحُجَّةَ عَلَى أَهْلِ الدُّنْيَا السَّلامُ عَلَيْكُمُ الْقُوَّامَ فِي الْبَرِيَّةِ بِالْقِسْطِ السَّلامُ عَلَيْكُمْ أَهْلَ الصَّفْوَةِ السَّلامُ عَلَيْكُمْ أَهْلَ النَّجْوَى أَشْهَدُ أَنَّكُمْ قَدْ بَلَّغْتُمْ وَنَصَحْتُمْ وَصَبَرْتُمْ فِي ذَاتِ الله وَكُذِّبْتُمْ وَأُسِي‏ءَ إِلَيْكُمْ فَعَفَوْتُمْ وَأَشْهَدُ أَنَّكُمُ الأَئِمَّةُ الرَّاشِدُونَ الْمَهْدِيُّونَ وَأَنَّ طَاعَتَكُمْ مَفْرُوضَةٌ وَأَنَّ قَوْلَكُمُ الصِّدْقُ وَأَنَّكُمْ دَعَوْتُمْ فَلَمْ تُجَابُوا وَأَمَرْتُمْ فَلَمْ تُطَاعُوا وَأَنَّكُمْ دَعَائِمُ الدِّينِ وَأَرْكَانُ الأَرْضِ وَلَمْ تَزَالُوا بِعَيْنِ الله يَنْسَخُكُمْ فِي أَصْلابِ كُلِّ مُطَهَّرٍ وَيَنْقُلُكُمْ فِي أَرْحَامِ الْمُطَهَّرَاتِ لَمْ تُدَنِّسْكُمُ الْجَاهِلِيَّةُ الْجَهْلاءُ وَلَمْ تَشْرَكْ فِيكُمْ فِتَنُ الأَهْوَاءِ طِبْتُمْ وَطَابَ مَنْبِتُكُمْ مَنَّ بِكُمْ عَلَيْنَا دَيَّانُ الدِّينِ فَجَعَلَكُمْ فِي بُيُوتٍ أَذِنَ الله أَنْ تُرْفَعَ وَيُذْكَرَ فِيهَا اسْمُهُ وَجَعَلَ صَلَوَاتِنَا عَلَيْكُمْ رَحْمَةً لَنَا وَكَفَّارَةً لِذُنُوبِنَا إِذَا اخْتَارَكُمْ لَنَا وَطَيَّبَ خَلْقَنَا بِمَا مَنَّ بِهِ عَلَيْنَا مِنْ وَلايَتِكُمْ وَكُنَّا عِنْدَهُ مُسَمَّيْنَ بِفَضْلِكُمْ مُعْتَرِفِينَ بِتَصْدِيقِنَا إِيَّاكُمْ وَهَذَا مَقَامُ مَنْ أَسْرَفَ وَأَخْطَأَ وَاسْتَكَانَ وَأَقَرَّ بِمَا جَنَى وَرَجَا بِمَقَامِهِ الْخَلاصَ وَأَنْ يَسْتَنْقِذَهُ بِكُمْ مُسْتَنْقِذُ الْهَلْكَى مِنَ الرَّدَى فَكُونُوا لِي شُفَعَاءَ فَقَدْ وَفَدْتُ إِلَيْكُمْ إِذَا رَغِبَ عَنْكُمْ أَهْلُ الدُّنْيَا وَاتَّخَذُوا آيَاتِ الله هُزُواً وَاسْتَكْبَرُوا عَنْهَا يَا مَنْ هُوَ قَائِمٌ لا يَسْهُو وَدَائِمٌ لا يَلْهُو وَمُحِيطٌ بِكُلِّ شَيْ‏ءٍ لَكَ الْمَنُّ بِمَا وَفَّقْتَنِي وَعَرَّفْتَنِي مِمَّا ائْتَمَنْتَنِي عَلَيْهِ إِذْ صَدَّ عَنْهُمْ عِبَادُكَ وَجَهِلُوا مَعْرِفَتَهُمْ وَاسْتَخَفُّوا بِحَقِّهِمْ وَمَالُوا إِلَى سِوَاهُمْ فَكَانَتِ الْمِنَّةُ مِنْكَ عَلَيَّ مَعَ أَقْوَامٍ خَصَصْتَهُمْ بِمَا خَصَصْتَنِي بِهِ فَلَكَ الْحَمْدُ إِذْ كُنْتُ عِنْدَكَ فِي مَقَامِي هَذَا مَذْكُوراً مَكْتُوباً وَلا تَحْرِمْنِي مَا رَجَوْتُ وَلا تُخَيِّبْنِي فِيمَا دَعَوْتُ وَادْعُ لِنَفْسِكَ بِمَا أَحْبَبْتَ. ",
          "English Text": "1. The following is narrated in a mawquf and mursal manner who has narrated the following: (It seems as if it is part of Hadith 5 of previous Chapter narrated from Mu‘awiyah ibn ‘Ammar). “When you go to the grave in al-Baqi‘ keep it in front of you and say, ‘(I hereby declare, affirm and acknowledge that you are ‘Alayhim al-Salam and my) submission to (your commandments), O leaders of (divine) guidance. (I hereby declare, affirm and acknowledge that you are ‘Alayhim al-Salam and my) submission to (your commandments), O people of piety. (I hereby declare, affirm and acknowledge that you are ‘Alayhim al-Salam and my) submission to (your commandments), O people who possess divine authority over the people of the world. (I hereby declare, affirm and acknowledge that you are ‘Alayhim al-Salam and my) submission to (your commandments) O executors of justice among people in the world. (I hereby declare, affirm and acknowledge that you are ‘Alayhim al-Salam and my) submission to (your commandments) O chosen ones. (I hereby declare, affirm and acknowledge that you are ‘Alayhim al-Salam and my) submission to (your commandments) O the ones with whom cherished conversation is worthwhile. I testify that you have preached (the divine message) and provided good advice, exercised patience for the cause of Allah, that you were rejected and that certain people treated you in wicked manners but you forgave. I testify that you are intelligent leaders, the well-guiding ones. Obedience to you is obligatory and your words speak the truth. I testify that you called (people to Allah) but you did not receive proper response, gave commands but were not obeyed. I testify that you are the pillars of religion and the cornerstones of earth. You continue to remain before the eyes (special attention) of Allah. He has kept you as offspring of clean generations and transferred you to clean wombs. The filth of total ignorance or the mischief of evil desires could not affect you. You are of noble birth as well as the noble place of growth. The Creator of religion and justice has done a great favor to us through you. He thus has placed you in such homes, which Allah wants to be made to stand high wherein His name is spoken of. He has made our asking Him to grant salawat (favors and compensation to Muhammad and his family worthy of their services to Your cause), a blessing for us and expiations for our sins; He has chosen you for us and has cleansed our creation through His favor of making you our guardians with divine authority. We were marked before Him to receive favors from you and that we affirm and acknowledge your divine authority. This is the place of one who has transgressed, slipped and shown his destitution and has confessed to his sins. He hopes in his place to be relieved and saved through you from destruction and condemnation. Be my intercessors, I have come to you when people of the world have turned away from you, have taken the signs of Allah in ridicule and have treated them with arrogance. O the One, who guards without making any mistakes, lives forever but never is playful and has encompassed all things, it is because of Your generosity that You have granted me this opportunity. (You have) introduced to me (my ’A’immah) what You have entrusted me with, when Your servants have kept away from them, lived in ignorance of knowing their high position, treated their rights as insignificant and inclined toward others. (What you have done for me) is because of Your generosity to me and to certain people whom You have given special attention. All praise belongs to You and thanks for the fact that You have kept me in this position, mentioned and listed me before You. Do not deprive me in what I hope for and do not fail me in my prayers.’ Pray for yourself and for whatever matter you like.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " موقوف مرسل   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/272)"
          }
        }
      },
      "Chapter #223": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 4: Sanctity of al-Madinah",
          "Link": "https://thaqalayn.net/hadith/4/3/223/2",
          "Arabic Text": "2ـ حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانٍ عَنْ أَبِي الْعَبَّاسِ قَالَ قُلْتُ لأَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) حَرَّمَ رَسُولُ الله (صلَّى اللهُ عَلَيْهِ وَآلِه) الْمَدِينَةَ قَالَ نَعَمْ حَرَّمَ بَرِيداً فِي بَرِيدٍ غَضَاها قَالَ قُلْتُ صَيْدَهَا قَالَ لا يَكْذِبُ النَّاسُ.",
          "English Text": "2. Humayd ibn Ziyad has narrated from al-Hassan ibn Muhammad ibn Sama‘ah from more than one person from Aban from abu al-‘Abbas who has said the following: “I once asked abu ‘Abd Allah , ’Is al-Madinah the sacred place of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause?’ He (the Imam) replied, ’Yes, he made it a one square Barid (a certain area of land) with its trees an area of sacred status.’ I (the narrator) then asked, ’What about hunting in such area?’ He (the Imam) replied, ’People’s words are not rejected.’” (Please consult Fatwa for this Hadith) ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالموثق   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/278)"
          }
        }
      },
      "Chapter #227": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 4: Statements to be Made Near the Gravesite of ’Amir al-Mu’minin, ‘Alayhi al-Salam",
          "Link": "https://thaqalayn.net/hadith/4/3/227/1",
          "Arabic Text": "1ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ أُورَمَةَ عَمَّنْ حَدَّثَهُ عَنِ الصَّادِقِ أَبِي الْحَسَنِ الثَّالِثِ (عَلَيْهِ السَّلاَم) قَالَ يَقُولُ السَّلامُ عَلَيْكَ يَا وَلِيَّ الله أَنْتَ أَوَّلُ مَظْلُومٍ وَأَوَّلُ مَنْ غُصِبَ حَقُّهُ صَبَرْتَ وَاحْتَسَبْتَ حَتَّى أَتَاكَ الْيَقِينُ فَأَشْهَدُ أَنَّكَ لَقِيتَ الله وَأَنْتَ شَهِيدٌ عَذَّبَ الله قَاتِلَكَ بِأَنْوَاعِ الْعَذَابِ وَجَدَّدَ عَلَيْهِ الْعَذَابَ جِئْتُكَ عَارِفاً بِحَقِّكَ مُسْتَبْصِراً بِشَأْنِكَ مُعَادِياً لأَعْدَائِكَ وَمَنْ ظَلَمَكَ أَلْقَى عَلَى ذَلِكَ رَبِّي إِنْ شَاءَ الله يَا وَلِيَّ الله إِنَّ لِي ذُنُوباً كَثِيرَةً فَاشْفَعْ لِي إِلَى رَبِّكَ فَإِنَّ لَكَ عِنْدَ الله مَقَاماً مَحْمُوداً مَعْلُوماً وَإِنَّ لَكَ عِنْدَ الله جَاهاً وَشَفَاعَةً وَقَدْ قَالَ تَعَالَى وَلا يَشْفَعُونَ إِلاَّ لِمَنِ ارْتَضى‏. مُحَمَّدُ بْنُ جَعْفَرٍ الرَّازِيُّ عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي الْحَسَنِ الثَّالِثِ (عَلَيْهِ السَّلاَم) مِثْلَهُ. دُعَاءٌ آخَرُ عِنْدَ قَبْرِ أَمِيرِ الْمُؤْمِنِينَ ع.",
          "English Text": "1. A number of our people have narrated from Sahl ibn Ziyad from Muhammad ibn ‘Uramah from those who have said the following: “Al-Sadiq abu al-Hassan the 3rd has said that one should say this near the gravesite of ’Amir al- Mu’minin. ‘(I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments) O the one who possesses Authority from Allah. You are the first oppressed and the first one whose rights were usurped. You exercised patience nobly until the time of your death. I testify that you went before Allah as a martyr. May Allah punish your assassin by all kinds of punishments and renew his punishments. I, with understanding of your rights and position, have come to visit you. I am aware of your prominent status and I am an enemy of your enemies and those who did injustice to you. I will go before my Lord with this belief, if Allah so wills. O possessor of authority from Allah, I have committed a great deal of sins. So intercede on my behalf before your Lord. You have a praiseworthy position, before Allah, which is well known. You possess high honor before Allah as well as approved intercession. Allah, the most High, has said, ‘No one will be able to intercede before Him except those whom He accepts.’ (21:28)” Muhammad ibn Ja’far al-Raziy has narrated from Muhammad ibn ‘Isa ibn ‘Ubayd from certain individuals of our people from abu al-Hassan, a similar Hadith. Another Prayer - Another Prayer to be Made Near the Gravesite of ’Amir al- Mu’minin  “You should say the following near the gravesite of ’Amir al-Mu’minin . “(I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments) O friend of Allah. (I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments) O Authority of Allah. (I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments) O deputy of Allah. (I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments) O pillar of religion. (I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments) O heir of the prophets. (I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments) O person in charge of paradise and hellfire, the person in charge of the ‘Asa’ and Misam (Staff and Marking item). (I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments) O ’Amir al-Mu’minin. I testify that you are the word of piety, the gateway of guidance, the unbreakable ring, the strong rope and the straight path. I testify that you are the authority of Allah over His creatures, His witness over His servants, His trustee of the treasure of His knowledge, the reservoir of His secret, the place of His wisdom and brother of His messenger. I testify that your call and preaching is the truth; and all callers and preachers appointed before you are false and invalid. You are the oppressed, the first one whose rights were usurped, but you exercised patience to be rewarded in the hereafter. May Allah condemn those who did injustice to you, transgressed against you and created obstacles in your way. May Allah condemn them with the strongest condemnation along with condemnation by the angels of prominent positions before Allah, by the messenger- prophets and all believing people whose faith has passed (Allah’s) test. I appeal before Allah to grant salawat (favors and kindness to you worthy of Your services to His cause), O ’Amir al-Mu’minin. I appeal before Allah to shower salawat (favors and kindness) upon your spirit and body. I testify that you are the servant and trustee of Allah. You have preached good advice and kept your trust properly, you died as a truthful person and passed away with pure certainty. You did not give preference to blindness over guidance and you never inclined toward falsehood against the truth. I testify that you performed salat (prayer), paid Zakat, asked people to obey Allah’s commands and to stay away from what Allah has prohibited. You followed the Messenger of Allah, provided guidance to his followers, recited the book in a true manner of recitation, and strove hard in true manners for the cause of Allah. You invited people to the path of Allah with wisdom and good advice until the time of your death. I testify that you lived with the strongest proof and good reason about your Lord and invited people to Him with full awareness. You preached what you were commanded to preach and stood firm for the rights of Allah without acting weakly or showing any weakness. I appeal before Allah to grant salawat (favors and compensation to you worthy of Your services to His cause), with such salat, thereafter, along with it and on its sides one after the other, without any break in between, a timeless and endless one. (I hereby declare, affirm and acknowledge that you are a ‘Alayhi al-Salam and my) submission to (your commandments) and may Allah grant you blessings and kindness. May Allah reward you, as the truthful one and because of his services to his followers. I testify that Jihad in your support is the true form of Jihad and that truth is on your side and in your favor. You are the man of Jihad and its source and that the legacy of prophet-hood is with you. May Allah grant you salawat (favors and compensation to you worthy of your services to Allah’s cause) and may Allah grant you safety and blessing. May Allah punish your assassin with all kinds of punishment. O ’Amir al-Mu’minin, I have come with my knowledge of your rights and my awareness about your prominent status. I am an enemy of your enemies and a friend of your friends. I pray to Allah to keep my soul and the soul of my parents in service for your cause. I have come to seek refuge with you against the fire, which is prepared for people like myself because of what I have committed against my soul. I have come to you as a visitor seeking thereby freedom for my neck from the hellfire. I have come to you fleeing from my sins, which I have loaded on my back. I have come to you because of your great status and position before my Lord. So intercede on my behalf before your Lord; I have committed great many sins. You have a well-known position before Allah and a great status, and an accepted intercession. Allah, the Most Majestic, the Most Glorious, has said, ‘They do not intercede except for the chosen ones.’ O Allah, (You are) the Lord of lords, the One who responds to those whom He loves. I have sought protection with the brother of Your messenger. Set my neck free from the hellfire. I believe in Allah and in whatever He has revealed to you (family of the Messenger of Allah). I accept as my guardian with love the first one among you and the last one of you just as I do so with first one of you. I reject al-Jibt and al-Taghut, al-Lat and al-‘Uzza’.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف والسند الثاني مرسل   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/287)"
          }
        }
      },
      "Chapter #228": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 4: Another Dua at the grave of Ameer al-Mumineen",
          "Link": "https://thaqalayn.net/hadith/4/3/228/1",
          "Arabic Text": "تقول: \" السلام عليك يا ولى الله، السلام عليك يا حجة الله، السلام عليك يا خليفة الله، السلام عليك يا عمود الدين ، السلام عليك يا وارث النبيين، السلام عليك يا قسيم الجنة والنار وصاحب العصا والميسم ، السلام عليك يا أمير المؤمنين أشهد أنك كلمة التقوى وباب الهدي والعروة الوثقى والحبل المتين والصراط المستقيم و أشهد أنك حجة الله على خلقه وشاهده على عباده وأمينه على علمه وخازن سره و موضع حكمته وأخو رسوله (عليه السلام) وأشهد أن دعوتك حق وكل داع منصوب  دونك باطل مدحوض، أنت أول مظلوم وأول مغصوب حقه فصبرت واحتسبت، لعن الله من ظلمك واعتدي عليك  وصد عنك لعنا كثيرا يلعنهم به كل ملك مقرب وكل نبي مرسل وكل عبد مؤمن ممتحن، صلى الله عليك يا أمير المؤمنين وصلي الله على روحك وبدنك أشهد أنك عبد الله وأمينه بلغت ناصحا وأديت أمينا وقتلت صديقا ومضيت على يقين لم تؤثر عمي على هدي ولم تمل من حق إلى باطل، أشهد أنك قد أقمت الصلاة وآتيت الزكاة وأمرت بالمعروف ونهيت عن المنكر واتبعت الرسول ونصحت للأمة وتلوت الكتاب حق تلاوته وجاهدت في الله حق جهاده ودعوت إلى سبيله بالحكمة والموعظة الحسنة حتى أتاك اليقين، أشهد أنك كنت على بينة من ربك ودعوت إليه على بصيرة وبلغت ما أمرت به وقمت بحق الله غير واهن فصلي الله عليك صلاة متبعة متواصلة مترادفة يتبع بعضها بعضا لا انقطاع لها ولا أمد ولا أجل والسلام عليك ورحمة الله وبركاته وجزاك الله من صديق خيرا عن رعيته، أشهد أن الجهاد معك جهاد وأن الحق معك وإليك وأنت أهله ومعدنه وميراث النبوة عندك فصلى الله عليك وسلم تسليما وعذب الله قاتلك بأنواع العذاب، أتيتك يا أمير المؤمنين عارفا بحقك مستبصرا بشأنك معاديا لأعدائك مواليا لأوليائك بابي أنت وأمي أتيتك عائذا بك من نار استحقها مثلي بما جنيت على نفسي أتيتك زائرا أبتغي بزيارتك فكاك رقبتي من النار، أتيتك هاربا من ذنوبي التي احتطبتها على ظهري أتيتك وافدا لعظيم حالك ومنزلتك عند ربي فاشفع لي عند ربك فإن لي ذنوبا كثيرة وإن لك عند الله مقاما معلوما وجاها عظيما وشأنا كبيرا وشفاعة مقبولة وقد قال الله عز وجل: \" ولا يشفعون إلا لمن ارتضى \" اللهم رب الأرباب صريخ الأحباب إني عذت بأخي رسولك معاذا ففك رقبتي من النار آمنت بالله وما انزل إليكم وأتولى آخركم بما توليت [به] أولكم وكفرت بالجبت و الطاغوت واللات والعزى.",
          "English Text": "1. To be translated",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " سكت عنه    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/288)"
          }
        }
      },
      "Chapter #233": {
        "Hadith #11": {
          "Title": "Al-Kafi - Volume 4: The Virtue and Excellence of Visiting abu ‘Abd Allah, al-Husayn, ‘Alayhi al-Salam",
          "Link": "https://thaqalayn.net/hadith/4/3/233/11",
          "Arabic Text": "11ـ مُحَمَّدُ بْنُ يَحْيَى وَغَيْرُهُ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ وَمُحَمَّدِ بْنِ الْحُسَيْنِ جَمِيعاً عَنْ مُوسَى بْنِ عُمَرَ عَنْ غَسَّانَ الْبَصْرِيِّ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ وَعَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ بَعْضِ أَصْحَابِنَا عَنْ إِبْرَاهِيمَ بْنِ عُقْبَةَ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ قَالَ اسْتَأْذَنْتُ عَلَى أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) فَقِيلَ لِي ادْخُلْ فَدَخَلْتُ فَوَجَدْتُهُ فِي مُصَلاَّهُ فِي بَيْتِهِ فَجَلَسْتُ حَتَّى قَضَى صَلاتَهُ فَسَمِعْتُهُ وَهُوَ يُنَاجِي رَبَّهُ وَيَقُولُ يَا مَنْ خَصَّنَا بِالْكَرَامَةِ وَخَصَّنَا بِالْوَصِيَّةِ وَوَعَدَنَا الشَّفَاعَةَ وَأَعْطَانَا عِلْمَ مَا مَضَى وَمَا بَقِيَ وَجَعَلَ أَفْئِدَةً مِنَ النَّاسِ تَهْوِي إِلَيْنَا اغْفِرْ لِي وَلإِخْوَانِي وَلِزُوَّارِ قَبْرِ أَبِي عَبْدِ الله الْحُسَيْنِ (عَلَيْهِ السَّلاَم) الَّذِينَ أَنْفَقُوا أَمْوَالَهُمْ وَأَشْخَصُوا أَبْدَانَهُمْ رَغْبَةً فِي بِرِّنَا وَرَجَاءً لِمَا عِنْدَكَ فِي صِلَتِنَا وَسُرُوراً أَدْخَلُوهُ عَلَى نَبِيِّكَ صَلَوَاتُكَ عَلَيْهِ وَآلِهِ وَإِجَابَةً مِنْهُمْ لأَمْرِنَا وَغَيْظاً أَدْخَلُوهُ عَلَى عَدُوِّنَا أَرَادُوا بِذَلِكَ رِضَاكَ فَكَافِهِمْ عَنَّا بِالرِّضْوَانِ وَاكْلأْهُمْ بِاللَّيْلِ وَالنَّهَارِ وَاخْلُفْ عَلَى أَهَالِيهِمْ وَأَوْلادِهِمُ الَّذِينَ خُلِّفُوا بِأَحْسَنِ الْخَلَفِ وَاصْحَبْهُمْ وَاكْفِهِمْ شَرَّ كُلِّ جَبَّارٍ عَنِيدٍ وَكُلِّ ضَعِيفٍ مِنْ خَلْقِكَ أَوْ شَدِيدٍ وَشَرَّ شَيَاطِينِ الإِنْسِ وَالْجِنِّ وَأَعْطِهِمْ أَفْضَلَ مَا أَمَّلُوا مِنْكَ فِي غُرْبَتِهِمْ عَنْ أَوْطَانِهِمْ وَمَا آثَرُونَا بِهِ عَلَى أَبْنَائِهِمْ وَأَهَالِيهِمْ وَقَرَابَاتِهِمْ اللهمَّ إِنَّ أَعْدَاءَنَا عَابُوا عَلَيْهِمْ خُرُوجَهُمْ فَلَمْ يَنْهَهُمْ ذَلِكَ عَنِ الشُّخُوصِ إِلَيْنَا وَخِلافاً مِنْهُمْ عَلَى مَنْ خَالَفَنَا فَارْحَمْ تِلْكَ الْوُجُوهَ الَّتِي قَدْ غَيَّرَتْهَا الشَّمْسُ وَارْحَمْ تِلْكَ الْخُدُودَ الَّتِي تَقَلَّبَتْ عَلَى حُفْرَةِ أَبِي عَبْدِ الله (عَلَيْهِ السَّلاَم) وَارْحَمْ تِلْكَ الأَعْيُنَ الَّتِي جَرَتْ دُمُوعُهَا رَحْمَةً لَنَا وَارْحَمْ تِلْكَ الْقُلُوبَ الَّتِي جَزِعَتْ وَاحْتَرَقَتْ لَنَا وَارْحَمِ الصَّرْخَةَ الَّتِي كَانَتْ لَنَا اللهمَّ إِنِّي أَسْتَوْدِعُكَ تِلْكَ الأَنْفُسَ وَتِلْكَ الأَبْدَانَ حَتَّى نُوَافِيَهُمْ عَلَى الْحَوْضِ يَوْمَ الْعَطَشِ فَمَا زَالَ وَهُوَ سَاجِدٌ يَدْعُو بِهَذَا الدُّعَاءِ فَلَمَّا انْصَرَفَ قُلْتُ جُعِلْتُ فِدَاكَ لَوْ أَنَّ هَذَا الَّذِي سَمِعْتُ مِنْكَ كَانَ لِمَنْ لا يَعْرِفُ الله لَظَنَنْتُ أَنَّ النَّارَ لا تَطْعَمُ مِنْهُ شَيْئاً وَالله لَقَدْ تَمَنَّيْتُ أَنْ كُنْتُ زُرْتُهُ وَلَمْ أَحُجَّ فَقَالَ لِي مَا أَقْرَبَكَ مِنْهُ فَمَا الَّذِي يَمْنَعُكَ مِنْ إِتْيَانِهِ ثُمَّ قَالَ يَا مُعَاوِيَةُ لِمَ تَدَعُ ذَلِكَ قُلْتُ جُعِلْتُ فِدَاكَ لَمْ أَدْرِ أَنَّ الأَمْرَ يَبْلُغُ هَذَا كُلَّهُ قَالَ يَا مُعَاوِيَةُ مَنْ يَدْعُو لِزُوَّارِهِ فِي السَّمَاءِ أَكْثَرُ مِمَّنْ يَدْعُو لَهُمْ فِي الأَرْضِ. ",
          "English Text": "11. Muhammad ibn Yahya and others have narrated from Muhammad ibn Ahmad and Muhammad ibn al-Husayn all from Musa ibn ‘Umar from Ghassan al-Basriy from Mu‘awiyah ibn Wahab Ali ibn Ibrahim has narrated from his father from certain individuals of our people from Ibrahim ibn ‘Uqbah from Mu‘awiyah ibn Wahab who has said the following: “I once asked permission to see abu ‘ Abd Allah , and permission was granted. I was told to come in. When I went inside, I found him in his place for salat (prayer) in his house. I then sat down until he completed his salat (prayer). I then heard him secretly speaking to his Lord. ‘O the One who has granted us honor in a special way, O the one who has granted us exclusive executorships of the will of the messengers and has promised us intercession, granted us the knowledge of the past and future and has made the hearts of people to incline toward us, forgive me and my brothers (in belief). (O Lord, forgive) the visitors of the grave of abu ‘Abd Allah, al-Husayn , who spend their wealth. Those who ready their bodies due to their interest in doing good to us and because of their hope in what is with You of compensation for keeping good relations with us and because of the happiness they bring to the heart of Your prophet. I appeal before Allah to grant salawat (favors and compensation to Your Holy prophet and his family worthy of his services to Your cause) and forgive them because of their yielding to our commands and because of the anger due to their visit they cause to our enemies. In doing so, they only want to find that You are happy with them. So compensate them on our behalf by being happy with them, and support them in the night and day. Be their deputy in their families and children whom they have left behind, as best deputy. Accompany them and protect them against the evil of every hostile tyrant, weak ones of Your creatures or strong ones, and against the evil of the devils of humankind and al-Jinn. Grant them the best, which they are to receive from You in their condition of being in strange places away from their homes and because of the preference they have given to us over their own children, families and relatives. O Allah, our enemies mock at them for their visiting us, but this does not prevent them from setting on their journey toward us and from opposing those who oppose us. So be kind to the faces, which the heat of sun has changed. Be kind to the side of those faces, which are turned from side to side over the grave of abu ‘Abd Allah . Be kind to those eyes, which have shed tears in sympathy with us. Be kind to the hearts, which mourned and felt pain for us. Be kind to the wailing cries for us. O Allah, I entrust those souls and bodies with You until the time we meet, and compensate them at the pond (in paradise) on the dehydrating day.’ He (the Imam) continued with such prayers in a prostrating position. When he completed, I said, ‘I pray to Allah to keep my soul in service for your cause, if what I heard from you were for even those who do not know Allah, I think, hellfire would not touch them. I by Allah, wished to have visited the grave of al-Husayn , instead of performing al-Hajj.’ He (the Imam) said to me, ‘He is much closer to you. What then prevents you from visiting him?’ He (the Imam) then said, ‘O Mu‘awiyah, why do you neglect such visitations?’ I said, ‘I pray to Allah to keep my soul in service for your cause, I did not know the matter is of all such great degrees of significance.’ He (the Imam) said, ‘O Mu‘awiyah, the number of those who pray for the visitors of al- Husayn , in the heavens is much greater than those who pray for them on earth.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " السندان مجهولن    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/309)"
          }
        }
      },
      "Chapter #237": {
        "Hadith #7": {
          "Title": "Al-Kafi - Volume 4: The Rare Ahadith",
          "Link": "https://thaqalayn.net/hadith/4/3/237/7",
          "Arabic Text": "7ـ عَلِيُّ بْنُ مُحَمَّدٍ رَفَعَهُ قَالَ قَالَ الْخَتْمُ عَلَى طِينِ قَبْرِ الْحُسَيْنِ (عَلَيْهِ السَّلاَم) أَنْ يُقْرَأَ عَلَيْهِ إِنَّا أَنْزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ وَرُوِيَ إِذَا أَخَذْتَهُ فَقُلْ بِسْمِ الله اللهمَّ بِحَقِّ هَذِهِ التُّرْبَةِ الطَّاهِرَةِ وَبِحَقِّ الْبُقْعَةِ الطَّيِّبَةِ وَبِحَقِّ الْوَصِيِّ الَّذِي تُوَارِيهِ وَبِحَقِّ جَدِّهِ وَأَبِيهِ وَأُمِّهِ وَأَخِيهِ وَالْمَلائِكَةِ الَّذِينَ يَحُفُّونَ بِهِ وَالْمَلائِكَةِ الْعُكُوفِ عَلَى قَبْرِ وَلِيِّكَ يَنْتَظِرُونَ نَصْرَهُ صَلَّى الله عَلَيْهِمْ أَجْمَعِينَ اجْعَلْ لِي فِيهِ شِفَاءً مِنْ كُلِّ دَاءٍ وَأَمَاناً مِنْ كُلِّ خَوْفٍ وَعِزّاً مِنْ كُلِّ ذُلٍّ وَأَوْسِعْ بِهِ عَلَيَّ فِي رِزْقِي وَأَصِحَّ بِهِ جِسْمِي.",
          "English Text": "7. Ali ibn Muhammad in a marfu‘ manners, has narrated the following: “He (the Imam) , has said, ‘The benefit of the clay from the grave of al-Husayn , is complete when thereupon Chapter 97 of the Holy Quran is read.” “It is narrated that when you take the clay say, ‘I begin this task in the name of Allah. O Allah, I appeal before You through this clean soil, this marvelous location, through the rights of the executor of the will whom You have concealed here. I appeal before You through the rights of his grandfather, his father, his mother and his brother. (I appeal before You) through the angels who surround it, the angels who are assigned to the grave of the one who possesses Your authority, who wait to support him, grant salawat (favors and compensation) to all of them. I appeal before You to place cure in it for me for all illnesses. Make it a protection against all frightening matters and strength against all weakness. Increase my sustenance and grant me good health thereby.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع وآخره مرسل    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/318)"
          }
        }
      }
    }
  }
}