{
  "Volume #3": {
    "Book #1": {
      "Chapter #9": {
        "Hadith #8": {
          "Title": "Al-Kafi - Volume 3: Mixing of Rain Water with Urine, with Water Used for Taking Ghusl (bath) Because of Carnal Relations, Touching of One’s Cloth with Water Used for Washing Because of Urine",
          "Link": "https://thaqalayn.net/hadith/3/1/9/8",
          "Arabic Text": "8ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ عُمَرَ بْنِ يَزِيدَ قَالَ قُلْتُ لأَبِي عَبْدِ الله (عَلَيْهِ الْسَّلام) أَغْتَسِلُ فِي مُغْتَسَلٍ يُبَالُ فِيهِ وَيُغْتَسَلُ مِنَ الْجَنَابَةِ فَيَقَعُ فِي الإِنَاءِ مَاءٌ يَنْزُو مِنَ الأرْضِ فَقَالَ لاَ بَأْسَ بِهِ. ",
          "English Text": "8. Al-Husayn ibn Muhammad has narrated from Mu‘alla’ ibn Muhammad, from af-Washsha’, from Hammad ibn ‘Uthman, from ‘Umar ibn Yazid who has said the foiiowing: “I once asked abu ‘Abd Allah , ‘I may take Ghusl (bath) in a place which is used for taking Ghusl (bath) due to sexual matters, and urination and water-drops sprinkle from the ground into the water container.’ He (the Imam) said, ‘It is not harmful.’” "
        }
      },
      "Chapter #13": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 3: Draining Urine, Washing and If One Does Not Find Water",
          "Link": "https://thaqalayn.net/hadith/3/1/13/3",
          "Arabic Text": "3ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَحْمَدَ بْنِ أَشْيَمَ عَنْ صَفْوَانَ قَالَ سَأَلَ الرِّضَا (عَلَيْهِ الْسَّلام) رَجُلٌ وَأَنَا حَاضِرٌ فَقَالَ إِنَّ بِي جُرْحاً فِي مَقْعَدَتِي فَأَتَوَضَّأُ وَأَسْتَنْجِي ثُمَّ أَجِدُ بَعْدَ ذَلِكَ النَّدَى وَالصُّفْرَةَ مِنَ الْمَقْعَدَةِ أَ فَأُعِيدُ الْوُضُوءَ فَقَالَ وَقَدْ أَنْقَيْتَ فَقَالَ نَعَمْ قَالَ لاَ وَلَكِنْ رُشَّهُ بِالْمَاءِ وَلاَ تُعِدِ الْوُضُوءَ. أَحْمَدُ عَنْ أَبِي نَصْرٍ قَالَ سَأَلَ الرِّضَا (عَلَيْهِ الْسَّلام) رَجُلٌ بِنَحْوِ حَدِيثِ صَفْوَانَ.",
          "English Text": "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn Ahmad ibn ‘Ushaym from Safwan who has said the following: “Once a man asked al-Rida , when I was present, saying, ‘There is a wound in my anus. I take Wudu and wash clean; but then I find wetness and yellowness there. Do I need to take Wudu again ? He (the Imam) said, ‘Had you cleaned it? He replied, ‘Yes, I did so.’ He (the Imam) said, ‘No, but pour water on it and you do not need to take Wudu again.” Ahmad ibn abu Nasr has said that a man asked al-Rida , a question like that in Hadith of Safwan. "
        }
      },
      "Chapter #35": {
        "Hadith #6": {
          "Title": "Al-Kafi - Volume 3: Semen or Al-Madhiy Comes in Contact with One’s Clothes or Body",
          "Link": "https://thaqalayn.net/hadith/3/1/35/6",
          "Arabic Text": "6ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ أَبَانٍ عَنْ عَنْبَسَةَ بْنِ مُصْعَبٍ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيْهِ الْسَّلام) يَقُولُ لاَ نَرَى فِي الْمَذْيِ وُضُوءاً وَلاَ غَسْلاً مَا أَصَابَ الثَّوْبَ مِنْهُ إِلاَّ فِي الْمَاءِ الأكْبَرِ. ",
          "English Text": "6. Al-Husayn ibn Muhammad has narrated from Mu‘alla’ ibn Muhammad from al-Washsha’ from Aban from ‘Anbasah ibn Mus’ab who has said the following: “I heard abu ‘Abd Allah , say, ‘Wudu’ is not necessary because of al-Madhiy (the pre-seminal fluid) nor is washing clothes which may have come in contact with it unless it is the major discharge of (semen).”’ "
        }
      },
      "Chapter #36": {
        "Hadith #8": {
          "Title": "Al-Kafi - Volume 3: Urine Comes in Contact with One’s Clothes or Body",
          "Link": "https://thaqalayn.net/hadith/3/1/36/8",
          "Arabic Text": "8ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ الْمُثَنَّى عَنْ أَبِي أَيُّوبَ قَالَ قُلْتُ لأَبِي عَبْدِ الله (عَلَيْهِ الْسَّلام) أَدْخُلُ الْخَلاَءَ وَفِي يَدِي خَاتَمٌ فِيهِ اسْمٌ مِنْ أَسْمَاءِ الله تَعَالَى قَالَ لاَ وَلاَ تُجَامِعْ فِيهِ. وَرُوِيَ أَيْضاً أَنَّهُ إِذَا أَرَادَ أَنْ يَسْتَنْجِيَ مِنَ الْخَلاَءِ فَلْيُحَوِّلْهُ مِنَ الْيَدِ الَّتِي يَسْتَنْجِي بِهَا. ",
          "English Text": "8. A number of our people have narrated from Ahmad ibn Muhammad from ibn Faddal from al-Muthanna from abu Ayyub who has said the following: “I once said to abu ’Abd Allah , ‘I enter the toilet area and there is a ring on my hand with a name of the names of Allah, most High. He (the Imam) said, ‘No, do not go there with it and do not perform sexual intercourse when you are wearing it.’” It also is narrated that when washing because of using a toilet one must remove such ring from the hand with which one is washing. "
        }
      }
    },
    "Book #2": {
      "Chapter #6": {
        "Hadith #6": {
          "Title": "Al-Kafi - Volume 3: Examining if Hayd (menses) has Ended or Not",
          "Link": "https://thaqalayn.net/hadith/3/2/6/6",
          "Arabic Text": "6ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ مُحَمَّدِ بْنِ عَلِيٍّ الْبَصْرِيِّ قَالَ سَأَلْتُ أَبَا الْحَسَنِ الأخِيرَ (عَلَيْهِ الْسَّلام) وَقُلْتُ لَهُ إِنَّ ابْنَةَ شِهَابٍ تَقْعُدُ أَيَّامَ أَقْرَائِهَا فَإِذَا هِيَ اغْتَسَلَتْ رَأَتِ الْقَطْرَةَ بَعْدَ الْقَطْرَةِ قَالَ فَقَالَ مُرْهَا فَلْتَقُمْ بِأَصْلِ الْحَائِطِ كَمَا يَقُومُ الْكَلْبُ ثُمَّ تَأْمُرُ امْرَأَةً فَلْتَغْمِزْ بَيْنَ وَرِكَيْهَا غَمْزاً شَدِيداً فَإِنَّهُ إِنَّمَا هُوَ شَيْ‏ءٌ يَبْقَى فِي الرَّحِمِ يُقَالُ لَهُ الإِرَاقَةُ وَإِنَّهُ سَيَخْرُجُ كُلُّهُ ثُمَّ قَالَ لاَ تُخْبِرُوهُنَّ بِهَذَا وَشِبْهِهِ وَذَرُوهُنَّ وَعِلَّتَهُنَّ الْقَذِرَةَ قَالَ فَفَعَلْتُ بِالْمَرْأَةِ الَّذِي قَالَ فَانْقَطَعَ عَنْهَا فَمَا عَادَ إِلَيْهَا الدَّمُ حَتَّى مَاتَتْ. ",
          "English Text": "6. Ali ibn Muhammad has narrated from certain persons of our people from Muhammad ibn Ali al-Basriy who has said the following: “I once said to abu al-Hassan, the last , that the daughter of Shihab during her Hayd- free times, after taking Ghusl (bath), finds drops after drops of discharge. He (the Imam) said, "
        }
      },
      "Chapter #18": {
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 3: Women Must Make-up-for Fasting Because of Hayd but Not Salah (Prayer)",
          "Link": "https://thaqalayn.net/hadith/3/2/18/4",
          "Arabic Text": "4ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلًّى عَنِ الْوَشَّاءِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ إِسْمَاعِيلَ الْجُعْفِيِّ قَالَ قُلْتُ لأَبِي جَعْفَرٍ (عَلَيْهِ الْسَّلام) إِنَّ الْمُغِيرَةَ بْنَ سَعِيدٍ رَوَى عَنْكَ أَنَّكَ قُلْتَ لَهُ إِنَّ الْحَائِضَ تَقْضِي الصَّلاَةَ فَقَالَ مَا لَهُ لاَ وَفَّقَهُ الله إِنَّ امْرَأَةَ عِمْرَانَ نَذَرَتْ مَا فِي بَطْنِهَا مُحَرَّراً وَالْمُحَرَّرُ لِلْمَسْجِدِ يَدْخُلُهُ ثُمَّ لاَ يَخْرُجُ مِنْهُ أَبَداً فَلَمَّا وَضَعَتْها قالَتْ رَبِّ إِنِّي وَضَعْتُها أُنْثى‏... وَلَيْسَ الذَّكَرُ كَالأنْثى‏ فَلَمَّا وَضَعَتْهَا أَدْخَلَتْهَا الْمَسْجِدَ فَسَاهَمَتْ عَلَيْهَا الأنْبِيَاءُ فَأَصَابَتِ الْقُرْعَةُ زَكَرِيَّا وَكَفَّلَهَا زَكَرِيَّا فَلَمْ تَخْرُجْ مِنَ الْمَسْجِدِ حَتَّى بَلَغَتْ فَلَمَّا بَلَغَتْ مَا تَبْلُغُ النِّسَاءُ خَرَجَتْ فَهَلْ كَانَتْ تَقْدِرُ عَلَى أَنْ تَقْضِيَ تِلْكَ الأيَّامَ الَّتِي خَرَجَتْ وَهِيَ عَلَيْهَا أَنْ تَكُونَ الدَّهْرَ فِي الْمَسْجِدِ. ",
          "English Text": "4. Al-Husayn ibn Muhammad has narrated from Mu‘alla’ from al-Washsha’ from Aban ibn ‘Uthman from ’Isma‘il al- -Ju’fiy who has said the following: “I once said to abu Ja‘far , that al-Mughirah ibn Sa‘id has narrated from you that you have said, ‘A woman is required to perform Qada’ (compensatory prayer) of Salah (prayer) she has missed when experiencing Hayd (menses). He (the Imam) said, ‘What has happened to him, may Allah not accord him. The wife of ‘Imran made a vow about what was in her belly to be dedicated. What is dedicated to Masjid enters it then does not come out whereof forever. When she gave birth she said, ‘My Cherisher, I have given birth to a female. . . . and male is not like a female.’ When she gave birth she entered the Masjid, prophets cooperated with her and the raffle came out in the name of Zakariya’ who took charge of her upbringing. She did not come out of the Masjid until she was an adult. When she became what women become, she moved out. Was she able to perform Qada’ (compensatory prayer) of the days of Salah (prayer) she was out of the Masjid while she must have remained in the Masjid forever?”’ (The terms of dedication may not allow her to perform the form of Salah (prayer) Qada’ (compensatory prayer) required from her). "
        }
      },
      "Chapter #24": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 3: Washing Clothes of Women during Hayd",
          "Link": "https://thaqalayn.net/hadith/3/2/24/3",
          "Arabic Text": "3ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنِ الْعَبْدِ الصَّالِحِ (عَلَيْهِ الْسَّلام) قَالَ سَأَلَتْهُ أُمُّ وَلَدٍ لأَبِيهِ فَقَالَتْ جُعِلْتُ فِدَاكَ إِنِّي أُرِيدُ أَنْ أَسْأَلَكَ عَنْ شَيْ‏ءٍ وَأَنَا أَسْتَحْيِي مِنْهُ فَقَالَ سَلِي وَلاَ تَسْتَحْيِي قَالَتْ أَصَابَ ثَوْبِي دَمُ الْحَيْضِ فَغَسَلْتُهُ فَلَمْ يَذْهَبْ أَثَرُهُ فَقَالَ اصْبَغِيهِ بِمِشْقٍ حَتَّى يَخْتَلِطَ وَيَذْهَبَ. ",
          "English Text": "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Qasim ibn Muhammad from Ali ibn abu Hamzah from virtuous servant (of Allah) who has said the following: “Once a mother of the child of his father asked him (the Imam) , saying, ‘I pray to Allah to keep my soul in service for your cause, I like to ask you a question but I feel shy. He (the Imam) said, ‘Ask and do not feel shy.’ She said, ‘My clothes have come in contact with blood of Hayd (menses) and I wash them, but its marks do not go away. He (the Imam) said, ‘Dye them with Mishq (a kind of dye) to mix its color and it will go away.’” "
        }
      }
    },
    "Book #3": {
      "Chapter #1": {
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 3: Causes of Death and that Believing People May Die by any Manner of Dying",
          "Link": "https://thaqalayn.net/hadith/3/3/1/4",
          "Arabic Text": "4ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ فَضَّالٍ عَنْ مُحَمَّدِ بْنِ الْحُصَيْنِ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ الْسَّلام) قَالَ قَالَ رَسُولُ الله (صلّى اللهُ عَلَيْهِ وَآلِه) مَاتَ دَاوُدُ النَّبِيُّ (عَلَيْهِ الْسَّلام) يَوْمَ السَّبْتِ مَفْجُوءاً فَأَظَلَّتْهُ الطَّيْرُ بِأَجْنِحَتِهَا وَمَاتَ مُوسَى كَلِيمُ الله (عَلَيْهِ الْسَّلام) فِي التِّيهِ فَصَاحَ صَائِحٌ مِنَ السَّمَاءِ مَاتَ مُوسَى (عَلَيْهِ الْسَّلام) وَأَيُّ نَفْسٍ لاَ تَمُوتُ.",
          "English Text": "4. Ali ibn Ibrahim has narrated from his father from ibn Faddal, from Muhammad ibn al-Husayn from Muhammad ibn al-Fudayl, from Abd al-Rahman ibn Yazid who has said the following: “Abu ‘Abd Allah , has said that the Messenger of Allah has said, ‘Prophet David died suddenly on a Saturday and birds provided shadow over his body. Moses died in the wilderness where he had lost his way. A voice cried from the sky, “Moses has died! Who is he that does not die?””’ "
        }
      },
      "Chapter #5": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 3: A Patient’s Giving Permission to His Visitors",
          "Link": "https://thaqalayn.net/hadith/3/3/5/3",
          "Arabic Text": "3ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مُحَمَّدٍ عَنْ سَيْفِ بْنِ عَمِيرَةَ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيْهِ الْسَّلام) إِذَا دَخَلَ أَحَدُكُمْ عَلَى أَخِيهِ عَائِداً لَهُ فَلْيَسْأَلْهُ يَدْعُو لَهُ فَإِنَّ دُعَاءَهُ مِثْلُ دُعَاءِ الْمَلاَئِكَةِ. ",
          "English Text": "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn Khalid, who has narrated from al-Qasim ibn Muhammad, from ‘Abd al-Rahman ibn Muhammad, from Sayf ibn ‘Amirah, who has said the following: “Abu ‘Abd Allah , has said, ‘If one of you visits his brother in belief during his illness, he should ask him (the patient) to pray for him; a patient’s prayer is like the prayer of the angels.’” "
        }
      },
      "Chapter #6": {
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 3: How Often a Patient Should Be Visited, How Long the Duration of Visitation Should Be and Complete Visit",
          "Link": "https://thaqalayn.net/hadith/3/3/6/4",
          "Arabic Text": "4ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ عَنْ مُوسَى بْنِ قَادِمٍ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ الْسَّلام) قَالَ تَمَامُ الْعِيَادَةِ لِلْمَرِيضِ أَنْ تَضَعَ يَدَكَ عَلَى ذِرَاعِهِ وَتُعَجِّلَ الْقِيَامَ مِنْ عِنْدِهِ فَإِنَّ عِيَادَةَ النَّوْكَى أَشَدُّ عَلَى الْمَرِيضِ مِنْ وَجَعِهِ.",
          "English Text": "4. A number of our people have narrated from Sahl ibn Ziyad from Muhammad ibn Sulayman from Musa ibn Qadim from a man who has said the following: “Abu ‘Abd Allah , has said that visiting of a patient is complete upon placing your hand over his arm (praying) and standing up quickly to leave; an unwise visiting of a patient is harder for him than the pain due to illness.” "
        },
        "Hadith #6": {
          "Title": "Al-Kafi - Volume 3: How Often a Patient Should Be Visited, How Long the Duration of Visitation Should Be and Complete Visit",
          "Link": "https://thaqalayn.net/hadith/3/3/6/6",
          "Arabic Text": "6ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ مَسْعَدَةَ بْنِ صَدَقَةَ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ الْسَّلام) قَالَ إِنَّ أَمِيرَ الْمُؤْمِنِينَ (صلّى اللهُ عَلَيْهِ وَآلِه) قَالَ إِنَّ مِنْ أَعْظَمِ الْعُوَّادِ أَجْراً عِنْدَ الله عَزَّ وَجَلَّ لَمَنْ إِذَا عَادَ أَخَاهُ خَفَّفَ الْجُلُوسَ إِلاَّ أَنْ يَكُونَ الْمَرِيضُ يُحِبُّ ذَلِكَ وَ يُرِيدُهُ وَيَسْأَلُهُ ذَلِكَ وَقَالَ (عَلَيْهِ الْسَّلام) مِنْ تَمَامِ الْعِيَادَةِ أَنْ يَضَعَ الْعَائِدُ إِحْدَى يَدَيْهِ عَلَى الأخْرَى أَوْ عَلَى جَبْهَتِهِ. ",
          "English Text": "6. Ali ibn Ibrahim has narrated from Harun ibn Muslim from Mas’adah ibn Sadaqah who has said the following: “Abu ‘Abd Allah , has said that ’Amir al-Mu’minin , has said, ‘Of the visitors who receive the greatest reward from Allah, the Majestic, the Glorious, is one whose visiting time is short, unless the patient likes otherwise and asks him to stay for a longer time.’ He has also said, ‘A visit is complete when one places his hand over the other hand or upon his forehead (as an expression of concern).”’ "
        }
      },
      "Chapter #9": {
        "Hadith #7": {
          "Title": "Al-Kafi - Volume 3: Dictations to a Dying Person",
          "Link": "https://thaqalayn.net/hadith/3/3/9/7",
          "Arabic Text": "7ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ الأشْعَرِيِّ عَنْ عَبْدِ الله بْنِ مَيْمُونٍ الْقَدَّاحِ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ الْسَّلام) قَالَ كَانَ أَمِيرُ الْمُؤْمِنِينَ (عَلَيْهِ الْسَّلام) إِذَا حَضَرَ أَحَداً مِنْ أَهْلِ بَيْتِهِ الْمَوْتُ قَالَ لَهُ قُلْ لاَ إِلَهَ إِلاَّ الله الْعَلِيُّ الْعَظِيمُ سُبْحَانَ الله رَبِّ السَّمَاوَاتِ السَّبْعِ وَرَبِّ الأرَضِينَ السَّبْعِ وَمَا بَيْنَهُمَا وَرَبِّ الْعَرْشِ الْعَظِيمِ وَالْحَمْدُ لله رَبِّ الْعَالَمِينَ فَإِذَا قَالَهَا الْمَرِيضُ قَالَ اذْهَبْ فَلَيْسَ عَلَيْكَ بَأْسٌ.",
          "English Text": "7. A number of our people has narrated from Sahl ibn Ziyad from Ja‘far ibn Muhammad al-Ash’ariy from ‘Abd Allah ibn Maymun al- Qaddah who has said the following: “Abu ‘Abd Allah , has said that when ’Amir al-Mu’minin , would find any member of his family in dying condition, he would ask him to say, ‘It is Allah, the Most High, the Most Great, alone who must be worshipped. It is Allah, Lord of seven heavens and the Lord of seven earths, all that is between them and the Lord of the great Throne who is free of all defects. All praise belongs to Allah, Lord of the worlds.’ Upon the patient’s saying this, he (the Imam) then would say, ‘Go on. You do not have to worry about anything.’” "
        }
      },
      "Chapter #13": {
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 3: Things that Believers and Unbelievers See in Dying Conditions",
          "Link": "https://thaqalayn.net/hadith/3/3/13/4",
          "Arabic Text": "4ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ عَمَّارِ بْنِ مَرْوَانَ قَالَ حَدَّثَنِي مَنْ سَمِعَ أَبَا عَبْدِ الله (عَلَيْهِ الْسَّلام) يَقُولُ مِنْكُمْ وَالله يُقْبَلُ وَلَكُمْ وَالله يُغْفَرُ إِنَّهُ لَيْسَ بَيْنَ أَحَدِكُمْ وَبَيْنَ أَنْ يَغْتَبِطَ وَيَرَى السُّرُورَ وَقُرَّةَ الْعَيْنِ إِلاَّ أَنْ تَبْلُغَ نَفْسُهُ هَاهُنَا وَأَوْمَأَ بِيَدِهِ إِلَى حَلْقِهِ ثُمَّ قَالَ إِنَّهُ إِذَا كَانَ ذَلِكَ وَاحْتُضِرَ حَضَرَهُ رَسُولُ الله (صلّى اللهُ عَلَيْهِ وَآلِه) وَعَلِيٌّ (عَلَيْهِ الْسَّلام) وَجَبْرَئِيلُ وَمَلَكُ الْمَوْتِ (عَلَيْهِ الْسَّلام) فَيَدْنُو مِنْهُ عَلِيٌّ (عَلَيْهِ الْسَّلام) فَيَقُولُ يَا رَسُولَ الله إِنَّ هَذَا كَانَ يُحِبُّنَا أَهْلَ الْبَيْتِ فَأَحِبَّهُ وَيَقُولُ رَسُولُ الله (صلّى اللهُ عَلَيْهِ وَآلِه) يَا جَبْرَئِيلُ إِنَّ هَذَا كَانَ يُحِبُّ الله وَرَسُولَهُ وَأَهْلَ بَيْتِ رَسُولِهِ فَأَحِبَّهُ وَيَقُولُ جَبْرَئِيلُ لِمَلَكِ الْمَوْتِ إِنَّ هَذَا كَانَ يُحِبُّ الله وَرَسُولَهُ وَأَهْلَ بَيْتِ رَسُولِهِ فَأَحِبَّهُ وَارْفُقْ بِهِ فَيَدْنُو مِنْهُ مَلَكُ الْمَوْتِ فَيَقُولُ يَا عَبْدَ الله أَخَذْتَ فَكَاكَ رَقَبَتِكَ أَخَذْتَ أَمَانَ بَرَاءَتِكَ تَمَسَّكْتَ بِالْعِصْمَةِ الْكُبْرَى فِي الْحَيَاةِ الدُّنْيَا قَالَ فَيُوَفِّقُهُ الله عَزَّ وَجَلَّ فَيَقُولُ نَعَمْ فَيَقُولُ وَمَا ذَلِكَ فَيَقُولُ وَلاَيَةُ عَلِيِّ بْنِ أَبِي طَالِبٍ (عَلَيْهِ الْسَّلام) فَيَقُولُ صَدَقْتَ أَمَّا الَّذِي كُنْتَ تَحْذَرُهُ فَقَدْ آمَنَكَ الله مِنْهُ وَأَمَّا الَّذِي كُنْتَ تَرْجُوهُ فَقَدْ أَدْرَكْتَهُ أَبْشِرْ بِالسَّلَفِ الصَّالِحِ مُرَافَقَةِ رَسُولِ الله (صلّى اللهُ عَلَيْهِ وَآلِه) وَعَلِيٍّ وَفَاطِمَةَ (عَلَيْهِا الْسَّلام) ثُمَّ يَسُلُّ نَفْسَهُ سَلاًّ رَفِيقاً ثُمَّ يَنْزِلُ بِكَفَنِهِ مِنَ الْجَنَّةِ وَحَنُوطِهِ مِنَ الْجَنَّةِ بِمِسْكٍ أَذْفَرَ فَيُكَفَّنُ بِذَلِكَ الْكَفَنِ وَيُحَنَّطُ بِذَلِكَ الْحَنُوطِ ثُمَّ يُكْسَى حُلَّةً صَفْرَاءَ مِنْ حُلَلِ الْجَنَّةِ فَإِذَا وُضِعَ فِي قَبْرِهِ فُتِحَ لَهُ بَابٌ مِنْ أَبْوَابِ الْجَنَّةِ يَدْخُلُ عَلَيْهِ مِنْ رَوْحِهَا وَرَيْحَانِهَا ثُمَّ يُفْسَحُ لَهُ عَنْ أَمَامِهِ مَسِيرَةَ شَهْرٍ وَعَنْ يَمِينِهِ وَعَنْ يَسَارِهِ ثُمَّ يُقَالُ لَهُ نَمْ نَوْمَةَ الْعَرُوسِ عَلَى فِرَاشِهَا أَبْشِرْ بِرَوْحٍ وَرَيْحَانٍ وَجَنَّةِ نَعِيمٍ وَرَبٍّ غَيْرِ غَضْبَانَ ثُمَّ يَزُورُ آلَ مُحَمَّدٍ فِي جِنَانِ رَضْوَى فَيَأْكُلُ مَعَهُمْ مِنْ طَعَامِهِمْ وَيَشْرَبُ مِنْ شَرَابِهِمْ وَيَتَحَدَّثُ مَعَهُمْ فِي مَجَالِسِهِمْ حَتَّى يَقُومَ قَائِمُنَا أَهْلَ الْبَيْتِ فَإِذَا قَامَ قَائِمُنَا بَعَثَهُمُ الله فَأَقْبَلُوا مَعَهُ يُلَبُّونَ زُمَراً زُمَراً فَعِنْدَ ذَلِكَ يَرْتَابُ الْمُبْطِلُونَ وَيَضْمَحِلُّ الْمُحِلُّونَ وَقَلِيلٌ مَا يَكُونُونَ هَلَكَتِ الْمَحَاضِيرُ وَنَجَا الْمُقَرَّبُونَ مِنْ أَجْلِ ذَلِكَ قَالَ رَسُولُ الله (صلّى اللهُ عَلَيْهِ وَآلِه) لِعَلِيٍّ (عَلَيْهِ الْسَّلام) أَنْتَ أَخِي وَمِيعَادُ مَا بَيْنِي وَبَيْنَكَ وَادِي السَّلاَمِ قَالَ وَإِذَا احْتُضِرَ الْكَافِرُ حَضَرَهُ رَسُولُ الله (صلّى اللهُ عَلَيْهِ وَآلِه) وَعَلِيٌّ (عَلَيْهِ الْسَّلام) وَجَبْرَئِيلُ (عَلَيْهِم الْسَّلام) وَمَلَكُ الْمَوْتِ (عَلَيْهِ الْسَّلام) فَيَدْنُو مِنْهُ عَلِيٌّ (عَلَيْهِ الْسَّلام) فَيَقُولُ يَا رَسُولَ الله إِنَّ هَذَا كَانَ يُبْغِضُنَا أَهْلَ الْبَيْتِ فَأَبْغِضْهُ وَيَقُولُ رَسُولُ الله (صلّى اللهُ عَلَيْهِ وَآلِه) يَا جَبْرَئِيلُ إِنَّ هَذَا كَانَ يُبْغِضُ الله وَرَسُولَهُ وَأَهْلَ بَيْتِ رَسُولِهِ فَأَبْغِضْهُ فَيَقُولُ جَبْرَئِيلُ يَا مَلَكَ الْمَوْتِ إِنَّ هَذَا كَانَ يُبْغِضُ الله وَرَسُولَهُ وَأَهْلَ بَيْتِ رَسُولِهِ فَأَبْغِضْهُ وَاعْنُفْ عَلَيْهِ فَيَدْنُو مِنْهُ مَلَكُ الْمَوْتِ فَيَقُولُ يَا عَبْدَ الله أَخَذْتَ فَكَاكَ رِهَانِكَ أَخَذْتَ أَمَانَ بَرَاءَتِكَ تَمَسَّكْتَ بِالْعِصْمَةِ الْكُبْرَى فِي الْحَيَاةِ الدُّنْيَا فَيَقُولُ لاَ فَيَقُولُ أَبْشِرْ يَا عَدُوَّ الله بِسَخَطِ الله عَزَّ وَجَلَّ وَعَذَابِهِ وَالنَّارِ أَمَّا الَّذِي كُنْتَ تَحْذَرُهُ فَقَدْ نَزَلَ بِكَ ثُمَّ يَسُلُّ نَفْسَهُ سَلاًّ عَنِيفاً ثُمَّ يُوَكِّلُ بِرُوحِهِ ثَلاَثَمِائَةِ شَيْطَانٍ كُلُّهُمْ يَبْزُقُ فِي وَجْهِهِ وَيَتَأَذَّى بِرُوحِهِ فَإِذَا وُضِعَ فِي قَبْرِهِ فُتِحَ لَهُ بَابٌ مِنْ أَبْوَابِ النَّارِ فَيَدْخُلُ عَلَيْهِ مِنْ قَيْحِهَا وَلَهَبِهَا.",
          "English Text": "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Sinan from ‘Ammar ibn Marwan from a person who had who has said the following: “I heard abu ‘Abd Allah  say, ‘Only from you, by Allah, it (good deeds) is accepted and only your sins are forgiven. There is nothing between any one of you and bliss, joy and the delight of heart, except the time when the soul reaches here’ - pointing to his throat he continued - ‘and when that time comes the Messenger of Allah, Ali, Gabriel and the angel of death come to visit him. Ali comes near him and says, ‘O Messenger of Allah, this person loved us (Ahl al-Bayt), thus please, love him.’ The Messenger of Allah, then says, ‘O Gabriel, this person loved Allah, His Messenger, and the family of His Messenger, thus please love him.’ Gabriel then says, ‘O angel of death, this person loved Allah, His Messenger, and the family of His Messenger, thus please love him and be kind to him.’ The angel of death then comes near him and says, ‘O servant of Allah, have you freed your neck (from punishment), acquired the certificate of exoneration (from sins) and established your hold to the greatest source of protection in the worldly life?”’ The Imam then said, ‘Allah, the Majestic, the Glorious, then grants him power to say, “Yes, I have done so.’” The angel asks, “What is it?” He replies, “It is (my accepting) the guardianship, the Divine Authority of Ali ibn abu Talib  .” The angel then says, “You have spoken the truth. Allah has now granted you safety from whatever you feared and all of your wishes that you wanted have come true. There is good news for you along with the virtuous ancestors to be in the company of the Messenger of Allah, Ali and Fatimah, ‘Alayhim al-Salam .” Then he gently separates his soul from his body. Then his shroud is brought from paradise and a special (hunut) perfume in the form of Adhfar Musk. He then is dressed up with that shroud, and that hunut is used. In addition, he is dressed up with a yellow dress of the dresses of paradise. When he is placed in the grave, a door from paradise is opened, through which breeze and fragrance come to him. Thereafter, a space of the distance of one month’s journey is opened in front and on both of his sides. Then it is said to him, “Rest like a bridegroom in his bed with good news of the delightful breeze, fragrance, bountiful paradise and the pleasure of the Lord.” He then visits the family of Muhammad in Rizwan paradise, and is served food and drink with them. He speaks to them in their gatherings until the reappearance of al-Qa’im from Ahl al-Bayt. When al- Qa’im reappears, Allah resurrects them and they come along with him wholeheartedly in groups and formations. The unbelievers at this time become worthless, and disrespectful ones are destroyed but they are very few. People who want the reappearance of Al-Qa’im very quickly vanish and those who believe it (reappearance) is near gain their salvation. For this reason the Messenger of Allah said to Ali , “You are my brother and the place for us to meet is the valley of Peace.’” The Imam then said, ‘When it is time for an unbeliever to die, the Messenger of Allah, Ali, Gabriel and the angel of death visit him. Ali comes closer to him and says, “O Messenger of Allah, this person disliked us (Ahl al-Bayt), thus dislike him.” The Messenger of Allah then says, “O Gabriel, this person disliked Allah, His Messenger and the family of His Messenger (Ahl al-Bayt), thus please, dislike him.” Gabriel then says, “O angel of death, this person disliked Allah, His Messenger, and the family of His Messenger, thus you should also dislike him and be firm with him.” The angel of death then comes near him and says, “O servant of Allah, have you freed your neck from punishment, acquired the certificate of exoneration from sins and established a secure hold to the source of safety in the worldly life?” He then says, “No.” The angel then says, “O enemy of Allah, the Majestic, the Glorious, His anger, punishment and hell await you. Whatever you were afraid of has come upon you”; and then he separates his soul from his body in a very harsh manner. Three hundred devils are then assigned over his soul who spit on his face and torture his soul. When he is placed in his grave a door of the doors of hell, whereby pus and flames enter in his grave, is opened.’” "
        }
      },
      "Chapter #23": {
        "Hadith #5": {
          "Title": "Al-Kafi - Volume 3: The Amount of Water Needed for Ghusl (bath) of a Deceased Person",
          "Link": "https://thaqalayn.net/hadith/3/3/23/5",
          "Arabic Text": "5ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ الْسَّلام) قَالَ أَقَلُّ مَا يُجْزِئُ مِنَ الْكَافُورِ لِلْمَيِّتِ مِثْقَالٌ. وَفِي رِوَايَةِ الْكَاهِلِيِّ وَحُسَيْنِ بْنِ الْمُخْتَارِ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ الْسَّلام) قَالَ الْقَصْدُ مِنْ ذَلِكَ أَرْبَعَةُ مَثَاقِيلَ. ",
          "English Text": "5. A number of our people have narrated from Sahl ibn Ziyad ibn abu Najran from certain persons of his people who has said the following: “Abu ‘Abd Allah , has said, ‘The minimum camphor for a deceased is one Mithqal (4.68 g).”’ In the narration of al-Kahiliy and Husayn ibn al-Mukhtar from abu ‘Abd Allah , it is said that a balanced amount of camphor for this purpose is four Mithqal. "
        }
      },
      "Chapter #34": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 3: The Reward for Shrouding the Body of a Believing Person",
          "Link": "https://thaqalayn.net/hadith/3/3/34/1",
          "Arabic Text": "1ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ سَعْدِ بْنِ طَرِيفٍ عَنْ أَبِي جَعْفَرٍ (عَلَيْهِ الْسَّلام) قَالَ مَنْ كَفَّنَ مُؤْمِناً كَانَ كَمَنْ ضَمِنَ كِسْوَتَهُ إِلَى يَوْمِ الْقِيَامَةِ. ",
          "English Text": "1. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from Sayf ibn ‘Amirah from Sa‘d ibn Tarif who has said the following: “Abu Ja‘far , has said, ‘One who provides shrouding (materials) for a believing person is like one whose dressing (needs) is guaranteed up to the Day of Judgment.’” "
        }
      },
      "Chapter #40": {
        "Hadith #7": {
          "Title": "Al-Kafi - Volume 3: Walking Along with Procession for the Dead Body",
          "Link": "https://thaqalayn.net/hadith/3/3/40/7",
          "Arabic Text": "7ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ الْسَّلام) قَالَ سُئِلَ كَيْفَ أَصْنَعُ إِذَا خَرَجْتُ مَعَ الْجَنَازَةِ أَمْشِي أَمَامَهَا أَوْ خَلْفَهَا أَوْ عَنْ يَمِينِهَا أَوْ عَنْ شِمَالِهَا فَقَالَ إِنْ كَانَ مُخَالِفاً فَلاَ تَمْشِ أَمَامَهُ فَإِنَّ مَلاَئِكَةَ الْعَذَابِ يَسْتَقْبِلُونَهُ بِأَلْوَانِ الْعَذَابِ. ",
          "English Text": "7. Ali ibn Ibrahim has narrated from his father from al-Nawfaliy from al-Sakuniy who has said the following: “Someone asked abu ‘Abd Allah , ‘How should I walk in a funeral procession?’ The Imam replied, ‘Walk in front, or behind or on the right or left side of the coffin.’ He (the Imam) then said, ‘Do not walk in front if he is someone opposed to our belief; the angels of torment will come his way with all kinds of torment.’” "
        }
      },
      "Chapter #41": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 3: It Is Not Desirable to Ride in Funeral Procession",
          "Link": "https://thaqalayn.net/hadith/3/3/41/2",
          "Arabic Text": "2ـ عَلِيٌّ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ الله قَالَ مَاتَ رَجُلٌ مِنَ الأنْصَارِ مِنْ أَصْحَابِ رَسُولِ الله (صلّى اللهُ عَلَيْهِ وَآلِه) فَخَرَجَ رَسُولُ الله (صلّى اللهُ عَلَيْهِ وَآلِه) فِي جَنَازَتِهِ يَمْشِي فَقَالَ لَهُ بَعْضُ أَصْحَابِهِ أَ لاَ تَرْكَبُ يَا رَسُولَ الله فَقَالَ إِنِّي لأَكْرَهُ أَنْ أَرْكَبَ وَالْمَلاَئِكَةُ يَمْشُونَ وَأَبَى أَنْ يَرْكَبَ. ",
          "English Text": "2. Ali has narrated from his father from Hammad ibn ‘Isa from Hariz from ‘Abd al-Rahman ibn ‘Abd Allah who has said the following: “Abu ‘Abd Allah , has said, ‘A man from Ansar (new Muslims of al-Madinah) of the companions of the Messenger of Allah died. The Messenger of Allah came out and joined the funeral procession walking. Someone from his companions said, “Why do you not ride, O Messenger of Allah?” He replied, “I do not like to ride when angels are walking.” He refused to ride.’” "
        }
      },
      "Chapter #62": {
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 3: Entering and Coming out of the Grave",
          "Link": "https://thaqalayn.net/hadith/3/3/62/4",
          "Arabic Text": "4ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ الْسَّلام) قَالَ مَنْ دَخَلَ الْقَبْرَ فَلاَ يَخْرُجْ إِلاَّ مِنْ قِبَلِ الرِّجْلَيْنِ.",
          "English Text": "4. Ali ibn Muhammad has narrated from his father from al-Nawfaliy from al-Sakuniy who has said the following: “Abu ‘Abd Allah , has said that whoever enters a grave should come out only from the side where the feet are placed.” "
        }
      },
      "Chapter #87": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 3: A Dying Person Observes His Properties, Children and Deeds Just Before His Death",
          "Link": "https://thaqalayn.net/hadith/3/3/87/1",
          "Arabic Text": "1ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَمْرِو بْنِ عُثْمَانَ وَعِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ وَالْحَسَنُ بْنُ عَلِيٍّ جَمِيعاً عَنْ أَبِي جَمِيلَةَ مُفَضَّلِ بْنِ صَالِحٍ عَنْ جَابِرٍ عَنْ عَبْدِ الأعْلَى وَعَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ إِبْرَاهِيمَ عَنْ عَبْدِ الأعْلَى عَنْ سُوَيْدِ بْنِ غَفَلَةَ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ (صلّى اللهُ عَلَيْهِ وَآلِه) إِنَّ ابْنَ آدَمَ إِذَا كَانَ فِي آخِرِ يَوْمٍ مِنْ أَيَّامِ الدُّنْيَا وَأَوَّلِ يَوْمٍ مِنْ أَيَّامِ الآخِرَةِ مُثِّلَ لَهُ مَالُهُ وَوَلَدُهُ وَعَمَلُهُ فَيَلْتَفِتُ إِلَى مَالِهِ فَيَقُولُ وَالله إِنِّي كُنْتُ عَلَيْكَ حَرِيصاً شَحِيحاً فَمَا لِي عِنْدَكَ فَيَقُولُ خُذْ مِنِّي كَفَنَكَ قَالَ فَيَلْتَفِتُ إِلَى وَلَدِهِ فَيَقُولُ وَالله إِنِّي كُنْتُ لَكُمْ مُحِبّاً وَإِنِّي كُنْتُ عَلَيْكُمْ مُحَامِياً فَمَا ذَا لِي عِنْدَكُمْ فَيَقُولُونَ نُؤَدِّيكَ إِلَى حُفْرَتِكَ نُوَارِيكَ فِيهَا قَالَ فَيَلْتَفِتُ إِلَى عَمَلِهِ فَيَقُولُ وَالله إِنِّي كُنْتُ فِيكَ لَزَاهِداً وَإِنْ كُنْتَ عَلَيَّ لَثَقِيلاً فَمَا ذَا عِنْدَكَ فَيَقُولُ أَنَا قَرِينُكَ فِي قَبْرِكَ وَيَوْمِ نَشْرِكَ حَتَّى أُعْرَضَ أَنَا وَأَنْتَ عَلَى رَبِّكَ قَالَ فَإِنْ كَانَ لله وَلِيّاً أَتَاهُ أَطْيَبُ النَّاسِ رِيحاً وَأَحْسَنُهُمْ مَنْظَراً وَأَحْسَنُهُمْ رِيَاشاً فَقَالَ أَبْشِرْ بِرَوْحٍ وَرَيْحَانٍ وَجَنَّةِ نَعِيمٍ وَمَقْدَمُكَ خَيْرُ مَقْدَمٍ فَيَقُولُ لَهُ مَنْ أَنْتَ فَيَقُولُ أَنَا عَمَلُكَ الصَّالِحُ ارْتَحِلْ مِنَ الدُّنْيَا إِلَى الْجَنَّةِ وَإِنَّهُ لَيَعْرِفُ غَاسِلَهُ وَيُنَاشِدُ حَامِلَهُ أَنْ يُعَجِّلَهُ فَإِذَا أُدْخِلَ قَبْرَهُ أَتَاهُ مَلَكَا الْقَبْرِ يَجُرَّانِ أَشْعَارَهُمَا وَيَخُدَّانِ الأرْضَ بِأَقْدَامِهِمَا أَصْوَاتُهُمَا كَالرَّعْدِ الْقَاصِفِ وَأَبْصَارُهُمَا كَالْبَرْقِ الْخَاطِفِ فَيَقُولاَنِ لَهُ مَنْ رَبُّكَ وَمَا دِينُكَ وَمَنْ نَبِيُّكَ فَيَقُولُ الله رَبِّي وَدِينِيَ الإِسْلاَمُ وَنَبِيِّي مُحَمَّدٌ (صلّى اللهُ عَلَيْهِ وَآلِه) فَيَقُولاَنِ لَهُ ثَبَّتَكَ الله فِيمَا تُحِبُّ وَتَرْضَى وَهُوَ قَوْلُ الله عَزَّ وَجَلَّ يُثَبِّتُ الله الَّذِينَ آمَنُوا بِالْقَوْلِ الثَّابِتِ فِي الْحَياةِ الدُّنْيا وَفِي الآخِرَةِ ثُمَّ يَفْسَحَانِ لَهُ فِي قَبْرِهِ مَدَّ بَصَرِهِ ثُمَّ يَفْتَحَانِ لَهُ بَاباً إِلَى الْجَنَّةِ ثُمَّ يَقُولاَنِ لَهُ نَمْ قَرِيرَ الْعَيْنِ نَوْمَ الشَّابِّ النَّاعِمِ فَإِنَّ الله عَزَّ وَجَلَّ يَقُولُ أَصْحابُ الْجَنَّةِ يَوْمَئِذٍ خَيْرٌ مُسْتَقَرًّا وَأَحْسَنُ مَقِيلاً قَالَ وَإِنْ كَانَ لِرَبِّهِ عَدُوّاً فَإِنَّهُ يَأْتِيهِ أَقْبَحُ مَنْ خَلَقَ الله زِيّاً وَرُؤْيَا وَأَنْتَنُهُ رِيحاً فَيَقُولُ لَهُ أَبْشِرْ بِنُزُلٍ مِنْ حَمِيمٍ وَتَصْلِيَةِ جَحِيمٍ وَإِنَّهُ لَيَعْرِفُ غَاسِلَهُ وَيُنَاشِدُ حَمَلَتَهُ أَنْ يَحْبِسُوهُ فَإِذَا أُدْخِلَ الْقَبْرَ أَتَاهُ مُمْتَحِنَا الْقَبْرِ فَأَلْقَيَا عَنْهُ أَكْفَانَهُ ثُمَّ يَقُولاَنِ لَهُ مَنْ رَبُّكَ وَمَا دِينُكَ وَمَنْ نَبِيُّكَ فَيَقُولُ لاَ أَدْرِي فَيَقُولاَنِ لاَ دَرَيْتَ وَلاَ هَدَيْتَ فَيَضْرِبَانِ يَافُوخَهُ بِمِرْزَبَةٍ مَعَهُمَا ضَرْبَةً مَا خَلَقَ الله عَزَّ وَجَلَّ مِنْ دَابَّةٍ إِلاَّ وَتَذْعَرُ لَهَا مَا خَلاَ الثَّقَلَيْنِ ثُمَّ يَفْتَحَانِ لَهُ بَاباً إِلَى النَّارِ ثُمَّ يَقُولاَنِ لَهُ نَمْ بِشَرِّ حَالٍ فِيهِ مِنَ الضَّيْقِ مِثْلُ مَا فِيهِ الْقَنَا مِنَ الزُّجِّ حَتَّى إِنَّ دِمَاغَهُ لَيَخْرُجُ مِنْ بَيْنِ ظُفُرِهِ وَلَحْمِهِ وَيُسَلِّطُ الله عَلَيْهِ حَيَّاتِ الأرْضِ وَعَقَارِبَهَا وَهَوَامَّهَا فَتَنْهَشُهُ حَتَّى يَبْعَثَهُ الله مِنْ قَبْرِهِ وَإِنَّهُ لَيَتَمَنَّى قِيَامَ السَّاعَةِ فِيمَا هُوَ فِيهِ مِنَ الشَّرِّ وَقَالَ جَابِرٌ قَالَ أَبُو جَعْفَرٍ (عَلَيْهِ الْسَّلام) قَالَ النَّبِيُّ (صلّى اللهُ عَلَيْهِ وَآلِه) إِنِّي كُنْتُ أَنْظُرُ إِلَى الإِبِلِ وَالْغَنَمِ وَأَنَا أَرْعَاهَا وَلَيْسَ مِنْ نَبِيٍّ إِلاَّ وَقَدْ رَعَى الْغَنَمَ وَكُنْتُ أَنْظُرُ إِلَيْهَا قَبْلَ النُّبُوَّةِ وَهِيَ مُتَمَكِّنَةٌ فِي الْمَكِينَةِ مَا حَوْلَهَا شَيْ‏ءٌ يُهَيِّجُهَا حَتَّى تَذْعَرَ فَتَطِيرَ فَأَقُولُ مَا هَذَا وَأَعْجَبُ حَتَّى حَدَّثَنِي جَبْرَئِيلُ (عَلَيْهِم الْسَّلام) أَنَّ الْكَافِرَ يُضْرَبُ ضَرْبَةً مَا خَلَقَ الله شَيْئاً إِلاَّ سَمِعَهَا وَيَذْعَرُ لَهَا إِلاَّ الثَّقَلَيْنِ فَقُلْتُ ذَلِكَ لِضَرْبَةِ الْكَافِرِ فَنَعُوذُ بِالله مِنْ عَذَابِ الْقَبْرِ.",
          "English Text": "1. Ali ibn Ibrahim has narrated from his father from ‘Amr ibn ‘Uthman and a number of our people, from Sahl ibn Ziyad from Ahmad ibn Muhammad ibn abu Nasr and al-Hassan ibn Ali all from abu Jamilah Mufaddal ibn Salih from Jabir from ‘Abd al-‘A’la’ and Ali ibn Ibrahim from Muhammad ibn ‘Isa from Yunus from Ibrahim from ‘Abd al-‘A’la’ from Suwayd ibn Ghafalah who has said the following: “Amir al-Mu’minin , has said, ‘When a child of Adam finds himself in the first day of his next life and the last day of his worldly life, his property, children and deeds are pictured before him. He then turns to his property and says, “By Allah, I was very greedy and stingy about you. In what ways can you help me?” It will say, “All you can do is to take your shroud from me.” He then turns to his children saying, “I loved you, protected you all the time. In what ways can you help me?” They will say, “We can take you to your grave and bury you therein.” He then turns to his deeds and asks, “By Allah, I had very little inclination to perform you and felt burdened because of you. In what ways can you help me now?” His deed will say, “I am your companion in your grave up to the day you will be resurrected, until we both will be brought before your Lord.’” The Imam then said, ‘If he is a friend of Allah, a person, the best of people with fragrance, the best in beauty, and in the best of dresses comes to him and says, “I have brought you the happiness and fragrance of paradise of blessings and you are most welcome.” He will then ask, “Who are you?” The person says, “I am your good deeds. You now move from the worldly life to paradise.” He knows those who wash his body for burial and begs those who carry his coffin to hurry up. When he is placed in his grave, two angels will come with their hairs dragging on the ground and tearing the earth with their feet, with thunderous sounds and their eyes like swift lightening. They will ask, “Who is your Lord? What is your religion and who is your prophet?” He will reply, “Allah is my Lord, Islam is my religion and Muhammad, O Allah grant compensation to Muhammad and his family worthy of their services to Your cause, is my prophet.” The two angels will then say, “May Allah keep you steadfast in what you love and are happy therewith.” This is a reference to the words of Allah, most Majestic, most Glorious, “Allah keeps the believers steadfast in the unchanging words, in this world and in the next life” (14:26). The two angels then open up his grave as far as his eyes can see, and a door to paradise and then say to him, “Rest delightfully like a blessed young person,” because Allah, the Most Majestic, the Most Glorious, has said, “People of paradise, on that day will have the best station and resting place” (25:26). The Imam then said, ‘If he is an enemy of his Lord, Allah’s ugliest creatures with the ugliest dress, appearance and smell will come to him and say, “Your place is boiling water and to suffer heat.” He knows people who wash his body for burial and begs those who carry his body to his grave to hold him back. When he is placed in his grave, the two examiners will come to him, remove his shroud away and ask him, “Who is your Lord? What is your religion and who is your prophet?” He will say, “I do not know.” They will say, “You did not know and you never had any guidance.” They will strike him at the front part of his head with a crashing hammer that they carry. The sound of this strike will frighten all creatures of Allah, the Most Majestic, the Most Glorious, except man and Jinn. They then open a door to hell for him and say to him, “Lie down here in worst condition, due to lack of space, as if squeezed like the iron spike into the tip of spears.” It will force his brain to squirt out of his toe and fingernails through the tissues of his flesh. Allah then gives his control to the snakes, scorpions and the creatures of earth that keep biting him until Allah will resurrect him from his grave. He will wish for the coming of the Day of Judgment because of suffering in his wicked condition.’” Jabir has said that abu Ja‘far has said that the Holy Prophet has said, ‘When watching the camels and sheep graze, before being commissioned as a prophet - there is no prophet who did not shepherd sheep - 1 could see them, while in safe and protected place and nothing around them, suddenly become excited and jump around frightened. I would say, “What is this strange phenomenon?” Once, Jibril (Gabriel) told me that when an unbeliever in his grave is struck on his head by the interrogating angels, all creatures of Allah, except man and Jinn, hear the sound of that (horrifying) strike and become frightened. I then said, “This is because of only one strike on the head of a disbeliever. I seek refuge with Allah against the (rest of the) torments in the grave.’”” "
        }
      }
    },
    "Book #4": {
      "Chapter #1": {
        "Hadith #13": {
          "Title": "Al-Kafi - Volume 3: The Excellence of Prayer",
          "Link": "https://thaqalayn.net/hadith/3/4/1/13",
          "Arabic Text": "13ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ عَبْدِ الله بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ أَبِيهِ عَنْ عَبْدِ الله بْنِ الْمُغِيرَةِ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ الْسَّلام) قَالَ قَالَ رَسُولُ الله (صلّى اللهُ عَلَيْهِ وَآلِه) الصَّلاَةُ مِيزَانٌ مَنْ وَفَّى اسْتَوْفَى. ",
          "English Text": "13. Muhammad ibn Yahya has narrated from ‘Abd Allah ibn Muhammad ibn ‘Isa from his father from ‘Abd Allah ibn al-Mughirah formal-Sakuniy who has said the following: “The Messenger of Allah has said, ‘Salah (prayer) is a balance. Whoever maintains it balanced receives his part properly balanced.  "
        }
      },
      "Chapter #3": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 3: Salah (Prayer) Is Made Obligatory (Chapters 3-15, practical rules about prayer are best expressed in the form of fatwa.)",
          "Link": "https://thaqalayn.net/hadith/3/4/3/1",
          "Arabic Text": "1ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى وَمُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى وَمُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ زُرَارَةَ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ (عَلَيْهِ الْسَّلام) عَمَّا فَرَضَ الله عَزَّ وَجَلَّ مِنَ الصَّلاَةِ فَقَالَ خَمْسُ صَلَوَاتٍ فِي اللَّيْلِ وَالنَّهَارِ فَقُلْتُ فَهَلْ سَمَّاهُنَّ وَبَيَّنَهُنَّ فِي كِتَابِهِ قَالَ نَعَمْ قَالَ الله تَعَالَى لِنَبِيِّهِ (صلّى اللهُ عَلَيْهِ وَآلِه) أَقِمِ الصَّلاةَ لِدُلُوكِ الشَّمْسِ إِلى‏ غَسَقِ اللَّيْلِ وَدُلُوكُهَا زَوَالُهَا فَفِيمَا بَيْنَ دُلُوكِ الشَّمْسِ إِلَى غَسَقِ اللَّيْلِ أَرْبَعُ صَلَوَاتٍ سَمَّاهُنَّ الله وَبَيَّنَهُنَّ وَوَقَّتَهُنَّ وَغَسَقُ اللَّيْلِ هُوَ انْتِصَافُهُ ثُمَّ قَالَ تَبَارَكَ وَتَعَالَى وَقُرْآنَ الْفَجْرِ إِنَّ قُرْآنَ الْفَجْرِ كانَ مَشْهُوداً فَهَذِهِ الْخَامِسَةُ وَقَالَ الله تَعَالَى فِي ذَلِكَ أَقِمِ الصَّلاةَ طَرَفَيِ النَّهارِ وَطَرَفَاهُ الْمَغْرِبُ وَالْغَدَاةُ وَزُلَفاً مِنَ اللَّيْلِ وَهِيَ صَلاَةُ الْعِشَاءِ الآخِرَةِ وَقَالَ تَعَالَى حافِظُوا عَلَى الصَّلَواتِ وَالصَّلاةِ الْوُسْطى‏ وَهِيَ صَلاَةُ الظُّهْرِ وَهِيَ أَوَّلُ صَلاَةٍ صَلاَّهَا رَسُولُ الله (صلّى اللهُ عَلَيْهِ وَآلِه) وَهِيَ وَسَطُ النَّهَارِ وَوَسَطُ الصَّلاَتَيْنِ بِالنَّهَارِ صَلاَةِ الْغَدَاةِ وَصَلاَةِ الْعَصْرِ وَفِي بَعْضِ الْقِرَاءَةِ حافِظُوا عَلَى الصَّلَواتِ وَالصَّلاةِ الْوُسْطى‏ صَلاَةِ الْعَصْرِ وَقُومُوا لله قانِتِينَ قَالَ وَنَزَلَتْ هَذِهِ الآيَةُ يَوْمَ الْجُمُعَةِ وَرَسُولُ الله (صلّى اللهُ عَلَيْهِ وَآلِه) فِي سَفَرِهِ فَقَنَتَ فِيهَا رَسُولُ الله (صلّى اللهُ عَلَيْهِ وَآلِه) وَتَرَكَهَا عَلَى حَالِهَا فِي السَّفَرِ وَالْحَضَرِ وَأَضَافَ لِلْمُقِيمِ رَكْعَتَيْنِ وَإِنَّمَا وُضِعَتِ الرَّكْعَتَانِ اللَّتَانِ أَضَافَهُمَا النَّبِيُّ (صلّى اللهُ عَلَيْهِ وَآلِه) يَوْمَ الْجُمُعَةِ لِلْمُقِيمِ لِمَكَانِ الْخُطْبَتَيْنِ مَعَ الإِمَامِ فَمَنْ صَلَّى يَوْمَ الْجُمُعَةِ فِي غَيْرِ جَمَاعَةٍ فَلْيُصَلِّهَا أَرْبَعَ رَكَعَاتٍ كَصَلاَةِ الظُّهْرِ فِي سَائِرِ الأيَّامِ.",
          "English Text": "1. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa and Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa and Muhammad ibn ’Isma‘il from af-Fadl ibn Shadhan all Hammad ibn ‘Isa from Hariz from Zurarah who has said the following: “I once asked abu Ja‘far , about how much of Salah (prayer) Allah, most Majestic, most Glorious, has made obligatory. He (the Imam) said, ‘During one day and night five Salah (prayer) are made obligatory.’ I then asked, ‘Has He named and explained them in His book?’ He (the Imam) said, ‘Yes, Allah, most High has said to His Holy Prophet, “Perform Salah (prayer) after the sun declines to the west, on midday until the darkness of the night.” (17: 78). The sun declines on midday. There are four Salah (prayer) between midday and the darkness of the night. Allah has named, explained and timed them. Darkness of night is in midnight. He, most Blessed, most High has then said, “. . . and the recitation (performing Salah (prayer)) at dawn and recitation at dawn was witnessed (attended by the angels of the day and those of the nights).” These are five Salah (prayers). Allah, most High about this issue has said, “Perform Salah (prayer) on both ends of the day, [which is sunset and morning], and in a part of the night.” (11:116) This is al-Tsha’ Salah (prayer) He, most High has said, “Preserve Salah (prayer) especially the middle Salah (prayer).” (2:239) Middle Salah (prayer) is al- Dhuhr Salah (prayer) which is the first Salah (prayer) the Messenger of Allah performed. It is in the middle of two Salah (prayer) during the day, the morning and al-‘Asr Salah (prayer). In some of the recitations it is said, “Preserve Salawat (prayers) and the middle Salah (prayer).” Middle Salah (prayer) is al-‘Asr Salah (prayer).’ About the words of Allah, “Stand up praying before Allah,” he (the Imam) said, ‘This verse was revealed on Friday when the Messenger of Allah was on a journey. The Messenger of Allah prayed before Allah on Friday and left it in that condition during a journey or when at home. For those at home he added two Rak‘ats. He reduced two Rak‘at which the Holy Prophet, had added on Friday for people when at home, because of the two sermons which a prayer leader delivers. Those who perform Friday prayer without congregation, they perform it four Rak‘at like al-Dhuhr Salah (prayer) in other days.’” "
        }
      },
      "Chapter #18": {
        "Hadith #26": {
          "Title": "Al-Kafi - Volume 3: Commencement of Adhan, Iqamah, and the Excellence of Reading them",
          "Link": "https://thaqalayn.net/hadith/3/4/18/26",
          "Arabic Text": "26ـ جَمَاعَةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ الْحَسَنِ بْنِ السَّرِيِّ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ الْسَّلام) قَالَ الأذَانُ تَرْتِيلٌ وَالإِقَامَةُ حَدْرٌ.",
          "English Text": "26. A group of our people has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Sinan from al-Hassan ibn al-Sariy who has said the following: “Abu ‘Abd Allah , has said, ‘Adhan is said with Tartil (articulation slowly) and ‘Iqamah is said quickly.’” "
        }
      },
      "Chapter #21": {
        "Hadith #21": {
          "Title": "Al-Kafi - Volume 3: Recitations in Salah (prayer)",
          "Link": "https://thaqalayn.net/hadith/3/4/21/21",
          "Arabic Text": "21ـ وَعَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ سَأَلْتُهُ عَنْ قَوْلِ الله عَزَّ وَجَلَّ وَلا تَجْهَرْ بِصَلاتِكَ وَلا تُخافِتْ بِها قَالَ الْمُخَافَتَةُ مَا دُونَ سَمْعِكَ وَالْجَهْرُ أَنْ تَرْفَعَ صَوْتَكَ شَدِيداً.",
          "English Text": "21. It is a narration from him (narrator of previous Hadith) by Ahmad ibn Muhammad from ‘Uthman ibn ‘Isa from Sama’ah who has said the following: “I once asked him (the Imam) , about the words of Allah, most Majestic, most Glorious, ‘Do not be loud in your Salah (prayer) nor very quiet.’ (17:110) He (the Imam) said, ‘Quiet is when you do not hear it, and loud is when you raise your voice very loud.’” "
        }
      },
      "Chapter #24": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 3: Ruku‘ (Kneeling) and Readings therein and When Standing up Straight Thereafter",
          "Link": "https://thaqalayn.net/hadith/3/4/24/1",
          "Arabic Text": "1ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ زُرَارَةَ وَعَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ (عَلَيْهِ الْسَّلام) قَالَ إِذَا أَرَدْتَ أَنْ تَرْكَعَ فَقُلْ وَأَنْتَ مُنْتَصِبٌ الله أَكْبَرُ ثُمَّ ارْكَعْ وَقُلِ اللهمَّ لَكَ رَكَعْتُ وَلَكَ أَسْلَمْتُ وَبِكَ آمَنْتُ وَعَلَيْكَ تَوَكَّلْتُ وَأَنْتَ رَبِّي خَشَعَ لَكَ قَلْبِي وَسَمْعِي وَبَصَرِي وَشَعْرِي وَبَشَرِي وَلَحْمِي وَدَمِي وَمُخِّي وَعِظَامِي وَعَصَبِي وَمَا أَقَلَّتْهُ قَدَمَايَ غَيْرَ مُسْتَنْكِفٍ وَلاَ مُسْتَكْبِرٍ وَلاَ مُسْتَحْسِرٍ سُبْحَانَ رَبِّيَ الْعَظِيمِ وَبِحَمْدِهِ ثَلاَثَ مَرَّاتٍ فِي تَرْتِيلٍ وَتَصُفُّ فِي رُكُوعِكَ بَيْنَ قَدَمَيْكَ تَجْعَلُ بَيْنَهُمَا قَدْرَ شِبْرٍ وَتُمَكِّنُ رَاحَتَيْكَ مِنْ رُكْبَتَيْكَ وَتَضَعُ يَدَكَ الْيُمْنَى عَلَى رُكْبَتِكَ الْيُمْنَى قَبْلَ الْيُسْرَى وَبَلِّعْ بِأَطْرَافِ أَصَابِعِكَ عَيْنَ الرُّكْبَةِ وَفَرِّجْ أَصَابِعَكَ إِذَا وَضَعْتَهَا عَلَى رُكْبَتَيْكَ وَأَقِمْ صُلْبَكَ وَمُدَّ عُنُقَكَ وَلْيَكُنْ نَظَرُكَ بَيْنَ قَدَمَيْكَ ثُمَّ قُلْ سَمِعَ الله لِمَنْ حَمِدَهُ وَأَنْتَ مُنْتَصِبٌ قَائِمٌ الْحَمْدُ لله رَبِّ الْعَالَمِينَ أَهْلَ الْجَبَرُوتِ وَالْكِبْرِيَاءِ وَالْعَظَمَةُ لله رَبِّ الْعَالَمِينَ تَجْهَرُ بِهَا صَوْتَكَ ثُمَّ تَرْفَعُ يَدَيْكَ بِالتَّكْبِيرِ وَتَخِرُّ سَاجِداً.",
          "English Text": "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Hammad ibn ‘Isa from Hariz from Zurarah and Ali ibn Ibrahim has narrated from his father from Hammad from Hariz from Zurarah who has said the following: “Abu Ja’far , has said, ‘When you want to kneel for Ruku‘ say, ‘Allah is great’ before it, then assume Ruku‘ position and say, ‘O Lord, I have knelt down for You, I am submitted to You, I believe in You, and I plead before You to be my attorney. You are my Lord. My heart, my ears, my eyes, my hairs, my skin, my flesh, my blood, my bone marrow, my bones, my nerves and all that my legs support of me are humble before You without reservations, arrogance or tiredness.’ Say three times, ‘My Lord, the great, is free of all defects and I praise Him,’ with clarity and fluency. In Ruku‘ position you should level up your feet with a distance of one shibr (eight inches) between them, place your palms over your knees, first your right palm on the right knee, and then the left palm over your left knee. Open your fingers and make them to hold the sides of your knees, keep your back straight, stretch your neck forward and keep your eyes to look between your feet. Then, while standing straight, say, ‘Allah hears all who praise Him. All praise belongs to Allah, Lord of the worlds, the owner of might and majesty. Greatness belongs to Allah, Lord of the worlds,’ raise your voice when saying this, then raise your hands for saying ‘Allah is great’ and then bow down for sajdah.” "
        }
      },
      "Chapter #34": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 3: Mistake in Opening of Salah (Prayer)",
          "Link": "https://thaqalayn.net/hadith/3/4/34/3",
          "Arabic Text": "3ـ مُحَمَّدُ بْنُ يَحْيَى رَفَعَهُ عَنِ الرِّضَا (عَلَيْهِ الْسَّلام) قَالَ الإِمَامُ يَحْمِلُ أَوْهَامَ مَنْ خَلْفَهُ إِلاَّ تَكْبِيرَةَ الافْتِتَاحِ. ",
          "English Text": "3. Muhammad ibn Yahya in a marfu‘ manner has narrated from the following: “Al-Rida , has said, ‘An Imam carries and sustains the conjectures of those who are behind him except the opening Takbir (Allah is great beyond description).”’ "
        }
      },
      "Chapter #40": {
        "Hadith #9": {
          "Title": "Al-Kafi - Volume 3: Mistakes in Salah (Prayer) of Three or Four Rak‘at",
          "Link": "https://thaqalayn.net/hadith/3/4/40/9",
          "Arabic Text": "9ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ حَدِيدٍ عَنْ جَمِيلٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ الله (عَلَيْهِ الْسَّلام) قَالَ فِي مَنْ لاَ يَدْرِي أَ ثَلاَثاً صَلَّى أَمْ أَرْبَعاً وَوَهْمُهُ فِي ذَلِكَ سَوَاءٌ قَالَ فَقَالَ إِذَا اعْتَدَلَ الْوَهْمُ فِي الثَّلاَثِ وَالأرْبَعِ فَهُوَ بِالْخِيَارِ إِنْ شَاءَ صَلَّى رَكْعَةً وَهُوَ قَائِمٌ وَإِنْ شَاءَ صَلَّى رَكْعَتَيْنِ وَأَرْبَعَ سَجَدَاتٍ وَهُوَ جَالِسٌ وَقَالَ فِي رَجُلٍ لَمْ يَدْرِ أَ ثِنْتَيْنِ صَلَّى أَمْ أَرْبَعاً وَوَهْمُهُ يَذْهَبُ إِلَى الأرْبَعِ أَوْ إِلَى الرَّكْعَتَيْنِ فَقَالَ يُصَلِّي رَكْعَتَيْنِ وَأَرْبَعَ سَجَدَاتٍ وَقَالَ إِنْ ذَهَبَ وَهْمُكَ إِلَى رَكْعَتَيْنِ وَأَرْبَعٍ فَهُوَ سَوَاءٌ وَلَيْسَ الْوَهْمُ فِي هَذَا الْمَوْضِعِ مِثْلَهُ فِي الثَّلاَثِ وَالأرْبَعِ. ",
          "English Text": "9. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn Hadid from Jamil certain persons of our people who have said the following: “Abu ‘Abdullah , has said, ‘ One may not know whether he has performed three or four and his guess about both sides is equal. (For such case) he (the narrator) has said that he (the Imam) said, ‘If his guess is equal about three and four, he has the choice to perform one Rak’ah standing or two Rak’ah in a sitting position and four Sujud (prostrations) in a sitting position.’ He (the Imam) , about a man who does not know if he has performed two or four Rak’ah and his guess about four is greater or about two Rak‘at, he (the Imam) said that he performs two Rak‘at and four Sujud (prostrations). He (the Imam) said, ‘If your guess about two Rak‘at and four is equal, then this and the case of doubt about whether it is three or four Rak‘at is not the same.”’ "
        }
      },
      "Chapter #60": {
        "Hadith #35": {
          "Title": "Al-Kafi - Volume 3: Kinds of Clothes in Which It Is Undesirable to Perform Salah (Prayer) As Well As Otherwise",
          "Link": "https://thaqalayn.net/hadith/3/4/60/35",
          "Arabic Text": "35ـ عَلِيٌّ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ الْسَّلام) قَالَ قَالَ رَسُولُ الله (صلّى اللهُ عَلَيْهِ وَآلِه) لاَ يُصَلِّ الرَّجُلُ وَفِي يَدِهِ خَاتَمُ حَدِيدٍ. وَرُوِيَ إِذَا كَانَ الْمِفْتَاحُ فِي غِلاَفٍ فَلاَ بَأْسَ. ",
          "English Text": "35. Ali has narrated from his father from al-Nawfaliy from al-Sakuniy who has said the following: “Abu ‘Abd Allah , has said that the Messenger of Allah has said, ‘A man does not perform Salah (prayer) wearing an iron ring.’” “It is narrated that if a key is inside cover then it is not an offense.” (Ahadith 1-35 of this chapter are best explained by fatwa.) "
        }
      },
      "Chapter #61": {
        "Hadith #14": {
          "Title": "Al-Kafi - Volume 3: Rules about Performing Salah (Prayer) in an Unclean Cloth Regardless One Knows it or Not",
          "Link": "https://thaqalayn.net/hadith/3/4/61/14",
          "Arabic Text": "14ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ عَبْدِ الله بْنِ عَامِرٍ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ وَمُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيٍّ وَعَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ قَالَ قَرَأْتُ فِي كِتَابِ عَبْدِ الله بْنِ مُحَمَّدٍ إِلَى أَبِي الْحَسَنِ (عَلَيْهِ الْسَّلام) جُعِلْتُ فِدَاكَ رَوَى زُرَارَةُ عَنْ أَبِي جَعْفَرٍ وَأَبِي عَبْدِ الله (صلّى اللهُ عَلَيْهِ وَآلِه) فِي الْخَمْرِ يُصِيبُ ثَوْبَ الرَّجُلِ أَنَّهُمَا قَالاَ لاَ بَأْسَ بِأَنْ يُصَلَّى فِيهِ إِنَّمَا حُرِّمَ شُرْبُهَا وَرَوَى غَيْرُ زُرَارَةَ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ الْسَّلام) أَنَّهُ قَالَ إِذَا أَصَابَ ثَوْبَكَ خَمْرٌ أَوْ نَبِيذٌ يَعْنِي الْمُسْكِرَ فَاغْسِلْهُ إِنْ عَرَفْتَ مَوْضِعَهُ وَإِنْ لَمْ تَعْرِفْ مَوْضِعَهُ فَاغْسِلْهُ كُلَّهُ وَإِنْ صَلَّيْتَ فِيهِ فَأَعِدْ صَلاَتَكَ فَأَعْلِمْنِي مَا آخُذُ بِهِ فَوَقَّعَ بِخَطِّهِ (عَلَيْهِ الْسَّلام) خُذْ بِقَوْلِ أَبِي عَبْدِ الله (عَلَيْهِ الْسَّلام).",
          "English Text": "14. Al-Husayn ibn Muhammad has narrated from ‘Abd Allah ibn ‘Amir from Ali ibn Mahziyar from and Muhammad ibn Yahya from Ahmad ibn Muhammad from Ali and Ali ibn Muhammad from Sahl ibn Ziyad from Ali ibn Mahziyar who has said the following: “I read in the letter of ’Abd Allah ibn Muhammad to abu al-Hassan , in which he has said, ‘I pray to Allah to keep my soul in service for your cause. Zurarah has narrated for abu Ja’far, and abu ‘Abd Allah, ‘Alayhim al-Salam, about wine which pollutes one’s clothes that the two Imam had said, “It is not an offense to perform Salah (prayer) with such clothes. Only drinking wine is unlawful.” People other than Zurarah have narrated from abu ‘Abd Allah . He (the Imam) has said, “If wine or al-Nabidh (a kind of wine) or any intoxicating thing pollutes your clothes, wash if you know the area of contact. If you do not know the area of contact, then wash all of such clothes. If you have performed Salah (prayer) with it perform such Salah (prayer) again.” Please instruct me which one I must follow. He (the Imam) wrote with his signature, “You must follow the words of abu ‘Abd Allah .’” "
        }
      },
      "Chapter #69": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 3: The Time for Friday and ‘Asr Salah (prayer)",
          "Link": "https://thaqalayn.net/hadith/3/4/69/1",
          "Arabic Text": "1ـ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ رِبْعِيٍّ وَمُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ جَمِيعاً عَنْ أَبِي عَبْدِ الله (عَلَيْهِ الْسَّلام) قَالَ وَقْتُ الظُّهْرِ يَوْمَ الْجُمُعَةِ حِينَ تَزُولُ الشَّمْسُ.",
          "English Text": "1. Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan from Hammad ibn ‘Isa from Rib‘i and Muhammad ibn Yahya from Muhammad ibn al-Husayn from ‘Uthman ibn ‘Isa from Sama‘ah all who has said the following: “Abu ’Abd Allah , has said that Abu ’Abd Allah , has said, ‘The time of al-Dhuhr on Friday begins at Zawal (declining of the sun toward the west at noontime).” "
        }
      },
      "Chapter #74": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 3: Optional Salah (Prayer) On Friday",
          "Link": "https://thaqalayn.net/hadith/3/4/74/1",
          "Arabic Text": "1ـ عَلِيُّ بْنُ مُحَمَّدٍ وَغَيْرُهُ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ قَالَ قَالَ أَبُو الْحَسَنِ (عَلَيْهِ الْسَّلام) الصَّلاَةُ النَّافِلَةُ يَوْمَ الْجُمُعَةِ سِتُّ رَكَعَاتٍ بُكْرَةً وَسِتُّ رَكَعَاتٍ صَدْرَ النَّهَارِ وَرَكْعَتَانِ إِذَا زَالَتِ الشَّمْسُ ثُمَّ صَلِّ الْفَرِيضَةَ وَصَلِّ بَعْدَهَا سِتَّ رَكَعَاتٍ.",
          "English Text": "1. Ali ibn Muhammad and others have narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad from ibn abu Nasr who has said the following: “Abu al-Hassan , has said, ‘Optional Salah (prayer) on Friday is six Rak‘at very early, six Rak‘at in midday, two Rak‘at at Zawal (declining of the sun toward the west at noontime), then perform obligatory Salah (prayer), then perform six Rak‘at thereafter.”’ "
        },
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 3: Optional Salah (Prayer) On Friday",
          "Link": "https://thaqalayn.net/hadith/3/4/74/3",
          "Arabic Text": "3ـ جَمَاعَةٌ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ أَوْ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ ابْنِ مُسْكَانَ عَنْ عَبْدِ الله بْنِ عَجْلاَنَ قَالَ قَالَ أَبُو جَعْفَرٍ (عَلَيْهِ الْسَّلام) إِذَا كُنْتَ شَاكّاً فِي الزَّوَالِ فَصَلِّ رَكْعَتَيْنِ فَإِذَا اسْتَيْقَنْتَ فَابْدَأْ بِالْفَرِيضَةِ. ",
          "English Text": "3. A group has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from Fadalah or Muhammad ibn Sinan from ibn Muskan from ‘Abd Allah ibn ‘Ajalan who has said the following: “Abu Ja’far , has said, ‘If you have doubts about Zawal (declining of the sun toward the west at noontime), perform two Rak‘at. When you become certain of Zawal, then begin performing obligatory Salah (prayer).”’ "
        }
      },
      "Chapter #80": {
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 3: Rules about Sailors and People Traveling Very often",
          "Link": "https://thaqalayn.net/hadith/3/4/80/4",
          "Arabic Text": "4ـ مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنِ ابْنِ بُكَيْرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ الله (عَلَيْهِ الْسَّلام) عَنِ الرَّجُلِ يَتَصَيَّدُ الْيَوْمَ وَالْيَوْمَيْنِ وَالثَّلاَثَةَ أَ يَقْصُرُ الصَّلاَةَ قَالَ لاَ إِلاَّ أَنْ يُشَيِّعَ الرَّجُلُ أَخَاهُ فِي الدِّينِ وَإِنَّ التَّصَيُّدَ مَسِيرٌ بَاطِلٌ لاَ تُقْصَرُ الصَّلاَةُ فِيهِ وَقَالَ يَقْصُرُ إِذَا شَيَّعَ أَخَاهُ. عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ عَنْ بَعْضِ أَصْحَابِهِ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ مِثْلَهُ.",
          "English Text": "4. Muhammad ibn al-Hassan has narrated from Sahl ibn Ziyad from Ali ibn Asbat from ibn Bukayr who has said the following: “I once asked abu ‘Abd Allah , about a man who goes hunting for one, two or three days. Is he required to perform his Salah (prayer) as reduced? He (the Imam) said, ‘No, he cannot perform as reduced. However if one escorts one’s brother in belief, then it is permissible to do so. Hunting is a way of falsehood and Salah (prayer) is not performed as reduced.’ He (the Imam) said, ‘When you escort your brother in religion you can perform your Salah (prayer) as reduced.’” “A number of our people have narrated from Ahmad ibn Muhammad from al-Barqiy from certain persons of his people from Ali ibn Asbat a similar Hadith. "
        }
      },
      "Chapter #88": {
        "Hadith #6": {
          "Title": "Al-Kafi - Volume 3: Salah (Prayer) of Both ‘Id and the Sermon for it",
          "Link": "https://thaqalayn.net/hadith/3/4/88/6",
          "Arabic Text": "6ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ جَعْفَرٍ عَنْ أَبِيهِ (عَلَيْهِ الْسَّلام) قَالَ نَهَى رَسُولُ الله (عَلَيْهِ الْسَّلام) أَنْ يُخْرَجَ السِّلاَحُ فِي الْعِيدَيْنِ إِلاَّ أَنْ يَكُونَ عَدُوٌّ حَاضِرٌ.",
          "English Text": "6. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from al-Nawfaliy from al-Sakuniy who has said the following: “Ja‘far has narrated from his father , who has said that the Messenger of Allah prohibited taking out arms on both days of ‘Id unless enemy was present.’” "
        }
      }
    },
    "Book #5": {
      "Chapter #13": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 3: (Without Title)",
          "Link": "https://thaqalayn.net/hadith/3/5/13/2",
          "Arabic Text": "2ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَبْدِ الله بْنِ سِنَانٍ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيْهِ الْسَّلام) يَقُولُ بَاعَ أَبِي مِنْ هِشَامِ بْنِ عَبْدِ الْمَلِكِ أَرْضاً لَهُ بِكَذَا وَكَذَا أَلْفَ دِينَارٍ وَاشْتَرَطَ عَلَيْهِ زَكَاةَ ذَلِكَ الْمَالِ عَشْرَ سِنِينَ وَإِنَّمَا فَعَلَ ذَلِكَ لأَنَّ هِشَاماً كَانَ هُوَ الْوَالِيَ.",
          "English Text": "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Hassan ibn Mahbub from ‘Abd Allah ibn Sinan who has said the following: “I once heard abu ‘Abd Allah , say, ‘My father purchased a piece of land from Hisham ibn ‘Abd al-Malik for such and such hundred thousand dinar with a condition that he will pay its Zakat for ten years. He did it as such because Hisham was the ruler.’” "
        }
      }
    }
  }
}