{
  "Volume #12": {
    "Book #1": {
      "Chapter #1": {
        "Hadith #201": {
          "Title": "ʿUyun akhbar al-Rida - Volume 2: Traditions about Ar-Ridha (a.s.)",
          "Link": "https://thaqalayn.net/hadith/12/1/1/201",
          "Arabic Text": "201 - حَدَّثَنا الحُسَيْنِ بْنِ إِبْراهيمِ بْنِ ناتانَةَ رَضِىَ اللهُعَنْهُ قالَ: حَدَّثَني عَلِىِّ بْن إِبراهِيمِ بْنِ هاشِمٍ، عَن الرَّيانِ بْنِ الصَّلْتِ، عَنْ أَبي الحَسَن عَلِىِّ بْنِ مُوسَى الرِّضا عَلَيْهِ السَّلامُ، عَنْ أَبيهِ، عَنْ آبائِهِ، عَنْ عَلِيِ‏ عَلَيْهِ السَّلامُ قالَ: قالَ رَسُولَ اللَّهِ‏ صَلَّى اللهُ عَلَيْهِ وَآلِهِ: شِيعَةُ عَلِيِّ هُمُ الفائِزوُن يَوْمَ القِيامَةِ.",
          "English Text": "31-201 Al-Husayn ibn Ibrahim ibn Tatana - may God be pleased with him - narrated that Ali ibn Ibrahim ibn Hashem quoted on the authority of his father, on the authority of al-Ryan ibn al-Salt, on the authority of Abil Hassan Ali ibn Musa Ar-Ridha’ , on the authority of his father , on the authority of his forefathers , on the authority of Ali  that God’s Prophet (S) said, “The followers of Ali  are prosperous on the Resurrection Day.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "من حيث السند لا بأس بها",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (8/538)"
          }
        }
      },
      "Chapter #10": {
        "Hadith #2": {
          "Title": "ʿUyun akhbar al-Rida - Volume 2: On The Reasons why Ali ibn Musa Ar-Ridha (a.s.) accepted the succession to the throne from Al-Ma’mun, what Went On, those who were displeased and those who were pleased",
          "Link": "https://thaqalayn.net/hadith/12/1/10/2",
          "Arabic Text": "2 - حَدَّثَنا أَحْمَدِ بْنِ زِيادِ بْنِ جَعْفَر الْهَمَذانيّ رَضِىَاللهُ عَنْهُ قالَ: حَدَّثَنا عَلِىِّ بْنِ إِبراهِيمِ بْنِ هاشِم‏عَنْ الرَّيانِ بْنِ الصَّلْتِ قالَ دَخَلْتُ عَلَى عَلِيِّ بْنِ مُوسَى الرِّضَا عَلَيْهِ السَّلامُ فَقُلْتُ لَهُ يَا ابْنَ رَسُولِ اللَّهِ إِنَّ النَّاسَ يَقُولُونَ إِنَّكَ قَبِلْتَ وِلايَةَ الْعَهْدِ مَعَ إِظْهَارِكَ الزُّهْدَ فِي الدُّنْيَا فَقَالَ‏ عَلَيْهِ السَّلامُ قَدْ عَلِمَ اللَّهُ كَرَاهَتِي لِذَلِكَ فَلَمَّا خُيِّرْتُ بَيْنَ قَبُولِ ذَلِكَ وَبَيْنَ الْقَتْلِ اخْتَرْتُ الْقَبُولَ عَلَى الْقَتْلِ وَيْحَهُمْ أَمَا عَلِمُوا أَنَّ يُوسُفَ‏ عَلَيْهِ السَّلامُ كَانَ نَبِيّاً رَسُولاً فَلَمَّا دَفَعَتْهُ الضَّرُورَةُ إِلَى تَوَلِّي خَزَائِنِ الْعَزِيزِ قَالَ لَهُ اجْعَلْنِي عَلى‏ خَزائِنِ الأَرْضِ إِنِّي حَفِيظٌ عَلِيمٌ وَدَفَعَتْنِي الضَّرُورَةُ إِلَى قَبُولِ ذَلِكَ عَلَى إِكْرَاهٍ وَإِجْبَارٍ بَعْدَ الإِشْرَافِ عَلَى الْهَلاكِ عَلَى أَنِّي مَا دَخَلْتُ فِي هَذَا الأَمْرِ إِلا دُخُولَ خَارِجٍ مِنْهُ فَإِلَى اللَّهِ الْمُشْتَكَى وَهُوَ الْمُسْتَعَانُ.",
          "English Text": "40-2 Ahmad ibn Ziyad ibn Ja’far al-Hamadani - may God be pleased with him - narrated that Ali ibn Ibrahim ibn Hashem quoted on the authority of his father, on the authority of al-Rayyan ibn al-Salt, “I went to see Ali ibn Musa Ar-Ridha’  and told him, “O son of the Prophet! The people say that although you show asceticism, you have accepted the succession to the throne.” He  replied, “Indeed God knows how much I hated this. However when I was only given the choice to either accept this or be killed, I chose this (the acceptance of the succession to the throne) over being killed. Woe be to them! Do they not know that Joseph , who was a Prophet, said the following to the King of Egypt when it was necessary to do so, ‘Set me over the store-houses of the land: I will indeed guard them, as one that knows (their importance).’I was also forced to accept this (the acceptance of the succession to the throne) even though I did not like to. I unwillingly accepted it when I was about to be killed. I accepted this affair like one who has no interest in it. And I will take my complaint to God on this issue and seek His Assistance.",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "معتبرة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (6/225)"
          }
        }
      }
    }
  }
}