{
  "Volume #10": {
    "Book #2": {
      "Chapter #2": {
        "Hadith #1": {
          "Title": "Al-Khisal: Abandoning the Present to Attain the Promised",
          "Link": "https://thaqalayn.net/hadith/10/2/2/1",
          "Arabic Text": "1-2 حدثنا أبي رضي الله عنه قال: حدثنا سعد بن عبد الله، عن أحمد بن محمد بن عيسى، عن أبيه، عن عبد الله بن المغيرة، عن إسماعيل بن مسلم السكوني، عن الصادق جعفر بن محمد، عن أبيه، عن آبائه، عن علي عليهم السلام قال: قال رسول الله صلى الله عليه وآله:\"طوبى لمن ترك شهوة حاضرة لموعود لم يره .\"",
          "English Text": "1-2 (The compiler of the book narrated) narrated that his father – may God be pleased with him - narrated that Sa’ed ibn Abdullah quoted on the authority of Ahmad ibn Muhammad ibn Isa, on the authority of his father, on the authority of Abdullah ibn al-Muqayrih, on the authority of Isma’il ibn Muslim al-Sakoony, on the authority of As-Sadiq Ja’far ibn Muhammad (MGB), on the authority of his father, on the authority of his forefathers, on the authority of Ali (MGB) that God’s Prophet (MGB) said, “Blessed be the one who abandons the present lust to attain the unseen promised reward.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "معتبرة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (5/447)"
          }
        }
      },
      "Chapter #8": {
        "Hadith #1": {
          "Title": "Al-Khisal: The Loftiest Characteristic of the Religion",
          "Link": "https://thaqalayn.net/hadith/10/2/8/1",
          "Arabic Text": "1-9 حدثنا أبي رضي الله عنه قال: حدثني علي بن إبراهيم بن هاشم، عن أبيه، عن عبد الله بن ميمون، عن جعفر بن محمد، عن أبيه، عن آبائه، عن علي عليهم السلام قال: قال رسول الله صلى الله عليه وآله: فضل العلم أحب إلى الله عز وجل من فضل العبادة، وأفضل دينكم الورع",
          "English Text": "1-9 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Ali ibn Ibrahim ibn Hashim quoted on the authority of his father, on the authority of Abdullah ibn Maymun , on the authority of Ja’far ibn Muhammad, on the authority of his father, on the authority of his forefathers, on the authority of Ali (MGB) that God’s Prophet (MGB) said, “God loves the loftiness of knowledge more than the loftiness of worshipping Him. Moreover, the loftiest characteristic in your religion is piety.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (12/150)"
          }
        }
      },
      "Chapter #24": {
        "Hadith #1": {
          "Title": "Al-Khisal: A Characteristic that Destroys a Believer’s Dignity",
          "Link": "https://thaqalayn.net/hadith/10/2/24/1",
          "Arabic Text": "1-30 حدثنا محمد بن علي ماجيلويه رضي الله عنه قال: حدثني محمد بن يحيى العطار، عن محمد بن أحمد بن يحيى بن عمران الاشعري، عن محمد بن عيسى بن عبيد، عن عبيد الله بن عبد الله الدهقان، عن درست بن أبي منصور الواسطي، عن إبراهيم ابن عبدالحميد، عن أبي الحسن عليه السلام قال: سرعة المشي تذهب ببهاء المؤمن",
          "English Text": "1-30 Muhammad ibn Ali Majiluyih - may God be pleased with him - narrated that Muhammad ibn Yahya al-Attar quoted on the authority of Muhammad ibn Ahmad ibn Yahya ibn Imran al-Ash’ari, on the authority of Muhammad ibn Isa ibn Ubayd, on the authority of Ubaydullah ibn Abdullah al-Dihqan, on the authority of Durost ibn Abi Mansoor al-Vaseti, on the authority of Ibrahim ibn Abdul-Hamid that Abil Hassan Al-Kadhim (MGB) said, “Walking in a rush will destroy a believer’s dignity.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "معتبرة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (5/106)"
          }
        }
      },
      "Chapter #30": {
        "Hadith #1": {
          "Title": "Al-Khisal: God Loves One Characteristic and Despises One Characteristic",
          "Link": "https://thaqalayn.net/hadith/10/2/30/1",
          "Arabic Text": "1-36 حدثنا أبي رضي الله عنه قال: حدثنا سعد بن عبد الله، عن محمد بن الحسين بن أبي الخطاب، عن جعفر بن بشير البجلي، عن داود الرقي، عن أبي عبد الله عليه السلام قال: إن القصد أمر يحبه الله عز وجل، وإن السرف [أمر] يبغضه [الله عز وجل] حتى طرحك النواة فإنها تصلح لشئ وحتى صبك فضل شرابك",
          "English Text": "1-36 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Sa’ed ibn Abdullah quoted on the authority of Muhammad ibn al-Hussein ibn Abil-Khat’tab, on the authority of Ja’far ibn Bashir al-Bajaly, on the authority of Davood al-Raqqy that Aba Abdullah as-Sadiq (MGB) said, “Moderation is what God the Honorable, the Exalted loves. Wastefulness is despised by Him even if it is throwing away a date seed that can be used, or throwing away the leftover liquid from your drink.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (1/252)"
          }
        }
      },
      "Chapter #54": {
        "Hadith #1": {
          "Title": "Al-Khisal: There Is No Honor Except Through One Characteristic. There Is No Nobility Except Through Another Characteristic",
          "Link": "https://thaqalayn.net/hadith/10/2/54/1",
          "Arabic Text": "1-62 حدثنا محمد بن موسى بن المتوكل رضي الله عنه قال: حدثنا عبد الله بن جعفر الحميري قال: حدثنا أحمد بن محمد بن عيسى، عن الحسن بن محبوب، عن مالك بن عطية، عن أبي حمزة الثمالي، عن علي بن الحسين عليهما السلام قال: لا حسب لقرشي ولا لعربي إلا بتواضع، ولا كرم إلا بتقوى، ولا عمل إلا بنية، ألا وإن أبغض الناس إلى الله عز وجل من يقدي بسنة إمام ولا يقتدي بأعماله",
          "English Text": "1-62 Muhammad ibn Musa ibn al-Mutevakil - may God be pleased with him - narrated that Abdullah ibn Ja’far al-Homayry, on the authority of Ahmad ibn Muhammad ibn Isa, on the authority of Al-Hassan ibn Mahboob, on the authority of Malik ibn Atiye, on the authority of Abi Hamzih al-Sumaly that Ali ibn al-Hussein as-Sajjad (MGB) said, “There is no honor for the Quraysh tribe or any other Arabs except by means of humbleness, and there is no nobility except by means of piety. A deed is not a deed unless there is an intention behind it. There is no worshipping except by means of understanding. Beware that the most despised person by God the Honorable the Exalted is the one who considers himself to be the follower of a leader but doesn’t act according to the deeds of his leader.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (2/251)"
          }
        }
      },
      "Chapter #64": {
        "Hadith #1": {
          "Title": "Al-Khisal: A Characteristic That is Gratitude for All Blessings",
          "Link": "https://thaqalayn.net/hadith/10/2/64/1",
          "Arabic Text": "1-73 حدثنا أبي رضي الله عنه قال: حدثنا سعد بن عبد الله، عن يعقوب بن يزيد، عن محمد بن أبي عمير، عن الحسن بن عطية، عن عمر بن يزيد، عن أبي عبد الله عليه السلام قال: سمعته يقول: شكر كل نعمة وإن عظمت أن تحمد الله عز وجل",
          "English Text": "1-73 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Sa’ed ibn Abdullah quoted on the authority of Yaqoob ibn Yazid, on the authority of Muhammad ibn Abi Umayr, on the authority of Al-Hassan ibn Atiye , on the authority of Umar ibn Yazid that he had heard Aba Abdullah as-Sadiq (MGB) say, “The gratitude for any blessing - no matter how great it may be - is to praise God the Honorable the Exalted.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (5/424)"
          }
        }
      },
      "Chapter #68": {
        "Hadith #1": {
          "Title": "Al-Khisal: A Characteristic That Revives the Affairs of the Almighty God’s Proofs",
          "Link": "https://thaqalayn.net/hadith/10/2/68/1",
          "Arabic Text": "1-77 حدثنا أبي رضي الله عنه قال: حدثنا علي بن إبراهيم، عن أبيه، عن ابن أبي عمير، عن محمد بن حمران، عن خيثمة قال: قال لي أبوجعفر عليه السلام: تزاوروا في بيوتكم فإن ذلك حياة لامرنا، رحم الله عبدا أحيا أمرنا",
          "English Text": "1-77 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Ali ibn Ibrahim quoted on the authority of his father, on the authority of Ibn Abi Umayr, on the authority of Muhammad ibn Hamran, on the authority of Khaysamat that Abu Ja’far al-Baqir (MGB) told him, “Visit each other in your homes since this will revive our affairs - may God forgive anyone who revives our affairs.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "من حيث السند لا بأس بها",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (2/153)"
          }
        }
      },
      "Chapter #85": {
        "Hadith #1": {
          "Title": "Al-Khisal: A Believer’s Honor is More Than That of the Ka’ba",
          "Link": "https://thaqalayn.net/hadith/10/2/85/1",
          "Arabic Text": "1-95 حدثنا أبي رضي الله عنه قال: حدثنا سعد بن عبد الله، عن يعقوب بن يزيد، عن حماد بن عيسى، عن إبراهيم بن عمر، عن أبي عبد الله عليه السلام قال: المؤمن أعظم حرمة من الكعبة",
          "English Text": "1-95 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Sa’ed ibn Abdullah quoted on the authority of Yaqoob ibn Yazid, on the authority of Hammad ibn Isa, on the authority of Ibrahim ibn Umar that Aba Abdullah as-Sadiq (MGB) said, “A believer’s honor is more than that of the Ka’ba.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (11/174)"
          }
        }
      }
    },
    "Book #3": {
      "Chapter #1": {
        "Hadith #1": {
          "Title": "Al-Khisal: Recognition of God By Two Characteristics",
          "Link": "https://thaqalayn.net/hadith/10/3/1/1",
          "Arabic Text": "2-1 حدثنا أحمد بن هارون الفامي وجعفر بن محمد بن مسرور رضي الله عنهما قالا: حدثنا محمد بن جعفر بن بطة قال: حدثنا أحمد بن أبي عبد الله البرقي، عن أبيه، عن محمد بن أبي عمير، عن هشام بن سالم، عن أبي عبد الله عليه السلام قال: سمعت أبي يحدث عن أبيه عليه السلام أن رجلاً قام إلى أمير المؤمنين عليه السلامفقال له: يا أمير المؤمنين بما عرفت ربك؟ قال: بفسخ العزم ونقض الهم لما أن هممت فحال بيني وبين همي، وعزمت فخالف القضاء عزمي فعلمت أن المدبر غيري، قال: فبما ذا شكرت نعماه؟ قال: نظرت إلى بلاء قد صرفه عني وأبلى به غيري، فعلمت أنه قد أنعم علي فشكرته، قال: فبما ذا أحببت لقاءه؟ قال: لما رأيته قد اختار لي دين ملائكته ورسله وأنبيائه علمت أن الذي أكرمني بهذا ليس ينساني فأحببت لقاءه",
          "English Text": "2-1 Ahmad ibn Harun al-Fami and Ja’far ibn Muhammad ibn Masroor - may God be pleased with them - narrated that Muhammad ibn Ja’far ibn Bat’tat quoted on the authority of Ahmad ibn Aba Abdullah al-Barqy, on the authority of his father, on the authority of Muhammad ibn Abi Umayr, on the authority of Hisham ibn Salim, on the authority of Aba Abdullah as-Sadiq (MGB), “I heard my father (MGB) narrate on the authority of his father (MGB) that a man stood in front of the Commander of the Faithful Imam Ali (MGB) and said, ‘O Commander of the Faithful! How did you cometo recognize your Lord?’ He (MGB) replied, ‘By the dissolution of intentions and the breach of aspirations. Sometimes I had an aspiration, but He got in the way between me and my aspirations. Sometimes I made some intentions, but destiny opposed my intentions. Thus, I realized that there is some other Planner.’ The man asked, ‘Why did you thank Him for His Blessings?’ He (MGB) replied, ‘I looked at His Calamities which He fended off from me and brought them upon someone else. Thus, I realized that He has Blessed me. Thus, I thanked Him.’ The man asked, ‘Why do you like to meet Him?’ He (MGB) replied, ‘I saw that He has given me the religion of His Angels, Messengers and Prophets. Then I realized that He has honored me with this religion and will never forget me. Therefore, I would like to meet Him.’",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "معتبرة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (10/68)"
          }
        }
      },
      "Chapter #6": {
        "Hadith #1": {
          "Title": "Al-Khisal: Two Things Which Cause Trouble for Most People",
          "Link": "https://thaqalayn.net/hadith/10/3/6/1",
          "Arabic Text": "2-6 حدثنا أبي رضي الله عنه قال: حدثنا علي بن إبراهيم، عن أبيه، عن النوفلي، عن السكوني، عن جعفر بن محمد، عن أبيه، عن آبائه، عن علي عليهم السلام قال: قال رسول الله صلى الله عليه وآله: خصلتان كثير من الناس مفتون فيهما: الصحة والفراغ",
          "English Text": "2-6 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Ali ibn Ibrahim quoted on the authority of his father, on the authority of Al-Nawfaly, on the authority of Al-Sakoony, on the authority of Ja’far ibn Muhammad (MGB), on the authority of his father (MGB), on the authority of his forefathers (MGB), on the authority of Ali (MGB) that God’s Prophet (MGB) said, “There are two things which cause trouble for most people: health and leisure.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "معتبرة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (8/360)"
          }
        }
      },
      "Chapter #45": {
        "Hadith #1": {
          "Title": "Al-Khisal: Friends Are of Two Types",
          "Link": "https://thaqalayn.net/hadith/10/3/45/1",
          "Arabic Text": "2-56 حدثنا أبي رضي الله عنه قال: حدثنا أحمد بن إدريس، عن محمد بن أحمـد،عن عبد الله بن أحمد الرازي، عن بكر بن صالح، عن إسماعيل بن مهران، عن محمد بن حفص عن يعقوب بن بشير، عن جابر، عن أبي جعفر عليه السلام قال: قام إلى أمير المؤمنين عليه السلام رجل بالبصرة فقال: يا أمير المؤمنين أخبرنا عن الاخوان؟ قال: الاخوان صنفان إخوان الثقة وإخوان المكاشرة فأما إخوان الثقة فهم الكف والجناح والاهل والمال فاذا كنت من أخيك على حد الثقة فابذل له مالك وبدنك، وصاف من صافاه، وعاد من عاداه، واكتم سره وعيبه، وأظهر منه الحسن. واعلم أيها السائل إنهم أقل من الكبريت الاحمر. وأما إخوان المكاشرة فانك تصيب منهم لذتك فلا تقطعن ذلك منهم. ولا تطلبن ماوراء ذلك من ضميرهم، وابذل لهم ما بذلوا لك من طلاقه الوجه وحلاوة اللسان",
          "English Text": "2-56 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Ahmad ibn Idris quoted Muhammad ibn Ahmad, on the authority of Abdullah ibn Ahmad al-Razi, on the authority of Bakr ibn Salih, on the authority of Isma’il ibn Mihran, on the authorityof Muhammad ibn Hafs, on the authority of Yaqoob ibn Bashir, on the authority of Jabir, on the authority of Abi Ja’far al-Baqir (MGB) that a man went to Basra to see the Commander of the Faithful Imam Ali (MGB) and said, “O Commander of the Faithful! Please inform me about my brethren.” The Commander of the Faithful (MGB) replied, “There are two types of brethren: sincere ones and hypocrites. The sincere brethren are similar to one’s hands, wings, and property. Once you find a sincere brother, do not hesitate to help him with your life and wealth. Be friends with his friends and be an enemy of his enemies. Cover up his flaws, and express his good deeds. However, you who ask should know that such friends are as scarce as red matches are. About hypocrites, you should only associate with them on the surface as they do with you. You should not expect anything else from them. Treat them just as they treat you in terms of being polite with and talking pleasantly with them.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "نقلها الكليني بسنده الصحيح في الكافي: /48",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (1/166)"
          }
        }
      },
      "Chapter #51": {
        "Hadith #2": {
          "Title": "Al-Khisal: Two Characteristics of Which People Should be Most Fearful",
          "Link": "https://thaqalayn.net/hadith/10/3/51/2",
          "Arabic Text": "2-63 حدثنا أبي رضي الله عنه قال: حدثنا محمد بن يحيى العطار، عن أحمد ابن محمد بن عيسى، عن أبيه، عن حماد بن عيسى، عن عمر بن اذينة، عن أبان بن أبي عياش، عن سليم بن قيس الهلالي، عن أمير المؤمنين عليه السلام: عن النبي صلى الله عليه وآله أنه قال في كلام له: العلماء رجلان: رجل عالم آخذ بعلمه فهذا ناج، ورجل عالم تارك لعلمه فهذا هالك. وإن أهل النار ليتأذون بريح العالم التارك لعلمه. وإن أشد أهل النار ندامة وحسرة رجل دعا عبدا إلى الله عز وجل فاستجاب له وقبل منه وأطاع الله عز وجل فأدخله الله الجنة وأدخل الداعي النار بتركه علمه واتباعه الهوى ثم قال أمير المؤمنين عليه السلام: ألا إن أخوف ما أخاف عليكم خصلتين اتباع الهوى وطول الامل أما اتباع الهوى فيصد عن الحق، وطول الامل ينسي الآخرة",
          "English Text": "2-63 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Muhammad ibn Yahya al-Attar quoted Ahmad ibn Muhammad ibn Isa, on the authority of Hammad ibn Isa, on the authority of Umar ibn Azineh, on the authority of Aban ibn Abi Ayyash, on the authority of Salim ibn Qays al-Hilaly, on the authority of the Commander of the Faithful Imam Ali (MGB) that God’s Prophet (MGB) said, “There are two groups of scientists. Those who practice their knowledge are prosperous, but those who abandon their knowledge get destroyed. The residents of Hell will be bothered with the bad smell of the scientists who have not put their knowledge into practice. However, there are those who are most sorry. They invite others to God, and their call is accepted by others who then obey God and are taken to Heaven by God. However, the caller himself is taken to Hell by God for not acting (on his own words), and those following their whims will be the most sorry.” Then the Commander of the Faithful (MGB) added, “I fear two things concerning you. The first is following your whims, and the second is having high aspirations since following your whims will prevent you from accepting the truth, and having high aspirations will make you forget the Hereafter.\"",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "من حيث السند لا بأس بها",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (7/280)"
          }
        }
      },
      "Chapter #52": {
        "Hadith #1": {
          "Title": "Al-Khisal: Two Characteristics Which You Are Admonished Against",
          "Link": "https://thaqalayn.net/hadith/10/3/52/1",
          "Arabic Text": "2-65 حدثنا أبي رضي الله عنه قال: حدثنا محمد بن يحيى العطار، عن أحمد وعبد الله ابني محمد بن عيسى، عن علي بن الحكم، عن سيف بن عميرة، عن مفضل بن مزيد قال: قال أبوعبد الله عليه السلام: أنهاك عن خصلتين فيهما هلك الرجال: أن تدين الله بالباطل وتفتي الناس بما لا تعلم",
          "English Text": "2-65 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Muhammad ibn Yahya al-Attar quoted Ahmad ibn Muhammad Isa and Abdullah ibn Muhammad ibn Isa, on the authority of Ali ibn al-Hikam, on the authority of Sayf ibn Umayrih, on the authority of Mufaz’zal ibn Mazid that Abu Abdullah as-Sadiq (MGB) said, “I admonish you against two characteristics which can ruin men: to worship God with a wrong religion, and to advise people on issues you are uninformed about.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "معتبرة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (12/57)"
          }
        }
      }
    },
    "Book #4": {
      "Chapter #8": {
        "Hadith #4": {
          "Title": "Al-Khisal: Three Things Raise the Ranks, The Three Expiations, The Three Which Destroy, The Three Which Save",
          "Link": "https://thaqalayn.net/hadith/10/4/8/4",
          "Arabic Text": "3-13 حدثنا محمد بن علي ماجيلويه رضي الله عنه قال: حدثني عمي محمد بن أبي القاسم، عن هارون بن مسلم، عن مسعدة بن زياد، عن جعفر بن محمد، عن أبيه عليهما السلام أن النبي صلى الله عليه وآله قال: ثلاث موبقات: نكث الصفقة، وترك السنة، وفراق الجماعة. وثلاث منجيات: تكف لسانك، وتبكي على خطيئتك. وتلزم بيتك",
          "English Text": "3-13 Muhammad ibn Ali Majiluyih - may God be pleased with him - narrated that his uncle Muhammad ibn Abil-Qasim quoted Harun ibn Muslim, on the authority of Mus’adat ibn Zyad, on the authority of Ja’far ibn Muhammad (MGB), on the authority of his father (MGB) that the Prophet (MGB) said, “There are three things which destroy. They are breaching transactions, abandoning traditions and leaving the society. There are three things which save. They are watching out what you say, crying over your mistakes, and staying at home.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "من حيث السند لا بأس بها",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (11/67)"
          }
        }
      },
      "Chapter #9": {
        "Hadith #1": {
          "Title": "Al-Khisal: Three Things for Which God Would Marry off one of the Houri-Eyed Ones to You",
          "Link": "https://thaqalayn.net/hadith/10/4/9/1",
          "Arabic Text": "3-14 حدثنا أبي رضي الله عنه قال: حدثنا سعد بن عبد الله، عن أحمد بن أبي عبد الله البرقي، عن أبيه، عن ابن أبي عمير، عن عبد الله بن سنان قال: قال أبوعبد الله عليه السلام: ثلاث من كن فيه زوجه الله من الحور العين كيف يشاء: كظم الغيظ، والصبر على السيوف لله عز وجل، ورجل أشرف على مال حرام فتركه لله عز وجل",
          "English Text": "3-14 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Sa’ed ibn Abdullah quoted on the authority of Ahmad ibn Aba Abdullah al-Barqy, on the authority of his father, on the authority of Ibn Abi Umayr, on the authority of Abdullah ibn Sin’an that Abu Abdullah as-Sadiq (MGB) said, “There are three characteristics for which God would marry off one of the Houri-eyed ones to you. They include withholding your anger, standing up against the swords of the enemies of the Honorable the Exalted God, and abandoning illegitimately earned property for the sake of the Honorable the Exalted God.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (9/347)"
          }
        }
      },
      "Chapter #12": {
        "Hadith #1": {
          "Title": "Al-Khisal: Three People Who Deserve Mercy",
          "Link": "https://thaqalayn.net/hadith/10/4/12/1",
          "Arabic Text": "3-18 حدثنا محمد بن الحسن بن أحمد بن الوليد رضي الله عنه قال: حدثنا محمد ابن الحسن الصفار، عن أحمد بن محمد بن عيسى، عن الحسن بن محبوب، عن عبد الله ابن سنان قال: سمعت أبا عبد الله عليه السلام قال: إني لا رحم ثلاثة، وحق لهم أن يرحموا: عزيز أصابته مذله بعد العز، وغني أصابته حاجة بعد الغني، وعالم يستخف به أهله والجهلة",
          "English Text": "3-18 Muhammad ibn al-Hassan ibn Ahmad ibn al-Walid - may God be pleased with him - narrated that Muhammad ibn al-Hassan al-Saffar quoted Ahmad ibn Muhammad ibn Isa, on the authority of Al-Hassan ibn Mahboob, on the authority of Abdullah ibn Sin’an, “I heard Aba Abdullah as-Sadiq (MGB) say, ‘Have mercy on three people as they deserve mercy: an honorable one who has been striken with misery and is no longer honored; an affluent person who has suffered and is needy; and a scholar who is belittled by his family members and the ignorant ones.”",
          "Grading": [
            {
              "English Grade": "Acceptable",
              "Arabic Grade": "صحيحة الإسناد",
              "Scholar": "Shaykh Hadi al-Najafi",
              "Book": "Mawsu'at Ahadith Ahlulbayt (4/144)"
            },
            {
              "English Grade": "Acceptable",
              "Arabic Grade": "معتبر",
              "Scholar": "Shaykh Asif al-Mohseni",
              "Book": "Muʿjam al-Aḥādīth al-Muʿtabara"
            }
          ]
        }
      },
      "Chapter #13": {
        "Hadith #1": {
          "Title": "Al-Khisal: Three People with Whom God Is Angry",
          "Link": "https://thaqalayn.net/hadith/10/4/13/1",
          "Arabic Text": "3-19 حدثنا حمزة بن محمد بن أحمد العلوي رضي الله عنه قال: أخبرني علي ابن إبراهيم بن هاشم، عن يعقوب بن يزيد، عن ابن أبي عمير، عن الحسين بن عثمان،عن أبي عبد الله عليه السلام قال: إن الله عز وجل يبغض الغني الظلوم، والشيخ الفاجر، والصعلوك المختال، ثم قال: أتدري ما الصعلوك المختال؟ قال: فقلنا: القليل المال، قال: لا هو الذي لا يتقرب إلى الله عز وجل بشيء من ماله",
          "English Text": "3-19 Hamzih ibn Muhammad ibn Ahmad al-Alavi - may God be pleased with him - narrated that Ali ibn Ibrahim ibn Hashim quoted Yaqoob ibn Yazid, on the authority of Ibn Abi Umayr, on the authority of Al-Hussein ibn Uthman, “Aba Abdullah as-Sadiq (MGB) said, ‘Indeed the Honorable the Exalted God is angry with the oppressive wealthy ones, wicked old men and the arrogant needy ones.’ Then the Imam (MGB) asked, ‘Do you know who the arrogant needy ones are?’ I said, ‘He is one who has little money.’ The Imam (MGB) said, ‘No. He is someone who would not spend any of his money in order to get closer to the Honorable the Exalted God.’”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "معتبرة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (8/199)"
          }
        }
      },
      "Chapter #26": {
        "Hadith #1": {
          "Title": "Al-Khisal: Three Characteristics Indicate Affluence, Beauty and Defeat of Your Enemies",
          "Link": "https://thaqalayn.net/hadith/10/4/26/1",
          "Arabic Text": "3-33 حدثنا حمزة بن محمد بن أحمد العلوي رضي الله عنه قال: أخبرني علي ابن إبراهيم بن هاشم، عن أبيه، عن النوفلي، عن السكوني، عن جعفر بن محمد، عن أبيه،عن آبائه، عن علي عليهم السلام قال: الدهن يظهر الغنى، والثياب تظهر الجمال، وحسن الملكة يكبت الاعداء",
          "English Text": "3-33 Hamzih ibn Muhammad ibn Ahmad al-Alavi - may God be pleased with him - narrated that Ali ibn Ibrahim ibn Hashim quoted his father, on the authority of Al-Nawfaly, on the authority of Al-Sakoony, on the authority of Ja’far ibn Muhammad (MGB), on the authority of his father (MGB), on the authority of his forefathers (MGB), on the authority of Ali (MGB), “Using good scent indicates affluence. Wearing good garments indicates beauty. Having a good temper defeats one’s enemies.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "من حيث السند معتبرة",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (2/122)"
          }
        }
      },
      "Chapter #27": {
        "Hadith #1": {
          "Title": "Al-Khisal: Three Things Are Pleasing to the Eyes",
          "Link": "https://thaqalayn.net/hadith/10/4/27/1",
          "Arabic Text": "3-35 حدثنا أبي رضي الله عنه قال: حدثنا أحمد بن إدريس، عن محمد بن أحمد عن محمد بن عيسى، عن عبيد الله بن عبد الله الدهقان، عن درست بن أبي منصور، عن إبراهيم بن عبدالحميد، عن أبي الحسن الاول عليه السلام قال: ثلاثة يجلين البصر: النظر إلى الخضرة، والنظر إلى الماء الجاري، والنظر ألى الوجه الحسن",
          "English Text": "3-35 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Ahmad ibn Idris quoted Muhammad ibn Ahmad, on the authority of Ahmad ibn Muhammad ibn Isa, on the authority of Ubaydullah ibn Abdullah al-Dehqan, on the authority of Durost ibn Abi Mansoor, on the authority of Ibrahim ibn Abdul-Hamid, on the authority of Abil Hassan - the first (MGB) , ‘Looking at greenery, looking at flowing water and looking at a beautiful woman are pleasing to the eyes.’",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "معتبرة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (11/378)"
          }
        }
      },
      "Chapter #52": {
        "Hadith #1": {
          "Title": "Al-Khisal: Our Followers Are in Three Groups",
          "Link": "https://thaqalayn.net/hadith/10/4/52/1",
          "Arabic Text": "3-61 حدثنا حمزة بن محمد بن أحمد العلوي رضي الله عنه قال: أخبرني علي ابن إبراهيم بن هاشم، عن أبيه، عن محمد بن خالد البرقي، عن خلف بن حماد، عن معاوية ابن وهب قال: قال أبوعبد الله عليه السلام: الشيعة ثلاث: محب واد، فهو منا، ومتزين بنا، ونحن زين لمن تزين بنا. ومستأكل بنا الناس، ومن استأكل بنا افقر",
          "English Text": "3-61 Hamzih ibn Muhammad ibn Ahmad al-Alavi - may God be pleased with him - narrated that Ali ibn Ibrahim ibn Hashim quoted his father, on the authority of Muhammad ibn Khalid al-Barqy, on the authority of Khalaf ibn Himmad, on the authority of Muawiyah ibn Wahab that Aba Abdullah as-Sadiq (MGB) said, “Our followers can be divided into three groups. There are those who are our true friends. They are from us. There are those to whom we lend beauty, and lend beauty to us. And there are those who attach themselves to us to attain worldly gains. Whoever tries to attain worldly gains by attaching himself to us will get poor.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "حسنة سندا",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (1/197)"
          }
        }
      },
      "Chapter #69": {
        "Hadith #2": {
          "Title": "Al-Khisal: Three Back-Breaking Things",
          "Link": "https://thaqalayn.net/hadith/10/4/69/2",
          "Arabic Text": "3-86 حدثنا أبي رضي الله عنه قال: حدثنا سعد بن عبد الله، عن أحمد بن أبي عبد الله البرقي، عن أبيه، عن صفوان بن يحيى، عن عبدالرحمن بن الحجاج، عن أبي عبد الله عليه السلام، قال قال إبليس لعنه الله عليه لجنوده: إذا استمكنت من ابن آدم في ثلاث لم أبال ما عمل فانه غير مقبول منه: إذا استكثر عمله، ونسي ذنبه، ودخله العجب",
          "English Text": "3-86 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Sa’ed ibn Abdullah quoted on the authority of Ahmad ibn Aba Abdullah al-Barqy, on the authority of his father, on the authority of Safvan ibn Yahya, on the authority of Abdul Rahman ibn al-Haj’jaj that Aba Abdullah as-Sadiq (MGB) said, “Satan (May God Damn him) told his followers, ‘There are three things which once a man does I will overcome him and not worry about his other deeds. These things are: Overestimating his deeds; forgetting his sins and becoming conceited.’”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (7/81)"
          }
        }
      },
      "Chapter #76": {
        "Hadith #2": {
          "Title": "Al-Khisal: Men Are of Three Kinds",
          "Link": "https://thaqalayn.net/hadith/10/4/76/2",
          "Arabic Text": "3-96 وبهذا الاسناد قال: قال أمير المؤمنين عليه السلام: الرجال ثلاثة: عاقل وأحمق وفاجر، فالعاقل الدين شريعته، والحلم طبيعته، والرأي سجيته، وإن سئل أجاب، وإن تكلم أصاب، وإن سمع وعى، وإن حدث صدق، وإن اطمأن إليه أحد وفى، والاحمق إن استنبه بجميل غفل، وإن استنزل عن حسن نزل، وإن حمل على جهل جهل، وإن حدث كذب، لا يفقه وإن فقه لا يتفقه، والفاجر إن ائتمنته خانك، وإن صاحبته شانك وإن وثقت به لم ينصحك",
          "English Text": "3-96 And with these same documents he narrated that the Commander of the Faithful Imam Ali (MGB) said, “Men are of three types: intelligent, stupid and corrupt. For the intelligent, religion is his way; patience is his nature, and thinking is in his character. If questioned, he will respond. If he talks, he says the right words. If he listens, he perceives. If he speaks, he tells the truth. If someone trusts him, he will be loyal to him. However, if you direct a stupid person to the good, he will neglect it. If he is directed away from the good, he will follow. If he is guided towards ignorance, he becomes ignorant. If he talks, he lies. He doesn’t understand. Even if you try to make him understand, he will not understand. And a corrupt person is such that if you entrust him with something, he will cheat you. If you become his companion, he will debase you. And if you trust him in some affairs, he will not be sincere to you.”",
          "Grading": [
            {
              "English Grade": "Acceptable",
              "Arabic Grade": "موثقة سندا",
              "Scholar": "Shaykh Hadi al-Najafi",
              "Book": "Mawsu'at Ahadith Ahlulbayt (3/227)"
            },
            {
              "English Grade": "Acceptable",
              "Arabic Grade": "معتبر",
              "Scholar": "Shaykh Asif al-Mohseni",
              "Book": "Muʿjam al-Aḥādīth al-Muʿtabara"
            }
          ]
        }
      },
      "Chapter #83": {
        "Hadith #1": {
          "Title": "Al-Khisal: All the Nation but Three Can Hope to Be Saved",
          "Link": "https://thaqalayn.net/hadith/10/4/83/1",
          "Arabic Text": "3-107 حدثنا أبي رضي الله عنه قال: حدثنا سعد بن عبد الله، عن القاسم ابن محمد الاصفهاني، عن سليمان بن داود المنقري، عن حفص بن غياث النخعي، عن جعفر ابن محمد عليهما السلام قال: إني لارجو النجاة لهذه الامة لمن عرف حقنا منهم إلا لاحد ثلاثة: صاحب سلطان جائر، وصاحب هوى، والفاسق المعلن",
          "English Text": "3-107 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Sa’ed ibn Abdullah quoted Al-Qasim ibn Muhammad al-Isfahani, on the authority of Suleiman ibn Davood al-Minqari, on the authority of Hafs ibn Qiyath al-Nakha’ee that Ja’far ibn Muhammad as-Sadiq (MGB) said, “Anyone in this nation who has recognized our right can hope to be saved but three: one who helps the oppressive King; one who follows his selfish desires; and one who engages in corrupt deeds in public.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "من حيث السند لا بأس بها",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (11/246)"
          }
        }
      },
      "Chapter #88": {
        "Hadith #1": {
          "Title": "Al-Khisal: The Three Signs",
          "Link": "https://thaqalayn.net/hadith/10/4/88/1",
          "Arabic Text": "3-113 حدثنا أبي رضي الله عنه قال: حدثنا سعد بن عبد الله قال: حدثني القاسم بن محمد، عن سليمان بن داود قال: حدثني حماد بن عيسى، عن أبي عبد الله عليه السلام قال: قال لقمان لابنه: يا بني لكل شيء علامة يعرف بها ويشهد عليها، وإن للدين ثلاث علامات: العلم والايمان والعمل به، وللايمان ثلاث علامات: الايمان بالله وكتبه ورسله. وللعالم ثلاث علامات: العلم بالله وبما يحب وبما يكره، وللعامل ثلاث علامات: الصلاة والصيام والزكاة، وللمتكلف ثلاث علامات: ينازع من فوقه، ويقول مالا يعلم ويتعاطى ما لا ينال وللظالم ثلاث علامات: يظلم من فوقه بالمعصية ومن دونه بالغلبة ويعين الظلمة. وللمنافق ثلاث علامات: يخالف لسانه قلبه، وقلبه فعله، وعلانيته سريرته. وللاثم ثلاث علامات: يخون، ويكذب، ويخالف ما يقول: وللمرائي ثلاث علامات: يكسل إذا كان وحده، وينشط إذا كان الناس عنده، ويتعرض في كل أمر للمحمدة.وللحاسد ثلاث علامات: يغتاب إذا غاب، ويتملق إذا شهد، ويشمت بالمصيبة. وللمسرف ثلاث علامات: يشتري ماليس له، ويلبس ماليس له، ويأكل ما ليس له. وللكسلان ثلاث علامات: يتواني حتى يفرط ويفرط حتى يضيع ويضيع حتى يأثم. وللغافل ثلاث علامات: السهو واللهو والنسيان.قال حماد بن عيسى: قال أبوعبد الله عليه السلام: ولكل واحدة من هذه العلامات شعب يبلغ العالم بها أكثر من ألف باب وألف باب وألف باب، فكن يا حماد طالبا للعلم في آناء الليل وأطراف النهار فان أردت أن تقر عينك وتنال خير الدنيا والآخرة فاقطع الطمع مما في أيدي الناس وعد نفسك في الموتى ولا تحدثن نفسك إنك فوق أحد من الناس واخزن لسانك كما تخزن مالك",
          "English Text": "3-113 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Sa’ed ibn Abdullah quoted on the authority of Al-Qasim ibn Muhammad, on the authority of Suleiman ibn Davood, on the authority of Hammad ibn Isa that Aba Abdullah as-Sadiq (MGB) narrated that Luqman told his son, “O my son! There are signs for everything by which they are known and which indicate those things. There are three signs for religion which are knowledge, faith and acting accordingly. There are three signs for knowledge which are knowledge of God, knowledge of what God likes and what God disapproves of. There are three signs for faith which are faith in God, His Book and His Messenger. There are also three signs for acting accordingly which are praying, fasting and paying the alms-tax. There are three signs for one who is a show-off which are quarrelling with ones who are better; speaking out of ignorance; and seeking what is extremely hard to find. There are three signs for the oppressor which are oppressively harming those who are superior; being forceful with those who are inferior; and helping those who are oppressors. There are three signs for the corrupt which are constant disagreement between what he says and what is in his heart; constant disagreement between his heart and his deeds; and constant disagreement between his outward appearance and his inward thoughts. There are three signs for the sinner which are he is treacherous, he lies and he acts opposite to what he says. There are three signs for the show-off which are he is lazy, but he acts as if he is steadfast in public and he always seeks to be praised.There are three signs for the haughty which are he blames others in their absence; he boastfully praises others in front of them; and he blames the events which bring about calamities. There are three signs for the wasteful which are he buys what he doesn’t deserve to have; he wears what he doesn’t deserve to wear; and he eats what he doesn’t deserve to eat. There are three signs for the lazy which are he is so sluggish that he starts to commit criminal acts; he has shortcomings that lead him to being ungrateful; and he wastes things so much that he becomes a criminal. There are three signs for the ignorant which are inattentiveness, playfulness and forgetfulness.” Hammad ibn Isa added that Aba Abdullah as-Sadiq (MGB) said, “For each of these signs there are more than a thousand indications. O Himad! Seek knowledge during the day and the night. Stop being greedy for what others possess, if you wish to be able to see the good in this world and attain the Eternal Abode. Consider yourself to be amongst the dead. Do not consider yourself to be superior to anyone else. Keep your mouth shut and keep your aspirations to yourself.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "معتبرة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (6/308)"
          }
        }
      },
      "Chapter #104": {
        "Hadith #1": {
          "Title": "Al-Khisal: Three Characteristics Not of a Believer",
          "Link": "https://thaqalayn.net/hadith/10/4/104/1",
          "Arabic Text": "3-134 حدثنا أبي رضي الله عنه قال: حدثنا سعد بن عبد الله، عن الهيثم بن أبي مسروق النهدي، عن الحسن بن محبوب، عن علي بن رئاب، عن الحلبي قال: سمعت أبا عبد الله عليه السلام يقول: إن المؤمن لا تكون سجيته الكذب والبخل والفجور ولكن ربما ألم بشيء من هذا لا يدوم عليه. فقيل له: أفيزني؟ قال: نعم هو مفتن تواب ولكن لا يولد له [ابن] من تلك النطفة",
          "English Text": "3-134 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Sa’ed ibn Abdullah quoted Al-Haysam ibn Abi Masruq al-Nehdi, on the authority of Al-Hassan ibn Mahboob, on the authority of Ali ibn Re’ab, on the authority of Al-Halabi that he had heard Aba Abdullah as-Sadiq (MGB) say, “A believer will not engage in lying, miserliness and adultery. It could happen that he turns to these acts, but he will not continue doing them.” The Imam (MGB) was asked, “Will he commit adultery?” The Imam (MGB) said, “Yes. He may fall into that trouble, but he would repent and no child will be born from that sperm.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (10/182)"
          }
        }
      },
      "Chapter #109": {
        "Hadith #1": {
          "Title": "Al-Khisal: Three Things That are Really Hard for the People",
          "Link": "https://thaqalayn.net/hadith/10/4/109/1",
          "Arabic Text": "3-142 حدثنا أبي رضي الله عنه قال: حدثنا سعد بن عبد الله عن أحمد بن أبي عبد الله، عن أبيه، عن النضر بن سويد، عن درست بن أبي منصور، عن عبد الله بن أبي يعفور قال: قال أبوعبد الله عليه السلام: ثلاث لا يطيقهن الناس: الصفح عن الناس، ومواساة الاخ أخاه في ماله، وذكر الله كثيرا",
          "English Text": "3-142 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Sa’ed ibn Abdullah quoted on the authority of Ahmad ibn Aba Abdullah, on the authority of his father, on the authority of Al-Nazr ibn Soweed, on the authority of Durost ibn Abi Mansoor, on the authority of Abdullah ibn Abi Ya’fur that Abu Abdullah as-Sadiq (MGB) said, “There are three things that are really hard for the people: forgiving the faults of others; accepting that others have more wealth than they do; and remembering God often.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (11/109)"
          }
        }
      },
      "Chapter #125": {
        "Hadith #1": {
          "Title": "Al-Khisal: Three Will be Under the Shade of the God’s Throne on the Resurrection Day",
          "Link": "https://thaqalayn.net/hadith/10/4/125/1",
          "Arabic Text": "3-162 حدثنا أبي رضي الله عنه قال: حدثنا سعد بن عبد الله، عن أحمد بن أبي عبد الله، عن النهيكي، عن علي بن جعفر، عن أخيه موسى بن جعفر عليه السلام قال: ثلاثة يستظلون بظل عرش الله يوم لا ظل إلا ظله: رجل زوج أخاه المسلم، أو أخدمه أو كتم له سرا",
          "English Text": "3-162 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Sa’ed ibn Abdullah quoted on the authority of Ahmad ibn Aba Abdullah, on the authority of Al-Nahikee , on the authority of Ali ibn Ja’far , on the authority of his brother Musa ibn Ja’far al-Kadhim (MGB), “The following three groups shall be under the Shade of the Honorable the Exalted God’s On the Resurrection Day in which there shall be no shade but God’s Shade: those who marry off their Muslim brother; those who help their Muslim brother and those who safeguard the secrets of their Muslim brother.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "معتبرة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (9/298)"
          }
        }
      },
      "Chapter #140": {
        "Hadith #1": {
          "Title": "Al-Khisal: Three Things No Muslims Would Ever Doubt",
          "Link": "https://thaqalayn.net/hadith/10/4/140/1",
          "Arabic Text": "3-182 حدثنا أبي رضي الله عنه قال: حدثنا سعد بن عبد الله، عن أحمد بن أبي عبد الله البرقي، عن أحمد بن محمد بن أبي نصر البزنطي، عن حماد بن عثمان، عن عبد الله بن أبي يعفور، عن أبي عبد الله عليه السلام قال: خطب رسول الله صلى الله عليه وآله الناس بمنى في حجة الوداع في مسجد الخيف فحمد الله وأثنى عليه، ثم قال: نصر الله عبداسمع مقالتي فوعاها، ثم بلغها إلى من لم يسمعها فرب حامل فقه غير فقيه، ورب حامل فقه إلى من هو أفقه منه، ثلاث لا يغل عليهن قلب امرء مسلم إخلاص العمل لله، والنصيحة لائمة المسلمين، واللزوم لجماعتهم، فان دعوتهم محيطة من ورائهم المسلمون إخوة، تتكافأ دماؤهم، يسعى بذمتهم أدناهم. وهم يد على من سواهم",
          "English Text": "3-182 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Sa’ed ibn Abdullah quoted Ahmad ibn Aba Abdullah Al-Barqy, on the authority of Ahmad ibn Muhammad ibn Abi Nasr al-Bazanty, on the authority of Hammad ibn Uthman, on the authority of Abdullah ibn Abi Ya’fur that Aba Abdullah as-Sadiq (MGB) said, “Once during the Last Pilgrimage to Mecca the Prophet of God (MGB) delivered a sermon in the Al-Khayf Mosque of Mina. He (MGB) started out by saying God’s Praises and His Glorifications. Then the Prophet (MGB) added, “May God assist any servant who hears me, remembers what I say and delivers it to whoever has not heard it. There are many who utter what they do not understand, but there are listeners who benefit from what they have said. There are many knowledgeable ones who state things for people of a better understanding and they benefit more from what is said. There are three things which a Muslim’s heart doesn’t doubt: having sincerity in what you do for the sake of God; being united with the nation’s leaders; and being associated with the Muslims, since inviting the Muslims includes anyone who supports them. Muslims are brothers one to another and their blood is all of the same color. Even the pledge of their youngest one is binding upon them all. All Muslims are united together against their enemies.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (1/128)"
          }
        }
      },
      "Chapter #142": {
        "Hadith #1": {
          "Title": "Al-Khisal: One Would Continue to Be Rewarded for Only Three Things",
          "Link": "https://thaqalayn.net/hadith/10/4/142/1",
          "Arabic Text": "3-18 4 حدثنا أبي رضي الله عنه قال: حدثنا عبد الله بن جعفر الحميري، عن أحمد بن محمد بن عيسى، عن الحسن بن محبوب، عن علي بن رئاب، عن الحلبي، عن أبي عبد الله عليه السلام قال:ليس يتبع الرجل بعد موته من الاجر إلا ثلاث خصال: صدقة أجراها في حياته فهي تجري بعد موته إلى يوم القيامة صدقة موقوفة لا تورث -، أو سنة هدى سنها فكان يعمل بها، وعمل بها من بعده غيره، أو ولد صالح يستغفر له",
          "English Text": "3-184 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Abdullah ibn Ja’far al-Homayry quoted Ahmad ibn Muhammad ibn Isa, on the authority of Al-Hassan ibn Mahboob, on the authority of Ali ibn Re’ab, on the authority of Al-Halabi that Aba Abdullah as-Sadiq (MGB) said, “No one would get any added rewards after he dies unless for three things: an on-going charity which he has established during his lifetime and is in effect after he dies all the way up until the Resurrection Day; a public donation left which is not to be inherited by anyone; a good rule he has established which he followed and others follow after his demise; and a well-mannered child who prays for his forgiveness.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (12/225)"
          }
        }
      },
      "Chapter #143": {
        "Hadith #2": {
          "Title": "Al-Khisal: The Three First Fathers",
          "Link": "https://thaqalayn.net/hadith/10/4/143/2",
          "Arabic Text": "3-187 حدثنا أبي رضي الله عنه قال: حدثنا سعد بن عبد الله قال: حدثنا أحمد ابن أبي عبد الله البرقي، عن الحسن بن محبوب، عن أبي أيوب، عن عبدالمؤمن الانصاري، عن أبي جعفر عليه السلام قال:إن الله عز وجل أعطى المؤمن ثلاث خصال العزة في الدنيا، والفلح في الآخرة، والمهابة في صدور الظالمين، ثم قرأ \"وَلِلَّهِ الْعِزَّةُ وَلِرَسُولِهِ وَلِلْمُؤْمِنِينَ.\" وقرأ \" قَدْ أَفْلَحَ الْمُؤْمِنُونَ…\" إلى قوله \"هُمْ فِيهَا خَالِدُونَ .\"",
          "English Text": "3-187 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Sa’ed ibn Abdullah quoted Ahmad ibn Aba Abdullah Al-Barqy, on the authority of Al-Hassan ibn Mahboob, on the authority of Abi Ayoob, on the authority of Abdul-Mumin al-Ansari that Abi Ja’far al-Baqir (MGB) said, “The Honorable the Exalted God has granted the believers three characteristics: honor in this world; prosperity in the Hereafter and grandeur in the hearts of the oppressors.” Then he (MGB) went on and recited the following verse of the Holy Quran, ‘…But honour belongs to Allah and His Messenger, and to the Believers; but the Hypocrites know not.’ And he (MGB) also recited the following verses, ‘The believers must (eventually) win through,- Those who humble themselves in their prayers; Who avoid vain talk; Who are active in deeds of charity; Who abstain from sex, Except with those joined to them in the marriage bond, or (the captives) whom their right hands possess,- for (in their case) they are free from blame, But those whose desires exceed those limits are transgressors;- Those who faithfully observe their trusts and their covenants; And who (strictly) guard their prayers;- These will be the heirs, Who will inherit Paradise: they will dwell therein (for ever). ’",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (11/105)"
          }
        }
      },
      "Chapter #156": {
        "Hadith #2": {
          "Title": "Al-Khisal: There Are Three Characteristics in Onions",
          "Link": "https://thaqalayn.net/hadith/10/4/156/2",
          "Arabic Text": "3-201 حدثنا محمد بن الحسن بن أحمد بن الوليد رضي الله عنه قال: حدثنا محمد بن الحسن الصفار، عن إبراهيم بن هاشم، عن النوفلي، عن السكوني، عن جعفر ابن محمد، عن أبيه عليهما السلام أن النبي صلى الله عليه وآله قال:لا رقى إلا في ثلاثة: في حمة أو عين أو دم لا يرقأ",
          "English Text": "3-201 Muhammad ibn al-Hassan ibn Ahmad ibn al-Walid - may God be pleased with him - narrated that Muhammad ibn al-Hassan al-Saffar quoted Ibrahim ibn Hashim, on the authority of Al-Nawfaly, on the authority of Al-Sakoony, on the authority of Ja’far ibn Muhammad as-Sadiq (MGB), on the authority of his father (MGB) that the Prophet (MGB) said, “Using charms is not effective except on three occasions: for biting bugs, sore eyes or blood that will not flow (due to phlebotomy).”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "معتبرة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (7/403)"
          }
        }
      },
      "Chapter #163": {
        "Hadith #1": {
          "Title": "Al-Khisal: Three Whose Prayers Will Not be Answered",
          "Link": "https://thaqalayn.net/hadith/10/4/163/1",
          "Arabic Text": "3-208 حدثنا أبي رضي الله عنه قال: حدثنا سعد بن عبد الله، عن أحمد بن محمد بن عيسى، عن أحمد بن محمد بن أبي نصر البزنطي، عن عبد الله بن سنان، عن الوليد ابن صبيح، عن أبي عبد الله عليه السلام قال: كنت عنده وعنده جفنة من رطب فجاء سائل فأعطاه ثم جاء سائل آخر فأعطاه، ثم جاء آخر فأعطاه، ثم جاء آخر فقال: وسع الله عليك، ثم قال: إن رجلا لو كان له مال يبلغ ثلاثين أو أربعين ألفا، ثم شاء أن لا يبقى منه شيء إلا قسمه في حق فعل فيبقى لا مال له، فيكون من الثلاثة الذين يرد دعاؤهم عليهم، قال: قلت: جعلت فداك من هم؟ قال: رجل رزقه الله عز وجل مالا فأنفقه في وجوهه ثم قال: يا رب ارزقني [فيقول الله عز وجل أولم أرزقك] ورجل دعا على امرأته وهو ظالم لها فيقال له: ألم أجعل أمرها بيدك، ورجل جلس في بيته وترك الطلب، ثم يقول: يا رب ارزقني فيقول [الله] عز وجل ألم أجعل لك السبيل إلى الطلب للرزق",
          "English Text": "3-208 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Sa’ed ibn Abdullah quoted on the authority of Ahmad ibn Muhammad ibn Isa, on the authority of Ahmad ibn Muhammad ibn Abi Nasr al-Bazanty, on the authority of Abdullah ibn Sin’an, on the authority of Al-Walid ibn Sabih who said, “I was with Aba Abdullah as-Sadiq (MGB). A tray of dates was in front of him (MGB). A beggar came and the Imam (MGB) gave him some dates. Another one came and the Imam (MGB) gave him some dates. A third beggar came, but the Imam (MGB) said, ‘May God grant you an increase of sustenance!’ Then the Imam (MGB) told me, ‘If a man has more than thirty or forty-thousand (Dinars) and wishes to give it all away in charity, he can do so, but he will become poor and will be amongst those whose prayers are returned to themselves.’ I asked the Imam (MGB), ‘May I be your ransom! Who are these people?’ The Imam (MGB) replied, ‘They include men to whom God has granted what they prayed for, but spend it all for God’s sake and again say, ‘O God! Please give me more sustenance!’ They also include men who curse their wives while having treated their wives oppressively. They are told, ‘Have We not entrusted her affairs with you?’ They also include men who sit in their house, pray to seek their sustenance and say, ‘O God! Please deliver my sustenance to me! The Honorable the Exalted God tells them, ‘Have I not established a way for you to obtain your daily sustenance?’”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "من حيث السند موثقة",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (1/89)"
          }
        }
      },
      "Chapter #214": {
        "Hadith #1": {
          "Title": "Al-Khisal: People Are Divided into Three Groups When Considering Fate",
          "Link": "https://thaqalayn.net/hadith/10/4/214/1",
          "Arabic Text": "3-272 حدثنا أحمد بن هارون الفامي، وجعفر بن محمد بن مسرور رضي الله عنهما قالا: حدثنا محمد بن جعفر بن بطة قال: حدثنا محمد بن الحسن الصفار، ومحمد بن علي ابن محبوب، ومحمد بن الحسن بن عبدالعزيز، عن أحمد بن محمد بن عيسى، عن الحسين ابن سعيد، عن حماد بن عيسي الجهني، عن حريز بن عبد الله، عن أبي عبد الله عليه السلام قال: الناس في القدر على ثلاثة أوجه رجل يزعم أن الله عز وجل أجبر الناس على المعاصي فهذا قد ظلم الله عز وجل في حكمه فهو كافر، ورجل يزعم أن الامر مفوض إليهم فهذا [قد] وهن الله في سلطانه فهو كافر، ورجل يقول: إن الله عز وجل كلف العباد ما يطيقون ولم يكلفهم ما لا يطيقون، فاذا أحسن حمد الله، وإذا أساء استغفر الله، فهذا مسلم بالغ، والله الموفق",
          "English Text": "3-272 Ahmad ibn Harun al-Fami and Ja’far ibn Muhammad ibn Masroor - may God be pleased with them - narrated that Muhammad ibn Ja’far ibn Bat’tat quoted Muhammad ibn al-Hassan al-Saf’far, Muhammad ibn Ali ibn Mahboob, and Muhammad ibn al-Hassan ibn Abdul-Aziz, on the authority of Ahmad ibn Muhammad ibn Isa, on the authority of Al-Hussein ibn Sa’id, on the authority of Hammad ibn Isa al-Jahani, on the authority of Hurayz ibn Abdullah, on the authority of Aba Abdullah as-Sadiq (MGB), “The people can be classified into three groups regarding the issue of fate. There are those who think that the Exalted the Honorable God has forced the people to commit sins. Such people have wronged the Exalted the Honorable God with their decree. They are atheists. There are others who think that running all the affairs has been turned over to them. Such people have undermined God’s Kingdom. Thus, they are atheists. There are also those who say, ‘The Honorable the Exalted God has placed such a burden upon His servants that they can bear. God has not overburdened the people to such an extent which they cannot stand. Once they do good, they praise God. And once they do bad, they seek God’s forgiveness.’ Such people are true Muslims. It is God who grants success.",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (9/81)"
          }
        }
      }
    },
    "Book #5": {
      "Chapter #4": {
        "Hadith #1": {
          "Title": "Al-Khisal: Four Issues Strengthen the Religion",
          "Link": "https://thaqalayn.net/hadith/10/5/4/1",
          "Arabic Text": "4-5 حدثنا محمد بن الحسن بن أحمد بن الوليد رضي الله عنه قال: حدثنا محمد بن الحسن الصفار، عن أحمد بن أبي عبد الله البرقي، عن أبيه، عن محمد بن أبي عمير، عن جميل بن دراج، عن زرارة، عن أبي جعفر عليه السلام قال: قال أمير المؤمنين عليه السلام: قوام الدين بأربعة: بعالم ناطق مستعمل له، وبغني لا يبخل بفضله على أهل دين الله، وبفقير لا يبيع آخرته بدنياه، وبجاهل لا يتكبر عن طلب العلم. فإذا كتم العالم علمه، وبخل الغني بماله، وباع الفقير آخرته بدنياه، واستكبر الجاهل عن طلب العلم رجعت الدنيا إلى ورائها القهقرى، فلا تغرنكم كثرة المساجد وأجساد قوم مختلفة، قيل: يا أمير المؤمنين كيف العيش في ذلك الزمان، فقال: خالطوهم بالبرانيةيعني في الظاهروخالفوهم في الباطن، للمرء ما اكتسب وهو مع من أحب، وانتظروا مع ذلك الفرج من الله عز وجل",
          "English Text": "4-5 Muhammad ibn al-Hassan ibn Ahmad ibn al-Walid - may God be pleased with him - narrated that Muhammad ibn al-Hassan al-Saffar quoted Ahmad ibn Aba Abdullah Al-Barqy, on the authority of his father, on the authority of Muhammad ibn Abi Umayr, on the authority of Jameel ibn Dur’raj, on the authority of Zurarah that Abi Ja’far al-Baqir (MGB) narrated that the Commander of the Faithful Imam Ali (MGB) said, “There are four issues that will strengthen the religion: outspoken scholars who act according to their knowledge; rich folks who are not stingy in assisting those who adhere to God’s Religion; poor folks who do not outsell their religious beliefs to worldly affairs; and ignorant folks who are not too arrogant to quest for knowledge. Once the knowledgeable ones hide their knowledge, the rich are stingy with their wealth, the poor trade their afterlife in exchange for this world and the ignorant are too arrogant to seek knowledge, the world will start to retreat. At that time you should not be fooled by the increasing number of mosques and the many who go there.” The Imam (MGB) was asked, “O Commander of the Faithful! How should one live at that time?” The Imam (MGB) replied, “Associate with the people superficially. One only gets what he earns and will be resurrected with whatever he likes. Await relief to be sent by the Honorable the Exalted God.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (7/400)"
          }
        }
      },
      "Chapter #9": {
        "Hadith #1": {
          "Title": "Al-Khisal: A Divine Leader Can Be Recognized By Four Characteristics",
          "Link": "https://thaqalayn.net/hadith/10/5/9/1",
          "Arabic Text": "4-12 حدثنا أبي رضي الله عنه قال: حدثنا محمد بن يحيى العطار، عن محمد ابن أحمد، عن محمد بن الوليد، عن حماد بن عثمان، عن الحارث بن المغيرة النصري قال: قلت لابي عبد الله عليه السلام: بم يعرف صاحب هذا الامر؟ قال: بالسكينة والوقار والعلم والوصية",
          "English Text": "4-12 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Muhammad ibn Yahya al-Attar quoted Muhammad ibn Ahmad, on the authority of Muhammad ibn al-Walid, on the authority of Hammad ibn Uthman, on the authority of Al-Harith ibn al-Muqayrih al-Nasri, “I asked Aba Abdullah as-Sadiq, ‘What are the signs with which one can recognize a true Divine Leader?’ The Imam (MGB) replied, ‘Serenity, solemnity, knowledge and will .’”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "موثقة سندا",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (12/215)"
          }
        }
      },
      "Chapter #19": {
        "Hadith #2": {
          "Title": "Al-Khisal: Four things Are Incumbent for Him who Has Three Characteristics",
          "Link": "https://thaqalayn.net/hadith/10/5/19/2",
          "Arabic Text": "4-29 حدثنا أبي رضي الله عنه قال: حدثنا علي بن موسى بن جعفر بن أبي جعفر الكميداني، عن أحمد بن محمد بن عيسى، عن محمد بن أبي عمير، عن عبد الله بن سنان، عن أبي عبد الله عليه السلام قال: ثلاث من كن فيه أوجبن له أربعا على الناس: من إذا حدثهم لم يكذبهم وإذا خالطهم لم يظلمهم وإذا وعدهم لم يخلفهم، وجب أن تظهر في الناس عدالته، وتظهر فيهم مروءته، وأن تحرم عليهم غيبته، وأن تجب عليهم اخوته",
          "English Text": "4-29 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Ali ibn Musa ibn Ja’far ibn Abi Ja’far al-Kumaydany quoted Ahmad ibn Muhammad ibn Isa, on the authority of Muhammad ibn Abi Umayr, on the authority of Abdullah ibn Sin’an, on the authority of Aba Abdullah as-Sadiq (MGB), “Four things are incumbent to do for anyone who has the following three characteristics: one who doesn’t lie to the people when he talks; one who doesn’t oppress the people in his dealings with them; one who doesn’t act opposite to what he promises. Such a person has perfect chivalry and justice. It is incumbent support his justness; to act like a brother with him; support his justness; not gossip about him; treat him like a brother.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "معتبرة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (7/117)"
          }
        }
      },
      "Chapter #35": {
        "Hadith #1": {
          "Title": "Al-Khisal: Four Characteristics Are Due to Obsession",
          "Link": "https://thaqalayn.net/hadith/10/5/35/1",
          "Arabic Text": "4-46 حدثنا أبي رضي الله عنه قال: حدثنا سعد بن عبد الله، عن محمد بن عيسى، عن عبيد الله بن عبد الله الدهقان، عن درست بن أبي منصور الواسطي، عن إبراهيم بن عبدالحميد، عن أبي الحسن الاول عليه السلام قال: أربعة من الوسواس: أكل الطين، وفت الطين، وتقليم الاظفار بالاسنان، وأكل اللحية",
          "English Text": "4-46 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Sa’ed ibn Abdullah quoted Muhammad ibn Isa, on the authority of Ubaydullah ibn Abdullah al-Dihqan, on the authority of Durost ibn Abi Mansoor al-Vaseti, on the authority of Ibrahim ibn Abdul-Hamid, on the authority of Durost ibn Abi Mansoor al-Vaseti, on the authority of Ibrahim ibn Abdul Hamid, on the authority of Abil Hassan - the first (MGB) , “The following four acts are due to obsession: eating clay, breaking up clay, biting one’s nails, and chewing one’s beard (Trichotillomania).”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (12/177)"
          }
        }
      },
      "Chapter #36": {
        "Hadith #1": {
          "Title": "Al-Khisal: Four Things Will Never Be Satiated with Four Others",
          "Link": "https://thaqalayn.net/hadith/10/5/36/1",
          "Arabic Text": "4-47 حدثنا محمد بن الحسن بن أحمد بن الوليد رضي الله عنه قال: حدثنا محمد ابن الحسن الصفار، عن جعفر بن محمد بن عبيد الله، عن عبد الله بن ميمون القداح،عن أبي عبد الله عليه السلام قال: أربعة لا يشبعن من أربعة: الارض من المطر، والعين من النظر، والانثى من الذكر، والعالم من العلم",
          "English Text": "4-47 Muhammad ibn al-Hassan ibn Ahmad ibn al-Walid - may God be pleased with him - narrated that Muhammad ibn al-Hassan al-Saffar quoted on the authority of Ja’far ibn Muhammad ibn Ubaydullah, on the authority of Abdullah ibn Maymun al-Qad’dah that Aba Abdullah as-Sadiq(MGB) said, “There are four things which will never be satiated by four other things: the Earth will never become satiated with rain; the eyes will never be satiated with seeing; women will never be satiated with men and scholars will never be satiated with knowledge.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "من حيث السند لا بأس بها",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (5/265)"
          }
        }
      },
      "Chapter #52": {
        "Hadith #1": {
          "Title": "Al-Khisal: The Prophet liked four tribes and disliked four tribes",
          "Link": "https://thaqalayn.net/hadith/10/5/52/1",
          "Arabic Text": "4-64 حدثنا أبي رضي الله عنه قال: حدثنا سعد بن عبد الله قال: حدثني محمد بن عيسى بن عبيد، عن سليمان بن جعفر الجعفري، عن الرضا، عن أبيه، عن جده، عن آبائه عليهم السلام أن رسول الله صلى الله عليه وآله كان يحب أربع قبائل: كان يحب الانصار، وعبدالقيس، وأسلم، وبني تميم، وكان يبغض بني امية، وبني حنيف وبني ثقيف وبني هذيل وكان عليه السلام يقول: لم تلدني امي بكرية ولا ثقفية، وكان عليه السلام يقول: في كل حي نجيب إلا في بني امية",
          "English Text": "4-64 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Sa’ed ibn Abdullah quoted Muhammad ibn Isa ibn Ubayd, on the authority of Suleiman ibn Ja’far al-Ja’fari, on the authority of Al-Ridha (MGB), on the authority of his father (MGB), on the authority of his forefathers (MGB), “God’s Prophet (MGB) liked four tribes: the Helpers (Ansar); Abdul Qyas; Aslam; and Tamim tribe. God’s Prophet (MGB) disliked four tribes: the Umayyads; the Hanif tribe; the Thaqif tribe; and the Hazil tribe. The Prophet (MGB) said, ‘My mother who delivered me was not from the Bakr tribe or the Thaqif tribe.’ He (MGB) also said, ‘There are some noble people in all tribes except for the Umayyads.’”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (9/65)"
          }
        }
      },
      "Chapter #53": {
        "Hadith #1": {
          "Title": "Al-Khisal: Four acts will make the heart perish",
          "Link": "https://thaqalayn.net/hadith/10/5/53/1",
          "Arabic Text": "4-65 حدثنا محمد بن الحسن رضي الله عنه قال: حدثنا عبد الله بن جعفر الحميري عن هارون بن مسلم، عن مسعدة بن صدقة، عن جعفر بن محمد، عن أبيه عليهما السلام قال: قال رسول الله صلى الله عليه وآله: أربع يمتن القلب: الذنب على الذنب، وكثرة مناقشة النساءيعني محادثتهن ومماراة الاحمق تقول ويقول ولا يرجع إلى خير [أبدا]، ومجالسة الموتى، فقيل له: يا رسول الله صلى الله عليه وآله وما الموتى؟ قال كل غني مترف",
          "English Text": "4-65 Muhammad ibn al-Hassan - may God be pleased with him - narrated that Abdullah ibn Ja’far al-Homayry quoted Harun ibn Muslim, on the authority of Mus’adat ibn Sadaqah, on the authority of Ja’far ibn Muhammad (MGB), on the authority of his father (MGB) that God’s Prophet (MGB) said, “Four acts will make the heart perish: committing sins continuously; talking with women often; arguing with a fool, (since you keep talking with him, but he will never be guided to the right way), and associating with the dead!” They asked him what he meant by the dead? The Prophet of God (MGB) said, “All the rich who live in ease and luxury.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "معتبرة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (3/226)"
          }
        }
      },
      "Chapter #76": {
        "Hadith #1": {
          "Title": "Al-Khisal: Four of the Traditions of the Prophets",
          "Link": "https://thaqalayn.net/hadith/10/5/76/1",
          "Arabic Text": "4-93 حدثنا محمد بن موسى بن المتوكل رضي الله عنه قال: حدثني علي بن إبراهيم ابن هاشم، عن أبيه، عن محمد بن يحيى الخزاز، عن طلحة بن زيد، عن جعفر بن محمد، عن أبيه، عن آبائه، عن علي عليهم السلام قال: قال رسول الله صلى الله عليه وآله: أربع من سنن المرسلين: العطر، والنساء، والسواك، والحناء",
          "English Text": "4-93 Muhammad ibn Musa ibn al-Mutevakil - may God be pleased with him - narrated that Ali ibn Ibrahim ibn Hashim quoted his father, on the authority of Muhammad ibn Yahya al-Khazzaz, on the authority of Talha ibn Zayd, on the authority of Ja’far ibn Muhammad as-Sadiq (MGB), on the authority of his father (MGB), on the authority of his grandfather (MGB), on the authority of Ali (MGB) that God’s Prophet (MGB) said, “The following four characteristics are from the traditions of the Messengers: perfumes, women , brushing and putting on Henna. ”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "معتبرة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (7/202)"
          }
        }
      },
      "Chapter #79": {
        "Hadith #1": {
          "Title": "Al-Khisal: The four signs of misery",
          "Link": "https://thaqalayn.net/hadith/10/5/79/1",
          "Arabic Text": "4-96 حدثنا محمد بن موسى بن المتوكل رضي الله عنه قال: حدثنا علي بن الحسين السعد آبادي، عن أحمد بن أبي عبد الله، عن النوفلي، عن السكوني، عن جعفر ابن محمد، عن أبيه، عن آبائه، عن علي عليهم السلام قال: قال رسول الله صلى الله عليه وآله: من علامات الشقاء جمود العين وقسوة القلب، وشدة الحرص في طلب الرزق، والاصرار على الذنب",
          "English Text": "4-96 Muhammad ibn Musa ibn al-Mutevakil - may God be pleased with him - narrated that Ali ibn al-Hussein al-Sa’ed Abady quoted Ahmad ibn Aba Abdullah, on the authority of Al-Nawfaly, on the authority of Al-Sakoony, on the authority of Ja’far ibn Muhammad as-Sadiq (MGB), on the authority of his father (MGB), on the authority of his forefathers (MGB), on the authority of Ali (MGB) that God’s Prophet (MGB) said, “The following are amongst the signs of misery: solidity of the eye , hard-heartedness, excessive greed to gain one’s daily bread and insisting on committing sins.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "معتبرة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (9/131)"
          }
        }
      },
      "Chapter #97": {
        "Hadith #1": {
          "Title": "Al-Khisal: Four of the Characteristics of the Prophets",
          "Link": "https://thaqalayn.net/hadith/10/5/97/1",
          "Arabic Text": "4-12 1 حدثنا أبي رضي الله عنه قال: حدثنا سعد بن عبد الله، عن أحمد بن محمد ابن عيسى، عن الحسن بن محبوب، عن أبان، عن الحلبي، عن أبي عبد الله عليه السلام قال: إن الصبر والبر والحلم وحسن الخلق من أخلاق الانبياء",
          "English Text": "4-121 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Sa’ed ibn Abdullah quoted Ahmad ibn Muhammad ibn Isa, on the authority of Al-Hassan ibn Mahboob, on the authority of Aban, on the authority of Al-Halabi that Aba Abdullah as-Sadiq (MGB) said, “Indeed perseverance, kindness, patience and being good-tempered are of the characteristics of the Prophets.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (10/394)"
          }
        }
      }
    },
    "Book #6": {
      "Chapter #30": {
        "Hadith #2": {
          "Title": "Al-Khisal: The five instances for renewing one’s prayer",
          "Link": "https://thaqalayn.net/hadith/10/6/30/2",
          "Arabic Text": "5-37 حدثنا محمد بن الحسن رضي الله عنه قال: حدثنا محمد بن الحسن الصفار، عن محمد بن عيسى، عن عثمان بن عيسى، عن عبد الله بن مسكان، عن أبي عبد الله عليه السلام قال:لم يقسم بين العباد أقل من خمس: اليقين والقنوع والصبر والشكر والذي يكمل له هذا كله العقل",
          "English Text": "5-37 Muhammad ibn al-Hassan - may God be pleased with him - narrated that Muhammad ibn al-Hassan al-Saffar quoted Muhammad ibn Isa, on the authority of Uthman ibn Isa, on the authority of Uthman ibn Isa, on the authority of Abdullah ibn Miskan that Aba Abdullah as-Sadiq (MGB) said, “No less than five characteristics are distributed among the servants of God: certitude, contentment, perseverance, gratitude, and intelligence which perfects them all.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "موثقة سندا",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (12/332)"
          }
        }
      },
      "Chapter #42": {
        "Hadith #1": {
          "Title": "Al-Khisal: The Prophet Has Admonished Against Five Things",
          "Link": "https://thaqalayn.net/hadith/10/6/42/1",
          "Arabic Text": "5-49 حدثنا أبي رضي الله عنه قال: حدثنا سعد بن عبد الله، عن أحمد، وعبد الله ابني محمد بن عيسى، عن محمد بن أبي عمير عن حماد بن عثمان عن الحلبي عن أبيعبد الله عليه السلام قال: قال علي عليه السلام: نهاني رسول الله صلى الله عليه وآله ولا أقول نهاكم عن التختم بالذهب، وعن ثياب القسي وعن مياثر الارجوان، وعن الملاحف المفدمة، وعن القراءة وأنا راكع. قال: مصنف هذا الكتاب رضي الله عنه: ثياب القسي هي ثياب يؤتى بها من مصر يخالطها الحرير",
          "English Text": "5-49 (The compiler of the book narrated) that his father -may God be pleased with him- narrated that Sa’ed ibn Abdullah quoted Ahmad and Abdullahibn Muhammad ibn Isa, on the authority of Muhammad ibn Abi Umayr, on the authority of Hammad ibn Uthman, on the authority of al-Halabi, on the authority of Aba Abdullah as-Sadiq (MGB) that Ali (MGB) said, “The Prophet (MGB) has admonished us (Imams) against five things. I am not saying that he (MGB) has admonished you against them. They are as follows: wearing a gold ring on the fingers; wearing silk clothes from Egypt; wearing red clothes; using highly reddish blankets; and reciting the Quran while bowing down.”The compiler of the book - may God be pleased with him - said, “What is meant by silk clothes from Egypt is clothes made from a fabric which is woven with silk and comes from Egypt.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (2/108)"
          }
        }
      },
      "Chapter #44": {
        "Hadith #1": {
          "Title": "Al-Khisal: The Perfection of a Muslim’s Faith Can Be Recognized By Five Things",
          "Link": "https://thaqalayn.net/hadith/10/6/44/1",
          "Arabic Text": "5-51 حدثنا محمد بن موسى بن المتوكل رضي الله عنه قال: حدثنا عبد الله بن جعفر الحميري، عن أحمد بن محمد بن عيسى، عن الحسن بن محبوب، عن أبي ولاد [الحناط]، عن أبي عبد الله عليه السلام قال: كان علي بن الحسين عليهما السلام يقول: إن المعرفة بكمال دين المسلم تركه الكلام فيما لا يعنيه، وقلة المراء وحلمه وصبره وحسن خلقه",
          "English Text": "5-51 Muhammad ibn Musa ibn al-Mutevakil - may God be pleased with him - narrated that Abdullah ibn Ja’far al-Homayry quoted Ahmad ibn Muhammad ibn Isa, on the authority of Al-Hassan ibn Mahboob, on the authority of Abi Vilad (al-Hinat), on the authority of Aba Abdullah as-Sadiq (MGB) that Ali ibn al-Hussein as-Sajjad (MGB) said, “Indeed the perfection of a Muslim’s faith can be recognized by the following five things: not saying absurd things; quarrelling rarely; having perseverance; being patient and being good-tempered.”",
          "Grading": [
            {
              "English Grade": "Acceptable",
              "Arabic Grade": "معتبرة الإسناد",
              "Scholar": "Shaykh Hadi al-Najafi",
              "Book": "Mawsu'at Ahadith Ahlulbayt (10/194)"
            },
            {
              "English Grade": "Acceptable",
              "Arabic Grade": "معتبر",
              "Scholar": "Shaykh Asif al-Mohseni",
              "Book": "Muʿjam al-Aḥādīth al-Muʿtabara"
            }
          ]
        }
      },
      "Chapter #54": {
        "Hadith #1": {
          "Title": "Al-Khisal: Blessed Bedvii Those who Have Five Characteristics",
          "Link": "https://thaqalayn.net/hadith/10/6/54/1",
          "Arabic Text": "5-63 حدثنا محمد بن موسى بن المتوكل رضي الله عنه قال: حدثنا عبد الله بن جعفر الحميري، عن إبراهيم بن هاشم، عن عبد الله بن ميمون، عن جعفر بن محمد، عن أبيه، عن آبائه، عن علي عليهم السلام قال: قال عيسى بن مريم عليه السلام: طوبى لمن كان صمته فكرا، ونظره عبرا، ووسعه بيته، وبكى على خطيئته. وسلم الناس من يده ولسانه",
          "English Text": "5-63 Muhammad ibn Musa ibn al-Mutevakil - may God be pleased with him - narrated that Abdullah ibn Ja’far al-Homayry quoted Ibrahim ibn Hashim, on the authority of Abdullah ibn Maymun , on the authority of Ja’far ibn Muhammad as-Sadiq (MGB), on the authority of his father (MGB), on the authority of his forefathers, on the authority of Ali (MGB) that Jesus the son of Mary (MGB) said, “Blessed be those who have five characteristics. Blessed be those who think when they are silent; who get advice by looking; who sit at home and cry over their sins; and do not bother the people with their hands or tongues.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (6/321)"
          }
        }
      },
      "Chapter #57": {
        "Hadith #1": {
          "Title": "Al-Khisal: The Mill in Hell which Grinds Five Groups of People",
          "Link": "https://thaqalayn.net/hadith/10/6/57/1",
          "Arabic Text": "5-66 حدثنا أبي رضي الله عنه قال: حدثنا عبد الله بن جعفر الحميري قال: حدثني هارون بن مسلم، عن مسعدة بن زياد، عن جعفر بن محمد، عن أبيه، عن آبائه عليهم السلام أن عليا عليه السلام قال: إن في جهنم رحى تطحن [خمسا] أفلا تسألون ما طحنها؟ فقيل له: فما طحنها يا أمير المؤمنين؟ قال: العلماء الفجرة، والقراء الفسقة، والجبابرة الظلمة، والوزراء الخونة، والعرفاء الكذبة.وإن في النار لمدينة يقال لها: الحصينة أفلا تسألوني ما فيها؟ فقيل: وما فيها يا أمير المؤمنين؟ فقال: فيها أيدي الناكثين",
          "English Text": "5-66 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Abdullah ibn Ja’far al-Homayry quoted Harun ibn Muslim, on the authority of Mus’adat ibn Zyad, on the authority of Ja’far ibn Muhammad as-Sadiq (MGB), on the authority of his father (MGB), on the authority of his forefathers (MGB), “Ali (MGB) said, ‘There is a mill in Hell which grinds five. Don’t you wish to ask me what it grinds?’ They asked him (MGB), ‘What does it grind?’ Ali (MGB) said, ‘It grinds wicked wise men; corrupt Quran recitors; wicked oppressors; dishonest ministers; and gnostics who lie. There is a town in Hell which is called Hasineh. Don’t you wish to ask me what is in it?’ They asked him, ‘O Commander of the Faithful! What is in it?’ He (MGB) replied, ‘The hands of the perfidious party (Nakiseen).’”",
          "Grading": [
            {
              "English Grade": "Acceptable",
              "Arabic Grade": "من حيث السند لا بأس بها",
              "Scholar": "Shaykh Hadi al-Najafi",
              "Book": "Mawsu'at Ahadith Ahlulbayt (7/279)"
            },
            {
              "English Grade": "Acceptable",
              "Arabic Grade": "معتبر",
              "Scholar": "Shaykh Asif al-Mohseni",
              "Book": "Muʿjam al-Aḥādīth al-Muʿtabara"
            }
          ]
        }
      }
    },
    "Book #7": {
      "Chapter #13": {
        "Hadith #1": {
          "Title": "Al-Khisal: Six characteristics which a believer doesn’t have",
          "Link": "https://thaqalayn.net/hadith/10/7/13/1",
          "Arabic Text": "6-15 حدثنا أحمد بن محمد بن يحيى العطار رضي الله عنه قال: حدثنا سعد بن عبد الله، عن محمد بن الحسين بن أبي الخطاب، عن جعفر بن بشير، عن أبان بن عثمان عن الحارث بن المغيرة النضري، عن أبي عبد الله عليه السلام قال: سمعته يقول: ستة لا تكون في المؤمن: العسر، والنكد، واللجاجة، والكذب، والحسد، والبغي",
          "English Text": "6-15 Ahmad ibn Muhammad ibn Yahya al-Attar - may God be pleased with him - narrated that Sa’ed ibn Abdullah quoted Muhammad ibn al-Hussein ibn Abil-Khat’tab, on the authority of Ja’far ibn Bashir, on the authority of Aban ibn Uthman, on the authority of Al-Harith ibn al-Muqayrih al-Nazri that Aba Abdullah as-Sadiq (MGB) said, “There are six characteristics which a believer doesn’t have: poverty; being unknown; being stubborn; telling lies; being jealous and transgression of people’s rights.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (10/22)"
          }
        }
      }
    },
    "Book #8": {
      "Chapter #44": {
        "Hadith #8": {
          "Title": "Al-Khisal: What Has Been Said About Sundays And Other Days After It",
          "Link": "https://thaqalayn.net/hadith/10/8/44/8",
          "Arabic Text": "7-68 حدثنا أبي رضي الله عنه قال: حدثنا سعد بن عبد الله قال: حدثني أحمد ابن محمد بن عيسى، عن موسى بن القاسم البجلي، عن علي بن جعفر قال: جاء رجل إلى أخي موسى بن جعفر عليهما السلام فقال له: جعلت فداك إني اريد الخروج فادع لى فقال: ومتى تخرج؟ قال: يوم الاثنين؟ فقال له: ولم تخرج يوم الاثنين؟ قال: أطلب فيه البركة لان رسول الله صلى الله عليه وآله ولد يوم الاثنين، فقال: كذبوا ولد رسول الله صلى الله عليه وآله يوم الجمعة، وما من يوم أعظم شوما من يوم الاثنين، يوم مات فيه رسول الله صلى الله عليه وآله وانقطع فيه وحي السماء، وظلمنا فيه حقنا، ألا أدلك على يوم سهل لين ألان الله لداود عليه السلام فيه الحديد؟ فقال الرجل: بلى جعلت فداك، فقال: اخرج يوم الثلثاء",
          "English Text": "7-68 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Sa’ed ibn Abdullah quoted Ahmad ibn Muhammad ibn Isa, on the authority of Musa ibn al-Qasim al-Bajaly, on the authority of Ali ibn Ja’far (MGB), “A man had gone to see my brother Musa ibn Ja’far al-Kadhim (MGB) and said, ‘May I be your ransom! I have planned to go on a trip. Please pray for me.’ The Imam (MGB) said, ‘On which day are you planning to go?’ The man said, ‘On Monday.’ The Imam (MGB) said, ‘Why do you go on Monday?’ The man said, ‘I go on that day to seek blessings since that is the Prophet’s birthday.’ The Imam (MGB) said, ‘No, they lie. The Prophet’s (MGB) birthday is on a Friday. No day is more wicked than Monday. It was on that day the Prophet (MGB) perished and heavenly revelations ceased to descend. It was on that day that they usurped our rights by force. Do you want me to guide you to an easy day on which God softened iron for David (MGB)?’ The man said, ‘May I be your ransom! Yes.’ The Imam (MGB) said, ‘Go on a Tuesday.’”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (12/360)"
          }
        }
      },
      "Chapter #45": {
        "Hadith #2": {
          "Title": "Al-Khisal: On What Has Been Said About Tuesdays",
          "Link": "https://thaqalayn.net/hadith/10/8/45/2",
          "Arabic Text": "7-70 حدثنا محمد بن الحسن بن أحمد بن الوليد رضي الله عنه قال: حدثنا سعد ابن عبدلله، عن القاسم بن محمد الاصبهاني، عن سليمان بن داود المنقري، عن حفص ابن غياث النخعي، عن أبي عبد الله عليه السلام قال: من كان مسافرا فليسافر يوم السبت، فلو أن حجرا زال عن حجر يوم السبت لرده الله إلى مكانه، ومن تعذرت عليه الحوائج فليلتمس طلبها يوم الثلثاء فإنه اليوم الذي ألان الله فيه الحديد لداود عليه السلام",
          "English Text": "7-70 Muhammad ibn al-Hassan ibn Ahmad ibn al-Walid - may God be pleased with him - narrated that Sa’ed ibn Abdullah quoted Al-Qasim ibn Muhammad al-Isfahani, on the authority of Suleiman ibn Davood al-Munqeri, on the authority of Hafs ibn Qiyath al-Nakha’ee, on the authority of Aba Abdullah as-Sadiq (MGB), “Whoever wants to travel, it is better for him to go on a trip on Saturdays because if a stone becomes separated from the mountain, God will return it to its place on that day. It is better for those who have some need, to ask for it on a Tuesday since that is the day on which God softened iron for David (MGB).”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "معتبرة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (12/362)"
          }
        }
      },
      "Chapter #46": {
        "Hadith #5": {
          "Title": "Al-Khisal: On what has been said about Wednesdays",
          "Link": "https://thaqalayn.net/hadith/10/8/46/5",
          "Arabic Text": "7-75 حدثنا أبي رضي الله عنه قال: حدثنا سعد بن عبد الله قال: حدثنا أحمد ابن محمد بن عيسى، عن الحسين بن سعيد، عن فضالة، عن أبان، عن أبي جعفر الاحوال عن بشار بن يسار قال: قلت لابي عبد الله عليه السلام:لاي شيء يصام يوم الاربعاء؟ قال: لان النار خلقت يوم الاربعاء",
          "English Text": "7-75 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Sa’ed ibn Abdullah quoted Ahmad ibn Muhammad ibn Isa, on the authority of Al-Hussein ibn Sa’id, on the authority of Fuzalat, on the authority of Aban, on the authority of Abi Ja’far al-Ahwal, on the authority of Bashar ibn Yasar, “I asked Aba Abdullah as-Sadiq (MGB), ‘Why do you always fast on Wednesdays?’ The Imam (MGB) replied, ‘Since the Fire (of Hell) was created on a Wednesday.’”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (12/364)"
          }
        }
      },
      "Chapter #47": {
        "Hadith #3": {
          "Title": "Al-Khisal: On what has been said about Thursdays",
          "Link": "https://thaqalayn.net/hadith/10/8/47/3",
          "Arabic Text": "7-82 وبهذا الاسناد، عن الحسين بن سعيد، عن النضر بن سويد، عن هشام بن سالم، عن الاحول، عن أبي عبد الله عليه السلام أن رسول الله صلى الله عليه وآلهسئل عن صوم خميسين بينهما أربعاء فقال: أما الخميس فيوم تعرض فيه الاعمال، وأما الاربعاء فيوم خلقت فيه النار، وأما الصوم فجنة",
          "English Text": "7-82 By the same documentation it is narrated that Al-Hussein ibn Sa’id quoted Al-Nazr ibn Soweed, on the authority of Hisham ibn Salim, on the authority of Al-Ahval that Aba Abdullah as-Sadiq (MGB) said, “God’s Prophet(MGB) was questioned about fasting on two Thursdays and on the Wednesday in between them He (MGB) replied, ‘Thursdays are the days when our deeds are presented and Wednesday is the day on which Hell was created. Fasting is an armor against the Fire.’”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "معتبرة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (12/366)"
          }
        }
      },
      "Chapter #48": {
        "Hadith #3": {
          "Title": "Al-Khisal: On What Has Been Said About Fridays",
          "Link": "https://thaqalayn.net/hadith/10/8/48/3",
          "Arabic Text": "7-86 وعن السكوني، عن جعفر بن محمد، عن أبيه، عن آبائه، عن علي عليهم السلام قال: قال رسول الله صلى الله عليه وآله: اطرفوا أهاليكم في كل جمعة بشيء من الفاكهة واللحم حتى يفرحوا بالجمعة وكان النبي صلى الله عليه وآله إذا خرج في الصيف من بيت خرج يوم الخميس وإذا أراد أن يدخل البيت في الشتاء من البرد دخل يوم الجمعة، وقد روي أنه كان دخوله وخروجه يوم الجمعة",
          "English Text": "7-86 And Al-Sakoony narrated that Ja’far ibn Muhammad as-Sadiq (MGB) quoted his father (MGB), on the authority of his forefathers (MGB), on the authority of Ali (MGB) that God’s Prophet (MGB) said, “You should take some meat and fruits to your family on Fridays so that they are happy. The Prophet (MGB) used to leave his room to rest in the summer on Thursdays. He (MGB) used to return to the room on Friday nights due to the cold in the winter. It has also been narrated that he (MGB) always left the room and returned to it on Fridays.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "معتبرة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (12/371)"
          }
        },
        "Hadith #7": {
          "Title": "Al-Khisal: On What Has Been Said About Fridays",
          "Link": "https://thaqalayn.net/hadith/10/8/48/7",
          "Arabic Text": "7-90 حدثنا أبي رضي الله عنه قال: حدثنا محمد بن يحيى العطار، عن محمد ابن أحمد، عن معاوية بن حكيم، عن معمر بن خلاد، عن أبي الحسن الرضا عليه السلام قال: لا يبغي للرجل أن يدع الطيب في كل يوم، فإن لم يقدر عليه فيوم ويوم لا، فان لم يقدر ففي كل جمعة، ولا يدع ذلك",
          "English Text": "7-90 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Muhammad ibn Yahya al-Attar quoted Muhammad ibn Ahmad, on the authority of Muawiyah ibn Hakim, on the authority of Mu’amir ibn Khilad that Abil Hassan al-Ridha (MGB) said, “It is not good for man to abandon putting on perfume on himself. He should at least put on perfume once every other day if he can. Or at least he should put on perfume every Friday if he can. He should not abandon this.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (12/372)"
          }
        },
        "Hadith #10": {
          "Title": "Al-Khisal: On What Has Been Said About Fridays",
          "Link": "https://thaqalayn.net/hadith/10/8/48/10",
          "Arabic Text": "7-93 حدثنا أحمدبن زياد الهمداني رضي الله عنه قال: حدثناعلي بن إبراهيم ابن هاشم، عن أبيه، عن محمد بن أبي عمير، وعلى بن الحكم جميعا، عن هشام بن الحكم عن أبي عبد الله عليه السلام في الرجل يريد أن يعمل شيئا من الخير مثل الصدقة والصوم ونحو هذا، قال: يستحب أن يكون ذلك يوم الجمعة فإن العمل يوم الجمعة يضاعف",
          "English Text": "7-93 Ahmad ibn Zyad al-Hamedany - may God be pleased with him - narrated that Ali ibn Ibrahim ibn Hashim quoted his father, on the authority of Muhammad ibn Abi Umayr and Ali ibn al-Hikam, on the authority of Hisham ibn al-Hakam that Aba Abdullah as-Sadiq (MGB) said, “In you want to do some good deed such as giving charity, fasting or a similar deed it is best to do it on a Friday since then it would be rewarded twice.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (12/372)"
          }
        },
        "Hadith #12": {
          "Title": "Al-Khisal: On What Has Been Said About Fridays",
          "Link": "https://thaqalayn.net/hadith/10/8/48/12",
          "Arabic Text": "7-95 حدثنا أبي رضي الله عنه قال: حدثنا سعدبن عبد الله، عن أيوب بن نوح، عن محمد بن أبي عمير، عن عبد الله بن سنان، عن أبي عبد الله عليه السلام قال: من قال في آخر سجدة من النافلة بعد المغرب ليلة الجمعة وإن قاله كـل ليلـة فهـوأفضل: \"اللهم إني أسالك بوجهك الكريم واسمك العظيم أن تصلي على محمد وآل محمد وأن تغفر لي ذنبي العظيم\" سبع مرات انصرف وقد غفرله. قال: وقال أبوعبد الله عليه السلام: إذا كانت عشية الخميس وليلة الجمعة نزلت ملائكة من السماء معها أقلام الذهب وصحف الفضة لا يكتبون عشية الخميس وليلة الجمعة ويوم الجمعة إلى أن تغيب الشمس إلا الصلاة على النبي صلى الله عليه وآله، ويكره السفر والسعي في الحوائج يوم الجمعة. يكره من أجل الصلاة فأما بعد الصلاة فجائز يتبرك به",
          "English Text": "7-95 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Sa’ed ibn Abdullah quoted Ayoob ibn Nooh, on the authority of Muhammad ibn Abi Umayr, on the authority of Abdullah ibn Sin’an, on the authority of Aba Abdullah as-Sadiq (MGB), “Whoever says the following supplications at the end of the prostration of the recommendable (Nafila) prayer after the eve of Friday night, ‘O my Lord! I beseech you by your Noble Face and Grand Name that you send blessingsupon Muhammad and his household and that you forgive my major sins’ for seven times would be forgiven by God just when he lifts his head off from the position of prostration.’”Aba Abdullah as-Sadiq (MGB) also said, “Angels who carry golden pens and silver tablets descend to the Earth on Thursday nights and Fridays. They only record the reward of sending blessings upon Muhammad and his household on Thursday nights and Fridays. It is not recommendable to go after your needs on Fridays before the Friday prayer, but it is fine to do so afterwards.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (12/371)"
          }
        },
        "Hadith #13": {
          "Title": "Al-Khisal: On What Has Been Said About Fridays",
          "Link": "https://thaqalayn.net/hadith/10/8/48/13",
          "Arabic Text": "7-96 حدثنا محمد بن الحسن بن أحمد بن الوليد رضي الله عنه قال: حدثنا محمد ابن الحسن الصفار، عن يعقوب بن يزيد، عن محمد بن أبي عمير، عن أبي أيوب إبراهيم ان عثمان الخزاز أنه قال: سألت أبا عبد الله عن قول الله عز وجل: \"فَإِذَا قُضِيَتِ الصَّلَاةُ فَانتَشِرُوا فِي الْأَرْضِ وَابْتَغُوا مِن فَضْلِ اللَّهِ\" قال: الصلاة يوم الجمعة والانتشار يوم السبت، وقال أبوعبد الله عليه السلام:اف للرجل المسلم أن لا يفرغ نفسه في الاسبوع يوم الجمعة لامر دينه فيسأل عنه",
          "English Text": "7-96 Muhammad ibn al-Hassan ibn Ahmad ibn al-Walid - may God be pleased with him - narrated that Muhammad ibn al-Hassan al-Saffar quoted on the authority of Yaqoob ibn Yazid, on the authority of Muhammad ibn Abi Umayr, on the authority of Abi Ayoob Ibrahim, “Uthman al-Khazzaz asked Aba Abdullah as-Sadiq (MGB) about the words of God the Honorable the Exalted, ‘And when the prayer is finished, then may ye disperse through the land, and seek of the Bounty of God.’ The Imam (MGB) said, ‘What is meant is to pray on Fridays and go after work on Saturdays.’ He (MGB) added, ‘Shame on a Muslim who doesn’t allocate Fridays for his religious affairs.’”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (12/372)"
          }
        }
      },
      "Chapter #49": {
        "Hadith #1": {
          "Title": "Al-Khisal: On What Has Been Said About Saturdays",
          "Link": "https://thaqalayn.net/hadith/10/8/49/1",
          "Arabic Text": "7-97 حدثنا أبي رضي الله عنه قال: حدثنا سعد بن عبد الله، عن القاسم بن محمد الاصبهاني، عن سليمان بن داود المنقري، عن حفص بن غياث النخعي، عن أبي عبد الله عليه السلام قال: من كان مسافرا فليسافر يوم السبت، فلوأن حجرا زال عن جبل في يوم السبت لرده الله إلى مكانه",
          "English Text": "7-97 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Sa’ed ibn Abdullah quoted Al-Qasim ibn Muhammad al-Isfahani, on the authority of Suleiman ibn Davood al-Munqeri, on the authority of Hafs ibn Qiyath al-Nakha’ee, on the authority of Aba Abdullah as-Sadiq (MGB), “Whoever wants to go on a journey should start on Saturday since God would return any rocks that may get loose and are about to separate from the hills to their original location on Saturdays.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "معتبرة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (12/358)"
          }
        },
        "Hadith #5": {
          "Title": "Al-Khisal: On What Has Been Said About Saturdays",
          "Link": "https://thaqalayn.net/hadith/10/8/49/5",
          "Arabic Text": "7-101 حدثنا أبي رضي الله عنه قال: حدثنا سعد بن عبد الله، عن يعقوب بن يزيد، عن محمد بن أبي عمير، عن غير واحد، عن أبي عبد الله عليه السلام قال: السبت لنا، والاحد لشيعتنا، والاثنين لاعدائنا، والثلثاء لبني امية، والاربعاء يوم شرب الدواء، والخميس تقضى فيه الحوائج، والجمعة للتنظف والتطيب، وهو عيد المسلمين وهو أفضل من الفطر والاضحى، ويوم الغدير أفضل الاعياد، وهو ثامن عشر من ذي الحجة وكان يوم الجمعة، ويخرج قائمنا أهل البيت يوم الجمعة، ويقوم القيامة يوم الجمعة، وما من عمل يوم الجمعة أفضل من الصلاة على محمد وآله",
          "English Text": "7-101 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Sa’ed ibn Abdullah quoted Yaqoob ibn Yazid, on the authority of Muhammad ibn Abi Umayr, on the authority of some other people that Aba Abdullah as-Sadiq (MGB) said, “Saturdays are for us. Sundays are for our followers. Mondays are for our enemies. Tuesdays are for the Umayyads. Wednesdays are the days for taking medicine. Thursdays are for taking care of your needs. Fridays are for leaning up and putting on perfume. Fridays are the holidays for the Muslims. They are even better than the Eid ul-Fitr and Eid ul-Azha. The Day of Eid ul-Qadir is the noblest of the holidays. It is on the eighteenth day of the month of Dhul-Hijja. Our Riser (MGB) - the Riser (MGB) from the Members of the Holy Household - will rise on a Friday. The Resurrection Day will be on a Friday. No deeds are better on Fridays than sending God’s Blessings upon Muhammad (MGB) and his Household.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "صحيحة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (2/173)"
          }
        }
      }
    },
    "Book #10": {
      "Chapter #6": {
        "Hadith #1": {
          "Title": "Al-Khisal: Nine Things Corrupt Nine",
          "Link": "https://thaqalayn.net/hadith/10/10/6/1",
          "Arabic Text": "9-7 حدثنا أبي رضي الله عنه قال: حدثنا سعد بن عبد الله، وعبد الله بن جعفر الحميري جميعا، عن هارون بن مسلم، عن مسعدة بن صدقة الربعي، عن جعفر بن محمد عن أبيه، عن آبائه، عن علي عليهم السلام قال: قال رسول الله صلى الله عليه وآله: آفة الحديث الكذب وآفة العلم النسيان، وآفة الحلم السفه، وآفة العبادة الفترة، وآفة الظرف الصلف، وآفة الشجاعة البغي، وآفة السخاء المن، وآفة الجمال الخيلاء، وآفة الحسب الفخر",
          "English Text": "9-7 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Sa’ed ibn Abdullah and Abdullah ibn Ja’far al-Homayry quoted Harun ibn Muslim, on the authority of Mus’adat ibn Sadaqe al-Rub’ee, on the authority of Ja’far ibn Muhammad as-Sadiq (MGB), on the authority of his father (MGB), on the authority of his forefathers (MGB), on the authority of Ali (MGB) that God’s Prophet (MGB) said, “What corrupts speech is lying. What corrupts knowledge is forgetting. What corrupts patience is foolishness. What corrupts worshipping is laziness. What corrupts circumstances is boasting. What corrupts bravery is transgression. What corrupts generosity is mentioning it. What corrupts beauty is haughtiness. What corrupts lineage is pride.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "معتبرة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (2/387)"
          }
        }
      }
    },
    "Book #11": {
      "Chapter #2": {
        "Hadith #1": {
          "Title": "Al-Khisal: Ten Cases of Going to House Doors",
          "Link": "https://thaqalayn.net/hadith/10/11/2/1",
          "Arabic Text": "10-3 حدثنا أحمد بن الحسن القطان قال: حدثنا أحمد بن محمد بن سعيد الهمداني قال: حدثنا علي بن الحسن بن فضال، عن أبيه، عن مروان بن مسلم، عن ثابت بن أبي صفية، عن سعد الخفاف، عن الاصبغ بن نباتة قال: قال أمير المؤمنين عليه السلام كانت الحكماء فيما مضى من الدهر تقول: ينبغي أن يكون الاختلاف إلى الابواب لعشرة أوجه أولها بيت الله عز وجل لقضاء نسكه والقيام بحقه وأداء فرضه،والثاني أبواب الملوك الذين طاعتهم متصلة بطاعة الله عز وجل وحقهم واجب ونفعهم عظيم وضرهم شديد،والثالث أبواب العلماء الذين يستفاد منهم علم الدين والدنيا،والرابع أبواب أهل الجود والبذل الذين ينفقون أموالهم التماس الحمد ورجاء الآخرة، والخامس أبواب السفهاء الذين يحتاج إليهم في الحوادث ويفزع إليهم في الحوائج. والسادس أبواب من يتقرب إليه من الاشراف لالتماس الهبة والمروءة والحاجة، والسابع أبواب من يرتجى عندهم النفع في الرأي والمشورة وتقوية الحزم وأخذ الاهبة لما يحتاج إليه والثامن أبواب الاخوان لما يجب من مواصلتهم ويلزم من حقوقهم، والتاسع أبواب الاعداء التي تسكن بالمدارأة وغوائلهم، ويدفع بالحيل والرفق واللطف والزيارة عداوتهم، والعاشر أبواب من ينتفع بغشيانهم ويستفاد منهم حسن الادب ويؤنس بمحادثتهم",
          "English Text": "10-3 Ahmad ibn al-Hassan al-Qat’tan narrated that Ahmad ibn Muhammad ibn Sa’id al-Hamedany quoted Ali ibn al-Hassan ibn Faz’zal, on the authority of his father, on the authority of Marvan ibn Muslim, on the authority of Sabit ibn Abi Safiyeh, on the authority of Sa’ed al-Khifaf, on the authority of Al-Asbaq ibn Nobatat that the Commander of the Faithful Imam Ali (MGB) said, “The wise men in the past said that going to and coming from doors of houses should be for one of ten reasons.1- To go to the door of the House of the Honorable the Exalted God to perform the Hajj pilgrimage; fulfill His right and do what He has made obligatory upon you.2- To go to the doors of the just kings obeying whom is an extension of obeying the Honorable the Exalted God. Their right is an obligatory right; their benefit may be great; and their loss may also be great.3- To go to the doors of the houses of wise men who can be used to gain religious knowledge.4- To go to the doors of the houses of the generous people who grant their possessions to gain a good reputation and hope to get rewarded in the Hereafter.5- To go to the doors of the houses of the unwise people whom you may need at times of disaster or seek refuge to when you need it.6- To go to the doors of the houses of the noble men to ask them for gifts, chivalry or the fulfillment of your needs.7- To go to the doors of the houses of those whose opinion is asked and are consulted with to reinforce alertness and request grants to fulfill needs.8- To go to the doors of the houses of religious brothers to associate with and visit the relations of kin to fulfill their rights.9- To go to the doors of the houses of the enemies whose wickedness will be fended off by treating them with patience, wisdom and kindness.10- To go to the doors of the houses of those from whose association and good manners we can benefit.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "من حيث السند معتبرة",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (2/33)"
          }
        }
      },
      "Chapter #35": {
        "Hadith #1": {
          "Title": "Al-Khisal: Islam is founded upon ten pillars",
          "Link": "https://thaqalayn.net/hadith/10/11/35/1",
          "Arabic Text": "10-48 حدثنا أبي رضي الله عنه قال: حدثنا محمد بن يحيى العطار، عن محمد بن أحمد، عن إبراهيم بن إسحاق، عن محمد بن خالد البرقي، عن محمد بن أبي عمير، عن ابن بكير، عن زرارة قال: قال أبوجعفر عليه السلام: قال رسول الله صلى الله عليه وآله: بني الاسلام على عشرة أسهم: على شهادة أن لا إله إلا الله وهي الملة، والصلاة وهي الفريضة، والصوم وهو الجنة، والزكاة وهي الطهر، والحج وهي الشريعة، والجهاد وهو الغزو، والامر بالمعروف وهوالوفاء، والنهي، عن المنكر وهو الحجة، والجماعة وهي الالفة، والعصمة وهي الطاعة",
          "English Text": "10-48 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Muhammad ibn Yahya al-Attar quoted Muhammad ibn Ahmad, on the authority of Ibrahim ibn Ishaq, on the authority of Muhammad ibn Khalid al-Barqy, on the authority of Muhammad ibn Abi Umayr, on the authority of Ibn Bakir, on the authority of Zurarah, on the authority of Abu Ja’far al-Baqir (MGB) that God’s Prophet (MGB) said, “Islam is founded upon ten pillars as follows: bearing witness that ‘There is no god but God’ - that is the basis of a Muslim’s nationality; prayer which is an obligatory deed; fasting which is a shield against the fire; payment of the alms-tax which purifies one’s possessions; going on the Hajj pilgrimage which is a decree; participating in holy war which is an honor; enjoining to do good deeds which is persistence in belief; admonishing against the bad deeds which is giving an ultimatum; attending congregational prayers which results in mutual sympathy; and avoiding sins which is the basis of obedience.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "معتبرة الإسناد",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (5/333)"
          }
        }
      }
    },
    "Book #25": {
      "Chapter #11": {
        "Hadith #1": {
          "Title": "Al-Khisal: God granted the intellect seventy-five troops and granted ignorance seventy-five troops",
          "Link": "https://thaqalayn.net/hadith/10/25/11/1",
          "Arabic Text": "24-17 حدثنا أبي رضي الله عنه قال: حدثنا سعد بن عبد الله، وعبد الله بن جعفر الحميري قالا: حدثنا أحمد بن محمد بن خالد البرقي، عن علي بن حديد، عن سماعة ابن مهران قال: كنت عند أبي عبد الله عليه السلام وعنده جماعة من مواليه فجرى ذكر العقل والجهل فقال أبوعبد الله عليه السلام: اعرفوا العقل وجنده والجهل وجنده تهتدوا، قال سماعة: فقلت: جعلت فداك لا نعرف إلا ما عرفتنا، فقال أبوعبد الله عليه السلام: إن الله جل ثناؤه خلق العقل وهو أول خلق خلقه من الروحانيين عن يمين العرش من نوره، فقال له: أقبل فأقبل، ثم قال له: أدبر فأدبر، فقال الله تبارك وتعالى: خلقتك خلقا عظيما وكرمتك على جميع خلقي، قال: ثم خلق الجهل من البحر الاجاج ظلمانيا، فقال له: أدبر فأدبر، ثم قال له: أقبل فلم يقبل، فقال له: استكبرت فلعنه. ثم جعل للعقل خمسة وسبعين جندا، فلما رأى الجهل ما أكرم الله به العقل وما أعطاه أضمر له العداوة، فقال الجهل: يا رب هذا خلق مثلي خلقته وكرمته وقويته وأنا ضده ولا قوة لي به فأعطني من الجند مثل ما أعطيته، فقال: نعم، فان عصيت بعد ذلك أخرجتك وجندك من رحمتي قال: قد رضيت فأعطاه خمسة وسبعين جندا فكان مما أعطى العقل من الخمسة والسبعين الجند: الخير وهو وزير العقل وجعل ضده الشر، وهو وزير الجهل، والايمان وضده الكفر، والتصديق وضده الجحود، والرجاء وضده القنوط، والعدل وضده الجور، والرضا وضده السخط، والشكر وضده الكفر، والطمع وضده اليأس، والتوكل وضده الحرص، والرأفة وضدها الغرة، والرحمة وضدها الغضب والعلم وضده الجهل، والفهم وضده الحمق، والعفة وضدها التهتك، والزهد وضده الرغبة، والرفق وضده الخرق، والرهبة وضدها الجرأة، والتواضع وضده التكبر، والتؤدة وضدها التسرع، والحلم وضده السفه، والصمت وضده الهذر والاستسلام وضده الاستكبار، والتسليم وضده التجبر، والعفو، وضده الحقد، والرقة وضدها القسوة، واليقين وضدها الشك، والصبر وضده الجزع، والصفح وضده الانتقام، والغنى وضده الفقر، والتفكر وضده السهو، والحفظ وضده النسيان، والتعطف وضده القطيعة، والقنوع وضده الحرض، والمواساة وضدها المنع، والمودة وضدها العداوة، والوفاء وضده الغدر، والطاعة وضدها المعصية، والخضوع وضده التطاول، والسلامة وضدها البلاء، والحب وضده البغض، والصدق وضده الكذب، والحق وضده الباطل، والامانة وضدها الخيانة، والاخلاص وضده الشوب، والشهامة وضدها البلادة، والفهم وضده الغباوة والمعرفة وضدها الانكار، والمدارأة وضدها الكاشفة، وسـلامة الغيب وضـدها الممـاكرة، والكتمـان وضـده الافشاء، والصـلاة وضدها الاضاعة والصوم وضده الافطار والجهاد وضده النكول، والحج وضده نبذ الميثاق، وصدق الحديث وضده النميمة، وبر الوالدين وضده العقوق والحقيقة وضدها الرياء، والمعروف وضده المنكر، والستر وضده التبرج، والتقية وضدها الاذاعة، والانصاف وضده الحمية، والتهيئة وضدها البغي، والنظافة وضدها القذر، والحياء وضده الخلع والقصد وضده العدوان، والراحة وضدها التعب، والسهولة وضدها الصعوبة، والبركة وضدها المحق، والعافية وضدها البلاء، والقوام وضده المكاثرة والحكمة وضدها الهوى، والوقار وضده الخفة، والسعادة وضدها الشقاء، والتوبة وضدها الاصرار، والاستغفار وضده الاعتزاز، والمحافظة وضدها التهاون، والدعاء وضده الاستنكاف، والنشاط وضده الكسل، والفرح وضده الحزن، والالفة وضدها الفرقة والسخاء وضده البخل. فلا تجتمع هذه الخصال كلا من أجناد العقل إلا في نبي أو وصي نبي أو مؤمن امتحن الله قلبه للايمان، وأما سائر ذلك من موالينا فإن أحدهم لا يخلو من أن يكون فيه بعض هذه الجنود حتى يستكمل وينقى من جنود الجهل فعند ذلك يكون في الدرجة العليا مع الانبياء والاوصياء عليهم السلام، وإنما يدرك الفوز بمعرفة العقل وجنوده ومجانبة الجهل وجنوده، وفقنا الله وإياكم لطاعته ومرضاته",
          "English Text": "24-17 (The compiler of the book narrated) that his father - may God be pleased with him - narrated that Sa’ed ibn Abdullah and Abdullah ibn Ja’far al-Homayry quoted Ahmad ibn Muhammad ibn Khalid al-Barqy, on the authority of Ali ibn Hadid, on the authority of Soma’at ibn Mihran narrated that once he and some friends of Imam as-Sadiq (MGB) were with Imam as-Sadiq (MGB) when they started to talk about intelligence and ignorance. Imam as-Sadiq (MGB) said, “Get to know intelligence and its troops, and ignorance and its troops to be guided.” Soma’at said, “O! May I be your devoted servant. We know nothing except for what you teach us.” Imam as-Sadiq (MGB) said, “God, Exalted is His Praise created the intellect. It was one of His first creatures which He created using His own Light from the right side of the Throne. Then He ordered it to go back, and it did. Then He ordered it to come forward, and it did. God said, “I created you as a great creature, and honored you above all My creatures.” Then God created ignorance and told it to go back and it did. Then God ordered it to come forward, but it did not accept. God said, “You rebelled.” Then God cursed it. God then established seventy-five troops for the intellect. When ignorance saw God’s grant to the intellect, it became its enemy and said, “O’ God! You created it and honored it and strengthened it. It is a creature like me. I am opposed to it and have no power over it. So please grant me of the troops you grant it.” God said, “Ok I will, but if you disobey I will throw you and your troops out of the domain of My Mercy.” Ignorance said it was pleased, and it was also granted seventy-five troops. The seventy-five troops are as follows: Goodness is the minister for the intellect, and evil is the minister for ignorance; faith for the intellect, and infidelity for ignorance; acceptance for the intellect, and rejection for ignorance; hope for the intellect, and despair for ignorance; justice for the intellect, and oppression for ignorance; contentment for the intellect, and discontent for ignorance; gratitude for the intellect, and ingratitude for ignorance; lack of hope (in God’s Mercy) for the intellect, and greed (in God’s Mercy) for ignorance; reliance on God for intellect, and greed for ignorance; kindness for the intellect, and ruthlessness for ignorance; mercy for the intellect, and anger for ignorance; knowledge for the intellect, and ignorance for ignorance; understanding for the intellect, and stupidity for ignorance; chastity for the intellect, and vulgarity for ignorance; abstinence for the intellect, and materialism for ignorance; kindness for the intellect, and violence for ignorance; solemnity for the intellect, and insolence for ignorance; humbleness for the intellect, and haughtiness for ignorance; calm for the intellect, and rush for ignorance; patience for the intellect, and being feeble-minded for ignorance; silence for the intellect, and being talkative for ignorance; compliance for the intellect, and conceit for ignorance; submission for the intellect, and being oppressive for ignorance; forgiveness for the intellect, and animosity for ignorance; amiability for the intellect, and ruthlessness for ignorance; certitude for the intellect, and doubt for ignorance; perseverance for the intellect, and anxiety for ignorance; pardon for the intellect, and revenge for ignorance; self-sufficiency for the intellect, and poverty for ignorance; pondering for the intellect, and neglect for ignorance; memorizing for the intellect, and forgetting for ignorance; loving for the intellect, and enmity for ignorance; obeying for the intellect, and rebelling for ignorance; contentment for the intellect, and greed for ignorance; justice for the intellect, and injustice for ignorance; friendship for the intellect, and enmity for ignorance; loyalty for the intellect, and treachery for ignorance; humbleness for the intellect, and arrogance for ignorance; right for the intellect, and wrong for ignorance; health for the intellect, and affliction for ignorance; love for the intellect, and hate for ignorance; honesty for the intellect, and telling lies for ignorance; trustworthiness for the intellect, and treason for ignorance; sincerity for the intellect, and corruption for ignorance; bravery for the intellect, and stupidity for ignorance; understanding for the intellect, and ignorance for ignorance; recognition for the intellect, and denial for ignorance; putting up with other people’s minor mistakes for the intellect, and divulging other people’s minor mistakes for ignorance; keeping other’s secrets for the intellect, and divulging other’s secrets for ignorance; hiding for the intellect, and divulging for ignorance; praying for the intellect, and neglecting (prayers) for ignorance; fasting for the intellect, and breaking fast for ignorance; engaging in Jihad (Holy War) for the intellect, and refusal to testify for ignorance; pilgrimage for the intellect, and breaking covenant for ignorance; keeping secrets for the intellect, and slandering for ignorance; being kind to parents for the intellect, and being cursed by parents for ignorance; truth for the intellect, and hypocrisy for ignorance; good for the intellect, and evil for ignorance; covering oneself for the intellect, and playing up a woman’s charms for ignorance; covering up for the intellect, and making up oneself for ignorance; concealment for the intellect and divulging for ignorance; being fair for the intellect, and siding with the wrong for ignorance; making up for the husband for the intellect, and fornication for ignorance; cleanliness for the intellect, and filthiness for ignorance; shyness for the intellect, and taking off clothing for ignorance; assuming a mediators position for the intellect, and aggression for ignorance; comfort for the intellect, and hard work for ignorance; easiness for the intellect, and hardship for ignorance; abundance of blessings for the intellect, and scarcity for ignorance; health for the intellect, and affliction for ignorance; reasonable wealth for the intellect, and hoarding for ignorance; wisdom for the intellect, and selfish desires for ignorance; dignity for the intellect, and humility for ignorance; prosperity for the intellect, and ruin for ignorance; repentance for the intellect, and insistence on sin for ignorance; asking for forgiveness for the intellect, and being too proud for ignorance; protection for the intellect, and neglect for ignorance; performing supplications for the intellect, and abandoning supplications for ignorance; joy for the intellect, and boredom for ignorance; happiness for the intellect, and sorrow for ignorance; intimacy for the intellect, and anger for ignorance; generosity for the intellect, and stinginess for ignorance. All the characteristics which are the troops of the intellect will only be present in the Prophet (MGB) or the Imams (MGB) or a believer who has tested his heart with faith. However, other friends of ours have some of these and can slowly attain the rest and avoid the troops of ignorance. Then they will reach the high ranks of the Prophets and the Imams. This prosperity is only obtained by the recognition of the intellect and its troops, and by avoiding ignorance and its troops. May God assist both you and us in obeying and pleasing Him.”",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": "موثقة سندا",
            "Scholar": "Shaykh Hadi al-Najafi",
            "Book": "Mawsu'at Ahadith Ahlulbayt (3/188)"
          }
        }
      }
    }
  }
}