{
  "1": {
    "2": {
      "1": {
        "Al-Kafi - Volume 1: Chapter on the necessity to seek knowledge and the recommendations to learn": [
          {
            "number": "Hadith #1",
            "url": "https://thaqalayn.net/hadith/1/2/1/1",
            "arabicText": "1ـ أَخْبَرَنَا مُحَمَّدُ بْنُ يَعْقُوبَ عَنْ عَلِيِّ بْنِ إِبْرَاهِيمَ بْنِ هَاشِمٍ عَنْ أَبِيهِ عَنِ الْحَسَنِ بْنِ أَبِي الْحُسَيْنِ الْفَارِسِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ زَيْدٍ عَنْ أَبِيهِ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) طَلَبُ الْعِلْمِ فَرِيضَةٌ عَلَى كُلِّ مُسْلِمٍ أَلا إِنَّ الله يُحِبُّ بُغَاةَ الْعِلْمِ.",
            "englishTranslation": "1. Muhammad ibn Ya‘qub has narrated from Ali ibn Ibrahim ibn Hashim from his father from al-Hassan ibn abu al-Hassan al-Farisi from ‘Abd al-Rahman ibn Ziyad from his father from abu ‘Abdallah  who has said the following. “The Messenger of Allah said, ‘Seeking knowledge is obligatory for every Muslim. Let it be known that Allah loves those who seek knowledge.”",
            "gradings": [
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (98/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          },
          {
            "number": "Hadith #2",
            "url": "https://thaqalayn.net/hadith/1/2/1/2",
            "arabicText": "2ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ عَبْدِ الله عَنْ عِيسَى بْنِ عَبْدِ الله الْعُمَرِيِّ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ طَلَبُ الْعِلْمِ فَرِيضَةٌ.",
            "englishTranslation": "2. Muhammad ibn Yahya has narrated from Muhammad ibn al-Hassan from Muhammad ibn ‘Abdallah from ‘Isa ibn ‘Abdallah al-‘Amri from abu ‘Abdallah  who has said the following. “Seeking knowledge is obligatory.”",
            "gradings": [
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (99/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "صحيح",
                "book": "Sahih al-Kafi (1/2)",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          },
          {
            "number": "Hadith #4",
            "url": "https://thaqalayn.net/hadith/1/2/1/4",
            "arabicText": "4ـ عَلِيُّ بْنُ مُحَمَّدٍ وَغَيْرُهُ عَنْ سَهْلِ بْنِ زِيَادٍ وَمُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي إِسْحَاقَ السَّبِيعِيِّ عَمَّنْ حَدَّثَهُ قَالَ سَمِعْتُ أَمِيرَ الْمُؤْمِنِينَ يَقُولُ أَيُّهَا النَّاسُ اعْلَمُوا أَنَّ كَمَالَ الدِّينِ طَلَبُ الْعِلْمِ وَالْعَمَلُ بِهِ أَلا وَإِنَّ طَلَبَ الْعِلْمِ أَوْجَبُ عَلَيْكُمْ مِنْ طَلَبِ الْمَالِ إِنَّ الْمَالَ مَقْسُومٌ مَضْمُونٌ لَكُمْ قَدْ قَسَمَهُ عَادِلٌ بَيْنَكُمْ وَضَمِنَهُ وَسَيَفِي لَكُمْ وَالْعِلْمُ مَخْزُونٌ عِنْدَ أَهْلِهِ وَقَدْ أُمِرْتُمْ بِطَلَبِهِ مِنْ أَهْلِهِ فَاطْلُبُوهُ.",
            "englishTranslation": "4. Ali ibn Muhammad and others have narrated from Sahl ibn Ziyad and Muhammad ibn Yahya from Ahmad ibn Muhammad ibn ‘Isa all from ibn Mahbub from Hisham ibn Salim from Abu Hamza from Abu Ishaq al-Subay‘i from one who narrated to him who has said the following: “I heard Amir al-Mu’minin Ali  say, ‘O people, you must know that religion becomes complete through seeking knowledge and acting accordingly. You must know that seeking knowledge is much more urgent for you than seeking wealth. Indeed, wealth is divided and guaranteed for you, a just person has already divided the wealth among you, guaranteed it, and will execute it for you. Knowledge, however, is stored with those who possess it. You are commanded to seek knowledge from its sources (those who possess it). You must seek knowledge.’”",
            "gradings": [
              {
                "grade": "مرسل",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/99)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          },
          {
            "number": "Hadith #5",
            "url": "https://thaqalayn.net/hadith/1/2/1/5",
            "arabicText": "5ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنْ أَبِي عَبْدِ الله رَجُلٍ مِنْ أَصْحَابِنَا رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) طَلَبُ الْعِلْمِ فَرِيضَةٌ وَفِي حَدِيثٍ آخَرَ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) طَلَبُ الْعِلْمِ فَرِيضَةٌ عَلَى كُلِّ مُسْلِمٍ أَلا وَإِنَّ الله يُحِبُّ بُغَاةَ الْعِلْمِ.",
            "englishTranslation": "5. A number of our people has narrated has narrated from Ahmad ibn Muhammad al-Barqi from Ya’qub ibn Yazid from abu ‘Abdallah, a man of our people narrated in a marfu‘ manner from abu ‘Abdallah  from the Holy Prophet (s.a) who has said the following. “Seeking knowledge is obligatory.” In another Hadith Imam abu ‘Abdallah has narrated from the holy Prophet who said, “Seeking knowledge is obligatory for every Muslim. Let it be known that Allah loves those who seek knowledge.”",
            "gradings": [
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              },
              {
                "grade": "مرسل",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (100/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "2": {
        "Al-Kafi - Volume 1: Chapter on the quality of knowledge its virtue and the virtue of the scholars": [
          {
            "number": "Hadith #4",
            "url": "https://thaqalayn.net/hadith/1/2/2/4",
            "arabicText": "4ـ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ رِبْعِيِّ بْنِ عَبْدِ الله عَنْ رَجُلٍ عَنْ ابي جعفر (عَلَيْهِ السَّلام) قَالَ قَالَ الْكَمَالُ كُلُّ الْكَمَالِ التَّفَقُّهُ فِي الدِّينِ وَالصَّبْرُ عَلَى النَّائِبَةِ وَتَقْدِيرُ الْمَعِيشَةِ.",
            "englishTranslation": "4. Muhammad ibn ’Isma‘il has narrated from Fadl ibn Shadhan from Hammad ibn ‘Isa from Rab‘i ibn ‘Abdallah from a man from abu Ja‘far  who has said the following. “The entirety of excellence and perfection is  in good understanding of religion, (b) exercise of patience in affliction and (c) setting up of means of living.”",
            "gradings": [
              {
                "grade": "مرسل",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (106/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          },
          {
            "number": "Hadith #9",
            "url": "https://thaqalayn.net/hadith/1/2/2/9",
            "arabicText": "9ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ إِسْحَاقَ عَنْ سَعْدَانَ بْنِ مُسْلِمٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ قُلْتُ لابِي عَبْدِ الله (عَلَيْهِ السَّلام) رَجُلٌ رَاوِيَةٌ لِحَدِيثِكُمْ يَبُثُّ ذَلِكَ فِي النَّاسِ وَيُشَدِّدُهُ فِي قُلُوبِهِمْ وَقُلُوبِ شِيعَتِكُمْ وَلَعَلَّ عَابِداً مِنْ شِيعَتِكُمْ لَيْسَتْ لَهُ هَذِهِ الرِّوَايَةُ أَيُّهُمَا أَفْضَلُ قَالَ الرَّاوِيَةُ لِحَدِيثِنَا يَشُدُّ بِهِ قُلُوبَ شِيعَتِنَا أَفْضَلُ مِنْ أَلْفِ عَابِدٍ.",
            "englishTranslation": "9. Al-Hassan ibn Muhammad has narrated from Ahmad ibn Ishaq from Sa‘dan ibn Muslim from Mu‘awiya ibn ‘Ammar who has said the following. “I asked (Imam) abu ‘Abdallah , “There is a man who recounts your Hadith and spreads them among people and ties them to their hearts and the hearts of your followers. Also perhaps there is a worshipper among your followers who does not narrate your Hadith. Which of these two people is better?” The Imam replied, “The one who narrates our Hadith and ties them up to the hearts of our followers is better than seventy thousand worshippers.”",
            "gradings": [
              {
                "grade": "مجهول على المشهور",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/108)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "صحيح",
                "book": "Sahih al-Kafi (3/ 1)",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          }
        ]
      },
      "3": {
        "Al-Kafi - Volume 1: Chapter on Kinds of People": [
          {
            "number": "Hadith #1",
            "url": "https://thaqalayn.net/hadith/1/2/3/1",
            "arabicText": "1ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ وَمُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي أُسَامَةَ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي إِسْحَاقَ السَّبِيعِيِّ عَمَّنْ حَدَّثَهُ مِمَّنْ يُوثَقُ بِهِ قَالَ سَمِعْتُ أَمِيرَ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) يَقُولُ إِنَّ النَّاسَ آلُوا بَعْدَ رَسُولِ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) إِلَى ثَلاثَةٍ آلُوا إِلَى عَالِمٍ عَلَى هُدًى مِنَ الله قَدْ أَغْنَاهُ الله بِمَا عَلِمَ عَنْ عِلْمِ غَيْرِهِ وَجَاهِلٍ مُدَّعٍ لِلْعِلْمِ لا عِلْمَ لَهُ مُعْجَبٍ بِمَا عِنْدَهُ قَدْ فَتَنَتْهُ الدُّنْيَا وَفَتَنَ غَيْرَهُ وَمُتَعَلِّمٍ مِنْ عَالِمٍ عَلَى سَبِيلِ هُدًى مِنَ الله وَنَجَاةٍ ثُمَّ هَلَكَ مَنِ ادَّعَى وَخَابَ مَنِ افْتَرَى.",
            "englishTranslation": "1. Ali ibn Muhammad from Sahl ibn Ziyad and Muhammad ibn Yahya from Ahmad ibn Muhammad ibn ‘Isa all from ibn Mahbub from abu ’Usama from Hisham ibn Salim from abu Hamza from abu Ishaq al-Sabay‘i from one who narrated it from a reliable source from Imam Ali  who has said the following. “After the holy Prophet people become of three kinds. One group went to a divinely well guided scholar. Allah had given him such a high degree of knowledge that made him independent of the knowledge of the others. The second group was the ignorant group, who claimed to have knowledge but in fact they had no knowledge. This was an egotist group. The worldly attractions had made them to lose sight of the truth and to mislead other people. The third group consisted of those people who learned from a divinely guided scholar who taught them for the sake of Allah and for their salvation. It then was obvious that those who claimed (to be scholars while, in fact, they were not scholars) and those who forged certain matters falsely were destroyed.”",
            "gradings": [
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/109)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          },
          {
            "number": "Hadith #3",
            "url": "https://thaqalayn.net/hadith/1/2/3/3",
            "arabicText": "3ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ عَبْدِ الله بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْعَلاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي حَمْزَةَ الثُّمَالِيِّ قَالَ قَالَ لِي أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) اغْدُ عَالِماً أَوْ مُتَعَلِّماً أَوْ أَحِبَّ أَهْلَ الْعِلْمِ وَلا تَكُنْ رَابِعاً فَتَهْلِكَ بِبُغْضِهِمْ.",
            "englishTranslation": "3. Muhammad ibn Yahya has narrated from ‘Abdallah ibn Muhammad from Ali ibn al-Hakam from al-‘Ala’ ibn Razin from Muhammad ibn Muslim from abu Hamza al-Thumali who has said the following. “Abu ‘Abdallah  said this. ‘It is narrated from Imam abu ‘Abdallah  who has said, “Be a scholar or a learning person or love the scholars. Do not become of the fourth group lest you will be destroyed by their hatred.’”",
            "gradings": [
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (111/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          }
        ]
      },
      "5": {
        "Al-Kafi - Volume 1: Chapter on the Qualities of the Scholars": [
          {
            "number": "Hadith #7",
            "url": "https://thaqalayn.net/hadith/1/2/5/7",
            "arabicText": "7ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ مَعْبَدٍ عَمَّنْ ذَكَرَهُ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ كَانَ أَمِيرُ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) يَقُولُ يَا طَالِبَ الْعِلْمِ إِنَّ لِلْعَالِمِ ثَلاثَ عَلامَاتٍ الْعِلْمَ وَالْحِلْمَ وَالصَّمْتَ وَلِلْمُتَكَلِّفِ ثَلاثَ عَلامَاتٍ يُنَازِعُ مَنْ فَوْقَهُ بِالْمَعْصِيَةِ وَيَظْلِمُ مَنْ دُونَهُ بِالْغَلَبَةِ وَيُظَاهِرُ الظَّلَمَةَ.",
            "englishTranslation": "7. Ali ibn Ibrahim has narrated from his father from Ali ibn Ma‘bad from the person whom he mentioned from Mu‘awiya ibn Wahab from abu ‘Abdallah  who has said the following. “Imam Ali , would often say, ‘O seekers of knowledge, (note that) a scholar has three signs: Knowledge, forbearance and quietness. An orator has three signs: He quarrels those higher then him through disobedience. He does injustice to those lower than him in position through domination and he becomes a supporter of the unjust.’”",
            "gradings": [
              {
                "grade": "مرسل",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (122/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          }
        ]
      },
      "6": {
        "Al-Kafi - Volume 1: Chapter on the Rights of the scholars": [
          {
            "number": "Hadith #1",
            "url": "https://thaqalayn.net/hadith/1/2/6/1",
            "arabicText": "1ـ عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَبْدِ الله عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنْ سُلَيْمَانَ بْنِ جَعْفَرٍ الْجَعْفَرِيِّ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ كَانَ أَمِيرُ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) يَقُولُ إِنَّ مِنْ حَقِّ الْعَالِمِ أَنْ لا تُكْثِرَ عَلَيْهِ السُّؤَالَ وَلا تَأْخُذَ بِثَوْبِهِ وَإِذَا دَخَلْتَ عَلَيْهِ وَعِنْدَهُ قَوْمٌ فَسَلِّمْ عَلَيْهِمْ جَمِيعاً وَخُصَّهُ بِالتَّحِيَّةِ دُونَهُمْ وَاجْلِسْ بَيْنَ يَدَيْهِ وَلا تَجْلِسْ خَلْفَهُ وَلا تَغْمِزْ بِعَيْنِكَ وَلا تُشِرْ بِيَدِكَ وَلا تُكْثِرْ مِنَ الْقَوْلِ قَالَ فُلانٌ وَقَالَ فُلانٌ خِلافاً لِقَوْلِهِ وَلا تَضْجَرْ بِطُولِ صُحْبَتِهِ فَإِنَّمَا مَثَلُ الْعَالِمِ مَثَلُ النَّخْلَةِ تَنْتَظِرُهَا حَتَّى يَسْقُطَ عَلَيْكَ مِنْهَا شَيْ‏ءٌ وَالْعَالِمُ أَعْظَمُ أَجْراً مِنَ الصَّائِمِ الْقَائِمِ الْغَازِي فِي سَبِيلِ الله.",
            "englishTranslation": "1. Ali ibn Muhammad ibn ‘Abdallah has narrated from Ahmad ibn Muhammad from Muhammad ibn Khalid from Sulayman ibn Ja’far al-Ja’fari from the person who he mentioned from abu ‘Abdallah  who has said the following. “Imam Ali  said, ‘One of the rights of a scholar is that one must not ask him a great many questions and must not hold to his garment (excessive questioning). When one would enter in his presence while other people are there one should offer salutation to all of them and special greetings to the scholar only. One must sit before him and not behind him. One must not blink his eyes before him or make hand gestures and must not speak much in his presence such as so and so said so and so opposite to what he says. The length of his meeting must not disappoint one because the case of a scholar is like a fruit bearing tree in which case one needs to wait until three lets fruits to fall onto one. The reward for a scholar is greater than that for one who fasts and prays very often and those who fight for the cause of Allah.’”",
            "gradings": [
              {
                "grade": "مرسل",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/123)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          }
        ]
      },
      "7": {
        "Al-Kafi - Volume 1: Chapter on the Loss of a Scholar": [
          {
            "number": "Hadith #6",
            "url": "https://thaqalayn.net/hadith/1/2/7/6",
            "arabicText": "6ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَمَّنْ ذَكَرَهُ عَنْ جَابِرٍ عَنْ ابي جعفر (عَلَيْهِ السَّلام) قَالَ كَانَ عَلِيُّ بن الحسين (عَلَيْهما السَّلام) يَقُولُ إِنَّهُ يُسَخِّي نَفْسِي فِي سُرْعَةِ الْمَوْتِ وَالْقَتْلِ فِينَا قَوْلُ الله أَ وَلَمْ يَرَوْا أَنَّا نَأْتِي الارْضَ نَنْقُصُها مِنْ أَطْرافِها وَهُوَ ذَهَابُ الْعُلَمَاءِ.",
            "englishTranslation": "6. A number of our people has narrated from Ahmad ibn Muhammad from Muhammad ibn Ali from the person who he mentioned from Jabi from abu Ja’far  who has said the following. “Imam Ali ibn al-Husayn  would say, ‘My soul shows generosity in accepting the quickening of our death or being murdered. It is due to the words of Allah that say, “Have they not considered that We have taken over the land and reduced its borders?” the reference here is to the death of the scholars.”",
            "gradings": [
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              },
              {
                "grade": "مرسل",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/126)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "9": {
        "Al-Kafi - Volume 1: Chapter on Asking the Scholar and Discussing with him": [
          {
            "number": "Hadith #5",
            "url": "https://thaqalayn.net/hadith/1/2/9/5",
            "arabicText": "5ـ عَلِيٌّ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) أُفٍّ لِرَجُلٍ لا يُفَرِّغُ نَفْسَهُ فِي كُلِّ جُمُعَةٍ لامْرِ دِينِهِ فَيَتَعَاهَدُهُ وَيَسْأَلُ عَنْ دِينِهِ وَفِي رِوَايَةٍ أُخْرَى لِكُلِّ مُسْلِمٍ.",
            "englishTranslation": "5. Ali has narrated from Muhammad ibn ‘Isa from Yunus from the person who he mentioned from abu ‘Abdallah  who has said the following. “The holy Prophet has said, ‘Woe is to a man who does not save a time every Friday for learning about his religion and make a habit to ask about his religion.” In another Hadith it says, “woe is to every such Muslim.”",
            "gradings": [
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              },
              {
                "grade": "مرسل",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (130/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #9",
            "url": "https://thaqalayn.net/hadith/1/2/9/9",
            "arabicText": "9ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ عُمَرَ بْنِ أَبَانٍ عَنْ مَنْصُورٍ الصَّيْقَلِ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ (عَلَيْهِ السَّلام) يَقُولُ تَذَاكُرُ الْعِلْمِ دِرَاسَةٌ وَالدِّرَاسَةُ صَلاةٌ حَسَنَةٌ.",
            "englishTranslation": "9. A number of our people has narrated from Ahmad ibn Muhammad ibn Khalid from his father from Faddala ibn Ayyub from ‘Umar ibn Aban from Mansur al-Sayqal who has said the following. “Imam abu Ja‘far  has said, ‘Discussing knowledge is study and study is a good prayer.’”",
            "gradings": [
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (133/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          }
        ]
      },
      "10": {
        "Al-Kafi - Volume 1: Chapter on Giving Knowledge as Charity": [
          {
            "number": "Hadith #4",
            "url": "https://thaqalayn.net/hadith/1/2/10/4",
            "arabicText": "4 - عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ قَامَ عِيسَى ابْنُ مَرْيَمَ (عَلَيْهِ السَّلام) خَطِيباً فِي بَنِي إِسْرَائِيلَ فَقَالَ يَا بَنِي إِسْرَائِيلَ لا تُحَدِّثُوا الْجُهَّالَ بِالْحِكْمَةِ فَتَظْلِمُوهَا وَلا تَمْنَعُوهَا أَهْلَهَا فَتَظْلِمُوهُمْ.",
            "englishTranslation": "4. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa ibn ‘Ubayd from Yunus ibn ’Abd al-Rahman from the person who he mentioned from abu ‘Abdallah  who has said the following. “Jesus, son of Mary  once stood up to speak to the Israelites saying, ‘O Israelites, do not speak the words of wisdom to the ignorant people because you will be doing injustice to them (words of wisdom). Do not keep them (words of wisdom) from those who deserve lest you will do injustice to them (deserving people).’”",
            "gradings": [
              {
                "grade": "مرسل",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (135/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          }
        ]
      },
      "11": {
        "Al-Kafi - Volume 1: Prohibition on Speaking without Knowledge.": [
          {
            "number": "Hadith #1",
            "url": "https://thaqalayn.net/hadith/1/2/11/1",
            "arabicText": "1ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ وَعَبْدِ الله ابْنَيْ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ مُفَضَّلِ بْنِ يَزِيدَ قَالَ قَالَ لِي أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) أَنْهَاكَ عَنْ خَصْلَتَيْنِ فِيهِمَا هَلاكُ الرِّجَالِ أَنْهَاكَ أَنْ تَدِينَ الله بِالْبَاطِلِ وَتُفْتِيَ النَّاسَ بِمَا لا تَعْلَمُ.",
            "englishTranslation": "1. Muhammad ibn Yahya has narrated from Ahmad and ‘Abdallah (both) sons of Muhammad ibn ‘Isa from Ali ibn al-Hakam from Sayf ibn ‘Umayra from Mufaddal ibn Yazid who has said the following. “(Imam) abu ‘Abdallah said, ‘I would like to warn you about two forms of behavior that lead a man to destruction. I prohibit you from dealing with Allah on the basis of falsehood and from giving fatwa to people without knowledge.’”",
            "gradings": [
              {
                "grade": "صحيح",
                "book": "Sahih al-Kafi (1/5)",
                "author": "Shaykh Baqir al-Behbudi"
              },
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (136/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "12": {
        "Al-Kafi - Volume 1: Chapter on Those who Act without Knowledge": [
          {
            "number": "Hadith #3",
            "url": "https://thaqalayn.net/hadith/1/2/12/3",
            "arabicText": "3ـ عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَمَّنْ رَوَاهُ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) مَنْ عَمِلَ عَلَى غَيْرِ عِلْمٍ كَانَ مَا يُفْسِدُ أَكْثَرَ مِمَّا يُصْلِحُ.",
            "englishTranslation": "3. It is narrated from him from Ahmad ibn Muhammad from ibn Faddal from the one he narrated from abu ‘Abdallah  who has said the following. “Imam abu ‘Abdallah  has said that the Holy Prophet said, ‘Those who work without knowledge they destroy more than what they gain.’”",
            "gradings": [
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              },
              {
                "grade": "مرسل",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (141/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "14": {
        "Al-Kafi - Volume 1: Chapter on Those who use their Knowledge to Fill their Stomach and are Boastful for it": [
          {
            "number": "Hadith #6",
            "url": "https://thaqalayn.net/hadith/1/2/14/6",
            "arabicText": "6 ـ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ رِبْعِيِّ بْنِ عَبْدِ الله عَمَّنْ حَدَّثَهُ عَنْ ابي جعفر (عَلَيْهِ السَّلام) قَالَ مَنْ طَلَبَ الْعِلْمَ لِيُبَاهِيَ بِهِ الْعُلَمَاءَ أَوْ يُمَارِيَ بِهِ السُّفَهَاءَ أَوْ يَصْرِفَ بِهِ وُجُوهَ النَّاسِ إِلَيْهِ فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ إِنَّ الرِّئَاسَةَ لا تَصْلُحُ إِلا لاهْلِهَا.",
            "englishTranslation": "6. Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan from Hammed ibn ‘Isa from Ri’ab‘i ibn ‘Abdallah from one he narrated from abu Ja’far  who has said the following. “Whoever would seek knowledge to show off to the scholars or to engage in arguments with fools or to attract people to himself he should know that in so doing he has prepare his seat in the fire. Leadership does not suite anyone besides those qualified for it.”",
            "gradings": [
              {
                "grade": "مرسل",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/150)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          }
        ]
      },
      "16": {
        "Al-Kafi - Volume 1: Chapter on Miscellaneous Issues": [
          {
            "number": "Hadith #8",
            "url": "https://thaqalayn.net/hadith/1/2/16/8",
            "arabicText": "8ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَمَّنْ ذَكَرَهُ عَنْ زَيْدٍ الشَّحَّامِ عَنْ ابي جعفر (عَلَيْهِ السَّلام) فِي قَوْلِ الله عَزَّ وَجَلَّ فَلْيَنْظُرِ الانْسانُ إِلى‏ طَعامِهِ قَالَ قُلْتُ مَا طَعَامُهُ قَالَ عِلْمُهُ الَّذِي يَأْخُذُهُ عَمَّنْ يَأْخُذُهُ.",
            "englishTranslation": "8. A number of our people has narrated from Ahmad ibn Muhammad ibn Khalid from his father from one he mentioned from Zayd al-Shahham from abu Ja’far  who has said the following. “It is his knowledge that he acquires from whoever he acquires.” This he said in answer to the question ‘What is his food’ in the words of Allah, “Let the human being think about (how We produce) his food.” (80:24)?’",
            "gradings": [
              {
                "grade": "مرسل",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (167/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          },
          {
            "number": "Hadith #14",
            "url": "https://thaqalayn.net/hadith/1/2/16/14",
            "arabicText": "14ـ الْحُسَيْنُ بْنُ الْحَسَنِ عَنْ مُحَمَّدِ بْنِ زَكَرِيَّا الْغَلابِيِّ عَنِ ابْنِ عَائِشَةَ الْبَصْرِيِّ رَفَعَهُ أَنَّ أَمِيرَ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) قَالَ فِي بَعْضِ خُطَبِهِ أَيُّهَا النَّاسُ اعْلَمُوا أَنَّهُ لَيْسَ بِعَاقِلٍ مَنِ انْزَعَجَ مِنْ قَوْلِ الزُّورِ فِيهِ وَلا بِحَكِيمٍ مَنْ رَضِيَ بِثَنَاءِ الْجَاهِلِ عَلَيْهِ النَّاسُ أَبْنَاءُ مَا يُحْسِنُونَ وَقَدْرُ كُلِّ امْرِئٍ مَا يُحْسِنُ فَتَكَلَّمُوا فِي الْعِلْمِ تَبَيَّنْ أَقْدَارُكُمْ.",
            "englishTranslation": "14. Al-Husayn ibn al-Hassan has narrated from Muhammad ibn Zakariyya al-Ghalibi from ibn ‘A’isha al-Basri in a marfu‘ manner (rafa’ahu) Amir al-Mu’minin Ali  who has said the following. “In certain parts of his sermons he said, ‘O people, know that there is no man of intelligence who would become disappointed for a lie spoken about him. There is no man of wisdom who would become pleased with the praises of ignorant people of him. People are children of what they do best and the value of a man is what he does best. Speak knowledge it will manifest your value.’”",
            "gradings": [
              {
                "grade": "مرسل",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/171)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          }
        ]
      },
      "17": {
        "Al-Kafi - Volume 1: Chapter on narrating books and Hadith (The virtue of writing and its preservation)": [
          {
            "number": "Hadith #6",
            "url": "https://thaqalayn.net/hadith/1/2/17/6",
            "arabicText": "6ـ عَنْهُ بِإِسْنَادِهِ عَنْ أَحْمَدَ بْنِ عُمَرَ الْحَلالِ قَالَ قُلْتُ لابِي الْحَسَنِ الرِّضَا (عَلَيْهِ السَّلام) الرَّجُلُ مِنْ أَصْحَابِنَا يُعْطِينِي الْكِتَابَ وَلا يَقُولُ ارْوِهِ عَنِّي يَجُوزُ لِي أَنْ أَرْوِيَهُ عَنْهُ قَالَ فَقَالَ إِذَا عَلِمْتَ أَنَّ الْكِتَابَ لَهُ فَارْوِهِ عَنْهُ.",
            "englishTranslation": "6. It is narrated from him from Ahmad ibn ‘Umar al-Hallal who has said the following. “I said to (Imam) abu al-Hassan al-Rida , ‘One of our people gives me a book but he does not say whether I can narrate any thing from it or not. Can I narrate from it?’” He has said that the Imam  said, “Yes, you can narrate if you would that the book is his.”",
            "gradings": [
              {
                "grade": "مرسل",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (179/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          },
          {
            "number": "Hadith #8",
            "url": "https://thaqalayn.net/hadith/1/2/17/8",
            "arabicText": "8ـ عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَبْدِ الله عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ أَبِي أَيُّوبَ الْمَدَنِيِّ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حُسَيْنٍ الاحْمَسِيِّ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ الْقَلْبُ يَتَّكِلُ عَلَى الْكِتَابَةِ.",
            "englishTranslation": "8. Ali ibn Muhammad ibn ‘Abdallah has narrated from Ahmad ibn Muhammad from abu Ayyub al-Madani from Ibn Abi ‘Umayr from Husayn al-Ahmasi from abu ‘Abdallah  who has said the following. “The heart relies on writing.”",
            "gradings": [
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/179)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          },
          {
            "number": "Hadith #15",
            "url": "https://thaqalayn.net/hadith/1/2/17/15",
            "arabicText": "15ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ أَبِي خَالِدٍ شَيْنُولَةَ قَالَ قُلْتُ لابِي جَعْفَرٍ الثَّانِي (عَلَيْهِ السَّلام) جُعِلْتُ فِدَاكَ إِنَّ مَشَايِخَنَا رَوَوْا عَنْ أَبِي جَعْفَرٍ وَأَبِي عَبْدِ الله (عَلَيْهِ السَّلام) وَكَانَتِ التَّقِيَّةُ شَدِيدَةً فَكَتَمُوا كُتُبَهُمْ وَلَمْ تُرْوَ عَنْهُمْ فَلَمَّا مَاتُوا صَارَتِ الْكُتُبُ إِلَيْنَا فَقَالَ حَدِّثُوا بِهَا فَإِنَّهَا حَقٌّ.",
            "englishTranslation": "15. A number of our people have narrated from Ahmad ibn Muhammad from Muhammad ibn al-Hassan ibn abu Khalid Shaynula who has said the following. “I said to abu Ja‘far , ‘May Allah take my soul in your service, our shaikhs have narrated Hadith from Imam abu Ja‘far and from Imam abu ‘Abdallah  and at that time because of fear Taqiyah, concealment was sever. They concealed their books and did narrate from them. When they died their books came to us.’” The Imam said, “You may narrate from them because they contain the truth.”",
            "gradings": [
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/182)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          }
        ]
      },
      "19": {
        "Al-Kafi - Volume 1: Chapter on Innovations, Personal Opinions and Analogies": [
          {
            "number": "Hadith #12",
            "url": "https://thaqalayn.net/hadith/1/2/19/12",
            "arabicText": "12ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عُمَرَ بْنِ أَبَانٍ الْكَلْبِيِّ عَنْ عَبْدِ الرَّحِيمِ الْقَصِيرِ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) كُلُّ بِدْعَةٍ ضَلالَةٌ وَكُلُّ ضَلالَةٍ فِي النَّارِ.",
            "englishTranslation": "12. A number of our people has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Hakam from ‘Umar ibn Aban al-Kalbi from ‘Abd al-Rahman al-Qasir from abu ‘Abdallah  who has said the following. “The Holy Prophet said, ‘All innovations are misguidance and all misguidance is Hell.’”",
            "gradings": [
              {
                "grade": "صحيح",
                "book": "Sahih al-Kafi (9/ 1)",
                "author": "Shaykh Baqir al-Behbudi"
              },
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (196/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #14",
            "url": "https://thaqalayn.net/hadith/1/2/19/14",
            "arabicText": "14ـ عَنْهُ عَنْ مُحَمَّدٍ عَنْ يُونُسَ عَنْ أَبَانٍ عَنْ أَبِي شَيْبَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) يَقُولُ ضَلَّ عِلْمُ ابْنِ شُبْرُمَةَ عِنْدَ الْجَامِعَةِ إِمْلاءِ رَسُولِ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) وَخَطِّ علي (عَلَيْهِ السَّلام) بِيَدِهِ إِنَّ الْجَامِعَةَ لَمْ تَدَعْ لاحَدٍ كَلاماً فِيهَا عِلْمُ الْحَلالِ وَالْحَرَامِ إِنَّ أَصْحَابَ الْقِيَاسِ طَلَبُوا الْعِلْمَ بِالْقِيَاسِ فَلَمْ يَزْدَادُوا مِنَ الْحَقِّ إِلا بُعْداً إِنَّ دِينَ الله لا يُصَابُ بِالْقِيَاسِ.",
            "englishTranslation": "14. It is narrated from him from Muhammad from Yunus from Aban from abu Shaybah who has said the following. “I heard (Imam) abu ‘Abdallah  saying, ‘Ibn Shabrama’s knowledge is lost and void before al-Jami‘ah. It is a large book that was dictated by the holy Prophet to Imam Ali , who wrote it with his own hands. Al-Jami‘ah has left nothing for any one to say. In it is the knowledge of all lawful and unlawful matters. The people of analogy sought knowledge through analogy and it increased to their knowledge but taking them away from knowledge. The religion of Allah is not of matters to learn through analogy.”",
            "gradings": [
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              },
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/197)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #21",
            "url": "https://thaqalayn.net/hadith/1/2/19/21",
            "arabicText": "21ـ عَلِيٌّ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ قُتَيْبَةَ قَالَ سَأَلَ رَجُلٌ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) عَنْ مَسْأَلَةٍ فَأَجَابَهُ فِيهَا فَقَالَ الرَّجُلُ أَ رَأَيْتَ إِنْ كَانَ كَذَا وَكَذَا مَا يَكُونُ الْقَوْلُ فِيهَا فَقَالَ لَهُ مَهْ مَا أَجَبْتُكَ فِيهِ مِنْ شَيْ‏ءٍ فَهُوَ عَنْ رَسُولِ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) لَسْنَا مِنْ أَ رَأَيْتَ فِي شَيْ‏ءٍ.",
            "englishTranslation": "21. Ali has narrated from Muhammad ibn ‘Isa from Yunus from Qutayba who has said the following. “A man asked Imam abu ‘Abdallah  about an issue and the Imam replied him. The man then said, “Have you considered if it had been so and so it would have been the word in it.” The Imam then said, “Wait, whatever I said in answer was from the holy Prophet (s.a.). We are not of the people, “Have you considered” in anything.” ( The Imam that they did not need reasoning process and that all they said had come to them from the holy Prophet (s.a.)",
            "gradings": [
              {
                "grade": "مرسل",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/201)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          }
        ]
      },
      "20": {
        "Al-Kafi - Volume 1: Chapter on the need to refer to the book and Sunnah": [
          {
            "number": "Hadith #3",
            "url": "https://thaqalayn.net/hadith/1/2/20/3",
            "arabicText": "3ـ عَلِيٌّ عَنْ مُحَمَّدٍ عَنْ يُونُسَ عَنْ أَبَانٍ عَنْ سُلَيْمَانَ بْنِ هَارُونَ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) يَقُولُ مَا خَلَقَ الله حَلالاً وَلا حَرَاماً إِلا وَلَهُ حَدٌّ كَحَدِّ الدَّارِ فَمَا كَانَ مِنَ الطَّرِيقِ فَهُوَ مِنَ الطَّرِيقِ وَمَا كَانَ مِنَ الدَّارِ فَهُوَ مِنَ الدَّارِ حَتَّى أَرْشُ الْخَدْشِ فَمَا سِوَاهُ وَالْجَلْدَةِ وَنِصْفِ الْجَلْدَةِ.",
            "englishTranslation": "3. Ali has narrated from Muhammad from Yunus from aban from Sulayman ibn Harun who has said the following. “Abu ‘Abdallah  has said, ‘All that Allah has created has a limit like the limits of a house, in which case what is of house is of the house and what is of the road and the walkway is of the walkway. Even the law for the compensation for a scratch, and a penalty in form of a lash or half a lashing.’”",
            "gradings": [
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (203/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          },
          {
            "number": "Hadith #6",
            "url": "https://thaqalayn.net/hadith/1/2/20/6",
            "arabicText": "6ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنْ ثَعْلَبَةَ بْنِ مَيْمُونٍ عَمَّنْ حَدَّثَهُ عَنِ الْمُعَلَّى بْنِ خُنَيْسٍ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) مَا مِنْ أَمْرٍ يَخْتَلِفُ فِيهِ اثْنَانِ إِلا وَلَهُ أَصْلٌ فِي كِتَابِ الله عَزَّ وَجَلَّ وَلَكِنْ لا تَبْلُغُهُ عُقُولُ الرِّجَالِ.",
            "englishTranslation": "6. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal from Al-Thaqafi‘laba ibn Maymun from one he narrated from al-Mu‘alla ibn Khunays who has said the following. “Abu ‘Abdallah  has said, ‘There is no issue which would be disputed between two people but that there is a principle for it the book of Allah, the Most Majestic, the Most Glorious, only the man’s power of Intelligence is not able to reach it.’”",
            "gradings": [
              {
                "grade": "مرسل",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/205)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          },
          {
            "number": "Hadith #8",
            "url": "https://thaqalayn.net/hadith/1/2/20/8",
            "arabicText": "8ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ ابْنِ فَضَّالٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ عَبْدِ الاعْلَى بْنِ أَعْيَنَ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) يَقُولُ قَدْ وَلَدَنِي رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) وَأَنَا أَعْلَمُ كِتَابَ الله وَفِيهِ بَدْءُ الْخَلْقِ وَمَا هُوَ كَائِنٌ إِلَى يَوْمِ الْقِيَامَةِ وَفِيهِ خَبَرُ السَّمَاءِ وَخَبَرُ الارْضِ وَخَبَرُ الْجَنَّةِ وَخَبَرُ النَّارِ وَخَبَرُ مَا كَانَ وَخَبَرُ مَا هُوَ كَائِنٌ أَعْلَمُ ذَلِكَ كَمَا أَنْظُرُ إِلَى كَفِّي إِنَّ الله يَقُولُ فِيهِ تِبْيَانُ كُلِّ شَيْ‏ءٍ.",
            "englishTranslation": "8. Muhammad ibn Yahya has narrated from Muhammad ibn ’Abd al-Jabbar from ibn Faddal from Hammad ibn ‘Uthman from ’Abd al-‘Ala’ ibn A‘yan who has said the following. “Abu ‘Abdallah  would say, ‘I was born of the descendents of the holy Prophet (s.a.) while I knew the book of Allah wherein is the knowledge of how the world was first created and the knowledge of all that may come up to the Day of Judgement. Therein is the news of the heavens and the earth, the news of the Paradise and the Fire hell, the news of things of the past, those that will come into existence. I know all of these just as I can see in the palm of my hands. Allah says, “In it there is an explanation of everything.’”",
            "gradings": [
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (208/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "صحيح",
                "book": "Sahih al-Kafi (9/ 1)",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          }
        ]
      },
      "21": {
        "Al-Kafi - Volume 1: Chapter on the Differences in al-Hadith": [
          {
            "number": "Hadith #8",
            "url": "https://thaqalayn.net/hadith/1/2/21/8",
            "arabicText": "8ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عُثْمَانَ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ الْمُخْتَارِ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ أَ رَأَيْتَكَ لَوْ حَدَّثْتُكَ بِحَدِيثٍ الْعَامَ ثُمَّ جِئْتَنِي مِنْ قَابِلٍ فَحَدَّثْتُكَ بِخِلافِهِ بِأَيِّهِمَا كُنْتَ تَأْخُذُ قَالَ قُلْتُ كُنْتُ آخُذُ بِالاخِيرِ فَقَالَ لِي رَحِمَكَ الله.",
            "englishTranslation": "8. Ali ibn Ibrahim has narrated from his father from ‘Uthman ibn ‘Isa from al-Husayn ibn al-Mukhtar from certain persons of our people from abu ‘Abdallah  who has said the following. “If you would come to me for an answer to a question and I give you an answer of a general nature and then you come again and I give you an opposite answer which one would you follow?” I replied, “I would follow the later.” The Imam  said, “May Allah grant you blessings.”",
            "gradings": [
              {
                "grade": "مرسل",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (220/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          },
          {
            "number": "Hadith #9",
            "url": "https://thaqalayn.net/hadith/1/2/21/9",
            "arabicText": "9ـ وَعَنْهُ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ يُونُسَ عَنْ دَاوُدَ بْنِ فَرْقَدٍ عَنِ الْمُعَلَّى بْنِ خُنَيْسٍ قَالَ قُلْتُ لابِي عَبْدِ الله (عَلَيْهِ السَّلام) إِذَا جَاءَ حَدِيثٌ عَنْ أَوَّلِكُمْ وَحَدِيثٌ عَنْ آخِرِكُمْ بِأَيِّهِمَا نَأْخُذُ فَقَالَ خُذُوا بِهِ حَتَّى يَبْلُغَكُمْ عَنِ الْحَيِّ فَإِنْ بَلَغَكُمْ عَنِ الْحَيِّ فَخُذُوا بِقَوْلِهِ قَالَ ثُمَّ قَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) إِنَّا وَالله لا نُدْخِلُكُمْ إِلا فِيمَا يَسَعُكُمْ وَفِي حَدِيثٍ آخَرَ خُذُوا بِالاحْدَثِ.",
            "englishTranslation": "9. It is narrated from him from his father from Isma’il ibn Marrar from Yunus from Dawud ibn Farqad from Mu‘alla ibn Khunays who has said the following. “I asked Imam abu ‘Abdallah , ‘If we receive a Hadith from first of you and from the members of your later generation which one should we follow?” The Imam replied, “Follow it until you receive it from the living Imam. When it comes from a living Imam follow his words.” The Imam than said, “We by Allah, like you to follow what is easy for you.” In another Hadith it is says, “Follow whichever the newest.”’",
            "gradings": [
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/221)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          }
        ]
      },
      "22": {
        "Al-Kafi - Volume 1: Chapter on Following the Sunnah and Evidence of the Book": [
          {
            "number": "Hadith #2",
            "url": "https://thaqalayn.net/hadith/1/2/22/2",
            "arabicText": "2ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ عَبْدِ الله بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ عَبْدِ الله بْنِ أَبِي يَعْفُورٍ قَالَ وَحَدَّثَنِي حُسَيْنُ بْنُ أَبِي الْعَلاءِ أَنَّهُ حَضَرَ ابْنَ أَبِي يَعْفُورٍ فِي هَذَا الْمَجْلِسِ قَالَ سَأَلْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) عَنِ اخْتِلافِ الْحَدِيثِ يَرْوِيهِ مَنْ نَثِقُ بِهِ وَمِنْهُمْ مَنْ لا نَثِقُ بِهِ قَالَ إِذَا وَرَدَ عَلَيْكُمْ حَدِيثٌ فَوَجَدْتُمْ لَهُ شَاهِداً مِنْ كِتَابِ الله أَوْ مِنْ قَوْلِ رَسُولِ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) وَإِلا فَالَّذِي جَاءَكُمْ بِهِ أَوْلَى بِهِ.",
            "englishTranslation": "2. Muhammad ibn Yahya has narrated from ‘Abdallah ibn Muhammad from Ali ibn al-Hakam from Aban ibn ‘Uthman from ’Abdallah ibn abu Ya‘fur who has said the following. “In a meeting where ibn abi Ya‘fur was also present I asked Imam abu ‘Abdallah  about the differences in Hadith which is narrated from people whom we trust and yet from other people we do not trust.” The Imam replied, “If you come across a Hadith and you find evidence in the holy Quran to support it or in Hadith of the holy Prophet (you may follow it), otherwise, you follow the one that has come to you through the trustworthy narrator.”",
            "gradings": [
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/228)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "صحيح",
                "book": "Sahih al-Kafi (11/ 1)",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          },
          {
            "number": "Hadith #4",
            "url": "https://thaqalayn.net/hadith/1/2/22/4",
            "arabicText": "4ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ فَضَّالٍ عَنْ عَلِيِّ بْنِ عُقْبَةَ عَنْ أَيُّوبَ بْنِ رَاشِدٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ مَا لَمْ يُوَافِقْ مِنَ الْحَدِيثِ الْقُرْآنَ فَهُوَ زُخْرُفٌ.",
            "englishTranslation": "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from ibn Faddal from Ali ibn ‘Uqba from Ayyub ibn Rashid from abu ‘Abdallah  who has said the following. “Of Hadith whatever does not agree with the holy Quran is a useless statement.”",
            "gradings": [
              {
                "grade": "صحيح",
                "book": "Sahih al-Kafi (11/ 1)",
                "author": "Shaykh Baqir al-Behbudi"
              },
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/229)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      }
    },
    "3": {
      "1": {
        "Al-Kafi - Volume 1: Chapter on Contingency of the Universe and Proof of the Existence of its Creator": [
          {
            "number": "Hadith #1",
            "url": "https://thaqalayn.net/hadith/1/3/1/1",
            "arabicText": "1ـ أَخْبَرَنَا أَبُو جَعْفَرٍ مُحَمَّدُ بْنُ يَعْقُوبَ قَالَ حَدَّثَنِي عَلِيُّ بْنُ إِبْرَاهِيمَ بْنِ هَاشِمٍ عَنْ أَبِيهِ عَنِ الْحَسَنِ بْنِ إِبْرَاهِيمَ عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَلِيِّ بْنِ مَنْصُورٍ قَالَ قَالَ لِي هِشَامُ بْنُ الْحَكَمِ كَانَ بِمِصْرَ زِنْدِيقٌ تَبْلُغُهُ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) أَشْيَاءُ فَخَرَجَ إِلَى الْمَدِينَةِ لِيُنَاظِرَهُ فَلَمْ يُصَادِفْهُ بِهَا وَقِيلَ لَهُ إِنَّهُ خَارِجٌ بِمَكَّةَ فَخَرَجَ إِلَى مَكَّةَ وَنَحْنُ مَعَ أَبِي عَبْدِ الله فَصَادَفَنَا وَنَحْنُ مَعَ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) فِي الطَّوَافِ وَكَانَ اسْمُهُ عَبْدَ الْمَلِكِ وَكُنْيَتُهُ أَبُو عَبْدِ الله فَضَرَبَ كَتِفَهُ كَتِفَ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) فَقَالَ لَهُ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) مَا اسْمُكَ فَقَالَ اسْمِي عَبْدُ الْمَلِكِ قَالَ فَمَا كُنْيَتُكَ قَالَ كُنْيَتِي أَبُو عَبْدِ الله فَقَالَ لَهُ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) فَمَنْ هَذَا الْمَلِكُ الَّذِي أَنْتَ عَبْدُهُ أَ مِنْ مُلُوكِ الارْضِ أَمْ مِنْ مُلُوكِ السَّمَاءِ وَأَخْبِرْنِي عَنِ ابْنِكَ عَبْدُ إِلَهِ السَّمَاءِ أَمْ عَبْدُ إِلَهِ الارْضِ قُلْ مَا شِئْتَ تُخْصَمُ قَالَ هِشَامُ بْنُ الْحَكَمِ فَقُلْتُ لِلزِّنْدِيقِ أَ مَا تَرُدُّ عَلَيْهِ قَالَ فَقَبَّحَ قَوْلِي فَقَالَ أَبُو عَبْدِ الله إِذَا فَرَغْتُ مِنَ الطَّوَافِ فَأْتِنَا فَلَمَّا فَرَغَ أَبُو عَبْدِ الله أَتَاهُ الزِّنْدِيقُ فَقَعَدَ بَيْنَ يَدَيْ أَبِي عَبْدِ الله وَنَحْنُ مُجْتَمِعُونَ عِنْدَهُ فَقَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) لِلزِّنْدِيقِ أَ تَعْلَمُ أَنَّ لِلارْضِ تَحْتاً وَفَوْقاً قَالَ نَعَمْ قَالَ فَدَخَلْتَ تَحْتَهَا قَالَ لا قَالَ فَمَا يُدْرِيكَ مَا تَحْتَهَا قَالَ لا أَدْرِي إِلا أَنِّي أَظُنُّ أَنْ لَيْسَ تَحْتَهَا شَيْ‏ءٌ فَقَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) فَالظَّنُّ عَجْزٌ لِمَا لا تَسْتَيْقِنُ ثُمَّ قَالَ أَبُو عَبْدِ الله أَ فَصَعِدْتَ السَّمَاءَ قَالَ لا قَالَ أَ فَتَدْرِي مَا فِيهَا قَالَ لا قَالَ عَجَباً لَكَ لَمْ تَبْلُغِ الْمَشْرِقَ وَلَمْ تَبْلُغِ الْمَغْرِبَ وَلَمْ تَنْزِلِ الارْضَ وَلَمْ تَصْعَدِ السَّمَاءَ وَلَمْ تَجُزْ هُنَاكَ فَتَعْرِفَ مَا خَلْفَهُنَّ وَأَنْتَ جَاحِدٌ بِمَا فِيهِنَّ وَهَلْ يَجْحَدُ الْعَاقِلُ مَا لا يَعْرِفُ قَالَ الزِّنْدِيقُ مَا كَلَّمَنِي بِهَذَا أَحَدٌ غَيْرُكَ فَقَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) فَأَنْتَ مِنْ ذَلِكَ فِي شَكٍّ فَلَعَلَّهُ هُوَ وَلَعَلَّهُ لَيْسَ هُوَ فَقَالَ الزِّنْدِيقُ وَلَعَلَّ ذَلِكَ فَقَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) أَيُّهَا الرَّجُلُ لَيْسَ لِمَنْ لا يَعْلَمُ حُجَّةٌ عَلَى مَنْ يَعْلَمُ وَلا حُجَّةَ لِلْجَاهِلِ يَا أَخَا أَهْلِ مِصْرَ تَفْهَمُ عَنِّي فَإِنَّا لا نَشُكُّ فِي الله أَبَداً أَ مَا تَرَى الشَّمْسَ وَالْقَمَرَ وَاللَّيْلَ وَالنَّهَارَ يَلِجَانِ فَلا يَشْتَبِهَانِ وَيَرْجِعَانِ قَدِ اضْطُرَّا لَيْسَ لَهُمَا مَكَانٌ إِلا مَكَانُهُمَا فَإِنْ كَانَا يَقْدِرَانِ عَلَى أَنْ يَذْهَبَا فَلِمَ يَرْجِعَانِ وَإِنْ كَانَا غَيْرَ مُضْطَرَّيْنِ فَلِمَ لا يَصِيرُ اللَّيْلُ نَهَاراً وَالنَّهَارُ لَيْلاً اضْطُرَّا وَالله يَا أَخَا أَهْلِ مِصْرَ إِلَى دَوَامِهِمَا وَالَّذِي اضْطَرَّهُمَا أَحْكَمُ مِنْهُمَا وَأَكْبَرُ فَقَالَ الزِّنْدِيقُ صَدَقْتَ ثُمَّ قَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) يَا أَخَا أَهْلِ مِصْرَ إِنَّ الَّذِي تَذْهَبُونَ إِلَيْهِ وَتَظُنُّونَ أَنَّهُ الدَّهْرُ إِنْ كَانَ الدَّهْرُ يَذْهَبُ بِهِمْ لِمَ لا يَرُدُّهُمْ وَإِنْ كَانَ يَرُدُّهُمْ لِمَ لا يَذْهَبُ بِهِمُ الْقَوْمُ مُضْطَرُّونَ يَا أَخَا أَهْلِ مِصْرَ لِمَ السَّمَاءُ مَرْفُوعَةٌ وَالارْضُ مَوْضُوعَةٌ لِمَ لا يَسْقُطُ السَّمَاءُ عَلَى الارْضِ لِمَ لا تَنْحَدِرُ الارْضُ فَوْقَ طِبَاقِهَا وَلا يَتَمَاسَكَانِ وَلا يَتَمَاسَكُ مَنْ عَلَيْهَا قَالَ الزِّنْدِيقُ أَمْسَكَهُمَا الله رَبُّهُمَا وَسَيِّدُهُمَا قَالَ فَ‏آمَنَ الزِّنْدِيقُ عَلَى يَدَيْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) فَقَالَ لَهُ حُمْرَانُ جُعِلْتُ فِدَاكَ إِنْ آمَنَتِ الزَّنَادِقَةُ عَلَى يَدِكَ فَقَدْ آمَنَ الْكُفَّارُ عَلَى يَدَيْ أَبِيكَ فَقَالَ الْمُؤْمِنُ الَّذِي آمَنَ عَلَى يَدَيْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) اجْعَلْنِي مِنْ تَلامِذَتِكَ فَقَالَ أَبُو عَبْدِ الله يَا هِشَامَ بْنَ الْحَكَمِ خُذْهُ إِلَيْكَ وَعَلِّمْهُ فَعَلَّمَهُ هِشَامٌ فَكَانَ مُعَلِّمَ أَهْلِ الشَّامِ وَأَهْلِ مِصْرَ الايمَانَ وَحَسُنَتْ طَهَارَتُهُ حَتَّى رَضِيَ بِهَا أَبُو عَبْدِ الله.",
            "englishTranslation": "1. Abu Ja‘far Muhammad ibn Ya‘qub has narrated from Ali ibn Ibrahim ibn Hashim from his father, from al-Hassan ibn Ibrahim from Yunus ibn ‘Abd al-Rahman from Ali ibn Mansur who narrated the following. “Hisham ibn al-Hakam has reported that in Egypt there lived a heretic who had heard about Imam abu ‘Abdallah  a great deal. He traveled to Madina to debate the Imam but he missed to find the Imam therein. He was told that the Imam has traveled to the city of Makkah. He then left for Makkah and we were with the Imam  when we came across him during our performing Tawaf (the seven times walking around the Ka‘bah). The man’s name was ‘Abdul Malik also called abu ‘Abdallah as his Kunyah in Arabic. He touched Imam abu ‘Abdallah’s shoulder with his shoulder as he walked along. The Imam asked him, “What is your name?” It is ‘Abdul Malik (meaning slave of the King).” The man replied. “What is your Kunyah?” The Imam  asked. “It is abu ‘Abdallah (meaning father of slave of Allah).” He replied. The Imam then asked, “Who is this king whose slave you are? Is he of the earthly kings or of the heavenly ones? Tell us about your son. Is he a slave of the Lord of the heavens or a slave of the Lord of the earth? Say whatever you may it will be against you.” Hisham has said that I asked him (the heretic man), “Why do you not answer?” The man seemed to dislike my words. The Imam  then told him, “Meet us when we finish our Tawaf (walking around the Ka‘bah).” The heretic man came to the Imam  later and sat in front of the Imam  and we were all gathered around him. The Imam  then asked him, “Do you know that the earth has an underside and an upperside?” The man replied, “Yes, I know it.” The Imam then asked, “Have you gone in the underside of the earth?” The man replied, “No, I have not gone there.” The Imam  then asked, “Do you know what is therein?” He said, “I do not know but I guess there is nothing therein.” The Imam  then said, “Guessing is weakness. Why do you not acquire certainty?” The Imam  then asked, “Have you climbed up into the sky?” The man replied, “No, I have not done so.” The Imam  then asked, “Do you know what is up there?” He replied, “No, I do not know.” The Imam  said, “It is very strange. Without reaching the East or West, without going under the earth or climbing up the sky and not even have crossed anything to know what is behind you deny what is in them. Does any man of reason deny what he does not know?” The heretic man then said, “No one has ever come up with such statements to me as you have.” The Imam  then said, “So you are uncertain about Him. Perhaps He is or may be He does not exist.” The heretic man then said, “Perhaps He is.” The Imam then said, “O man, one who does not know has no authority over the one who knows. O Egyptian brethren, listen carefully. We have no doubts in the existence of Allah (God). Think about the sun, the moon, the day and the nights follow each other and do not miss their turns or become confused. They each have its place and do not have any choice. If they had any other choice they would not come back again. If they had a choice the day would not end with night and the night would not end in the day. They are forced to continue, O Egyptian brethren, I swear byAllah (God). The One who has forced them is stronger then them and greater. What people speak of and you guess it is (dahr) motionless time if it was so, then when it would take them away it would not return them and if time have returned them then why it is not taking them away? These things, O Egyptian brethren, are compelled. Why the sky is up high and why the earth is low? Why the sky does not fall down on earth? Why the earth does not flow one layer over the other and the two do not stick to each other and why those on it do not stick to it?” The man then said, “God their Lord has made them to hold together.” Hisham has said, “He professed belief in God in the presence of Imam abu ‘Abdallah .” “Humran then said to the Imam, “May Allah take my soul in service for your cause, if heretics profess belief in Allah (God) before you it is because the unbelievers converted to faith because of your father.” The man who had just professed belief in Allah requested Imam abu ‘Abdallah  to allow him to become one of his students. The Imam then asked Hisham to teach him. Hisham taught him well and he became a teacher for the people in Syria and Egypt. His purification was very well and the Imam  became happy with him.”",
            "gradings": [
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/235)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          },
          {
            "number": "Hadith #4",
            "url": "https://thaqalayn.net/hadith/1/3/1/4",
            "arabicText": "4ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ الْخَفَّافِ أَوْ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ قَالَ إِنَّ عَبْدَ الله الدَّيَصَانِيَّ سَأَلَ هِشَامَ بْنَ الْحَكَمِ فَقَالَ لَهُ أَ لَكَ رَبٌّ فَقَالَ بَلَى قَالَ أَ قَادِرٌ هُوَ قَالَ نَعَمْ قَادِرٌ قَاهِرٌ قَالَ يَقْدِرُ أَنْ يُدْخِلَ الدُّنْيَا كُلَّهَا الْبَيْضَةَ لا تَكْبُرُ الْبَيْضَةُ وَلا تَصْغُرُ الدُّنْيَا قَالَ هِشَامٌ النَّظِرَةَ فَقَالَ لَهُ قَدْ أَنْظَرْتُكَ حَوْلاً ثُمَّ خَرَجَ عَنْهُ فَرَكِبَ هِشَامٌ إِلَى أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) فَاسْتَأْذَنَ عَلَيْهِ فَأَذِنَ لَهُ فَقَالَ لَهُ يَا ابْنَ رَسُولِ الله أَتَانِي عَبْدُ الله الدَّيَصَانِيُّ بِمَسْأَلَةٍ لَيْسَ الْمُعَوَّلُ فِيهَا إِلا عَلَى الله وَعَلَيْكَ فَقَالَ لَهُ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) عَمَّا ذَا سَأَلَكَ فَقَالَ قَالَ لِي كَيْتَ وَكَيْتَ فَقَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) يَا هِشَامُ كَمْ حَوَاسُّكَ قَالَ خَمْسٌ قَالَ أَيُّهَا أَصْغَرُ قَالَ النَّاظِرُ قَالَ وَكَمْ قَدْرُ النَّاظِرِ قَالَ مِثْلُ الْعَدَسَةِ أَوْ أَقَلُّ مِنْهَا فَقَالَ لَهُ يَا هِشَامُ فَانْظُرْ أَمَامَكَ وَفَوْقَكَ وَأَخْبِرْنِي بِمَا تَرَى فَقَالَ أَرَى سَمَاءً وَأَرْضاً وَدُوراً وَقُصُوراً وَبَرَارِيَ وَجِبِالاً وَأَنْهَاراً فَقَالَ لَهُ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) إِنَّ الَّذِي قَدَرَ أَنْ يُدْخِلَ الَّذِي تَرَاهُ الْعَدَسَةَ أَوْ أَقَلَّ مِنْهَا قَادِرٌ أَنْ يُدْخِلَ الدُّنْيَا كُلَّهَا الْبَيْضَةَ لا تَصْغَرُ الدُّنْيَا وَلا تَكْبُرُ الْبَيْضَةُ فَأَكَبَّ هِشَامٌ عَلَيْهِ وَقَبَّلَ يَدَيْهِ وَرَأْسَهُ وَرِجْلَيْهِ وَقَالَ حَسْبِي يَا ابْنَ رَسُولِ الله وَانْصَرَفَ إِلَى مَنْزِلِهِ وَغَدَا عَلَيْهِ الدَّيَصَانِيُّ فَقَالَ لَهُ يَا هِشَامُ إِنِّي جِئْتُكَ مُسَلِّماً وَلَمْ أَجِئْكَ مُتَقَاضِياً لِلْجَوَابِ فَقَالَ لَهُ هِشَامٌ إِنْ كُنْتَ جِئْتَ مُتَقَاضِياً فَهَاكَ الْجَوَابَ فَخَرَجَ الدَّيَصَانِيُّ عَنْهُ حَتَّى أَتَى بَابَ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) فَاسْتَأْذَنَ عَلَيْهِ فَأَذِنَ لَهُ فَلَمَّا قَعَدَ قَالَ لَهُ يَا جَعْفَرَ بْنَ مُحَمَّدٍ دُلَّنِي عَلَى مَعْبُودِي فَقَالَ لَهُ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) مَا اسْمُكَ فَخَرَجَ عَنْهُ وَلَمْ يُخْبِرْهُ بِاسْمِهِ فَقَالَ لَهُ أَصْحَابُهُ كَيْفَ لَمْ تُخْبِرْهُ بِاسْمِكَ قَالَ لَوْ كُنْتُ قُلْتُ لَهُ عَبْدُ الله كَانَ يَقُولُ مَنْ هَذَا الَّذِي أَنْتَ لَهُ عَبْدٌ فَقَالُوا لَهُ عُدْ إِلَيْهِ وَقُلْ لَهُ يَدُلُّكَ عَلَى مَعْبُودِكَ وَلا يَسْأَلُكَ عَنِ اسْمِكَ فَرَجَعَ إِلَيْهِ فَقَالَ لَهُ يَا جَعْفَرَ بْنَ مُحَمَّدٍ دُلَّنِي عَلَى مَعْبُودِي وَلا تَسْأَلْنِي عَنِ اسْمِي فَقَالَ لَهُ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) اجْلِسْ وَإِذَا غُلامٌ لَهُ صَغِيرٌ فِي كَفِّهِ بَيْضَةٌ يَلْعَبُ بِهَا فَقَالَ لَهُ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) نَاوِلْنِي يَا غُلامُ الْبَيْضَةَ فَنَاوَلَهُ إِيَّاهَا فَقَالَ لَهُ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) يَا دَيَصَانِيُّ هَذَا حِصْنٌ مَكْنُونٌ لَهُ جِلْدٌ غَلِيظٌ وَتَحْتَ الْجِلْدِ الْغَلِيظِ جِلْدٌ رَقِيقٌ وَتَحْتَ الْجِلْدِ الرَّقِيقِ ذَهَبَةٌ مَائِعَةٌ وَفِضَّةٌ ذَائِبَةٌ فَلا الذَّهَبَةُ الْمَائِعَةُ تَخْتَلِطُ بِالْفِضَّةِ الذَّائِبَةِ وَلا الْفِضَّةُ الذَّائِبَةُ تَخْتَلِطُ بِالذَّهَبَةِ الْمَائِعَةِ فَهِيَ عَلَى حَالِهَا لَمْ يَخْرُجْ مِنْهَا خَارِجٌ مُصْلِحٌ فَيُخْبِرَ عَنْ صَلاحِهَا وَلا دَخَلَ فِيهَا مُفْسِدٌ فَيُخْبِرَ عَنْ فَسَادِهَا لا يُدْرَى لِلذَّكَرِ خُلِقَتْ أَمْ لِلانْثَى تَنْفَلِقُ عَنْ مِثْلِ أَلْوَانِ الطَّوَاوِيسِ أَ تَرَى لَهَا مُدَبِّراً قَالَ فَأَطْرَقَ مَلِيّاً ثُمَّ قَالَ أَشْهَدُ أَنْ لا إِلَهَ إِلا الله وَحْدَهُ لا شَرِيكَ لَهُ وَأَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ وَأَنَّكَ إِمَامٌ وَحُجَّةٌ مِنَ الله عَلَى خَلْقِهِ وَأَنَا تَائِبٌ مِمَّا كُنْتُ فِيهِ.",
            "englishTranslation": "4. Ali ibn Ibrahim has narrated from Muhammad ibn Ishaq al-Khaffaf or from his father from Muhammad ibn Ishaq who has said the following. “‘Abdallah al-Daysani asked Hisham ibn al-Hakam, ‘Do you have a God?’” He replied, “Yes, I have a God.” He then asked, “Is He powerful?” Hisham then replied, “Yes, He is powerful and the most powerful One.” The man then asked, “Can He fit the whole world inside an egg without any change in the size of either one?” Hisham then said, “Give me a little time.” The man said, “I give you one whole year and he left.” Hisham then went to see Imam abu ‘Abdallah  for an Answer. After asking permission that he was granted Hisham explained, “Al-Daysani asked me a question today and I see no one except Allah and yourself to answer it.” The Imam then asked, “What is the question?” Hisham restated the question that al-Daysani had asked. The Imam then said, “O Hisham, how many are your senses?” He replied, “They are five.” The Imam then asked, “Which one is the smallest?” He replied, “The seeing sense.” The Imam then asked, “How big is its size?” He replied, “It is about the size of the pupil or smaller.” The Imam then said, “O Hisham, look in front of you and above you and then tell me what you have seen.” Hisham then replied, “I can see the sky, the earth, the houses, the buildings, the land, the mountains and the water canals.” The Imam then said, “The One who has been able to fit all that you can see in a pupil or even a smaller thing is also able to fit the whole world in side an egg without any change in the size of any one of them. Hisham bowed down and kissed the feet, the hands and the head of the Imam  saying, “This is enough for me O descendant of the holy Prophet and then left for his home. The next day al-Daysani met him and said, “I have come just to say greetings to you and not for an answer to my question” Hisham then said, “Even if you may have come for an answer it is ready.” Al-Daysani then left to meet Imam abu ‘Abdallah  and after asking permission for a meeting which was granted he sat down and said, “O Ja‘far ibn Muhammad, “Guide me to my Lord.” The Imam then asked, “What is your name?” He then left without answering the Imam and his people asked him, “Why did you not answer the Imam?” He replied, “Were I to tell him that it is ‘Abdallah he would then ask that who is this Lord whose slave are you?” They then said, “Return to him and ask him to guide you to your Lord without asking your name.” He then returned back to the Imam and asked, “O Ja‘far ibn Muhammad, “Guide me to my Lord but do not ask my name.” The Imam asked him to sit down. A young boy, son of the Imam was there playing with an egg in his hand and the Imam asked, “Fetch me the egg O young man. The boy gave the egg to the Imam who said, “O Daysani, this is a secure castle. It has a thicker outer shell and inside of it there is much finer shell inside of which there is liquid gold and flowing silver. The liquid gold does not mix with the flowing silver nor does the flowing silver mix the liquid gold. Such is its condition no expert comes out therefrom to find out what is beneficial to it to report back all about it nor any corrupting agent enters therein so that its problems would be reported. No one knows if it is created for a male or a female. It will burst out with colors of a peacock. Do you think there is someone to design and manage it? Al-Daysani thought quietly and said, “I testify that there is no god but Allah Who is the only Lord and has no partner. I testify that Muhammad (s.a) is His servant and messenger and that you are the Imam and an authority from Allah over his creatures and I repent because of previous beliefs.”",
            "gradings": [
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              },
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/256)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #5",
            "url": "https://thaqalayn.net/hadith/1/3/1/5",
            "arabicText": "5ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبَّاسِ بْنِ عَمْرٍو الْفُقَيْمِيِّ عَنْ هِشَامِ بْنِ الْحَكَمِ فِي حَدِيثِ الزِّنْدِيقِ الَّذِي أَتَى أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) وَكَانَ مِنْ قَوْلِ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) لا يَخْلُو قَوْلُكَ إِنَّهُمَا اثْنَانِ مِنْ أَنْ يَكُونَا قَدِيمَيْنِ قَوِيَّيْنِ أَوْ يَكُونَا ضَعِيفَيْنِ أَوْ يَكُونَ أَحَدُهُمَا قَوِيّاً وَالاخَرُ ضَعِيفاً فَإِنْ كَانَا قَوِيَّيْنِ فَلِمَ لا يَدْفَعُ كُلُّ وَاحِدٍ مِنْهُمَا صَاحِبَهُ وَيَتَفَرَّدُ بِالتَّدْبِيرِ وَإِنْ زَعَمْتَ أَنَّ أَحَدَهُمَا قَوِيٌّ وَالاخَرَ ضَعِيفٌ ثَبَتَ أَنَّهُ وَاحِدٌ كَمَا نَقُولُ لِلْعَجْزِ الظَّاهِرِ فِي الثَّانِي فَإِنْ قُلْتَ إِنَّهُمَا اثْنَانِ لَمْ يَخْلُ مِنْ أَنْ يَكُونَا مُتَّفِقَيْنِ مِنْ كُلِّ جِهَةٍ أَوْ مُفْتَرِقَيْنِ مِنْ كُلِّ جِهَةٍ فَلَمَّا رَأَيْنَا الْخَلْقَ مُنْتَظِماً وَالْفَلَكَ جَارِياً وَالتَّدْبِيرَ وَاحِداً وَاللَّيْلَ وَالنَّهَارَ وَالشَّمْسَ وَالْقَمَرَ دَلَّ صِحَّةُ الامْرِ وَالتَّدْبِيرِ وَائْتِلافُ الامْرِ عَلَى أَنَّ الْمُدَبِّرَ وَاحِدٌ ثُمَّ يَلْزَمُكَ إِنِ ادَّعَيْتَ اثْنَيْنِ فُرْجَةٌ مَا بَيْنَهُمَا حَتَّى يَكُونَا اثْنَيْنِ فَصَارَتِ الْفُرْجَةُ ثَالِثاً بَيْنَهُمَا قَدِيماً مَعَهُمَا فَيَلْزَمُكَ ثَلاثَةٌ فَإِنِ ادَّعَيْتَ ثَلاثَةً لَزِمَكَ مَا قُلْتَ فِي الاثْنَيْنِ حَتَّى تَكُونَ بَيْنَهُمْ فُرْجَةٌ فَيَكُونُوا خَمْسَةً ثُمَّ يَتَنَاهَى فِي الْعَدَدِ إِلَى مَا لا نِهَايَةَ لَهُ فِي الْكَثْرَةِ قَالَ هِشَامٌ فَكَانَ مِنْ سُؤَالِ الزِّنْدِيقِ أَنْ قَالَ فَمَا الدَّلِيلُ عَلَيْهِ فَقَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) وُجُودُ الافَاعِيلِ دَلَّتْ عَلَى أَنَّ صَانِعاً صَنَعَهَا أَ لا تَرَى أَنَّكَ إِذَا نَظَرْتَ إِلَى بِنَاءٍ مُشَيَّدٍ مَبْنِيٍّ عَلِمْتَ أَنَّ لَهُ بَانِياً وَإِنْ كُنْتَ لَمْ تَرَ الْبَانِيَ وَلَمْ تُشَاهِدْهُ قَالَ فَمَا هُوَ قَالَ شَيْ‏ءٌ بِخِلافِ الاشْيَاءِ ارْجِعْ بِقَوْلِي إِلَى إِثْبَاتِ مَعْنًى وَأَنَّهُ شَيْ‏ءٌ بِحَقِيقَةِ الشَّيْئِيَّةِ غَيْرَ أَنَّهُ لا جِسْمٌ وَلا صُورَةٌ وَلا يُحَسُّ وَلا يُجَسُّ وَلا يُدْرَكُ بِالْحَوَاسِّ الْخَمْسِ لا تُدْرِكُهُ الاوْهَامُ وَلا تَنْقُصُهُ الدُّهُورُ وَلا تُغَيِّرُهُ الازْمَانُ.",
            "englishTranslation": "5. Ali ibn Ibrahim has narrated from his father from ‘Abbass ibn ‘Amr al-Faqimi from Hisham ibn al-Hakam in the narration about the atheist who came to Imam abu ‘Abdallah  and the Imam had explained to him the following. “You assume that there are two eternal and powerful powers (who control the universe) or that both are weak or only one of them is weak and the other is powerful. If they both are powerful why then neither one ever makes an effort to remove the other one so only one would become in control of the universe? If you would assume that one is powerful and the other is weak then it is proof that there is only one, as we believe because the weakness of the other is so apparent. Besides, if you would say that they are two then they either agree with each other in all matters or disagree in the same way. Since we see the creation works in an organized manner, the orbiting objects continue to do so, the organization is one, the day, the night, the sun and the moon all show that the organization is valid and correct. The harmony in the matter shows that the organizer is One. If your claim of two would involve you to believe that there must be a gap in between to show two things and in that case, the gap will become a third one and eternal. Thus, it will involve you in three and this will involve to say what you said about the two where you needed to have a gap and in this case it will become five and so on indefinite in number and multiplicity.” Hisham has said that of the questions of the atheist from Imam abu ‘Abdallah one was that what is the evidence of His existence? The Imam  answered, “The existence of the effects (activities) show that someone has produced those effects and activities. Consider, when you see a well constructed building you learn that there is someone, who has built it even if you have not seen the builder with your own eyes.” The atheist then asked, “What is it then?” The Imam replied, “He is something but different from all things. I repeat my statement that speaks about Him as a thing. He is a thing in the sense of the reality of things except that He does not have a body and form. He does not have a feeling (like our sense of feeling) or touching and He does not comprehend with the five senses (as we do). Imaginations can not comprehend Him and the timeless (Dahr) times does not reduce Him and the times do not change Him.”",
            "gradings": [
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              },
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (260/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #6",
            "url": "https://thaqalayn.net/hadith/1/3/1/6",
            "arabicText": "6ـ مُحَمَّدُ بْنُ يَعْقُوبَ قَالَ حَدَّثَنِي عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنِ ابْنِ مُسْكَانَ عَنْ دَاوُدَ بْنِ فَرْقَدٍ عَنْ أَبِي سَعِيدٍ الزُّهْرِيِّ عَنْ ابي جعفر (عَلَيْهِ السَّلام) قَالَ كَفَى لاولِي الالْبَابِ بِخَلْقِ الرَّبِّ الْمُسَخِّرِ وَمُلْكِ الرَّبِّ الْقَاهِرِ وَجَلالِ الرَّبِّ الظَّاهِرِ وَنُورِ الرَّبِّ الْبَاهِرِ وَبُرْهَانِ الرَّبِّ الصَّادِقِ وَمَا أَنْطَقَ بِهِ أَلْسُنَ الْعِبَادِ وَمَا أَرْسَلَ بِهِ الرُّسُلَ وَمَا أَنْزَلَ عَلَى الْعِبَادِ دَلِيلاً عَلَى الرَّبِّ.",
            "englishTranslation": "6. Muhammad ibn Ya‘qub has said that a number of our people have narrated from Ahmad ibn Muhammad al-Barqi from his father, from Ali ibn al-Ni‘man, from ibn Maskan, from Dawud ibn Farqad from abu Sa‘id al-Zuhri from Imam abu Ja‘far  who said the following. “For the people of understanding as proof of the existence of the Allah it is enough that He has created all things and has kept them full under His control. It is enough proof that He is the Most powerful king. It is enough proof that His Majesty is manifest everywhere. That His light is the Most bright that His testimony is the Most truthful. There is enough proof of His existence in what the people speak and what the messengers have brought and what he has revealed to people as proof of His Own existence.”",
            "gradings": [
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              },
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/276)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "2": {
        "Al-Kafi - Volume 1: Chapter on Can Allah (God) be Considered a Thing?": [
          {
            "number": "Hadith #7",
            "url": "https://thaqalayn.net/hadith/1/3/2/7",
            "arabicText": "7ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَمَّنْ ذَكَرَهُ قَالَ سُئِلَ أَبُو جَعْفَرٍ (عَلَيْهِ السَّلام) أَ يَجُوزُ أَنْ يُقَالَ إِنَّ الله شَيْ‏ءٌ قَالَ نَعَمْ يُخْرِجُهُ مِنَ الْحَدَّيْنِ حَدِّ التَّعْطِيلِ وَحَدِّ التَّشْبِيهِ.",
            "englishTranslation": "7. It is narrated from Imam abu Ja‘far  who said when he was asked, “Is it permissible to say Allah is a thing?” “Yes, it is permissible because it excludes Him from being ignored altogether and from being analogized or considered similar to the creatures.”",
            "gradings": [
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              },
              {
                "grade": "مرسل",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/294)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "3": {
        "Al-Kafi - Volume 1: Chapter on (the Issue) that only He is proof of His Own Existence": [
          {
            "number": "Hadith #1",
            "url": "https://thaqalayn.net/hadith/1/3/3/1",
            "arabicText": "1ـ عَلِيُّ بْنُ مُحَمَّدٍ عَمَّنْ ذَكَرَهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ حُمْرَانَ عَنِ الْفَضْلِ بْنِ السَّكَنِ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) اعْرِفُوا الله بِالله وَالرَّسُولَ بِالرِّسَالَةِ وَأُولِي الامْرِ بِالامْرِ بِالْمَعْرُوفِ وَالْعَدْلِ وَالاحْسَانِ.  وَمَعْنَى قَوْلِهِ (عَلَيْهِ السَّلام) اعْرِفُوا الله بِالله يَعْنِي أَنَّ الله خَلَقَ الاشْخَاصَ وَالانْوَارَ وَالْجَوَاهِرَ وَالاعْيَانَ فَالاعْيَانُ الابْدَانُ وَالْجَوَاهِرُ الارْوَاحُ وَهُوَ جَلَّ وَعَزَّ لا يُشْبِهُ جِسْماً وَلا رُوحاً وَلَيْسَ لاحَدٍ فِي خَلْقِ الرُّوحِ الْحَسَّاسِ الدَّرَّاكِ أَمْرٌ وَلا سَبَبٌ هُوَ الْمُتَفَرِّدُ بِخَلْقِ الارْوَاحِ وَالاجْسَامِ فَإِذَا نَفَى عَنْهُ الشَّبَهَيْنِ شَبَهَ الابْدَانِ وَشَبَهَ الارْوَاحِ فَقَدْ عَرَفَ الله بِالله وَإِذَا شَبَّهَهُ بِالرُّوحِ أَوِ الْبَدَنِ أَوِ النُّورِ فَلَمْ يَعْرِفِ الله بِالله.",
            "englishTranslation": "1. Ali ibn Muhammad has narrated from the people he mentioned from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Humran from al- Fadl ibn al-Sakan from Imam abu ‘Abdallah  who has narrated the following. “Imam Ali  has said, ‘Recognize Allah by Allah’s Own-Self, recognize the Messenger through his message and the people with Divine authority through their commanding others to do what is obligatory, the practice of justice and kindness.’” Al-Kulayni had made the following comment on the above passage. “Acknowledge the existence of Allah by His own self” means that Allah has created the individuals, the light, the substance and the objects. The objects are the bodies, the substance stand for the spirits and He is not similar to the bodies or spirit in any of the creatures. No one has any part or effect in the creation of the spirits that comprehend and feel. He is the only one who has created the spirits and the bodies. When similarity to both kinds of creatures; similarity to the bodies and spirits is negated from Him, then one has acknowledge the existence of Allah by Allah’s own self. If one considers Him similar to the spirits, lights or bodies he has not acknowledged His existence by His own self.",
            "gradings": [
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (294/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          },
          {
            "number": "Hadith #2",
            "url": "https://thaqalayn.net/hadith/1/3/3/2",
            "arabicText": "2ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ عَلِيِّ بْنِ عُقْبَةَ بْنِ قَيْسِ بْنِ سِمْعَانَ بْنِ أَبِي رُبَيْحَةَ مَوْلَى رَسُولِ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) قَالَ سُئِلَ أَمِيرُ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) بِمَ عَرَفْتَ رَبَّكَ قَالَ بِمَا عَرَّفَنِي نَفْسَهُ قِيلَ وَكَيْفَ عَرَّفَكَ نَفْسَهُ قَالَ لا يُشْبِهُهُ صُورَةٌ وَلا يُحَسُّ بِالْحَوَاسِّ وَلا يُقَاسُ بِالنَّاسِ قَرِيبٌ فِي بُعْدِهِ بَعِيدٌ فِي قُرْبِهِ فَوْقَ كُلِّ شَيْ‏ءٍ وَلا يُقَالُ شَيْ‏ءٌ فَوْقَهُ أَمَامَ كُلِّ شَيْ‏ءٍ وَلا يُقَالُ لَهُ أَمَامٌ دَاخِلٌ فِي الاشْيَاءِ لا كَشَيْ‏ءٍ دَاخِلٍ فِي شَيْ‏ءٍ وَخَارِجٌ مِنَ الاشْيَاءِ لا كَشَيْ‏ءٍ خَارِجٍ مِنْ شَيْ‏ءٍ سُبْحَانَ مَنْ هُوَ هَكَذَا وَلا هَكَذَا غَيْرُهُ وَلِكُلِّ شَيْ‏ءٍ مُبْتَدَأٌ.",
            "englishTranslation": "2. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from some of our people from Ali ibn Ali ibn ‘Uqbaa ibn Qays ibn Sam‘an ibn abu Rabi‘ah Mawla of the Messenger of Allah who has said the following. “A certain person asked Imam Ali  saying, ‘By what means do you acknowledge the existence of your Lord?’” The Imam  replied, “I acknowledge His existence by what He has made me to acknowledge His Own-Self.” He was asked, “How that has happened?” The Imam  then replied, “He is not similar to any form and is not felt and comprehended through any of the senses and can not be analogized with the people. He is near in that He is far and He is far in that He is near. He is above every thing but one can not say that certain things are above Him. He is before every thing but one can not say that something is before Him. He is inside all things but not the way things are inside other things. He is outside every thing but not the way things are outside other things. Glory belongs to the One Who is as such and nothing else other than Him is as such and for every thing there is a beginner.”",
            "gradings": [
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              },
              {
                "grade": "مرسل",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/299)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "4": {
        "Al-Kafi - Volume 1: Chapter on the minimum degree of knowledge of the existence of Allah": [
          {
            "number": "Hadith #1",
            "url": "https://thaqalayn.net/hadith/1/3/4/1",
            "arabicText": "1ـ مُحَمَّدُ بْنُ الْحَسَنِ عَنْ عَبْدِ الله بْنِ الْحَسَنِ الْعَلَوِيِّ وَعَلِيُّ بْنُ إِبْرَاهِيمَ عَنِ الْمُخْتَارِ بْنِ مُحَمَّدِ بْنِ الْمُخْتَارِ الْهَمْدَانِيِّ جَمِيعاً عَنِ الْفَتْحِ بْنِ يَزِيدَ عَنْ أَبِي الْحَسَنِ (عَلَيْهِ السَّلام) قَالَ سَأَلْتُهُ عَنْ أَدْنَى الْمَعْرِفَةِ فَقَالَ الاقْرَارُ بِأَنَّهُ لا إِلَهَ غَيْرُهُ وَلا شِبْهَ لَهُ وَلا نَظِيرَ وَأَنَّهُ قَدِيمٌ مُثْبَتٌ مَوْجُودٌ غَيْرُ فَقِيدٍ وَأَنَّهُ لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ.",
            "englishTranslation": "1. Muhammad ibn al- Hassan has narrated from ‘Abdallah ibn al-Hassan al-‘Alawi and Ali ibn Ibrahim from al-Mukhtar ibn Muhammad ibn al-Mukhtar al-Hmadini altogether from al- Fath ibn Yazid who has said the following. “I asked Imam abul Hassan , “What is the minimum required degree of knowledge about Allah?” The Imam said, “To acknowledge that there is no other lord besides Him and that nothing is similar to and like Him and that He is eternal, positively existing and not absence and that nothing is like Him.”",
            "gradings": [
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/301)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          }
        ]
      },
      "6": {
        "Al-Kafi - Volume 1: Chapter On Being and Space (al-Kawn WA al-Makan)": [
          {
            "number": "Hadith #5",
            "url": "https://thaqalayn.net/hadith/1/3/6/5",
            "arabicText": "5ـ وَبِهَذَا الاسْنَادِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبِي الْحَسَنِ الْمَوْصِلِيِّ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ جَاءَ حِبْرٌ مِنَ الاحْبَارِ إِلَى أَمِيرِ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ مَتَى كَانَ رَبُّكَ فَقَالَ لَهُ ثَكِلَتْكَ أُمُّكَ وَمَتَى لَمْ يَكُنْ حَتَّى يُقَالَ مَتَى كَانَ كَانَ رَبِّي قَبْلَ الْقَبْلِ بِلا قَبْلٍ وَبَعْدَ الْبَعْدِ بِلا بَعْدٍ وَلا غَايَةَ وَلا مُنْتَهَى لِغَايَتِهِ انْقَطَعَتِ الْغَايَاتُ عِنْدَهُ فَهُوَ مُنْتَهَى كُلِّ غَايَةٍ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ أَ فَنَبِيٌّ أَنْتَ فَقَالَ وَيْلَكَ إِنَّمَا أَنَا عَبْدٌ مِنْ عَبِيدِ مُحَمَّدٍ (صَلَّى اللهُ عَلَيْهِ وَآلِه) وَرُوِيَ أَنَّهُ سُئِلَ (عَلَيْهِ السَّلام) أَيْنَ كَانَ رَبُّنَا قَبْلَ أَنْ يَخْلُقَ سَمَاءً وَأَرْضاً فَقَالَ (عَلَيْهِ السَّلام) أَيْنَ سُؤَالٌ عَنْ مَكَانٍ وَكَانَ الله وَلا مَكَانَ.",
            "englishTranslation": "5. It is narrated, through the same chain of narrators and source, from Ahmad ibn Muhammad ibn Khalid from his father from Ahmad ibn Muhammad ibn Abu Nasr from abu al-Hassan al-Muwsali from Imam abu ‘Abdallah , who has said the following. “One of the Jewish rabbis (hibr) came to Imam Ali , and asked, ‘O Amir al-Mu’minin, when did your Lord come into existence?’” Imam Ali  replied, “Bereft of you be your mother! When has Allah not been (in existence), so that it could be said when did He come into existence. My Lord existed before any before without being before. He is after every after, without being after. There is no finale destination or end for Him. All ends fall short before Him. He is the final destination of all goals.” He further asked, “O Amir al-Mu’minin, are you a prophet?” Imam Ali  replied, “Hold it there. I am one of the slaves of Muhammad,(s.a.) the Messenger of Allah.” It has also been narrated that someone asked Imam Ali  this. “Where was our Lord before the creation of the heavens and the earth?” Imam Ali  replied, “Where is a question about space. Allah has been there before there was space.”",
            "gradings": [
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              },
              {
                "grade": "مجهول وآخره مرسل",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/314)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "7": {
        "Al-Kafi - Volume 1: Chapter On The relationships (Nisbah) Of Allah": [
          {
            "number": "Hadith #2",
            "url": "https://thaqalayn.net/hadith/1/3/7/2",
            "arabicText": "2ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى وَمُحَمَّدِ بْنِ الْحُسَيْنِ عَنِ ابْنِ مَحْبُوبٍ عَنْ حَمَّادِ بْنِ عَمْرٍو النَّصِيبِيِّ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ سَأَلْتُ أَبَا عَبْدِ الله عَنْ قُلْ هُوَ الله أَحَدٌ فَقَالَ نِسْبَةُ الله إِلَى خَلْقِهِ أَحَداً صَمَداً أَزَلِيّاً صَمَدِيّاً لا ظِلَّ لَهُ يُمْسِكُهُ وَهُوَ يُمْسِكُ الاشْيَاءَ بِأَظِلَّتِهَا عَارِفٌ بِالْمَجْهُولِ مَعْرُوفٌ عِنْدَ كُلِّ جَاهِلٍ فَرْدَانِيّاً لا خَلْقُهُ فِيهِ وَلا هُوَ فِي خَلْقِهِ غَيْرُ مَحْسُوسٍ وَلا مَجْسُوسٍ لا تُدْرِكُهُ الابْصَارُ عَلا فَقَرُبَ وَدَنَا فَبَعُدَ وَعُصِيَ فَغَفَرَ وَأُطِيعَ فَشَكَرَ لا تَحْوِيهِ أَرْضُهُ وَلا تُقِلُّهُ سَمَاوَاتُهُ حَامِلُ الاشْيَاءِ بِقُدْرَتِهِ دَيْمُومِيٌّ أَزَلِيٌّ لا يَنْسَى وَلا يَلْهُو وَلا يَغْلَطُ وَلا يَلْعَبُ وَلا لارَادَتِهِ فَصْلٌ وَفَصْلُهُ جَزَاءٌ وَأَمْرُهُ وَاقِعٌ لَمْ يَلِدْ فَيُورَثَ وَلَمْ يُولَدْ فَيُشَارَكَ وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ.",
            "englishTranslation": "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa and Muhammad ibn al-Husayn from ibn Mahbub from Hammad ibn ’Amr al-Nusaybi who has said the following. “I asked Imam abu ’Abdallah  about the words of Allah, ‘Say, ‘He is Allah, One . .’” The Imam replied, “These verses define Allah’s relation to His creation. He is the One, Unique, Eternal, and Absolute. He does not have shadow so one can hold Him but it is He who holds things by their shadows. He knows the unknown and is known to every ignorant person. He is only One. He is not in His creatures and His creatures are not in Him. He does not feel nor others can feel Him (physically). Eyes cannot see Him. He is so High that is near and is so near that He is far. Although disobeyed, yet He forgives. When obeyed, He is appreciative. His earth does not contain Him, nor do His heavens bear Him. He holds all things through His power and He is Everlasting and Eternal. He does not forget or amuse Himself. He does not make any mistakes or play. There is no lapse in His will. His judgment is rewarding and His commands are effective. He does not have a child to become His heir nor is He begotten so His power would be shared. And there is no one like Him.”",
            "gradings": [
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              },
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/317)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "8": {
        "Al-Kafi - Volume 1: Chapter On Prohibition on Saying How is Allah (al-Kayfiyyah)": [
          {
            "number": "Hadith #9",
            "url": "https://thaqalayn.net/hadith/1/3/8/9",
            "arabicText": "9ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنِ الْيَعْقُوبِيِّ عَنْ بَعْضِ أَصْحَابِنَا عَنْ عَبْدِ الاعْلَى مَوْلَى آلِ سَامٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ إِنَّ يَهُودِيّاً يُقَالُ لَهُ سِبَخْتُ جَاءَ إِلَى رَسُولِ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) فَقَالَ يَا رَسُولَ الله جِئْتُ أَسْأَلُكَ عَنْ رَبِّكَ فَإِنْ أَنْتَ أَجَبْتَنِي عَمَّا أَسْأَلُكَ عَنْهُ وَإِلا رَجَعْتُ قَالَ سَلْ عَمَّا شِئْتَ قَالَ أَيْنَ رَبُّكَ قَالَ هُوَ فِي كُلِّ مَكَانٍ وَلَيْسَ فِي شَيْ‏ءٍ مِنَ الْمَكَانِ الْمَحْدُودِ قَالَ وَكَيْفَ هُوَ قَالَ وَكَيْفَ أَصِفُ رَبِّي بِالْكَيْفِ وَالْكَيْفُ مَخْلُوقٌ وَالله لا يُوصَفُ بِخَلْقِهِ قَالَ فَمِنْ أَيْنَ يُعْلَمُ أَنَّكَ نَبِيُّ الله قَالَ فَمَا بَقِيَ حَوْلَهُ حَجَرٌ وَلا غَيْرُ ذَلِكَ إِلا تَكَلَّمَ بِلِسَانٍ عَرَبِيٍّ مُبِينٍ يَا سِبَخْتُ إِنَّهُ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) فَقَالَ سِبَخْتُ مَا رَأَيْتُ كَالْيَوْمِ أَمْراً أَبْيَنَ مِنْ هَذَا ثُمَّ قَالَ أَشْهَدُ أَنْ لا إِلَهَ إِلا الله وَأَنَّكَ رَسُولُ الله.",
            "englishTranslation": "9. Ali ibn Ibrahim has narrated from his father from al-Hassan ibn Ali from al-Ba’qubi (Dawud ibn Ali al-Hashimi) from some of our people from ’Abd al-‘Ala’ Mawla Ala Sam from Imam abu ‘Abdallah  who has said the following. “A Jew named Sabhut came to the Prophet, (s.a.) and said, “O Messenger of Allah, I have come to ask about your Lord. If you will answer my question it will be fine, otherwise, I will go back.” The Prophet replied, “Ask whatever you like.” He asked, “Where is your Lord?” The Prophet replied, “He is everywhere, but He is not confined in any limited space.” He asked, “How is He?” The Prophet replied, “How can I describe my Lord by means of conditions that are created. Allah cannot be describe by His creation.” The Jew asked further, “What is the proof that you are the Messenger of Allah?” The Imam said, “At this point nothing remained around him (the Jew), the stones and all other things, but that they spoke in clear Arabic language, ‘O Sabhut he (Muhammad) is the Messenger of Allah.’ Sabhut said, “I have not seen anything so clearly as this today.” And then he declared, “I testify that there is no god but Allah and you are the Messenger of Allah.”",
            "gradings": [
              {
                "grade": "مرسل",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/325)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          },
          {
            "number": "Hadith #10",
            "url": "https://thaqalayn.net/hadith/1/3/8/10",
            "arabicText": "10ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى الْخَثْعَمِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَتِيكٍ الْقَصِيرِ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ (عَلَيْهِ السَّلام) عَنْ شَيْ‏ءٍ مِنَ الصِّفَةِ فَرَفَعَ يَدَهُ إِلَى السَّمَاءِ ثُمَّ قَالَ تَعَالَى الْجَبَّارُ تَعَالَى الْجَبَّارُ مَنْ تَعَاطَى مَا ثَمَّ هَلَكَ.",
            "englishTranslation": "10. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from Muhammad ibn Yahya al-Khath‘ami from ’Abd al-Rahman ibn ‘Utayk al-Qasir who has said the following. “I asked Imam abu Ja‘far , about certain attributes of Allah. The Imam raised his hand towards the heavens and said, ‘High is the Almighty. High is the Almighty. One who pursues beyond this, he is doomed.’”",
            "gradings": [
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/316)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          }
        ]
      },
      "9": {
        "Al-Kafi - Volume 1: Chapter On The Invalidity of the Belief to see God (Ru’yah of Allah)": [
          {
            "number": "Hadith #3",
            "url": "https://thaqalayn.net/hadith/1/3/9/3",
            "arabicText": "3ـ أَحْمَدُ بْنُ إِدْرِيسَ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ سَيْفٍ عَنْ مُحَمَّدِ بْنِ عُبَيْدٍ قَالَ كَتَبْتُ إِلَى أَبِي الْحَسَنِ الرِّضَا (عَلَيْهِ السَّلام) أَسْأَلُهُ عَنِ الرُّؤْيَةِ وَمَا تَرْوِيهِ الْعَامَّةُ وَالْخَاصَّةُ وَسَأَلْتُهُ أَنْ يَشْرَحَ لِي ذَلِكَ فَكَتَبَ بِخَطِّهِ اتَّفَقَ الْجَمِيعُ لا تَمَانُعَ بَيْنَهُمْ أَنَّ الْمَعْرِفَةَ مِنْ جِهَةِ الرُّؤْيَةِ ضَرُورَةٌ فَإِذَا جَازَ أَنْ يُرَى الله بِالْعَيْنِ وَقَعَتِ الْمَعْرِفَةُ ضَرُورَةً ثُمَّ لَمْ تَخْلُ تِلْكَ الْمَعْرِفَةُ مِنْ أَنْ تَكُونَ إِيمَاناً أَوْ لَيْسَتْ بِإِيمَانٍ فَإِنْ كَانَتْ تِلْكَ الْمَعْرِفَةُ مِنْ جِهَةِ الرُّؤْيَةِ إِيمَاناً فَالْمَعْرِفَةُ الَّتِي فِي دَارِ الدُّنْيَا مِنْ جِهَةِ الاكْتِسَابِ لَيْسَتْ بِإِيمَانٍ لانَّهَا ضِدُّهُ فَلا يَكُونُ فِي الدُّنْيَا مُؤْمِنٌ لانَّهُمْ لَمْ يَرَوُا الله عَزَّ ذِكْرُهُ وَإِنْ لَمْ تَكُنْ تِلْكَ الْمَعْرِفَةُ الَّتِي مِنْ جِهَةِ الرُّؤْيَةِ إِيمَاناً لَمْ تَخْلُ هَذِهِ الْمَعْرِفَةُ الَّتِي مِنْ جِهَةِ الاكْتِسَابِ أَنْ تَزُولَ وَلا تَزُولُ فِي الْمَعَادِ فَهَذَا دَلِيلٌ عَلَى أَنَّ الله عَزَّ وَجَلَّ لا يُرَى بِالْعَيْنِ إِذِ الْعَيْنُ تُؤَدِّي إِلَى مَا وَصَفْنَاهُ.",
            "englishTranslation": "3. Ahmad ibn Idris has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn Sayf from Muhammad ibn ‘Ubayd who has said the following. “I wrote to abu al-Hassan al-Rida  and asked him about the belief in eye-witnessing Allah’s self. Is it is possible to see Allah’s self with one’s own eyes as is traditionally narrated in the affirmative by the Sunni Muslims (al-’ammah) and the Shi‘ah Muslims (al-khassah) who are contrary. I requested him to explain the matter. The Imam answered in his own handwriting. “All agree and there is no dissension among the people that eye-witnessed knowledge of things is certainly knowledge without doubt. It is the form of knowledge that does not require logical proofs. If it is true that seeing Allah’s self with the eyes is possible then it becomes a necessity to acknowledge that Allah becomes entirely known and defined through eye-witnessed process. Now, can eye-witnessed knowledge of Allah’s self be considered faith or not? If the knowledge of Him as such, i.e. eye-witnessed knowledge (which according to Sunni Muslims will happen on the Day of resurrection) be considered faith, then faith in Allah in this world, which comes through non-eye-witnessed knowledge is not faith. It is contrary to eye-witnessed knowledge and faith (contrary things do not exist at the same time). Thus, there would be no one who would have faith in Allah in this world because no one has seen Him, Majestic is Whose name. If the eye-witnessed knowledge and understanding would not be considered faith then the non-eye-witnessed faith and knowledge formed and acquired must go away in the next life, but, in fact, it will not go away on the Day of resurrection. This is proof that Allah, the Majestic, the Glorious, can not be seen because it will lead to (the kind of confusion) what we just mentioned.”",
            "gradings": [
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/331)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          },
          {
            "number": "Hadith #6",
            "url": "https://thaqalayn.net/hadith/1/3/9/6",
            "arabicText": "6ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبِي الْحَسَنِ الْمَوْصِلِيِّ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ جَاءَ حِبْرٌ إِلَى أَمِيرِ الْمُؤْمِنِينَ صَلَوَاتُ الله عَلَيْهِ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ هَلْ رَأَيْتَ رَبَّكَ حِينَ عَبَدْتَهُ قَالَ فَقَالَ وَيْلَكَ مَا كُنْتُ أَعْبُدُ رَبّاً لَمْ أَرَهُ قَالَ وَكَيْفَ رَأَيْتَهُ قَالَ وَيْلَكَ لا تُدْرِكُهُ الْعُيُونُ فِي مُشَاهَدَةِ الابْصَارِ وَلَكِنْ رَأَتْهُ الْقُلُوبُ بِحَقَائِقِ الايمَانِ.",
            "englishTranslation": "6. A group of our people has narrated from Ahmad ibn Muhammad ibn Khalid from Ahmad ibn Muhammad ibn abu Nasr from abu al-Hassan al-Muwsali from abu ‘Abdallah  who has said, “Once a rabbi (hibr) came to Imam Ali  and asked, ‘O Amir al-mu’minin, have you seen your Lord when worshipping Him?’” Imam Ali  replied, “This is not a proper question. I would not have worshipped a Lord whom I could not see.” He then asked, “How did you see Him?” Imam Ali  said, “This is not a proper statement. Eyes can not see Him in eye-witnessing process but hearts see Him in the realities of faith.”",
            "gradings": [
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              },
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/337)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #11",
            "url": "https://thaqalayn.net/hadith/1/3/9/11",
            "arabicText": "11ـ مُحَمَّدُ بْنُ أَبِي عَبْدِ الله عَمَّنْ ذَكَرَهُ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ دَاوُدَ بْنِ الْقَاسِمِ أَبِي هَاشِمٍ الْجَعْفَرِيِّ قَالَ قُلْتُ لابي جعفر (عَلَيْهِ السَّلام) لا تُدْرِكُهُ الابْصارُ وَهُوَ يُدْرِكُ الابْصارَ فَقَالَ يَا أَبَا هَاشِمٍ أَوْهَامُ الْقُلُوبِ أَدَقُّ مِنْ أَبْصَارِ الْعُيُونِ أَنْتَ قَدْ تُدْرِكُ بِوَهْمِكَ السِّنْدَ وَالْهِنْدَ وَالْبُلْدَانَ الَّتِي لَمْ تَدْخُلْهَا وَلا تُدْرِكُهَا بِبَصَرِكَ وَأَوْهَامُ الْقُلُوبِ لا تُدْرِكُهُ فَكَيْفَ أَبْصَارُ الْعُيُونِ.",
            "englishTranslation": "11. Muhammad ibn abu ‘Abdallah has narrated from the person whose name he mentioned from Muhammad ibn ‘Isa from Dawud ibn al-Qasim abu Hashim al-Ja‘fari who has said the following. “I mentioned the words of Allah , ‘No mortal eyes can see Him, but He can see all eyes. He is All-kind and All-aware.’ (6:103) to Imam abu Ja’far . He said, “O abu Hashim, Awham (mentioned above) of hearts are keener and sharper than the perceptions of the eyes. Through the Awham of the heart you can perceive countries like Sind, Hind (India) and other cities which you have never seen with your eyes. How can your eyes see Him when the Awham of your heart cannot perceive Him?”",
            "gradings": [
              {
                "grade": "مرسل",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (141/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          },
          {
            "number": "Hadith #12",
            "url": "https://thaqalayn.net/hadith/1/3/9/12",
            "arabicText": "12ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ بَعْضِ أَصْحَابِهِ عَنْ هِشَامِ بْنِ الْحَكَمِ قَالَ الاشْيَاءُ كُلُّهَا لا تُدْرَكُ إِلا بِأَمْرَيْنِ بِالْحَوَاسِّ وَالْقَلْبِ وَالْحَوَاسُّ إِدْرَاكُهَا عَلَى ثَلاثَةِ مَعَانٍ إِدْرَاكاً بِالْمُدَاخَلَةِ وَإِدْرَاكاً بِالْمُمَاسَّةِ وَإِدْرَاكاً بِلا مُدَاخَلَةٍ وَلا؛ّّ مُمَاسَّةٍ فَأَمَّا الادْرَاكُ الَّذِي بِالْمُدَاخَلَةِ فَالاصْوَاتُ وَالْمَشَامُّ وَالطُّعُومُ وَأَمَّا الادْرَاكُ بِالْمُمَاسَّةِ فَمَعْرِفَةُ الاشْكَالِ مِنَ التَّرْبِيعِ وَالتَّثْلِيثِ وَمَعْرِفَةُ اللَّيِّنِ وَالْخَشِنِ وَالْحَرِّ وَالْبَرْدِ وَأَمَّا الادْرَاكُ بِلا مُمَاسَّةٍ وَلا مُدَاخَلَةٍ فَالْبَصَرُ فَإِنَّهُ يُدْرِكُ الاشْيَاءَ بِلا مُمَاسَّةٍ وَلا مُدَاخَلَةٍ فِي حَيِّزِ غَيْرِهِ وَلا فِي حَيِّزِهِ وَإِدْرَاكُ الْبَصَرِ لَهُ سَبِيلٌ وَسَبَبٌ فَسَبِيلُهُ الْهَوَاءُ وَسَبَبُهُ الضِّيَاءُ فَإِذَا كَانَ السَّبِيلُ مُتَّصِلاً بَيْنَهُ وَبَيْنَ الْمَرْئِيِّ وَالسَّبَبُ قَائِمٌ أَدْرَكَ مَا يُلاقِي مِنَ الالْوَانِ وَالاشْخَاصِ فَإِذَا حُمِلَ الْبَصَرُ عَلَى مَا لا سَبِيلَ لَهُ فِيهِ رَجَعَ رَاجِعاً فَحَكَى مَا وَرَاءَهُ كَالنَّاظِرِ فِي الْمِرْآةِ لا يَنْفُذُ بَصَرُهُ فِي الْمِرْآةِ فَإِذَا لَمْ يَكُنْ لَهُ سَبِيلٌ رَجَعَ رَاجِعاً يَحْكِي مَا وَرَاءَهُ وَكَذَلِكَ النَّاظِرُ فِي الْمَاءِ الصَّافِي يَرْجِعُ رَاجِعاً فَيَحْكِي مَا وَرَاءَهُ إِذْ لا سَبِيلَ لَهُ فِي إِنْفَاذِ بَصَرِهِ فَأَمَّا الْقَلْبُ فَإِنَّمَا سُلْطَانُهُ عَلَى الْهَوَاءِ فَهُوَ يُدْرِكُ جَمِيعَ مَا فِي الْهَوَاءِ وَيَتَوَهَّمُهُ فَإِذَا حُمِلَ الْقَلْبُ عَلَى مَا لَيْسَ فِي الْهَوَاءِ مَوْجُوداً رَجَعَ رَاجِعاً فَحَكَى مَا فِي الْهَوَاءِ فَلا يَنْبَغِي لِلْعَاقِلِ أَنْ يَحْمِلَ قَلْبَهُ عَلَى مَا لَيْسَ مَوْجُوداً فِي الْهَوَاءِ مِنْ أَمْرِ التَّوْحِيدِ جَلَّ الله وَعَزَّ فَإِنَّهُ إِنْ فَعَلَ ذَلِكَ لَمْ يَتَوَهَّمْ إِلا مَا فِي الْهَوَاءِ مَوْجُودٌ كَمَا قُلْنَا فِي أَمْرِ الْبَصَرِ تَعَالَى الله أَنْ يُشْبِهَهُ خَلْقُهُ.",
            "englishTranslation": "12. Ali ibn Ibrahim has narrated from his father from some of his people from Hisham ibn al-Hakam who has said the following. “Things can be perceived by two means: (1) By the senses and (2) by the heart, intellect. Perceptions of the senses are of three kinds: (1) Perception in the form of penetration, (2) Perception in the form of touching, and (3) Perception without penetration or touCh Perception by means of sounds, smells and tastes are formed through penetration. Perception through touching comes from the knowledge of shapes, such as rectangular or triangular etc., and also softness, hardness, heat and cold. Perception without touch or penetration is that of sight which is capable of perceiving things without touching or penetration, directly or indirectly. Perception through sight needs a path and medium. Its path is air and its medium is the light. If the path is continuous between the viewer and the object and the medium then seeing takes place such as colors and persons. If light falls on something without a path, it will return reflecting what is behind (the observed), like an observer looking into a mirror. Light does not penetrate into the mirror, because it finds no path. So it returns reflecting what lies behind the observed. It is similar to looking into the clear water returns light that reflects what is at the rear. This happens because there is no path for the penetration of light. Intellect dominates the air. It perceives all that is in the air and forms his Wahm (intuitive form of perception). If the heart will not find any thing in the air it comes back and reflects what is in the air. A person of reason should not force his heart against what is not in the air of the issue of the Oneness of Allah, the Majestic, the Glorious, otherwise, it will form his Wahm of what is there in the air as mentioned about the eye-witnessing. Allah, the Most High is far and above similarities with the creatures.”",
            "gradings": [
              {
                "grade": "مرسل موقو ف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/141)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          }
        ]
      },
      "10": {
        "Al-Kafi - Volume 1: Chapter On Prohibition on Attributing to Allah What He Himself has not Done so": [
          {
            "number": "Hadith #1",
            "url": "https://thaqalayn.net/hadith/1/3/10/1",
            "arabicText": "1ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنِ الْعَبَّاسِ بْنِ مَعْرُوفٍ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ عَبْدِ الرَّحِيمِ بْنِ عَتِيكٍ الْقَصِيرِ قَالَ كَتَبْتُ عَلَى يَدَيْ عَبْدِ الْمَلِكِ بْنِ أَعْيَنَ إِلَى أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) أَنَّ قَوْماً بِالْعِرَاقِ يَصِفُونَ الله بِالصُّورَةِ وَبِالتَّخْطِيطِ فَإِنْ رَأَيْتَ جَعَلَنِيَ الله فِدَاكَ أَنْ تَكْتُبَ إِلَيَّ بِالْمَذْهَبِ الصَّحِيحِ مِنَ التَّوْحِيدِ فَكَتَبَ إِلَيَّ سَأَلْتَ رَحِمَكَ الله عَنِ التَّوْحِيدِ وَمَا ذَهَبَ إِلَيْهِ مَنْ قِبَلَكَ فَتَعَالَى الله الَّذِي لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وَهُوَ السَّمِيعُ الْبَصِيرُ تَعَالَى عَمَّا يَصِفُهُ الْوَاصِفُونَ الْمُشَبِّهُونَ الله بِخَلْقِهِ الْمُفْتَرُونَ عَلَى الله فَاعْلَمْ رَحِمَكَ الله أَنَّ الْمَذْهَبَ الصَّحِيحَ فِي التَّوْحِيدِ مَا نَزَلَ بِهِ الْقُرْآنُ مِنْ صِفَاتِ الله جَلَّ وَعَزَّ فَانْفِ عَنِ الله تَعَالَى الْبُطْلانَ وَالتَّشْبِيهَ فَلا نَفْيَ وَلا تَشْبِيهَ هُوَ الله الثَّابِتُ الْمَوْجُودُ تَعَالَى الله عَمَّا يَصِفُهُ الْوَاصِفُونَ وَلا تَعْدُوا الْقُرْآنَ فَتَضِلُّوا بَعْدَ الْبَيَانِ.",
            "englishTranslation": "1. Ali ibn Ibrahim has narrated from al-‘Abbass ibn Ma‘ruf from ibn abu Najran from Hammad ibn ‘Uthman from Abd al-Rahim ibn ‘Utayk al-Qusayr who has said the following. “I wrote through ‘Abdal Malik ibn ’a‘yan to Imam abu ‘Abdallah . “In Iraq there are people who attribute to Allah forms and lines. If you consider it proper, may Allah take my soul in your service, please write for me the correct belief in the issue of the Oneness of Allah.” The Imam wrote for me, “May Allah grant you blessings. You have asked about the Oneness of Allah and the belief of the group before you. Exalted is Allah, to Who nothing is similar. He is All-hearing and All-seeing. Allah is above what certain people attribute to Him and analogize Him with His creatures and the lies of those who speak lies about Him. Note that the true doctrine in the Oneness of Allah is what is revealed in the Quran in about the attributes of Allah, the Almighty, the Exalted. Keep away from the belief in Allah, the Most High, all ideas that amount to ignoring His existence altogether and those that amount to analogizing Him with the creatures. Neither should His existence be negated nor should He be considered similar to anything. He, Allah, the Most High exists. Exalted is He and far above what is falsely attributed to Him. Do not exceed the limits of the Quran lest you go astray after the clear presentation of Truth.”",
            "gradings": [
              {
                "grade": "صحيح",
                "book": "Sahih al-Kafi (1/14)",
                "author": "Shaykh Baqir al-Behbudi"
              },
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (335/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "11": {
        "Al-Kafi - Volume 1: Chapter On Prohibition on Considering Allah as having Body (JISM) and Form (SURAH)": [
          {
            "number": "Hadith #4",
            "url": "https://thaqalayn.net/hadith/1/3/11/4",
            "arabicText": "4ـ مُحَمَّدُ بْنُ أَبِي عَبْدِ الله عَمَّنْ ذَكَرَهُ عَنْ عَلِيِّ بْنِ الْعَبَّاسِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ مُحَمَّدِ بْنِ حَكِيمٍ قَالَ وَصَفْتُ لابِي إِبْرَاهِيمَ (عَلَيْهِ السَّلام) قَوْلَ هِشَامِ بْنِ سَالِمٍ الْجَوَالِيقِيِّ وَحَكَيْتُ لَهُ قَوْلَ هِشَامِ بْنِ الْحَكَمِ أَنَّهُ جِسْمٌ فَقَالَ إِنَّ الله تَعَالَى لا يُشْبِهُهُ شَيْ‏ءٌ أَيُّ فُحْشٍ أَوْ خَناً أَعْظَمُ مِنْ قَوْلِ مَنْ يَصِفُ خَالِقَ الاشْيَاءِ بِجِسْمٍ أَوْ صُورَةٍ أَوْ بِخِلْقَةٍ أَوْ بِتَحْدِيدٍ وَأَعْضَاءٍ تَعَالَى الله عَنْ ذَلِكَ عُلُوّاً كَبِيراً.",
            "englishTranslation": "4. Muhammad ibn Abu ‘Abdallah has narrated from those he mentioned from Ali ibn al-‘Abbass from Ahmad ibn Muhammad ibn abu Nasr from Muhammad ibn Hakim. He has said that I explained to abu Ibrahim (Musa al-Kadhim , the words of Hisham ibn Salim al-Jawaliqi and the words of Hisham ibn al-Hakam that say Allah is a body. The Imam  said, “Allah, the Most High, is not similar to any of the things. What can be more blasphemous and scandalous than to describe the Creator of all things by means of body, form, type of creation, limitations, limbs and organs. Allah, the Most High, the Great, is far above these things.”",
            "gradings": [
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              },
              {
                "grade": "مرسل",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/3)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #8",
            "url": "https://thaqalayn.net/hadith/1/3/11/8",
            "arabicText": "8ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ مُحَمَّدِ بْنِ حَكِيمٍ قَالَ وَصَفْتُ لابِي الْحَسَنِ (عَلَيْهِ السَّلام) قَوْلَ هِشَامٍ الْجَوَالِيقِيِّ وَمَا يَقُولُ فِي الشَّابِّ الْمُوَفَّقِ وَوَصَفْتُ لَهُ قَوْلَ هِشَامِ بْنِ الْحَكَمِ فَقَالَ إِنَّ الله لا يُشْبِهُهُ شَيْ‏ءٌ.",
            "englishTranslation": "8. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Iisa from Yunus from Muhammad ibn Hakim who has said the following. “I mentioned to abu al-Hassan al-Awwal (the first) , the statements of Hisham al-Jawaliqi and what he says about fully grown up young man (see Hadith 3 Chapter on prohibited Attributes). I also mentioned the statements of Hisham ibn al-Hakam in this matter.” The Imam said, “Allah, certainly, is not similar to any thing.”",
            "gradings": [
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              },
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/ 2)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "12": {
        "Al-Kafi - Volume 1: Chapter On Attribute Of Essence (Sifat al-DhDhat) Of Allah": [
          {
            "number": "Hadith #1",
            "url": "https://thaqalayn.net/hadith/1/3/12/1",
            "arabicText": "1ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ خَالِدٍ الطَّيَالِسِيِّ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) يَقُولُ لَمْ يَزَلِ الله عَزَّ وَجَلَّ رَبَّنَا وَالْعِلْمُ ذَاتُهُ وَلا مَعْلُومَ وَالسَّمْعُ ذَاتُهُ وَلا مَسْمُوعَ وَالْبَصَرُ ذَاتُهُ وَلا مُبْصَرَ وَالْقُدْرَةُ ذَاتُهُ وَلا مَقْدُورَ فَلَمَّا أَحْدَثَ الاشْيَاءَ وَكَانَ الْمَعْلُومُ وَقَعَ الْعِلْمُ مِنْهُ عَلَى الْمَعْلُومِ وَالسَّمْعُ عَلَى الْمَسْمُوعِ وَالْبَصَرُ عَلَى الْمُبْصَرِ وَالْقُدْرَةُ عَلَى الْمَقْدُورِ قَالَ قُلْتُ فَلَمْ يَزَلِ الله مُتَحَرِّكاً قَالَ فَقَالَ تَعَالَى الله عَنْ ذَلِكَ إِنَّ الْحَرَكَةَ صِفَةٌ مُحْدَثَةٌ بِالْفِعْلِ قَالَ قُلْتُ فَلَمْ يَزَلِ الله مُتَكَلِّماً قَالَ فَقَالَ إِنَّ الْكَلامَ صِفَةٌ مُحْدَثَةٌ لَيْسَتْ بِأَزَلِيَّةٍ كَانَ الله عَزَّ وَجَلَّ وَلا مُتَكَلِّمَ.",
            "englishTranslation": "1. Ali ibn Ibrahim has narrated from Muhammad ibn Khalid al-Tayalisi from Safwan ibn Yahya from ibn Maskan from abu Basir who has said the following. “I heard abu ‘Abdallah  saying, ‘The Exalted, the Glorious, Allah, our Lord, is Eternal. Knowledge is His self even if there is nothing to be known. Hearing is His self even if there is nothing to be heard. Seeing is His-self even when there is nothing to be seen. Power is His self even if there is nothing to feel the power. When He brought things into existence the perceptible objects became the objects of His knowledge, His hearing applied to audible objects, His seeing to visible objects and His power to the objects that feel power.’” Abu Basir adds; “I further asked, ‘Has Allah always been in motion?” He replied, “Allah is High Exalted above that. Motion is an attribute that is created through action.” I asked, “Did Allah always have the ability to speak?” He replied, “ Speech is a created attribute and not an eternal one. Allah, the Majestic, the Glorious, existed when there was nothing able to speak.”",
            "gradings": [
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/ 2)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          }
        ]
      },
      "13": {
        "Al-Kafi - Volume 1: Another Chapter of The Previous Chapter": [
          {
            "number": "Hadith #2",
            "url": "https://thaqalayn.net/hadith/1/3/13/2",
            "arabicText": "2ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْعَبَّاسِ بْنِ عَمْرٍو عَنْ هِشَامِ بْنِ الْحَكَمِ قَالَ فِي حَدِيثِ الزِّنْدِيقِ الَّذِي سَأَلَ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) أَنَّهُ قَالَ لَهُ أَ تَقُولُ إِنَّهُ سَمِيعٌ بَصِيرٌ فَقَالَ أَبُو عَبْدِ الله هُوَ سَمِيعٌ بَصِيرٌ سَمِيعٌ بِغَيْرِ جَارِحَةٍ وَبَصِيرٌ بِغَيْرِ آلَةٍ بَلْ يَسْمَعُ بِنَفْسِهِ وَيُبْصِرُ بِنَفْسِهِ وَلَيْسَ قَوْلِي إِنَّهُ سَمِيعٌ بِنَفْسِهِ أَنَّهُ شَيْ‏ءٌ وَالنَّفْسُ شَيْ‏ءٌ آخَرُ وَلَكِنِّي أَرَدْتُ عِبَارَةً عَنْ نَفْسِي إِذْ كُنْتُ مَسْئُولاً وَإِفْهَاماً لَكَ إِذْ كُنْتَ سَائِلاً فَأَقُولُ يَسْمَعُ بِكُلِّهِ لا أَنَّ كُلَّهُ لَهُ بَعْضٌ لانَّ الْكُلَّ لَنَا لَهُ بَعْضٌ وَلَكِنْ أَرَدْتُ إِفْهَامَكَ وَالتَّعْبِيرُ عَنْ نَفْسِي وَلَيْسَ مَرْجِعِي فِي ذَلِكَ كُلِّهِ إِلا أَنَّهُ السَّمِيعُ الْبَصِيرُ الْعَالِمُ الْخَبِيرُ بِلا ا��ْتِلافِ الذَّاتِ وَلا اخْتِلافِ مَعْنًى.",
            "englishTranslation": "2. Ali ibn Ibrahim has narrated from his father from al-‘Abbass ibn ’Amr from Hisham ibn al-Hakam, who about the debate with an atheist (see Hadith No.225 - 6), has said the following. “He asked Imam abu ‘Abdallah , ‘Do you say that He is All-hearing and All-seeing?’ Abu ‘Abdallah said, “Allah is All-hearing, All-seeing. He hears without any organ and sees without any instrument. He Himself hears and He Himself sees. When I say He Himself hears I do not mean thereby that He is One and His self is something different. I only try to express what I have in my mind to answer a question and help you understand the answer. So I say, “His whole self hears. This does not mean that His whole has parts. In our perception whole consists of parts. It is to make you understand and express my thoughts. It all amounts to saying that He is All-hearing, All-seeing, All-knowing and All-aware, without any multiplicity in the meaning.”",
            "gradings": [
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/13)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          }
        ]
      },
      "14": {
        "Al-Kafi - Volume 1: Chapter On Will Power (IRADAH) it is of the Attributes of Action (SIFAT al-FI‘L) and the Rest of the Attributes of Action": [
          {
            "number": "Hadith #6",
            "url": "https://thaqalayn.net/hadith/1/3/14/6",
            "arabicText": "6ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْعَبَّاسِ بْنِ عَمْرٍو عَنْ هِشَامِ بْنِ الْحَكَمِ فِي حَدِيثِ الزِّنْدِيقِ الَّذِي سَأَلَ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) فَكَانَ مِنْ سُؤَالِهِ أَنْ قَالَ لَهُ فَلَهُ رِضًا وَسَخَطٌ فَقَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) نَعَمْ وَلَكِنْ لَيْسَ ذَلِكَ عَلَى مَا يُوجَدُ مِنَ الْمَخْلُوقِينَ وَذَلِكَ أَنَّ الرِّضَا حَالٌ تَدْخُلُ عَلَيْهِ فَتَنْقُلُهُ مِنْ حَالٍ إِلَى حَالٍ لانَّ الْمَخْلُوقَ أَجْوَفُ مُعْتَمِلٌ مُرَكَّبٌ لِلاشْيَاءِ فِيهِ مَدْخَلٌ وَخَالِقُنَا لا مَدْخَلَ لِلاشْيَاءِ فِيهِ لانَّهُ وَاحِدٌ وَاحِدِيُّ الذَّاتِ وَاحِدِيُّ الْمَعْنَى فَرِضَاهُ ثَوَابُهُ وَسَخَطُهُ عِقَابُهُ مِنْ غَيْرِ شَيْ‏ءٍ يَتَدَاخَلُهُ فَيُهَيِّجُهُ وَيَنْقُلُهُ مِنْ حَالٍ إِلَى حَالٍ لانَّ ذَلِكَ مِنْ صِفَةِ الْمَخْلُوقِينَ الْعَاجِزِينَ الْمُحْتَاجِينَ.",
            "englishTranslation": "6. Ali ibn Ibrahim has narrated from his father from al-‘Abbass ibn ‘Amr from Hisham ibn al-Hakam who has narrated the following in the debate with the atheist who asked abu ‘Abdallah  (See Hadith Nos.225 - 6 and 297 -2). “Does Allah become pleased and displeased?” Abu ‘Abdallah  replied, “Yes, but not like that which is found in His creatures. In His creatures the pleasure is a state (hal), which enters into him and changes him from one state to another. The creatures are hollow, active and compound with entrance in them. Nothing can enter into our Creator. Because He is One, a single self, a single meaning. His pleasure is His reward and His anger is His punishment without anything entering in Him to motivate and change Him from one state to another because these are of the attributes of His creatures who are weak and needy.”",
            "gradings": [
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/21)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          }
        ]
      },
      "15": {
        "Al-Kafi - Volume 1: Chapter On the Coming into the Existence of the Names of Allah": [
          {
            "number": "Hadith #1",
            "url": "https://thaqalayn.net/hadith/1/3/15/1",
            "arabicText": "1ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ صَالِحِ بْنِ أَبِي حَمَّادٍ عَنِ الْحُسَيْنِ بْنِ يَزِيدَ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ إِبْرَاهِيمَ بْنِ عُمَرَ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ إِنَّ الله تَبَارَكَ وَتَعَالَى خَلَقَ اسْماً بِالْحُرُوفِ غَيْرَ مُتَصَوَّتٍ وَبِاللَّفْظِ غَيْرَ مُنْطَقٍ وَبِالشَّخْصِ غَيْرَ مُجَسَّدٍ وَبِالتَّشْبِيهِ غَيْرَ مَوْصُوفٍ وَبِاللَّوْنِ غَيْرَ مَصْبُوغٍ مَنْفِيٌّ عَنْهُ الاقْطَارُ مُبَعَّدٌ عَنْهُ الْحُدُودُ مَحْجُوبٌ عَنْهُ حِسُّ كُلِّ مُتَوَهِّمٍ مُسْتَتِرٌ غَيْرُ مَسْتُورٍ فَجَعَلَهُ كَلِمَةً تَامَّةً عَلَى أَرْبَعَةِ أَجْزَاءٍ مَعاً لَيْسَ مِنْهَا وَاحِدٌ قَبْلَ الاخَرِ فَأَظْهَرَ مِنْهَا ثَلاثَةَ أَسْمَاءٍ لِفَاقَةِ الْخَلْقِ إِلَيْهَا وَحَجَبَ مِنْهَا وَاحِداً وَهُوَ الاسْمُ الْمَكْنُونُ الْمَخْزُونُ فَهَذِهِ الاسْمَاءُ الَّتِي ظَهَرَتْ فَالظَّاهِرُ هُوَ الله تَبَارَكَ وَتَعَالَى وَسَخَّرَ سُبْحَانَهُ لِكُلِّ اسْمٍ مِنْ هَذِهِ الاسْمَاءِ أَرْبَعَةَ أَرْكَانٍ فَذَلِكَ اثْنَا عَشَرَ رُكْناً ثُمَّ خَلَقَ لِكُلِّ رُكْنٍ مِنْهَا ثَلاثِينَ اسْماً فِعْلاً مَنْسُوباً إِلَيْهَا فَهُوَ الرَّحْمَنُ الرَّحِيمُ الْمَلِكُ الْقُدُّوسُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ الْحَيُّ الْقَيُّومُ لا تَأْخُذُهُ سِنَةٌ وَلا نَوْمٌ الْعَلِيمُ الْخَبِيرُ السَّمِيعُ الْبَصِيرُ الْحَكِيمُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ الْعَلِيُّ الْعَظِيمُ الْمُقْتَدِرُ الْقَادِرُ السَّلامُ الْمُؤْمِنُ الْمُهَيْمِنُ الْبَارِئُ الْمُنْشِئُ الْبَدِيعُ الرَّفِيعُ الْجَلِيلُ الْكَرِيمُ الرَّازِقُ الْمُحْيِي الْمُمِيتُ الْبَاعِثُ الْوَارِثُ فَهَذِهِ الاسْمَاءُ وَمَا كَانَ مِنَ الاسْمَاءِ الْحُسْنَى حَتَّى تَتِمَّ ثَلاثَ مِائَةٍ وَسِتِّينَ اسْماً فَهِيَ نِسْبَةٌ لِهَذِهِ الاسْمَاءِ الثَّلاثَةِ وَهَذِهِ الاسْمَاءُ الثَّلاثَةُ أَرْكَانٌ وَحَجَبَ الاسْمَ الْوَاحِدَ الْمَكْنُونَ الْمَخْزُونَ بِهَذِهِ الاسْمَاءِ الثَّلاثَةِ وَذَلِكَ قَوْلُهُ تَعَالَى قُلِ ادْعُوا الله أَوِ ادْعُوا الرَّحْمنَ أَيًّا ما تَدْعُوا فَلَهُ الاسْماءُ الْحُسْنى‏.",
            "englishTranslation": "1. Ali ibn Muhammad has narrated from Salih ibn abu Hammad from al-Husayn ibn Yazid from al-Hassan ibn Ali ibn abu Hamzah from Ibrahim ibn ‘Umar from abu ‘Abdallah , who has said the following. “Allah, the Most Holy, the Most High, created a name with letters that had no sound. He created it with the word that would not be spoken. He created it with a personality that had no body. It had a similarity that is not described. He created it with color that is colorless. Diameters were negated from it. Limitations were distanced away from it. The feel of all Mutawahhim (intuitive sense) is curtained from it. It is hidden but not covered. He placed it to be a perfect word consisting of four parts together. No one of them is before the other. From these He made public only three names because people desperately needed them. One of them is kept out of public sight. This is the protected and treasured name. The names that became public is Allah, the Most Holy, the Most High. He, the Most Glorious, for each of these made four subservient key elements that formed twelve key elements. Then for each key element He created thirty key elements to indicate an action ascribed to the four key elements. He, therefore, is Al-Rahman (The All compassionate); al-Rahim (The All merciful); al-Malik (The King); al-Quddus (The Holy); al-Khaliq (The Creator); al-Bari’ (The Maker); al-Musawwir (The Fashioner); al-Hayy (The Ever living); al-Qayyum (The Self-subsistent). Neither slumber nor sleep seizes Him. Al-’Alim (The All-knowing); al-Khabir (The All-aware); as-Sami‘ (The All-hearing); al-Basir (The All-seeing); al-Hakim (The All-wise); al-‘Aziz (The All-Majestic); al-Jabbar (The All-compeller); al-Mutakabbir (The All- sublime); al-‘Aliyy (The Most High); al-‘Azim (The All-Great); al-Muqtadir (The All-Dominant); al-Qadir (The All-capable); Al-Salam (The All peaceable); al-Mu’min (The All-protector); al-Muhaymin (The All-preserver); al-Munshi’ (The All-inventor) al-Badi‘ (The All-originator); al-Rafi‘ (The Exalter); al-Jalil (The Majestic); al-Karim (The Generous); al-Raziq (The All-provider); al-Muhyi (The Bestower of Life); al-Mumit (The Inflictor of death); al-Ba‘ith (The Resurrector); al-Warith (The Inheriter). These names in addition to the (Asma’ al-Husna) beautiful names make them three hundred sixty names. Such is the ratio of these three names. These three names are key element names. Only one name is kept out of public sight, protected and treasured with these three names. Thus, Allah has said, “Say, call Allah or al-Rahman. Call whichever you call. For Him there are beautiful names. (17:110) from each were I by letter, nor expressed by word, nor manifested by baby, nor indicated by similitude, nor emblazoned by colour. Negated from Annit are all dimensions, removed from it all limits, inaccessible is it to the sensations of every sensate being, and veiled is it without any veil. Allah made it one all comprehensive Word, with four constituents contiguous, immediate, without one being after the other. Three out of the four were made manifest, since creation was most in need of them, and one has been concealed, the ineffable, the occult Name. Of the (three) Names that have been made manifest, their manifestation is Allah’—the Hallowed, the Exalted. To each one of these (three) Names, Allah, the Exalted, subordinated four ’Supports’. Thus, they have all become twelve ’supports’ in number. Then Allah created thirty Names in respect of every support according to (His different) actions. These names are: Al-Rahman (The All-compassionate); ar-Rahim (The All-merciful); al-Malik (The Lord); al-Quddus (The All-holy); al-Khiliq (The Creator); al-B&ri’ ( The Maker); al-Musawwir (The Fashioner); al-.Hayy (The Ever living); al-Qayyam (The Selfsubsistent); ’Whom slumber seize Him not, neither sleep’; al- !41im ( The All-knowing); al-Khabur ( The All-aware); as-Sami ’ ( The Allhearing); al-Basir (The All-seeing); al-Hakim (The All-wise); al->lziz (The All-mighty); al-Jabbar (The All-compeller); al-Mutakabbir (The All-sublime); al-Aliyy (The All-high); al-!Azim (The All-glorious); al-Muqtadir ( The All-omnipotent); al-Qddir ( The All-powerful); as-Saldm (The All-peaceable); al-Mu’min (The All-faithful); al-Muhaymin (The All-preserver); al-Munshi’ (The All-evolver) al-Badi’ (The All-originator);ar-Rafi’ (The Exalter);al-Jalil (The Majestic);al-Karim (The Generous); ar-R§ziq (The All-sustainer); al-MuRyi (The Bestower of Life); al-Mumit (The Inflictor of death); al-Ba’ith (The Resurrector); al-W6rith (The Inheriter). “These names along with the other Beautiful and Good Names come to a total of three hundred and sixty names. They all branch forth from the original three which are the three supports. And that one ineffable occult name became concealed through these three names. This is what Allah, the Sublime, has said, ’Say, call upon Allah, or call upon ’ar-Rahmdn’ (the Compassionate); whichsoever you call upon, to Him (alone) belongs the name most Beautiful. ’ (al-Isrd’, 17: 110)” Al-‘Allamah al-Majlisi has said the following about the above Hadith, “Among its narrators, there are unknown people. The Hadith itself is not clear. Its meaning is an indefinable secret. No one knows its interpretation except Allah and those firmly rooted in knowledge. Therefore, to remain silent in its interpretation and to confess failure in understanding its meaning is most righteous, worthwhile and suitable to precaution. (Mir’at al-‘uqul, vol.2, p.24)",
            "gradings": [
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              },
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/24)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "16": {
        "Al-Kafi - Volume 1: Chapter On The Meanings of the Names of Allah and their Derivatives": [
          {
            "number": "Hadith #6",
            "url": "https://thaqalayn.net/hadith/1/3/16/6",
            "arabicText": "6ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ أُذَيْنَةَ عَنْ مُحَمَّدِ بْنِ حَكِيمٍ عَنْ مَيْمُونٍ الْبَانِ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) وَقَدْ سُئِلَ عَنِ الاوَّلِ وَالاخِرِ فَقَالَ الاوَّلُ لا عَنْ أَوَّلٍ قَبْلَهُ وَلا عَنْ بَدْءٍ سَبَقَهُ وَالاخِرُ لا عَنْ نِهَايَةٍ كَمَا يُعْقَلُ مِنْ صِفَةِ الْمَخْلُوقِينَ وَلَكِنْ قَدِيمٌ أَوَّلٌ آخِرٌ لَمْ يَزَلْ وَلا يَزُولُ بِلا بَدْءٍ وَلا نِهَايَةٍ لا يَقَعُ عَلَيْهِ الْحُدُوثُ وَلا يَحُولُ مِنْ حَالٍ إِلَى حَالٍ خَالِقُ كُلِّ شَيْ‏ءٍ.",
            "englishTranslation": "6. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from ibn ’Udhaynah from Muhammad ibn Hakim from Maymun al-Ban who has said the following. “I heard abu ‘Abdallah  saying to a question about Allah being the first and the last.” The Imam replied, “His being the first means there was no first before Him and no beginning preceded Him at all. His being the last means that He has no end because it is an attribute of the created and He is eternal, the first and the last. He has always been and He will always be without any beginning and any end. Nothing new happens to Him and does not change from one state to another. He is the Creator of all things.”",
            "gradings": [
              {
                "grade": "صحيح",
                "book": "Sahih al-Kafi (1/17)",
                "author": "Shaykh Baqir al-Behbudi"
              },
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/41)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #9",
            "url": "https://thaqalayn.net/hadith/1/3/16/9",
            "arabicText": "9ـ وَرَوَاهُ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مَرْوَكِ بْنِ عُبَيْدٍ عَنْ جُمَيْعِ بْنِ عُمَيْرٍ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) أَيُّ شَيْ‏ءٍ الله أَكْبَرُ فَقُلْتُ الله أَكْبَرُ مِنْ كُلِّ شَيْ‏ءٍ فَقَالَ وَكَانَ ثَمَّ شَيْ‏ءٌ فَيَكُونُ أَكْبَرَ مِنْهُ فَقُلْتُ وَمَا هُوَ قَالَ الله أَكْبَرُ مِنْ أَنْ يُوصَفَ.",
            "englishTranslation": "9. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Marwak ibn ‘Ubayd from Jumay’ ibn ‘Umayr who has said the following. “Imam abu ‘Abdallah  asked me, ‘What is Allah is Greatest?” I replied, “Allah is Greatest of all things.” The Imam further asked, “Were there other things so Allah would be considered the greatest of them?” I then asked, “What then is the meaning thereof?”’ The Imam replied, “Allah is far greater than all descriptions.”",
            "gradings": [
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (48/ 2)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          }
        ]
      },
      "17": {
        "Al-Kafi - Volume 1: Chapter on Another Chapter (Related) to the Previous Chapter": [
          {
            "number": "Hadith #1",
            "url": "https://thaqalayn.net/hadith/1/3/17/1",
            "arabicText": "1ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنِ الْمُخْتَارِ بْنِ مُحَمَّدِ بْنِ الْمُخْتَارِ الْهَمْدَانِيِّ وَمُحَمَّدُ بْنُ الْحَسَنِ عَنْ عَبْدِ الله بْنِ الْحَسَنِ الْعَلَوِيِّ جَمِيعاً عَنِ الْفَتْحِ بْنِ يَزِيدَ الْجُرْجَانِيِّ عَنْ أَبِي الْحَسَنِ (عَلَيْهِ السَّلام) قَالَ سَمِعْتُهُ يَقُولُ وَهُوَ اللَّطِيفُ الْخَبِيرُ السَّمِيعُ الْبَصِيرُ الْوَاحِدُ الاحَدُ الصَّمَدُ لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ لَوْ كَانَ كَمَا يَقُولُ الْمُشَبِّهَةُ لَمْ يُعْرَفِ الْخَالِقُ مِنَ الْمَخْلُوقِ وَلا الْمُنْشِئُ مِنَ الْمُنْشَإِ لَكِنَّهُ الْمُنْشِئُ فَرْقٌ بَيْنَ مَنْ جَسَّمَهُ وَصَوَّرَهُ وَأَنْشَأَهُ إِذْ كَانَ لا يُشْبِهُهُ شَيْ‏ءٌ وَلا يُشْبِهُ هُوَ شَيْئاً قُلْتُ أَجَلْ جَعَلَنِيَ الله فِدَاكَ لَكِنَّكَ قُلْتَ الاحَدُ الصَّمَدُ وَقُلْتَ لا يُشْبِهُهُ شَيْ‏ءٌ وَالله وَاحِدٌ وَالانْسَانُ وَاحِدٌ أَ لَيْسَ قَدْ تَشَابَهَتِ الْوَحْدَانِيَّةُ قَالَ يَا فَتْحُ أَحَلْتَ ثَبَّتَكَ الله إِنَّمَا التَّشْبِيهُ فِي الْمَعَانِي فَأَمَّا فِي الاسْمَاءِ فَهِيَ وَاحِدَةٌ وَهِيَ دَالَّةٌ عَلَى الْمُسَمَّى وَذَلِكَ أَنَّ الانْسَانَ وَإِنْ قِيلَ وَاحِدٌ فَإِنَّهُ يُخْبَرُ أَنَّهُ جُثَّةٌ وَاحِدَةٌ وَلَيْسَ بِاثْنَيْنِ وَالانْسَانُ نَفْسُهُ لَيْسَ بِوَاحِدٍ لانَّ أَعْضَاءَهُ مُخْتَلِفَةٌ وَأَلْوَانَهُ مُخْتَلِفَةٌ وَمَنْ أَلْوَانُهُ مُخْتَلِفَةٌ غَيْرُ وَاحِدٍ وَهُوَ أَجْزَاءٌ مُجَزَّاةٌ لَيْسَتْ بِسَوَاءٍ دَمُهُ غَيْرُ لَحْمِهِ وَلَحْمُهُ غَيْرُ دَمِهِ وَعَصَبُهُ غَيْرُ عُرُوقِهِ وَشَعْرُهُ غَيْرُ بَشَرِهِ وَسَوَادُهُ غَيْرُ بَيَاضِهِ وَكَذَلِكَ سَائِرُ جَمِيعِ الْخَلْقِ فَالانْسَانُ وَاحِدٌ فِي الاسْمِ وَلا وَاحِدٌ فِي الْمَعْنَى وَالله جَلَّ جَلالُهُ هُوَ وَاحِدٌ لا وَاحِدَ غَيْرُهُ لا اخْتِلافَ فِيهِ وَلا تَفَاوُتَ وَلا زِيَادَةَ وَلا نُقْصَانَ فَأَمَّا الانْسَانُ الْمَخْلُوقُ الْمَصْنُوعُ الْمُؤَلَّفُ مِنْ أَجْزَاءٍ مُخْتَلِفَةٍ وَجَوَاهِرَ شَتَّى غَيْرَ أَنَّهُ بِالاجْتِمَاعِ شَيْ‏ءٌ وَاحِدٌ قُلْتُ جُعِلْتُ فِدَاكَ فَرَّجْتَ عَنِّي فَرَّجَ الله عَنْكَ فَقَوْلَكَ اللَّطِيفُ الْخَبِيرُ فَسِّرْهُ لِي كَمَا فَسَّرْتَ الْوَاحِدَ فَإِنِّي أَعْلَمُ أَنَّ لُطْفَهُ عَلَى خِلافِ لُطْفِ خَلْقِهِ لِلْفَصْلِ غَيْرَ أَنِّي أُحِبُّ أَنْ تَشْرَحَ ذَلِكَ لِي فَقَالَ يَا فَتْحُ إِنَّمَا قُلْنَا اللَّطِيفُ لِلْخَلْقِ اللَّطِيفِ وَلِعِلْمِهِ بِالشَّيْ‏ءِ اللَّطِيفِ أَ وَلا تَرَى وَفَّقَكَ الله وَثَبَّتَكَ إِلَى أَثَرِ صُنْعِهِ فِي النَّبَاتِ اللَّطِيفِ وَغَيْرِ اللَّطِيفِ وَمِنَ الْخَلْقِ اللَّطِيفِ وَمِنَ الْحَيَوَانِ الصِّغَارِ وَمِنَ الْبَعُوضِ وَالْجِرْجِسِ وَمَا هُوَ أَصْغَرُ مِنْهَا مَا لا يَكَادُ تَسْتَبِينُهُ الْعُيُونُ بَلْ لا يَكَادُ يُسْتَبَانُ لِصِغَرِهِ الذَّكَرُ مِنَ الانْثَى وَالْحَدَثُ الْمَوْلُودُ مِنَ الْقَدِيمِ فَلَمَّا رَأَيْنَا صِغَرَ ذَلِكَ فِي لُطْفِهِ وَاهْتِدَاءَهُ لِلسَّفَادِ وَالْهَرَبَ مِنَ الْمَوْتِ وَالْجَمْعَ لِمَا يُصْلِحُهُ وَمَا فِي لُجَجِ الْبِحَارِ وَمَا فِي لِحَاءِ الاشْجَارِ وَالْمَفَاوِزِ وَالْقِفَارِ وَإِفْهَامَ بَعْضِهَا عَنْ بَعْضٍ مَنْطِقَهَا وَمَا يَفْهَمُ بِهِ أَوْلادُهَا عَنْهَا وَنَقْلَهَا الْغِذَاءَ إِلَيْهَا ثُمَّ تَأْلِيفَ أَلْوَانِهَا حُمْرَةٍ مَعَ صُفْرَةٍ وَبَيَاضٍ مَعَ حُمْرَةٍ وَأَنَّهُ مَا لا تَكَادُ عُيُونُنَا تَسْتَبِينُهُ لِدَمَامَةِ خَلْقِهَا لا تَرَاهُ عُيُونُنَا وَلا تَلْمِسُهُ أَيْدِينَا عَلِمْنَا أَنَّ خَالِقَ هَذَا الْخَلْقِ لَطِيفٌ لَطُفَ بِخَلْقِ مَا سَمَّيْنَاهُ بِلا عِلاجٍ وَلا أَدَاةٍ وَلا آلَةٍ وَأَنَّ كُلَّ صَانِعِ شَيْ‏ءٍ فَمِنْ شَيْ‏ءٍ صَنَعَ وَالله الْخَالِقُ اللَّطِيفُ الْجَلِيلُ خَلَقَ وَصَنَعَ لا مِنْ شَيْ‏ءٍ.",
            "englishTranslation": "1. Ali ibn Ibrahim has narrated from al-Mukhtar ibn Muhammad ibn al-Mukhtar al-Hamadani and Muhammad ibn al-Hassan from ‘Abdallah ibn al-Hassan al-‘Alawi both of them from al-Fath ibn Yazid al-Jurjani from abu al-Hassan  al-Thani or al-Thalith who has said the following. “I heard the Imam saying, ‘He (Allah) is the Subtle, All-aware, All-hearing, All-seeing, the One, the Self-sufficient, Who does not have any children, is not any one’s child and there is no one similar to Him. Had Allah been as those believing in similitude (al-Mushabbihah) say there would have been no distinction between the Creator and the created, the inventor and the invented but He is the Inventor. There would have been no distinction between Allah and what He has given body and form to bring into existence. In fact, nothing is similar to Him and He is not similar to anything.” I then said, “Yes, may Allah take my soul in your service, but you just said, The One the Self-sufficient, that no one is similar to Him. Allah is One and a man is one. Are the two not similar in oneness?” The Imam replied, “O Fath, you said something impossible. May Allah grant you steadfastness. Similarity is in meaning. In the case of names they are all the same. The names refer to the nominee. When it is said a man it, at the same time, is a report about one body and not two bodies. In fact, man is not one thing. His parts, colors and the color of his colors that consist of distinct parts, that are not equal. His blood is different from his flesh. His nerves are different from his vines, his hairs are different from his skin. The black things in him are different from the white things therein. The same is true of all other creatures. Human beings are one in name but not in meaning. Allah, Great Whose Majesty is, is only One and no one other than Him is one. There is no difference, imbalance, increase or decrease in Him. Human beings are created, designed, compounded of different parts and various substances. Only when combined becomes one.” I then said, “May Allah take my soul in service for your cause, and grant you happiness, would you explain to me the meaning of your words “Subtle and All-aware? Explain it as you just did with the One? I know that His Subtlety or kindness is different from those of His creatures but I like more clarity.” The Imam said, “O Fath, we said He is Subtle it is because of His knowledge of the delicate creatures, may Allah give you success and steadfastness, so you should consider His creation. Consider His design in delicate and not so delicate plants and other creatures like animals, small and large such as flies and cricket and smaller ones that even eyes can not. Because of their small size no one knows which is male and which is female, which is new born and which is old. We find tremendously delicate things with signs of His Subtlety, in their desire for reproduction, running away from death, collecting what is good for them and what is in the depth of the oceans and on the barks of trees, in the wilderness and desolate places. We find more fastidiousness in such animals and their ability to communicate with each other, and what their offspring understand from them, their transporting food to their young and their colors, red along with yellow, white along with red so fine that our eyes are not able to catch for their very exquisite shape. Our eyes are not able to see them and our hands are not able to touch them. All these show that the Creator of all such marvelous creatures are Subtle Who is kind to all the creatures we mentioned. He has done it without instruments and means. Every designer and manufacturer builds and manufactures some thing from something but Allah does it from nothing.”",
            "gradings": [
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (50/ 2)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          },
          {
            "number": "Hadith #2",
            "url": "https://thaqalayn.net/hadith/1/3/17/2",
            "arabicText": "2ـ عَلِيُّ بْنُ مُحَمَّدٍ مُرْسَلاً عَنْ أَبِي الْحَسَنِ الرِّضَا (عَلَيْهِ السَّلام) قَالَ قَالَ اعْلَمْ عَلَّمَكَ الله الْخَيْرَ أَنَّ الله تَبَارَكَ وَتَعَالَى قَدِيمٌ وَالْقِدَمُ صِفَتُهُ الَّتِي دَلَّتِ الْعَاقِلَ عَلَى أَنَّهُ لا شَيْ‏ءَ قَبْلَهُ وَلا شَيْ‏ءَ مَعَهُ فِي دَيْمُومِيَّتِهِ فَقَدْ بَانَ لَنَا بِإِقْرَارِ الْعَامَّةِ مُعْجِزَةُ الصِّفَةِ أَنَّهُ لا شَيْ‏ءَ قَبْلَ الله وَلا شَيْ‏ءَ مَعَ الله فِي بَقَائِهِ وَبَطَلَ قَوْلُ مَنْ زَعَمَ أَنَّهُ كَانَ قَبْلَهُ أَوْ كَانَ مَعَهُ شَيْ‏ءٌ وَذَلِكَ أَنَّهُ لَوْ كَانَ مَعَهُ شَيْ‏ءٌ فِي بَقَائِهِ لَمْ يَجُزْ أَنْ يَكُونَ خَالِقاً لَهُ لانَّهُ لَمْ يَزَلْ مَعَهُ فَكَيْفَ يَكُونُ خَالِقاً لِمَنْ لَمْ يَزَلْ مَعَهُ وَلَوْ كَانَ قَبْلَهُ شَيْ‏ءٌ كَانَ الاوَّلَ ذَلِكَ الشَّيْ‏ءُ لا هَذَا وَكَانَ الاوَّلُ أَوْلَى بِأَنْ يَكُونَ خَالِقاً لِلاوَّلِ ثُمَّ وَصَفَ نَفْسَهُ تَبَارَكَ وَتَعَالَى بِأَسْمَاءٍ دَعَا الْخَلْقَ إِذْ خَلَقَهُمْ وَتَعَبَّدَهُمْ وَابْتَلاهُمْ إِلَى أَنْ يَدْعُوهُ بِهَا فَسَمَّى نَفْسَهُ سَمِيعاً بَصِيراً قَادِراً قَائِماً نَاطِقاً ظَاهِراً بَاطِناً لَطِيفاً خَبِيراً قَوِيّاً عَزِيزاً حَكِيماً عَلِيماً وَمَا أَشْبَهَ هَذِهِ الاسْمَاءَ فَلَمَّا رَأَى ذَلِكَ مِنْ أَسْمَائِهِ الْقَالُونَ الْمُكَذِّبُونَ وَقَدْ سَمِعُونَا نُحَدِّثُ عَنِ الله أَنَّهُ لا شَيْ‏ءَ مِثْلُهُ وَلا شَيْ‏ءَ مِنَ الْخَلْقِ فِي حَالِهِ قَالُوا أَخْبِرُونَا إِذَا زَعَمْتُمْ أَنَّهُ لا مِثْلَ لله وَلا شِبْهَ لَهُ كَيْفَ شَارَكْتُمُوهُ فِي أَسْمَائِهِ الْحُسْنَى فَتَسَمَّيْتُمْ بِجَمِيعِهَا فَإِنَّ فِي ذَلِكَ دَلِيلاً عَلَى أَنَّكُمْ مِثْلُهُ فِي حَالاتِهِ كُلِّهَا أَوْ فِي بَعْضِهَا دُونَ بَعْضٍ إِذْ جَمَعْتُمُ الاسْمَاءَ الطَّيِّبَةَ قِيلَ لَهُمْ إِنَّ الله تَبَارَكَ وَتَعَالَى أَلْزَمَ الْعِبَادَ أَسْمَاءً مِنْ أَسْمَائِهِ عَلَى اخْتِلافِ الْمَعَانِي وَذَلِكَ كَمَا يَجْمَعُ الاسْمُ الْوَاحِدُ مَعْنَيَيْنِ مُخْتَلِفَيْنِ وَالدَّلِيلُ عَلَى ذَلِكَ قَوْلُ النَّاسِ الْجَائِزُ عِنْدَهُمُ الشَّائِعُ وَهُوَ الَّذِي خَاطَبَ الله بِهِ الْخَلْقَ فَكَلَّمَهُمْ بِمَا يَعْقِلُونَ لِيَكُونَ عَلَيْهِمْ حُجَّةً فِي تَضْيِيعِ مَا ضَيَّعُوا فَقَدْ يُقَالُ لِلرَّجُلِ كَلْبٌ وَحِمَارٌ وَثَوْرٌ وَسُكَّرَةٌ وَعَلْقَمَةٌ وَأَسَدٌ كُلُّ ذَلِكَ عَلَى خِلافِهِ وَحَالاتِهِ لَمْ تَقَعِ الاسَامِي عَلَى مَعَانِيهَا الَّتِي كَانَتْ بُنِيَتْ عَلَيْهِ لانَّ الانْسَانَ لَيْسَ بِأَسَدٍ وَلا كَلْبٍ فَافْهَمْ ذَلِكَ رَحِمَكَ الله وَإِنَّمَا سُمِّيَ الله تَعَالَى بِالْعِلْمِ بِغَيْرِ عِلْمٍ حَادِثٍ عَلِمَ بِهِ الاشْيَاءَ اسْتَعَانَ بِهِ عَلَى حِفْظِ مَا يُسْتَقْبَلُ مِنْ أَمْرِهِ وَالرَّوِيَّةِ فِيمَا يَخْلُقُ مِنْ خَلْقِهِ وَيُفْسِدُ مَا مَضَى مِمَّا أَفْنَى مِنْ خَلْقِهِ مِمَّا لَوْ لَمْ يَحْضُرْهُ ذَلِكَ الْعِلْمُ وَيَغِيبُهُ كَانَ جَاهِلاً ضَعِيفاً كَمَا أَنَّا لَوْ رَأَيْنَا عُلَمَاءَ الْخَلْقِ إِنَّمَا سُمُّوا بِالْعِلْمِ لِعِلْمٍ حَادِثٍ إِذْ كَانُوا فِيهِ جَهَلَةً وَرُبَّمَا فَارَقَهُمُ الْعِلْمُ بِالاشْيَاءِ فَعَادُوا إِلَى الْجَهْلِ وَإِنَّمَا سُمِّيَ الله عَالِماً لانَّهُ لا يَجْهَلُ شَيْئاً فَقَدْ جَمَعَ الْخَالِقَ وَالْمَخْلُوقَ اسْمُ الْعَالِمِ وَاخْتَلَفَ الْمَعْنَى عَلَى مَا رَأَيْتَ وَسُمِّيَ رَبُّنَا سَمِيعاً لا بِخَرْتٍ فِيهِ يَسْمَعُ بِهِ الصَّوْتَ وَلا يُبْصِرُ بِهِ كَمَا أَنَّ خَرْتَنَا الَّذِي بِهِ نَسْمَعُ لا نَقْوَى بِهِ عَلَى الْبَصَرِ وَلَكِنَّهُ أَخْبَرَ أَنَّهُ لا يَخْفَى عَلَيْهِ شَيْ‏ءٌ مِنَ الاصْوَاتِ لَيْسَ عَلَى حَدِّ مَا سُمِّينَا نَحْنُ فَقَدْ جَمَعْنَا الاسْمَ بِالسَّمْعِ وَاخْتَلَفَ الْمَعْنَى وَهَكَذَا الْبَصَرُ لا بِخَرْتٍ مِنْهُ أَبْصَرَ كَمَا أَنَّا نُبْصِرُ بِخَرْتٍ مِنَّا لا نَنْتَفِعُ بِهِ فِي غَيْرِهِ وَلَكِنَّ الله بَصِيرٌ لا يَحْتَمِلُ شَخْصاً مَنْظُوراً إِلَيْهِ فَقَدْ جَمَعْنَا الاسْمَ وَاخْتَلَفَ الْمَعْنَى وَهُوَ قَائِمٌ لَيْسَ عَلَى مَعْنَى انْتِصَابٍ وَقِيَامٍ عَلَى سَاقٍ فِي كَبَدٍ كَمَا قَامَتِ الاشْيَاءُ وَلَكِنْ قَائِمٌ يُخْبِرُ أَنَّهُ حَافِظٌ كَقَوْلِ الرَّجُلِ الْقَائِمُ بِأَمْرِنَا فُلانٌ وَالله هُوَ الْقَائِمُ عَلَى كُلِّ نَفْسٍ بِمَا كَسَبَتْ وَالْقَائِمُ أَيْضاً فِي كَلامِ النَّاسِ الْبَاقِي وَالْقَائِمُ أَيْضاً يُخْبِرُ عَنِ الْكِفَايَةِ كَقَوْلِكَ لِلرَّجُلِ قُمْ بِأَمْرِ بَنِي فُلانٍ أَيِ اكْفِهِمْ وَالْقَائِمُ مِنَّا قَائِمٌ عَلَى سَاقٍ فَقَدْ جَمَعْنَا الاسْمَ وَلَمْ نَجْمَعِ الْمَعْنَى وَأَمَّا اللَّطِيفُ فَلَيْسَ عَلَى قِلَّةٍ وَقَضَافَةٍ وَصِغَرٍ وَلَكِنْ ذَلِكَ عَلَى النَّفَاذِ فِي الاشْيَاءِ وَالامْتِنَاعِ مِنْ أَنْ يُدْرَكَ كَقَوْلِكَ لِلرَّجُلِ لَطُفَ عَنِّي هَذَا الامْرُ وَلَطُفَ فُلانٌ فِي مَذْهَبِهِ وَقَوْلِهِ يُخْبِرُكَ أَنَّهُ غَمَضَ فِيهِ الْعَقْلُ وَفَاتَ الطَّلَبُ وَعَادَ مُتَعَمِّقاً مُتَلَطِّفاً لا يُدْرِكُهُ الْوَهْمُ فَكَذَلِكَ لَطُفَ الله تَبَارَكَ وَتَعَالَى عَنْ أَنْ يُدْرَكَ بِحَدٍّ أَوْ يُحَدَّ بِوَصْفٍ وَاللَّطَافَةُ مِنَّا الصِّغَرُ وَالْقِلَّةُ فَقَدْ جَمَعْنَا الاسْمَ وَاخْتَلَفَ الْمَعْنَى وَأَمَّا الْخَبِيرُ فَالَّذِي لا يَعْزُبُ عَنْهُ شَيْ‏ءٌ وَلا يَفُوتُهُ لَيْسَ لِلتَّجْرِبَةِ وَلا لِلاعْتِبَارِ بِالاشْيَاءِ فَعِنْدَ التَّجْرِبَةِ وَالاعْتِبَارِ عِلْمَانِ وَلَوْ لا هُمَا مَا عُلِمَ لانَّ مَنْ كَانَ كَذَلِكَ كَانَ جَاهِلاً وَالله لَمْ يَزَلْ خَبِيراً بِمَا يَخْلُقُ وَالْخَبِيرُ مِنَ النَّاسِ الْمُسْتَخْبِرُ عَنْ جَهْلٍ الْمُتَعَلِّمُ فَقَدْ جَمَعْنَا الاسْمَ وَاخْتَلَفَ الْمَعْنَى وَأَمَّا الظَّاهِرُ فَلَيْسَ مِنْ أَجْلِ أَنَّهُ عَلا الاشْيَاءَ بِرُكُوبٍ فَوْقَهَا وَقُعُودٍ عَلَيْهَا وَتَسَنُّمٍ لِذُرَاهَا وَلَكِنْ ذَلِكَ لِقَهْرِهِ وَلِغَلَبَتِهِ الاشْيَاءَ وَقُدْرَتِهِ عَلَيْهَا كَقَوْلِ الرَّجُلِ ظَهَرْتُ عَلَى أَعْدَائِي وَأَظْهَرَنِي الله عَلَى خَصْمِي يُخْبِرُ عَنِ الْفَلْجِ وَالْغَلَبَةِ فَهَكَذَا ظُهُورُ الله عَلَى الاشْيَاءِ وَوَجْهٌ آخَرُ أَنَّهُ الظَّاهِرُ لِمَنْ أَرَادَهُ وَلا يَخْفَى عَلَيْهِ شَيْ‏ءٌ وَأَنَّهُ مُدَبِّرٌ لِكُلِّ مَا بَرَأَ فَأَيُّ ظَاهِرٍ أَظْهَرُ وَأَوْضَحُ مِنَ الله تَبَارَكَ وَتَعَالَى لانَّكَ لا تَعْدَمُ صَنْعَتَهُ حَيْثُمَا تَوَجَّهَتْ وَفِيكَ مِنْ آثَارِهِ مَا يُغْنِيكَ وَالظَّاهِرُ مِنَّا الْبَارِزُ بِنَفْسِهِ وَالْمَعْلُومُ بِحَدِّهِ فَقَدْ جَمَعَنَا الاسْمُ وَلَمْ يَجْمَعْنَا الْمَعْنَى وَأَمَّا الْبَاطِنُ فَلَيْسَ عَلَى مَعْنَى الاسْتِبْطَانِ لِلاشْيَاءِ بِأَنْ يَغُورَ فِيهَا وَلَكِنْ ذَلِكَ مِنْهُ عَلَى اسْتِبْطَانِهِ لِلاشْيَاءِ عِلْماً وَحِفْظاً وَتَدْبِيراً كَقَوْلِ الْقَائِلِ أَبْطَنْتُهُ يَعْنِي خَبَّرْتُهُ وَعَلِمْتُ مَكْتُومَ سِرِّهِ وَالْبَاطِنُ مِنَّا الْغَائِبُ فِي الشَّيْ‏ءِ الْمُسْتَتِرُ وَقَدْ جَمَعْنَا الاسْمَ وَاخْتَلَفَ الْمَعْنَى وَأَمَّا الْقَاهِرُ فَلَيْسَ عَلَى مَعْنَى عِلاجٍ وَنَصَبٍ وَاحْتِيَالٍ وَمُدَارَاةٍ وَمَكْرٍ كَمَا يَقْهَرُ الْعِبَادُ بَعْضُهُمْ بَعْضاً وَالْمَقْهُورُ مِنْهُمْ يَعُودُ قَاهِراً وَالْقَاهِرُ يَعُودُ مَقْهُوراً وَلَكِنْ ذَلِكَ مِنَ الله تَبَارَكَ وَتَعَالَى عَلَى أَنَّ جَمِيعَ مَا خَلَقَ مُلَبَّسٌ بِهِ الذُّلُّ لِفَاعِلِهِ وَقِلَّةُ الامْتِنَاعِ لِمَا أَرَادَ بِهِ لَمْ يَخْرُجْ مِنْهُ طَرْفَةَ عَيْنٍ أَنْ يَقُولَ لَهُ كُنْ فَيَكُونُ وَالْقَاهِرُ مِنَّا عَلَى مَا ذَكَرْتُ وَوَصَفْتُ فَقَدْ جَمَعْنَا الاسْمَ وَاخْتَلَفَ الْمَعْنَى وَهَكَذَا جَمِيعُ الاسْمَاءِ وَإِنْ كُنَّا لَمْ نَسْتَجْمِعْهَا كُلَّهَا فَقَدْ يَكْتَفِي الاعْتِبَارُ بِمَا أَلْقَيْنَا إِلَيْكَ وَالله عَوْنُكَ وَعَوْنُنَا فِي إِرْشَادِنَا وَتَوْفِيقِنَا.",
            "englishTranslation": "2. It is narrated from Ali ibn Muhammad, in a mursal manner, from abu al-Hassan al-Rida  who has said the following to one of his followers. “May Allah, bestow up on you knowledge of the good, notice that Allah, the Most Holy, the Most High, is eternal. Eternity is that attribute which guides the wise that there was nothing before Him in eternity nor is there anything with Him eternal. That this attribute is a miraculous one has come to light from the acknowledgement of the ‘Ammah (common people) that there is nothing before Allah, with and after Him. At the same time, it invalidates the belief that there was something before or with Him. Had there been something with Him eternal He would not have been the Creator of that thing. If it was with Him how then He could have been its creator? Had there been something before Him then that thing might have been His creator because of its existing earlier. Allah, the Most Holy, the Exalted, has ascribed certain names to Himself. He told His creatures when He created them, give them the ability to worship Him and made them responsible, to call Him with those names. He called Himself All-hearing, All-seeing, All-powerful, Guarding, Rationalizing, Manifest, Hidden, Subtle, All-aware, Powerful, Majestic, Wise, All-knowing and with such other similar names. When the animosity-mongers, who speak lies heard us mention such names as that there is nothing similar to Him and nothing of the creatures is like Him they began to speak out. “When you (the Imams  say that there is nothing like Him and no one is similar to Him then how is it that you also have those beautiful names for yourselves? This is proof that you are similar to Him or in certain conditions and not in other conditions because of having all those beautiful names.” It is said to them that Allah, the Most Holy, the Most High, made it necessary for His servants to have certain names from among His names with differences in their meanings. The difference is because one name may have two different meanings. One example is what people consider permissible and is widely used. This is the way Allah has addressed people. He has spoken to them by means of things that they understand so that they will have no excuse in their misdeeds. A man is sometimes called a dog, a bull, sweet, bitter and a loin. All these are different from him and his conditions. The names were not used in their original meaning because man is not a loin or a dog etc. Note this carefully, may Allah grant you blessings. Allah is called All-knowing. It is other than the created knowledge. With His knowledge of things He knows things and uses it to preserve His future commands and the process of whatever He creates of His creatures, destroys what He destroys of His creatures and without such knowledge He would have been weak and ignorant. We see that people of knowledge among people are called knowledgeable because of the created knowledge, which they did not have at one time. Perhaps such knowledge may go away from them and they become ignorant. Allah is called All-knowing because He is not ignorant of anything. Thus, the Creator and created are both called as having knowledge but the meaning is different as you may have noticed. Our Lord is called All-hearing but it is not through the perforated piece and with sound so He would hear with it but would not see with it, which is the case with us. We do not see with what we hear but Allah has told us that from Him nothing of the sounds is hidden. His hearing is not in the way we are called as hearing people. We are called as hearing but the meaning is different. In the same way is seeing not that He sees through a hole as we do and can not use it for other uses. Allah sees but not by looking to an object. We also are called as seeing but the meaning is different. Allah is called Standing but not in the sense of standing in an upright position on the legs as is the case with the things but that He has said He is preserving as in the saying of a man, “standing for our affairs.” Allah stands over every soul and what it gains. The word standing is also in the usage of people. Words like remaining and standing also mean to suffice as in the words as you may say to a man, “Stand up over the affairs of so and so” which means deal with them in a sufficient manner. We stand on our legs, thus, the name is similar but the meaning is different. The name, Subtle is not in the sense of fastidiousness or being infinitesimal but it is in the rarity and hard to perceive nature of things. As an example it may be said, “It has become very delicate for me and that so and so is very delicate in his manners and dealings.” This means that it is profound for intelligence and difficult to find. It has become bottomless and delicate so much that even imagination is not able to reach it. Allah, the Most Holy, the Most High, is far Subtle to be comprehended through definitions or be combined in an attribute or in the way we are subtle, small and delicate. Names are the same but different in meaning. The name al-Khabir, meaning All-aware, is for One Who knows all things completely but not by means of experience and learning lessons from the past. Experience and learning from mistakes are of the means of learning for people. Without them there would exist no knowledge. One without experience and learning lessons is an ignorant person. Allah is All-aware eternally of what He has created but well aware and expert among people are those who ask questions and learn. Our names are the same but they, again, are different in meaning. The name al-Zahir meaning clear and conspicuous is not because of being over and on top of all things or sitting on them at their peak but it is because of His domination and having power over all things. An example of this is when a person says, “I over came my enemies or that Allah gave me victory over my enemies.” In this there is report of the failure and victory. Also there is Allah’s domination over all things. Another example is that His existence is clear for those who want (to know) Him. Nothing is hidden from Him and that He is the guardian of all that He has curved and fashioned. In such case whose existence can be clearer than Allah, the Most Holy, the Most High? You will not live without His creatures, no matter wherever you may be. Only within your own self there is enough of His creation. His existence by far is clearer than ours. He manifest all by His Own-self and is Known by His own self. We are of the same name but the meaning is different. The name al-Batin, means hidden. This is not in the sense of being inside of things by means of diving or so but is in the sense of His dealing, having knowledge, preserving and regulating the inside of all things. As one may say, “I tried to find the inside to learn and discover the secrets.” Hidden for us is what is unseen and covered. In this case again our names are the same but different in meaning. The name al-Qahir, means subduing. It is not in the sense of plotting, using certain devices and speaking attractive words or cunning means. It is not the way people subdue each other. The victorious among people may become subdued and vice versa. For Allah, the Most Holy, the Most High all the creatures have the garment of weakness on them. Due to the absence of obstacles in what He wills about them, it only takes less than a blinking of the eye to say it Be and it is, comes into existence. Subduing in our case is how I mentioned and explained. Our names are alike but the meaning is different. Thus, is the case for all the names although we have not mentioned all of them. For learning a lesson what we have mentioned for you is sufficient. May Allah be your and our helper in the matters of guidance and success.”",
            "gradings": [
              {
                "grade": "مرسل",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/54)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          }
        ]
      },
      "19": {
        "Al-Kafi - Volume 1: Chapter on Motion and Change": [
          {
            "number": "Hadith #3",
            "url": "https://thaqalayn.net/hadith/1/3/19/3",
            "arabicText": "3ـ وَعَنْهُ عَنْ مُحَمَّدِ بْنِ أَبِي عَبْدِ الله عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ دَاوُدَ بْنِ عَبْدِ الله عَنْ عَمْرِو بْنِ مُحَمَّدٍ عَنْ عِيسَى بْنِ يُونُسَ قَالَ قَالَ ابْنُ أَبِي الْعَوْجَاءِ لابِي عَبْدِ الله (عَلَيْهِ السَّلام) فِي بَعْضِ مَا كَانَ يُحَاوِرُهُ ذَكَرْتَ الله فَأَحَلْتَ عَلَى غَائِبٍ فَقَالَ أَبُو عَبْدِ الله وَيْلَكَ كَيْفَ يَكُونُ غَائِباً مَنْ هُوَ مَعَ خَلْقِهِ شَاهِدٌ وَإِلَيْهِمْ أَقْرَبُ مِنْ حَبْلِ الْوَرِيدِ يَسْمَعُ كَلامَهُمْ وَيَرَى أَشْخَاصَهُمْ وَيَعْلَمُ أَسْرَارَهُمْ فَقَالَ ابْنُ أَبِي الْعَوْجَاءِ أَ هُوَ فِي كُلِّ مَكَانٍ أَ لَيْسَ إِذَا كَانَ فِي السَّمَاءِ كَيْفَ يَكُونُ فِي الارْضِ وَإِذَا كَانَ فِي الارْضِ كَيْفَ يَكُونُ فِي السَّمَاءِ فَقَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) إِنَّمَا وَصَفْتَ الْمَخْلُوقَ الَّذِي إِذَا انْتَقَلَ عَنْ مَكَانٍ اشْتَغَلَ بِهِ مَكَانٌ وَخَلا مِنْهُ مَكَانٌ فَلا يَدْرِي فِي الْمَكَانِ الَّذِي صَارَ إِلَيْهِ مَا يَحْدُثُ فِي الْمَكَانِ الَّذِي كَانَ فِيهِ فَأَمَّا الله الْعَظِيمُ الشَّأْنِ الْمَلِكُ الدَّيَّانُ فَلا يَخْلُو مِنْهُ مَكَانٌ وَلا يَشْتَغِلُ بِهِ مَكَانٌ وَلا يَكُونُ إِلَى مَكَانٍ أَقْرَبَ مِنْهُ إِلَى مَكَانٍ.",
            "englishTranslation": "3. It is narrated from him (the narrator of the above Hadith) from Muhammad ibn abu ‘Abdallah from Muhammad ibn Isma‘il from Dawud ibn ‘Abdallah from ‘Amr ibn Muhammad from ‘Isa ibn Yunus who has said the following. “Ibn abu al-‘Awja said to Imam abu ‘Abdallah  in one of their conversations, ‘You spoke of Allah and referred to an unseen.’” The Imam  said, “What you said is not proper. How would He be unseen when He is present with His creatures and is closer to them than their jugular vein. He hears their speeches, sees their persons and knows their secrets.” Ibn abu al-‘Awja then said, “Is He everywhere? If He is in the heavens, how can He, at the same time, be on earth and when He would be on earth then how can He be in the heavens at the same time.?” The Imam  said, “You spoke only of a creature that with changing place any other place becomes occupied with it and another place is vacated from him and does not know what has happened to the place where he used to be. Allah’s position is great. He is the king Who has full account of all things. No place is without Him and He does not occupy any place. He is nearer to one place than the other place.”",
            "gradings": [
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              },
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/66)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "20": {
        "Al-Kafi - Volume 1: Chapter about al-‘Arsh and al-Kursi": [
          {
            "number": "Hadith #6",
            "url": "https://thaqalayn.net/hadith/1/3/20/6",
            "arabicText": "6ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ حَمَلَةُ الْعَرْشِ وَالْعَرْشُ الْعِلْمُ ثَمَانِيَةٌ أَرْبَعَةٌ مِنَّا وَأَرْبَعَةٌ مِمَّنْ شَاءَ الله.",
            "englishTranslation": "6. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ahmad ibn Muhammad ibn abu Nasr from Muhammad ibn al-Fudayl from abu Hamza from Imam abu ‘abdallah  who said the following. “The carriers of al-‘Arsh (the Throne), al-‘Arsh and al-‘Ilm (knowledge) are eight. Four of these are from us and the rest are whoever Allah will chose.”",
            "gradings": [
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              },
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/80)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "21": {
        "Al-Kafi - Volume 1: Chapter on al-Ruh, the Spirit": [
          {
            "number": "Hadith #3",
            "url": "https://thaqalayn.net/hadith/1/3/21/3",
            "arabicText": "3ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنِ الْقَاسِمِ بْنِ عُرْوَةَ عَنْ عَبْدِ الْحَمِيدِ الطَّائِيِّ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَأَلْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) عَنْ قَوْلِ الله عَزَّ وَجَلَّ وَنَفَخْتُ فِيهِ مِنْ رُوحِي كَيْفَ هَذَا النَّفْخُ فَقَالَ إِنَّ الرُّوحَ مُتَحَرِّكٌ كَالرِّيحِ وَإِنَّمَا سُمِّيَ رُوحاً لانَّهُ اشْتَقَّ اسْمَهُ مِنَ الرِّيحِ وَإِنَّمَا أَخْرَجَهُ عَنْ لَفْظَةِ الرِّيحِ لانَّ الارْوَاحَ مُجَانِسَةٌ لِلرِّيحِ وَإِنَّمَا أَضَافَهُ إِلَى نَفْسِهِ لانَّهُ اصْطَفَاهُ عَلَى سَائِرِ الارْوَاحِ كَمَا قَالَ لِبَيْتٍ مِنَ الْبُيُوتِ بَيْتِي وَلِرَسُولٍ مِنَ الرُّسُلِ خَلِيلِي وَأَشْبَاهِ ذَلِكَ وَكُلُّ ذَلِكَ مَخْلُوقٌ مَصْنُوعٌ مُحْدَثٌ مَرْبُوبٌ مُدَبَّرٌ.",
            "englishTranslation": "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Khalid from Qasin ibn ‘Urwa from ‘Abd al-Hamid al- Ta’i from Muhammad ibn Muslim who has said the following. “I asked Imam abu ‘Abdallah  about the words of Allah, the Most Holy, the Most High, ‘I have blown My Spirit into it (15:29)’” The Imam  replied, “The spirit has motion like winds. It is called spirit (Ruh) because the word is a derivative of Rih (wind). This derivative is selected because the spirits are similar or are of the genus of the Rih (wind). He has given His own possessive case because He selected it from among the other spirits just as He has said about a House from among the houses ‘My house’ and to a messenger from among the messengers ‘My friend’ and so on. All such things are created, invented, newly produced and are cherished by the Lord.”",
            "gradings": [
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              },
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (83/ 2)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "22": {
        "Al-Kafi - Volume 1: Chapter on Comprehensive (Ahadith) about the Oneness of Allah": [
          {
            "number": "Hadith #6",
            "url": "https://thaqalayn.net/hadith/1/3/22/6",
            "arabicText": "6ـ وَرَوَاهُ مُحَمَّدُ بْنُ الْحُسَيْنِ عَنْ صَالِحِ بْنِ حَمْزَةَ عَنْ فَتْحِ بْنِ عَبْدِ الله مَوْلَى بَنِي هَاشِمٍ قَالَ كَتَبْتُ إِلَى أَبِي إِبْرَاهِيمَ (عَلَيْهِ السَّلام) أَسْأَلُهُ عَنْ شَيْ‏ءٍ مِنَ التَّوْحِيدِ فَكَتَبَ إِلَيَّ بِخَطِّهِ الْحَمْدُ لله الْمُلْهِمِ عِبَادَهُ حَمْدَهُ.  وَذَكَرَ مِثْلَ مَا رَوَاهُ سَهْلُ بْنُ زِيَادٍ إِلَى قَوْلِهِ وَقَمَعَ وُجُودُهُ جَوَائِلَ الاوْهَامِ ثُمَّ زَادَ فِيهِ أَوَّلُ الدِّيَانَةِ بِهِ مَعْرِفَتُهُ وَكَمَالُ مَعْرِفَتِهِ تَوْحِيدُهُ وَكَمَالُ تَوْحِيدِهِ نَفْيُ الصِّفَاتِ عَنْهُ بِشَهَادَةِ كُلِّ صِفَةٍ أَنَّهَا غَيْرُ الْمَوْصُوفِ وَشَهَادَةِ الْمَوْصُوفِ أَنَّهُ غَيْرُ الصِّفَةِ وَشَهَادَتِهِمَا جَمِيعاً بِالتَّثْنِيَةِ الْمُمْتَنِعِ مِنْهُ الازَلُ فَمَنْ وَصَفَ الله فَقَدْ حَدَّهُ وَمَنْ حَدَّهُ فَقَدْ عَدَّهُ وَمَنْ عَدَّهُ فَقَدْ أَبْطَلَ أَزَلَهُ وَمَنْ قَالَ كَيْفَ فَقَدِ اسْتَوْصَفَهُ وَمَنْ قَالَ فِيمَ فَقَدْ ضَمَّنَهُ وَمَنْ قَالَ عَلامَ فَقَدْ جَهِلَهُ وَمَنْ قَالَ أَيْنَ فَقَدْ أَخْلَى مِنْهُ وَمَنْ قَالَ مَا هُوَ فَقَدْ نَعَتَهُ وَمَنْ قَالَ إِلامَ فَقَدْ غَايَاهُ عَالِمٌ إِذْ لا مَعْلُومَ وَخَالِقٌ إِذْ لا مَخْلُوقَ وَرَبٌّ إِذْ لا مَرْبُوبَ وَكَذَلِكَ يُوصَفُ رَبُّنَا وَفَوْقَ مَا يَصِفُهُ الْوَاصِفُونَ.",
            "englishTranslation": "6. The above is narrated from Muhammad ibn al-Husayn from Salih ibn Hamza from Fath ibn ‘Abdallah Mawla Banu Hashim who has said the following. “I wrote to abu Ibrahim  asking him about the Oneness of Allah.” He wrote back to me in his own hand writing, “All praise is due to Allah, Who inspires His servants with His praise.” He mentioned in it facts similar to those in the Hadith of Sahl ibn Ziyad (No. 5 above) to his words that read, ‘His essence has uprooted the (spreading) vines of imaginations’ with the following addition. “The first thing in His religion is to know Him. A perfect knowledge about Him is to know that He is One. A perfect belief in His Oneness is to negate all attributes from Him. Every attribute is evidence that it is different from what it is attributed to. That everything to which an attribute is ascribed is evidence that it is something other than the attribute. Both the attribute and to whatever it is attributed are evidence that there are two things which invalidate His being eternal. Whoever attributes a quality to Allah he has considered Him limited. Whoever considers Him limited he has enumerated Him and whoever enumerates Him he has considered His eternity invalid. Whoever says how is He, he has he has considered Him describable. Whoever says in what is He, he has considered Him as contained. Whoever says on what is He, he has become ignorant of Him. Whoever says where is He, he has considered some place without Him. Whoever says what is He, he has attributed certain qualities to Him. Whoever says up to what limit is He, he has considered Him as having an end. He had knowledge before there was anything to know. He was the Creator before there was any creatures. He was the Lord before there was a worshipper. Thus, is our Lord spoken of and it is above the way others speak of Him.”",
            "gradings": [
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/103)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          },
          {
            "number": "Hadith #7",
            "url": "https://thaqalayn.net/hadith/1/3/22/7",
            "arabicText": "7ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ النَّضْرِ وَغَيْرِهِ عَمَّنْ ذَكَرَهُ عَنْ عَمْرِو بْنِ ثَابِتٍ عَنْ رَجُلٍ سَمَّاهُ عَنْ أَبِي إِسْحَاقَ السَّبِيعِيِّ عَنِ الْحَارِثِ الاعْوَرِ قَالَ خَطَبَ أَمِيرُ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) خُطْبَةً بَعْدَ الْعَصْرِ فَعَجِبَ النَّاسُ مِنْ حُسْنِ صِفَتِهِ وَمَا ذَكَرَهُ مِنْ تَعْظِيمِ الله جَلَّ جَلالُهُ قَالَ أَبُو إِسْحَاقَ فَقُلْتُ لِلْحَارِثِ أَ وَمَا حَفِظْتَهَا قَالَ قَدْ كَتَبْتُهَا فَأَمْلاهَا عَلَيْنَا مِنْ كِتَابِهِ الْحَمْدُ لله الَّذِي لا يَمُوتُ وَلا تَنْقَضِي عَجَائِبُهُ لانَّهُ كُلَّ يَوْمٍ فِي شَأْنٍ مِنْ إِحْدَاثِ بَدِيعٍ لَمْ يَكُنِ الَّذِي لَمْ يَلِدْ فَيَكُونَ فِي الْعِزِّ مُشَارَكاً وَلَمْ يُولَدْ فَيَكُونَ مَوْرُوثاً هَالِكاً وَلَمْ تَقَعْ عَلَيْهِ الاوْهَامُ فَتُقَدِّرَهُ شَبَحاً مَاثِلاً وَلَمْ تُدْرِكْهُ الابْصَارُ فَيَكُونَ بَعْدَ انْتِقَالِهَا حَائِلاً الَّذِي لَيْسَتْ فِي أَوَّلِيَّتِهِ نِهَايَةٌ وَلا؛!!ّّ لآِخِرِيَّتِهِ حَدٌّ وَلا غَايَةٌ الَّذِي لَمْ يَسْبِقْهُ وَقْتٌ وَلَمْ يَتَقَدَّمْهُ زَمَانٌ وَلا يَتَعَاوَرُهُ زِيَادَةٌ وَلا نُقْصَانٌ وَلا يُوصَفُ بِأَيْنٍ وَلا بِمَ وَلا مَكَانٍ الَّذِي بَطَنَ مِنْ خَفِيَّاتِ الامُورِ وَظَهَرَ فِي الْعُقُولِ بِمَا يُرَى فِي خَلْقِهِ مِنْ عَلامَاتِ التَّدْبِيرِ الَّذِي سُئِلَتِ الانْبِيَاءُ عَنْهُ فَلَمْ تَصِفْهُ بِحَدٍّ وَلا بِبَعْضٍ بَلْ وَصَفَتْهُ بِفِعَالِهِ وَدَلَّتْ عَلَيْهِ بِ‏آيَاتِهِ لا تَسْتَطِيعُ عُقُولُ الْمُتَفَكِّرِينَ جَحْدَهُ لانَّ مَنْ كَانَتِ السَّمَاوَاتُ وَالارْضُ فِطْرَتَهُ وَمَا فِيهِنَّ وَمَا بَيْنَهُنَّ وَهُوَ الصَّانِعُ لَهُنَّ فَلا مَدْفَعَ لِقُدْرَتِهِ الَّذِي نَأَى مِنَ الْخَلْقِ فَلا شَيْ‏ءَ كَمِثْلِهِ الَّذِي خَلَقَ خَلْقَهُ لِعِبَادَتِهِ وَأَقْدَرَهُمْ عَلَى طَاعَتِهِ بِمَا جَعَلَ فِيهِمْ وَقَطَعَ عُذْرَهُمْ بِالْحُجَجِ فَعَنْ بَيِّنَةٍ هَلَكَ مَنْ هَلَكَ وَبِمَنِّهِ نَجَا مَنْ نَجَا وَلله الْفَضْلُ مُبْدِئاً وَمُعِيداً ثُمَّ إِنَّ الله وَلَهُ الْحَمْدُ افْتَتَحَ الْحَمْدَ لِنَفْسِهِ وَخَتَمَ أَمْرَ الدُّنْيَا وَمَحَلَّ الاخِرَةِ بِالْحَمْدِ لِنَفْسِهِ فَقَالَ وَقَضَى بَيْنَهُمْ بِالْحَقِّ وَقِيلَ الْحَمْدُ لله رَبِّ الْعَالَمِينَ الْحَمْدُ لله اللابِسِ الْكِبْرِيَاءِ بِلا تَجْسِيدٍ وَالْمُرْتَدِي بِالْجَلالِ بِلا تَمْثِيلٍ وَالْمُسْتَوِي عَلَى الْعَرْشِ بِغَيْرِ زَوَالٍ وَالْمُتَعَالِي عَلَى الْخَلْقِ بِلا تَبَاعُدٍ مِنْهُمْ وَلا مُلامَسَةٍ مِنْهُ لَهُمْ لَيْسَ لَهُ حَدٌّ يُنْتَهَى إِلَى حَدِّهِ وَلا لَهُ مِثْلٌ فَيُعْرَفَ بِمِثْلِهِ ذَلَّ مَنْ تَجَبَّرَ غَيْرَهُ وَصَغُرَ مَنْ تَكَبَّرَ دُونَهُ وَتَوَاضَعَتِ الاشْيَاءُ لِعَظَمَتِهِ وَانْقَادَتْ لِسُلْطَانِهِ وَعِزَّتِهِ وَكَلَّتْ عَنْ إِدْرَاكِهِ طُرُوفُ الْعُيُونِ وَقَصُرَتْ دُونَ بُلُوغِ صِفَتِهِ أَوْهَامُ الْخَلائِقِ الاوَّلِ قَبْلَ كُلِّ شَيْ‏ءٍ وَلا قَبْلَ لَهُ وَالاخِرِ بَعْدَ كُلِّ شَيْ‏ءٍ وَلا بَعْدَ لَهُ الظَّاهِرِ عَلَى كُلِّ شَيْ‏ءٍ بِالْقَهْرِ لَهُ وَالْمُشَاهِدِ لِجَمِيعِ الامَاكِنِ بِلا انْتِقَالٍ إِلَيْهَا لا تَلْمِسُهُ لامِسَةٌ وَلا تَحُسُّهُ حَاسَّةٌ هُوَ الَّذِي فِي السَّمَاءِ إِلَهٌ وَفِي الارْضِ إِلَهٌ وَهُوَ الْحَكِيمُ الْعَلِيمُ أَتْقَنَ مَا أَرَادَ مِنْ خَلْقِهِ مِنَ الاشْبَاحِ كُلِّهَا لا بِمِثَالٍ سَبَقَ إِلَيْهِ وَلا لُغُوبٍ دَخَلَ عَلَيْهِ فِي خَلْقِ مَا خَلَقَ لَدَيْهِ ابْتَدَأَ مَا أَرَادَ ابْتِدَاءَهُ وَأَنْشَأَ مَا أَرَادَ إِنْشَاءَهُ عَلَى مَا أَرَادَ مِنَ الثَّقَلَيْنِ الْجِنِّ وَالانْسِ لِيَعْرِفُوا بِذَلِكَ رُبُوبِيَّتَهُ وَتَمَكَّنَ فِيهِمْ طَاعَتُهُ نَحْمَدُهُ بِجَمِيعِ مَحَامِدِهِ كُلِّهَا عَلَى جَمِيعِ نَعْمَائِهِ كُلِّهَا وَنَسْتَهْدِيهِ لِمَرَاشِدِ أُمُورِنَا وَنَعُوذُ بِهِ مِنْ سَيِّئَاتِ أَعْمَالِنَا وَنَسْتَغْفِرُهُ لِلذُّنُوبِ الَّتِي سَبَقَتْ مِنَّا وَنَشْهَدُ أَنْ لا إِلَهَ إِلا الله وَأَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ بَعَثَهُ بِالْحَقِّ نَبِيّاً دَالاً عَلَيْهِ وَهَادِياً إِلَيْهِ فَهَدَى بِهِ مِنَ الضَّلالَةِ وَاسْتَنْقَذَنَا بِهِ مِنَ الْجَهَالَةِ مَنْ يُطِعِ الله وَرَسُولَهُ فَقَدْ فَازَ فَوْزاً عَظِيماً وَنَالَ ثَوَاباً جَزِيلاً وَمَنْ يَعْصِ الله وَرَسُولَهُ فَقَدْ خَسِرَ خُسْرَاناً مُبِيناً وَاسْتَحَقَّ عَذَاباً أَلِيماً فَأَنْجِعُوا بِمَا يَحِقُّ عَلَيْكُمْ مِنَ السَّمْعِ وَالطَّاعَةِ وَإِخْلاصِ النَّصِيحَةِ وَحُسْنِ الْمُؤَازَرَةِ وَأَعِينُوا عَلَى أَنْفُسِكُمْ بِلُزُومِ الطَّرِيقَةِ الْمُسْتَقِيمَةِ وَهَجْرِ الامُورِ الْمَكْرُوهَةِ وَتَعَاطَوُا الْحَقَّ بَيْنَكُمْ وَتَعَاوَنُوا بِهِ دُونِي وَخُذُوا عَلَى يَدِ الظَّالِمِ السَّفِيهِ وَمُرُوا بِالْمَعْرُوفِ وَانْهَوْا عَنِ الْمُنْكَرِ وَاعْرِفُوا لِذَوِي الْفَضْلِ فَضْلَهُمْ عَصَمَنَا الله وَإِيَّاكُمْ بِالْهُدَى وَثَبَّتَنَا وَإِيَّاكُمْ عَلَى التَّقْوَى وَأَسْتَغْفِرُ الله لِي وَلَكُمْ.",
            "englishTranslation": "7. It is narrated from a number of our people from Ahmad ibn Muhammad ibn Khalid from his father from Ahmad ibn al-Nadr and others whom he mentioned from ‘Amr ibn Thabit from a man whom he mentioned from abu Ishaq al-Subay‘i from Harith al-A‘war who said the following. “Amirul Mu’minin gave a speech in the afternoon and people liked it very much because of the beautiful manner in which Allah, the Most Holy, the Most High, is praised. Abu Ishaq has said that he asked al-Harith if he has recorded that sermon.” Al-Harith said, “I have recorded the sermon in writing.” He then dictated it to us from his book. “All praise is due to Allah Who does not die Whose wonders do not end. It is because everyday He has a task in the form of the invention of something that did not exist. It is He Who has no children so that He would share others in Majesty and He is not the child of others so that He would be inherited and Himself banish. The imaginations can not comprehend Him to figure Him out in some form of similitude. The eyes have not perceived Him so that after changing position He would also change. It is He for whose beginning there is no end nor there is a final destination for His being the last. It is He before Whom there is no time and is not preceded by any duration. He does not become defective by reduction or addition. He does not become attributed with direction or of what is He made of or with place. It is He Who knows all the hidden matters and has surpassed all intelligence what is evident in His creatures of plans and maintenance. It is He about Whom the prophets were asked and they did not speak of Him in terms of limits and parts. They spoke of His acts and showed people His signs. The intelligence of thinkers can not deny Him because the One who has created the heavens and earth and all that is in them and between them and is their Creator no one is able to stand up to His power. It is He, Who is different from the creatures and there is nothing similar to Him. It is He, Who has created the creatures for His worship and has given them the ability to obey Him. With the capabilities that He has placed in them and has removed all their excuses He has placing His authority among them so that after knowing the authority would perish whoever would like to perish and after knowing the authority receive salvation whoever would like to receive salvation. Benevolent is Allah to begin and to repeat. Then, Allah, to Whom all praise is due, introduced praise for His Own-self. He has finished the affairs of the world and the coming of the next life with praise for His Own-self saying, “He has judged among them with the truth” and All praise is due to Allah, Lord of the worlds.” All praise is due to Allah, Who has dressed up with greatness but with out a body, Who has put on the gown of Majesty and Glory which has no similarity. It is He, Who has control over the Throne without losing such authority. He is far Exalted above the creatures but without being far from them or being in touch with them. He has no limit that would end to a limit nor there is anything similar to Him to help know Him better. All things are humble before His power and might. All things, although great, are small before Him. All things respect His Greatness, obey His authority and Majesty. Glimpses of eyes are weak and exhausted in trying to comprehend Him. The imaginations of the creatures fall far short off describing Him. He is the first before all things and there was is no one before Him. He is the last after all things and there is no after for Him. He has control over all things with might. He observes all places without moving thereto. No touching touches Him and no sense senses Him. He is the Lord in the heavens and the Lord on earth. He is All-wise and All-knowing. He has given firm shape and form to His creatures the way He willed but not with following previous examples and without experiencing any fatigue in the creation of the things that He has created. He began what He wanted to begin and invented what He wanted to invent and the way He willed of the two great and heavy creatures, the man and Jinn so that they would know Him through such evidence His Lordship and established in them His obedience. “We thank Him with all of His praise for all of His bounties. We ask Him for His guidance to give us wisdom in our affairs. We seek His refuge from the evil of our sinful deeds and ask Him to forgive our sins that we may have committed before. We testify that there is no god but Allah and that Muhammad (s.a.) is His servant and messengers. He sent him with truth as a prophet, as a sign of His existence and a guide to Him. (We) found guidance through him from straying and are saved through him from ignorance. Whoever obeys Allah and His messenger has indeed gained a great success and has earned a great reward. Whoever disobeys Allah and His messengers has indeed suffered a clear loss and is subjected to a painful punishment. Make sure to succeed in obedience and listening, sincerity, good advice and proper support. Be helpful to yourselves to keep on the straight path and shun the detested matters. Deal among yourselves with truth and cooperate thereby with me. Hold back the unjust and feeble minded hands. Make others do good and prevent them from committing unlawful deeds. Appreciate excellence of the excelling people. May Allah protect you and us through guidance and make you and us steadfast in piety. I ask Allah for forgiveness for myself and for you.”",
            "gradings": [
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              },
              {
                "grade": "مرسل",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/104)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "23": {
        "Al-Kafi - Volume 1: Chapter on Miscellaneous Ahadith": [
          {
            "number": "Hadith #1",
            "url": "https://thaqalayn.net/hadith/1/3/23/1",
            "arabicText": "1ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَمَّنْ ذَكَرَهُ عَنِ الْحَارِثِ بْنِ الْمُغِيرَةِ النَّصْرِيِّ قَالَ سُئِلَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) عَنْ قَوْلِ الله تَبَارَكَ وَتَعَالَى كُلُّ شَيْ‏ءٍ هالِكٌ إِلا وَجْهَهُ فَقَالَ مَا يَقُولُونَ فِيهِ قُلْتُ يَقُولُونَ يَهْلِكُ كُلُّ شَيْ‏ءٍ إِلا وَجْهَ الله فَقَالَ سُبْحَانَ الله لَقَدْ قَالُوا قَوْلاً عَظِيماً إِنَّمَا عَنَى بِذَلِكَ وَجْهَ الله الَّذِي يُؤْتَى مِنْهُ.",
            "englishTranslation": "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Ni‘man from Sayf ibn ‘Umayr from those whom he mentioned from al-Harith ibn al-Mughira al-Nasri who has said the following. “A person asked Imam abu ‘Abdallah  about the words of Allah, the Most Holy, the Most High, “Everything will be destroyed except God. . .” (28:88) The Imam  asked, “What do they say about it?” I replied, “They say that everything will perish except the face of Allah.” The Imam  said, “Glory belongs to Allah. What they say is monstrous. What is meant thereby is that aspect of Allah’s relation with people through which (persons of highest degree of excellence) they establish faith in Him.”",
            "gradings": [
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              },
              {
                "grade": "مرسل",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/111)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #4",
            "url": "https://thaqalayn.net/hadith/1/3/23/4",
            "arabicText": "4ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ الاشْعَرِيُّ وَمُحَمَّدُ بْنُ يَحْيَى جَمِيعاً عَنْ أَحْمَدَ بْنِ إِسْحَاقَ عَنْ سَعْدَانَ بْنِ مُسْلِمٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) فِي قَوْلِ الله عَزَّ وَجَلَّ وَلله الاسْماءُ الْحُسْنى‏ فَادْعُوهُ بِها قَالَ نَحْنُ وَالله الاسْمَاءُ الْحُسْنَى الَّتِي لا يَقْبَلُ الله مِنَ الْعِبَادِ عَمَلاً إِلا بِمَعْرِفَتِنَا.",
            "englishTranslation": "4. Al-Husayn ibn Muhammad al-Ash‘ari and Muhammad ibn Yahya altogether have narrated from Ahmad ibn Ishaq from Su‘dan ibn Muslim from Mu‘awiya ibn ‘Ammar from abu ‘Abdallah  who has said the following about the words of Allah. “God has the most blessed Names. You should address Him in your worship by these Names . .” (7:180) The Imam said, “We, I swear by Allah, are the most blessed names of Allah without which Allah does not accept any of the good deeds of His servants until they know us properly.”",
            "gradings": [
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              },
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/115)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #7",
            "url": "https://thaqalayn.net/hadith/1/3/23/7",
            "arabicText": "7ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي نَصْرٍ عَنْ مُحَمَّدِ بْنِ حُمْرَانَ عَنْ أَسْوَدَ بْنِ سَعِيدٍ قَالَ كُنْتُ عِنْدَ ابي جعفر (عَلَيْهِ السَّلام) فَأَنْشَأَ يَقُولُ ابْتِدَاءً مِنْهُ مِنْ غَيْرِ أَنْ أَسْأَلَهُ نَحْنُ حُجَّةُ الله وَنَحْنُ بَابُ الله وَنَحْنُ لِسَانُ الله وَنَحْنُ وَجْهُ الله وَنَحْنُ عَيْنُ الله فِي خَلْقِهِ وَنَحْنُ وُلاةُ أَمْرِ الله فِي عِبَادِهِ.",
            "englishTranslation": "7. A number of our people have narrated from Ahmad ibn Muhammad ibn abu Nasr from Muhammad ibn Humran from Aswad ibn Sa‘id who has said the following. “I was in the presence of Imam abu Ja‘far , who began to speak without any question from me.” “We are the authority of Allah. We are the door to Allah. We are the tongue of Allah. We are the face of Allah. We are the eyes of Allah in His people. We are the authority in the commandments of Allah among His servants.”",
            "gradings": [
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/120)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          },
          {
            "number": "Hadith #8",
            "url": "https://thaqalayn.net/hadith/1/3/23/8",
            "arabicText": "8ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ حَسَّانَ الْجَمَّالِ قَالَ حَدَّثَنِي هَاشِمُ بْنُ أَبِي عُمَارَةَ الْجَنْبِيُّ قَالَ سَمِعْتُ أَمِيرَ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) يَقُولُ أَنَا عَيْنُ الله وَأَنَا يَدُ الله وَأَنَا جَنْبُ الله وَأَنَا بَابُ الله.",
            "englishTranslation": "8. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Ahmad ibn abu Nasr from Hassan al-Jammal who has said that Hashim ibn abu ‘Ammara al-Janbi reported to him this. “I heard Amirul Mu’minin Ali  saying, ‘I am the eyes of Allah. I am the hands of Allah. I am the sides of Allah. I am the door to Allah.”",
            "gradings": [
              {
                "grade": "مجهول بهاشم بنغابي وعمار الجنب ي",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (120/ 2)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          },
          {
            "number": "Hadith #11",
            "url": "https://thaqalayn.net/hadith/1/3/23/11",
            "arabicText": "11ـ بَعْضُ أَصْحَابِنَا عَنْ مُحَمَّدِ بْنِ عَبْدِ الله عَنْ عَبْدِ الْوَهَّابِ بْنِ بِشْرٍ عَنْ مُوسَى بْنِ قَادِمٍ عَنْ سُلَيْمَانَ عَنْ زُرَارَةَ عَنْ ابي جعفر (عَلَيْهِ السَّلام) قَالَ سَأَلْتُهُ عَنْ قَوْلِ الله عَزَّ وَجَلَّ وَما ظَلَمُونا وَلكِنْ كانُوا أَنْفُسَهُمْ يَظْلِمُونَ قَالَ إِنَّ الله تَعَالَى أَعْظَمُ وَأَعَزُّ وَأَجَلُّ وَأَمْنَعُ مِنْ أَنْ يُظْلَمَ وَلَكِنَّهُ خَلَطَنَا بِنَفْسِهِ فَجَعَلَ ظُلْمَنَا ظُلْمَهُ وَوَلايَتَنَا وَلايَتَهُ حَيْثُ يَقُولُ إِنَّما وَلِيُّكُمُ الله وَرَسُولُهُ وَالَّذِينَ آمَنُوا يَعْنِي الائِمَّةَ مِنَّا ثُمَّ قَالَ فِي مَوْضِعٍ آخَرَ وَما ظَلَمُونا وَلكِنْ كانُوا أَنْفُسَهُمْ يَظْلِمُونَ ثُمَّ ذَكَرَ مِثْلَهُ.",
            "englishTranslation": "11. Some of our people have narrated from Muhammad ibn ‘Abdallah from ‘Abdal Wahhab ibn Bishr from Musa ibn Qadim from Sulayman from Zurara from abu Ja‘far  who has said the following. “I asked the Imam about the words of Allah, the Most Holy, the Most High, “They (children of Israel) did not wrong Us but they wronged themselves.” (2:57) The Imam said, “Allah is far Great and Majestic and Mighty above being wronged. But He has mixed us with His Own-self. He has considered the wrong done to us as being done to Him and His Own authority as our authority as He has said, “Only God, His Messenger, and the true believers who are steadfast in prayer and pay alms, while they kneel during prayer, are your guardians” (5:55). It means the Imams from us. Allah has also said, “They (children of Israel) did not wrong Us but wronged themselves. (2:57)” Then he mentioned a similar statement.”",
            "gradings": [
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              },
              {
                "grade": "مجهول مرسل",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (122/ 2)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "24": {
        "Al-Kafi - Volume 1: Chapter on al-Bida’": [
          {
            "number": "Hadith #8",
            "url": "https://thaqalayn.net/hadith/1/3/24/8",
            "arabicText": "8ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَبْدِ الله بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ مَا بَدَا لله فِي شَيْ‏ءٍ إِلا كَانَ فِي عِلْمِهِ قَبْلَ أَنْ يَبْدُوَ لَهُ.",
            "englishTranslation": "8. It is narrated from Muhammad ibn Yahya from Ahmad ibn Muhammad from al-Husayn ibn sa‘id from al-Hassan ibn Mahbub from ‘Abdallah ibn Sinan from abu ‘Abdallah  who has said the following. “Nothing appeared to Allah in a thing except that He knew it before al-Bada’ would take place.”",
            "gradings": [
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/140)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "صحيح",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          },
          {
            "number": "Hadith #9",
            "url": "https://thaqalayn.net/hadith/1/3/24/9",
            "arabicText": "9ـ عَنْهُ عَنْ أَحْمَدَ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ فَضَّالٍ عَنْ دَاوُدَ بْنِ فَرْقَدٍ عَنْ عَمْرِو بْنِ عُثْمَانَ الْجُهَنِيِّ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ إِنَّ الله لَمْ يَبْدُ لَهُ مِنْ جَهْلٍ.",
            "englishTranslation": "9. It is narrated from him from Ahmad from al-Hassan ibn Ali ibn Faddal from Dawud ibn Farqad from ‘Amr ibn ‘Uthman al-Juhanni from abu ‘Abdallah  who has said the following. “Al-Bada’ does not takke place to Allah out of ignorance.”",
            "gradings": [
              {
                "grade": "صحيح",
                "book": "Sahih al-Kafi (1/18)",
                "author": "Shaykh Baqir al-Behbudi"
              },
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/140)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #10",
            "url": "https://thaqalayn.net/hadith/1/3/24/10",
            "arabicText": "10ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ مَنْصُورِ بْنِ حَازِمٍ قَالَ سَأَلْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) هَلْ يَكُونُ الْيَوْمَ شَيْ‏ءٌ لَمْ يَكُنْ فِي عِلْمِ الله بِالامْسِ قَالَ لا مَنْ قَالَ هَذَا فَأَخْزَاهُ الله قُلْتُ أَ رَأَيْتَ مَا كَانَ وَمَا هُوَ كَائِنٌ إِلَى يَوْمِ الْقِيَامَةِ أَ لَيْسَ فِي عِلْمِ الله قَالَ بَلَى قَبْلَ أَنْ يَخْلُقَ الْخَلْقَ.",
            "englishTranslation": "10. It is narrated from Ali ibn Ibrahim from Muhammad ibn ibn ‘Isa from Yunus from Mansur ibn Hazim who has said the following. I asked abu ‘Abdallah , “Can anything happen today that was not in the knowledge of Allah the day before?’ The Imam  said, “No, this does not happen. Whoever would say so Allah will make him to suffer a great deal.” I then said, “Do you consider that all that were there and all that will take place up to the Day of Judgment are all in the knowledge of Allah?” The Imam said, “Yes, it was so before He created the creatures.”",
            "gradings": [
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/140)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "صحيح",
                "book": "Sahih al-Kafi (1/18)",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          },
          {
            "number": "Hadith #12",
            "url": "https://thaqalayn.net/hadith/1/3/24/12",
            "arabicText": "12ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ مُحَمَّدِ بْنِ عَمْرٍو الْكُوفِيِّ أَخِي يَحْيَى عَنْ مُرَازِمِ بْنِ حَكِيمٍ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) يَقُولُ مَا تَنَبَّأَ نَبِيٌّ قَطُّ حَتَّى يُقِرَّ لله بِخَمْسِ خِصَالٍ بِالْبَدَاءِ وَالْمَشِيئَةِ وَالسُّجُودِ وَالْعُبُودِيَّةِ وَالطَّاعَةِ.",
            "englishTranslation": "12. It is narrated from a number of our peole from Ahmad ibn Muhammad ibn Khalid fro some of our people from Muhammad ibn ‘Amr al-Kufi brother of Yahya from Murazim ibn Hakimwhos has said the following. I heard abu ‘Abdallah  saying, “No prophet has ever proclaimed prophethood before acknowledging before Allah about five things. Acknowledgement of al-Bada’, of the wish of Allah, the prostration, affirmation of worshipping and obedience.”",
            "gradings": [
              {
                "grade": "مجهول",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (141/ 2)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          },
          {
            "number": "Hadith #13",
            "url": "https://thaqalayn.net/hadith/1/3/24/13",
            "arabicText": "13ـ وَبِهَذَا الاسْنَادِ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ يُونُسَ عَنْ جَهْمِ بْنِ أَبِي جَهْمَةَ عَمَّنْ حَدَّثَهُ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ إِنَّ الله عَزَّ وَجَلَّ أَخْبَرَ مُحَمَّداً (صَلَّى اللهُ عَلَيْهِ وَآلِه) بِمَا كَانَ مُنْذُ كَانَتِ الدُّنْيَا وَبِمَا يَكُونُ إِلَى انْقِضَاءِ الدُّنْيَا وَأَخْبَرَهُ بِالْمَحْتُومِ مِنْ ذَلِكَ وَاسْتَثْنَى عَلَيْهِ فِيمَا سِوَاهُ.",
            "englishTranslation": "13. With the same chain of narrators it is narrated from Ahmad ibn Muhammad from Ja‘far ibn Muhammad from Yunus from Jahm ibn abu Jahma from whom he narrated from abu ‘Abdallah  who has said the following. “Allah, the Most Holy, the Most High, inform Prophet Muhammad about all that was there from the beginning of the world and that will be there to the end of the world. He informed him about is definit in them and made an except about what is otherwise.”",
            "gradings": [
              {
                "grade": "مرسل",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (141/ 2)",
                "author": "Allamah Baqir al-Majlisi"
              },
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              }
            ]
          },
          {
            "number": "Hadith #14",
            "url": "https://thaqalayn.net/hadith/1/3/24/14",
            "arabicText": "14ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الرَّيَّانِ بْنِ الصَّلْتِ قَالَ سَمِعْتُ الرِّضَا (عَلَيْهِ السَّلام) يَقُولُ مَا بَعَثَ الله نَبِيّاً قَطُّ إِلا بِتَحْرِيمِ الْخَمْرِ وَأَنْ يُقِرَّ لله بِالْبَدَاءِ.",
            "englishTranslation": "14. It is narrated from Ali ibn Ibrahim from his father from al-Rayyan ibn al-Salt who has said the following. “I heard Imam al-Rida  saying, “Allah never sent a prophet without the law that prohibits the use of wine and without belief in al-Bada.’”",
            "gradings": [
              {
                "grade": "لم يخرجه",
                "book": "Sahih al-Kafi",
                "author": "Shaykh Baqir al-Behbudi"
              },
              {
                "grade": "مرسل",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (142/ 2)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      }
    }
  }
}