{
  "1": {
    "0": {
      "1": {
        "Al-Kafi - Volume 1: Introduction": [
          {
            "number": "Hadith #1",
            "url": "https://thaqalayn.net/hadith/1/0/1/1",
            "arabicText": "بسم الله الرحمن الرحيم الحمد لله المحمود لنعمته المعبود لقدرته ، المطاع في سلطانه المرهوب لجلاله ، المرغوب إليه فيما عنده ، النافذ أمره في جميع خلقه ، علا فاستعلى ودنا فتعالى ، وارتفع فوق كل منظر ، الذي لا بدء لأوليته ، ولا غاية لأزليته ، القائم قبل الأشياء ، والدائم الذي به قوامها ، والقاهر الذي لا يؤوده حفظها والقادر الذي بعظمته تفرد بالملكوت وبقدرته توحد بالجبروت ، وبحكمته أظهر حججه على خلقه . اخترع الأشياء إنشاء ، وابتدعها ابتداء ، بقدرته وحكمته ، لا من شئ فيبطل الاختراع ولا لعلة فلا يصح الابتداع ، خلق ما شاء كيف شاء ، متوحدا ” بذلك لإظهار حكمته ، وحقيقة ربوبيته ، لا تضبطه العقول ، ولا تبلغه الأوهام ، ولا تدركه الأبصار ، ولا يحيط به مقدار ، عجزت دونه العبارة ، وكلت دونه الأبصار ، وضل فيه تصاريف الصفات . احتجب بغير حجاب محجوب ، واستتر بغير ستر مستور ، عرف بغير رؤية ، ووصف بغير صورة ، ونعت بغير جسم ، لا إله إلا الله الكبير المتعال ، ضلت الأوهام عن بلوغ كنهه ، وذهلت العقول أن تبلغ اية نهايته ، لا يبلغه حدوهم ، ولا يدركه نفاذ بصر ، وهو السميع العليم ، احتج على خلقه برسله ، وأوضح الأمور بدلائله ، وابتعث الرسل مبشرين ومنذرين ، ليهلك من هلك عن بينة ويحيى من حي عن بينة ، وليعقل العباد عن ربهم ما جهلوه ، فيعرفوه بربوبيته بعدما أنكروه ، ويوحدوه بالإلهية بعد ما أضدوه .\n\nأحمده ، حمدا ” يشفي النفوس ، ويبلغ رضاه ويؤدي شكر ما وصل إلينا ، من سوابغ النعماء ، وجزيل الآلاء وجميل البلاء . وأشهد أن لا إله إلا الله وحده لا شريك له ، إلها ” واحدا ” أحدا ” صمدا ” لم يتخذ صاحبة ولا ولدا ” وأشهد أن محمدا ” صلى الله عليه وآله عبد انتجبه ، ورسول ابتعثه ، على حين فترة من الرسل وطول هجعة من الأمم وانبساط من الجهل ، واعتراض من الفتنة وانتقاض من المبرم وعمى عن الحق ، واعتساف من الجور وامتحاق من الدين . وأنزل إليه الكتاب ، فيه البيان والتبيان ، قرآنا ” عربيا ” غير ذي عوج لعلهم يتقون ، قد بينه للناس ونهجه ، بعلم قد فصله ، ودين قد أوضحه ، وفرائض قد أوجبها ، وأمور قد كشفها لخلقه وأعلنها ، فيها دلالة إلى النجاة ، ومعالم تدعو إلى هداه . فبلغ صلى الله عليه وآله ما ارسل به ، وصدع بما أمر ، وأدى ما حمل من أثقال النبوة ، وصبر لربه ، وجاهد في سبيله ، ونصح لامته ، ودعاهم إلى النجاة ، وحثهم على الذكر ودلهم على سبيل الهدى من بعده بمناهج ودواع أسس للعباد أساسها ومنائر رفع لهم أعلامها ، لكيلا يضلوا من بعده ، وكان بهم رؤوفا ” رحيما ” .\n\nفلما انقضت مدته واستكملت أيامه ، توفاه الله وقبضه إليه ، وهو عند الله مرضي عمله ، وافر حظه ، عظيم خطره ، فمضى صلى الله عليه وآله وخلف في أمته كتاب الله ووصيه أمير المؤمنين ، وإمام المتقين صلوات الله عليه ، صاحبين مؤتلفين ، يشهد كل واحد منهما لصاحبه بالتصديق ، ينطق الامام عن الله في الكتاب ، بما أوجب الله فيه على العباد ، من طاعته ، وطاعة الإمام وولايته ، وواجب حقه ، الذي أراد من استكمال دينه ، وإظهار أمره ، والاحتجاج بحججه ، والاستضاءة بنوره ، في معادن أهل صفوته ومصطفى أهل خيرته فأوضح الله بأئمة الهدى من أهل بيت نبينا صلى الله عليه وآله عن دينه وأبلج بهم عن سبيل مناهجه وفتح بهم عن باطن ينابيع علمه ، وجعلهم مسالك لمعرفته ، ومعالم لدينه ، وحجابا ” بينه وبين خلقه ، والباب المؤدي إلى معرفة حقه وأطلعهم على المكنون من غيب سره . كلما مضى منهم إمام ، نصب لخلقه من عقبه إماما ” بينا ” ، وهاديا ” نيرا ” وإماما ” قيما ” يهدون بالحق وبه يعدلون ، حجج الله ودعاته ، ورعاته على خلقه ، يدين بهديهم العباد ، ويستهل بنورهم البلاد ، جعلهم الله حياة للأنام ، ومصابيح للظلام ومفاتيح للكلام ، ودعائم للاسلام ، وجعل نظام طاعته وتمام فرضه التسليم لهم فيما علم ، والرد إليهم فيما جهل ، وحظر على غيرهم التهجم على القول بما يجهلون ومنعهم جحد ما لا يعلمون ، لما أراد تبارك وتعالى من استنقاذ من شاء من خلقه ، من ملمات الظلم ومغشيات البهم . وصلى الله على محمد وأهل بيته الأخيار الذين أذهب الله عنهم الرجس [ أهل البيت ] وطهرهم تطهيرا ” .\n\nأما بعد ، فقد فهمت يا أخي ما شكوت من اصطلاح أهل دهرنا على الجهالة وتوازرهم وسعيهم في عمارة طرقها ، ومباينتهم العلم وأهله ، حتى كاد العلم معهم أن يأزر كله وينقطع مواده ، لما قد رضوا أن يستندوا إلى الجهل ، ويضيعوا العلم وأهله . وسألت : هل يسع الناس المقام على الجهالة والتدين بغير علم ، إذا كانوا داخلين في الدين ، مقرين بجميع أموره على جهة الاستحسان ، والنشوء عليه ، والتقليد للآباء ، والأسلاف والكبراء ، والاتكال على عقولهم في دقيق الأشياء وجليلها ،\n\nفاعلم يا أخي رحمك الله أن الله تبارك وتعالى خلق عباده خلقة منفصلة من البهائم في الفطن والعقول المركبة فيهم ، محتملة للأمر والنهي ، وجعلهم جل ذكره صنفين : صنفا ” منهم أهل الصحة والسلامة ، وصنفا ” منهم أهل الضرر والزمانة ، فخص أهل الصحة والسلامة بالأمر والنهي ، بعد ما أكمل لهم آلة التكليف ، ووضع التكليف عن أهل الزمانة والضرر ، إذ قد خلقهم خلقة غير محتملة للأدب والتعليم ، وجعل عز وجل سبب بقائهم أهل الصحة والسلامة ، وجعل بقاء أهل الصحة والسلامة بالأدب والتعليم ، فلو كانت الجهالة جائزة لأهل الصحة والسلامة لجاز وضع التكليف عنهم ، وفي جواز ذلك بطلان الكتب والرسل والآداب ، وفي رفع الكتب والرسل والآداب فساد التدبير ، والرجوع إلى قول أهل الدهر ، فوجب في عدل الله عز وجل وحكمته أن يخص من خلق من خلقه خلقة محتملة للأمر والنهي ، بالأمر والنهي ، لئلا يكونوا سدى مهملين ، وليعظموه ويوحدوه ، ويقروا له بالربوبية ، وليعلموا أنه خالقهم ورازقهم ، إذ شواهد ربوبيته دالة ظاهرة ، وحججه نيرة واضحة ، وأعلامه لائحة تدعوهم إلى توحيد الله عز وجل ، وتشهد على أنفسها لصانعها بالربوبية والإلهية ، لما فيها من آثار صنعه ، وعجائب تدبيره ، فندبهم إلى معرفته لئلا يبيح لهم أن يجهلوه ويجهلوا دينه وأحكامه ، لأن الحكيم لا يبيح الجهل به ، والانكار لدينه ، فقال جل ثناؤه : ” ألم يؤخذ عليهم ميثاق الكتاب ألا يقولوا على الله إلا الحق ” وقال : ” بل كذبوا بما لم يحيطوا بعلمه ” ، فكانوا محصورين بالأمر والنهي ، مأمورين بقول الحق ، غير مرخص لهم في المقام على الجهل ، أمرهم بالسؤال ، والتفقه في الدين فقال : ” فلولا نفر من كل فرقة منهم طائفة ليتفقهوا في الدين ولينذروا قومهم إذا رجعوا إليهم ” وقال : ” فاسألوا أهل الذكر إن كنتم لا تعلمون ” .\n\nفلو كان يسع أهل الصحة والسلامة ، المقام على الجهل ، لما أمرهم بالسؤال ، ولم يكن يحتاج إلى بعثة الرسل بالكتب والآداب ، وكادوا يكونون عند ذلك بمنزلة البهائم ، ومنزلة أهل الضرر والزمانة ، ولو كانوا كذلك لما بقوا طرفة عين ، فلما لم يجز بقاؤهم إلا بالأدب والتعليم ، وجب أنه لا بد لكل صحيح الخلقة ، كامل الآلة من مؤدب ، ودليل ، ومشير ، وآمر ، وناه ، وأدب ، وتعليم ، وسؤال ، ومسألة . فأحق ما اقتبسه العاقل ، والتمسه المتدبر الفطن ، وسعى له الموفق المصيب ، العلم بالدين ، ومعرفة ما استعبد الله به خلقه من توحيده ، وشرائعه وأحكامه ، وأمره ونهيه وزواجره وآدابه ، إذ كانت الحجة ثابتة ، والتكليف لازما ” ، والعمر يسيرا ” ، والتسويف غير مقبول ، والشرط من الله جل ذكره فيما استعبد به خلقه أن يؤدوا جميع فرائضه بعلم ويقين وبصيرة ، ليكون المؤدي لها محمودا ” عند ربه ، مستوجبا ” لثوابه ، وعظيم جزائه ، لأن الذي يؤدي بغير علم وبصيرة ، لا يدري ما يؤدي ، ولا يدري إلى من يؤدي ، وإذا كان جاهلا ” لم يكن على ثقة مما أدى ، ولا مصدقا ” ، لأن المصدق لا يكون مصدقا ” حتى يكون عارفا ” بما صدق به من غير شك ولا شبهة ، لأن الشاك لا يكون له من الرغبة والرهبة والخضوع والتقرب مثل ما يكون من العالم المستيقن ، وقد قال الله عز وجل : ” إلا من شهد بالحق وهم يعلمون ” فصارت الشهادة مقبولة لعلة العلم بالشهادة ، ولولا العلم بالشهادة ، لم تكن الشهادة مقبولة ، والأمر في الشاك المؤدي بغير علم وبصيرة ، إلى الله جل ذكره ، إن شاء تطول عليه فقبل عمله ، وإن شاء رد عليه ، لأن الشرط عليه من الله أن يؤدي المفروض بعلم وبصيرة ويقين ، كيلا يكونوا ممن وصفه الله فقال تبارك وتعالى : ” ومن الناس من يعبد الله على حرف فإن أصابه خير اطمأن به وإن أصابته فتنة انقلب على وجهه خسر الدنيا والآخرة ذلك هو الخسران المبين ” لأنه كان داخلا ” فيه بغير علم ولا يقين ، فلذلك صار خروجه بغير علم ولا يقين ، وقد قال العالم عليه السلام : ” من دخل في الإيمان بعلم ثبت فيه ، ونفعه إيمانه ، ومن دخل فيه بغير علم خرج منه كما دخل فيه ” ، وقال عليه السلام : ” من أخذ دينه من كتاب الله وسنة نبيه صلوات الله عليه وآله زالت الجبال قبل أن يزول ومن أخذ دينه من أفواه الرجال ردته الرجال ” ، وقال عليه السلام : ” من لم يعرف أمرنا من القرآن لم يتنكب الفتن ” .\n\nولهذه العلة انبثقت على أهل دهرنا بثوق هذه الأديان الفاسدة ، والمذاهب المستشنعة التي قد استوفت شرائط الكفر والشرك كلها ، وذلك بتوفيق الله تعالى وخذلانه ، فمن أراد الله توفيقه وأن يكون إيمانه ثابتا ” مستقرا ” ، سبب له الأسباب التي توديه إلى أن يأخذ دينه من كتاب الله وسنة نبيه صلوات الله عليه وآله بعلم ويقين وبصيرة ، فذاك أثبت في دينه من الجبال الرواسي ، ومن أراد الله خذلانه وأن يكون دينه معارا ” مستودعا ” – نعوذ بالله منه – سبب له أسباب الاستحسان والتقليد والتأويل من غير علم وبصيرة ، فذاك في المشيئة إن شاء الله تبارك وتعالى أتم إيمانه ، وإن شاء سلبه إياه ، ولا يؤمن عليه أن يصبح مؤمنا ” ويمسي كافرا ” ، أو يمسي مؤمنا ” ويصبح كافرا ” ، لأنه كلما رأى كبيرا ” من الكبراء مال معه ، وكلما رأى شيئا ” استحسن ظاهره قبله ، وقد قال العالم عليه السلام : ” إن الله عز وجل خلق النبيين على النبوة ، فلا يكونون إلا أنبياء ، وخلق الأوصياء على الوصية ، فلا يكونون إلا أوصياء ، وأعار قوما ” إيمانا ” فإن شاء تممه لهم ، وإن شاء سلبهم إياه . قال : وفيهم جرى قوله : فمستقر ومستودع ” .\nوذكرت أن أمورا ” قد أشكلت عليك ، لا تعرف حقائقها لاختلاف الرواية فيها ، وأنك تعلم أن اختلاف الرواية فيها لاختلاف عللها وأسبابها ، وأنك لا تجد بحضرتك من تذاكره وتفاوضه ممن تثق بعلمه فيها ، وقلت : إنك تحب أن يكون عندك كتاب كاف يجمع [ فيه ] من جميع فنون علم الدين ، ما يكتفي به المتعلم ، ويرجع إليه المسترشد ، ويأخذ منه من يريد علم الدين والعمل به بالآثار الصحيحة عن الصادقين عليهم السلام والسنن القائمة التي عليها العمل ، وبها يؤدي فرض الله عز وجل وسنة نبيه صلى الله عليه وآله ، وقلت : لو كان ذلك رجوت أن يكون ذلك سببا ” يتدارك الله [ تعالى ] بمعونته وتوفيقه إخواننا وأهل ملتنا ويقبل بهم إلى مراشدهم .\n\nفاعلم يا أخي أرشدك الله أنه لا يسع أحدا ” تمييز شئ مما اختلف الرواية فيه عن العلماء عليهم السلام برأيه ، إلا على ما أطلقه العالم بقوله عليه السلام : ” اعرضوها على كتاب الله فما وافى كتاب الله عز وجل فخذوه ، وما خالف كتاب الله فردوه ” و قوله عليه السلام : ” دعوا ما وافق القوم فإن الرشد في خلافهم ” وقوله عليه السلام ” خذوا بالمجمع عليه ، فإن المجمع عليه لا ريب فيه ” ونحن لا نعرف من جميع ذلك إلا أقله ولا نجد شيئا ” أحوط ولا أوسع من رد علم ذلك كله إلى العالم عليه السلام وقبول ما وسع من الأمر فيه بقوله عليه السلام : ” بأيما أخذتم من باب التسليم وسعكم ” .\n\nوقد يسر الله – وله الحمد – تأليف ما سألت ، وأرجو أن يكون بحيث توخيت فمهما كان فيه من تقصير فلم تقصر نيتنا في إهداء النصيحة ، إذ كانت واجبة لإخواننا وأهل ملتنا ، مع ما رجونا أن نكون مشاركين لكل من اقتبس منه ، وعمل بما فيه دهرنا هذا ، وفي غابره إلى انقضاء الدنيا ، إذ الرب عز وجل واحد والرسول محمد خاتم النبيين – صلوات الله وسلامه عليه وآله – واحد ، والشريعة واحدة وحلال محمد حلال وحرامه حرام إلى يوم القيامة ، ووسعنا قليلا ” كتاب الحجة وإن لم نكمله على استحقاقه ، لأنا كرهنا أن نبخس حظوظه كلها . وأرجو أن يسهل الله عز وجل إمضاء ما قدمنا من النية ، إن تأخر الأجل صنفنا كتابا ” أوسع وأكمل منه ، نوفيه حقوقه كلها إن شاء الله تعالى وبه الحول والقوة وإليه الرغبة في الزيادة في المعونة والتوفيق . والصلاة على سيدنا محمد النبي وآله الطاهرين الأخيار .\n\nوأول ما أبدأ به وأفتتح به كتابي هذا كتاب العقل ، وفضائل العلم ، وارتفاع درجة أهله ، وعلو قدرهم ، ونقص الجهل ، وخساسة أهله ، وسقوط منزلتهم ، إذ كان العقل هو القطب الذي عليه المدار وبه يحتج وله الثواب ، وعليه العقاب ، [ والله الموفق ])",
            "englishTranslation": "In the Praise of Allah, the Beneficent, the Merciful All praise belongs to Allah Who is praised for His bounties, worshipped for His Might, obeyed in His rule and feared for His Majesty. He possesses all that is attractive; His commands pervade in all of His creation. He is High, the Most High. He is near in His Highness and the Most High above being seen. His being the first has had no beginning and He is eternal. He existed before the existence of all things and He is the eternal Who guards all things. He is the overwhelming power and the preservation of the things does not burden Him. He is the only Almighty in His kingdom and only power to compel what is to compel. Through wisdom He has revealed His authority over His creation. He created all things in their origin new and at the very beginning through His might and wisdom and nothing existed to invalidate His being the originator of all things. No other cause existed to compete His invention. He alone created what He wished as He wished to reveal His wisdom and the reality of His Lordship. Reason is not able to grasp Him. Imagination is not able to reach Him. Eyes are not able to see Him. Measurement is not able to limit Him. Statements fail to describe Him. Eyes turn dull in trying to see Him. Describing Him by means of qualities looses the right path. He is veiled without any barrier and is concealed without any covering. He is known but is not seen and is described without a form. He is characterized without a body. There is no Lord except Allah, the Most Great, the Most High. Imagination looses the right path in trying to reach His reality. Intelligent becomes exhausted and is not able to reach Him. So also is the case with imaginations and eyesight. He is all hearing and all knowing. Allah has established His authority over His creatures through His messengers  and has explained things with evidence. He has sent His messengers with glad news and warnings. So that those who would find salvation would do so with proper evidence and those would be destroyed would be so for ignoring proper evidence. So that people would learn about their Lord what they are ignorant of and know Him through His Lordship after that they were ignorant of this fact, so that they would believe in Him as the only One Lord after considering other things like Him. I thank Him in a way that would be a cure for the souls, of a degree to please Him, enough to fulfil the duty to express gratitude for His favors to us in the form of His pleasant blessings, graceful bounties and beautiful trials. I testify that there is no Lord except Allah alone Who has no partners. He is the only Lord, the only self-sufficient Who has no companion or children. I testify that Muhammad  is His servant. He is His chosen one, His messenger whom He sent at a time of lapse of messengers and at the time of the long sleep of the nations, wide spread of ignorance, mischief and shortages of authority, blindness to the truth, prevailing injustice and the disappearance of religion. Allah sent His book to him (Muhammad  that contains the statements and explanations, a reading in straight forward Arabic language so that people may become pious. Allah has explained and organized this book for the people and with knowledge He has given the details. He has explained a religion in it, certain obligations are made obligatory therein and certain matters are declared for His creature in it. It contains signs that lead to salvation and evidence that call to guidance. He (Muhammad  preached His message and executed His commands. He fulfilled his responsibilities with patience for the sake of his Lord. He worked hard for His cause, gave good advice to his followers and invited them to salvation. He encouraged them to speak of (Allah), gave them guidance to the right path after his passing away through a system, reason, basis for the people and signs that he established for them so that they would not be mislead after him. It was all due to his kindness and sympathy for them. When his life ended and his days were over, Allah took his soul to Himself. With Allah he is well pleased for his deeds. His reward is a good deal and his position very great. He left this world leaving behind among his followers the Book of Allah and the executor of his will, Amir al-Mu’minin Ali  the master of the believers and the leader (Imam) for pious people. The twine that he left behind was a united companion. They each acknowledge and speak in support of the other. The Imam speaks of Allah from the Book. He speaks of what Allah has made obligatory on His servants, of obedience to Him, of obedience to the Imam  and the acknowledgement of Leadership with Divine Authority. He speaks of His rights that are meant to be for the completion of religion, His commandments, establishment of His authority, seeking guidance in His light from its mines, His chosen and select people who possess good from Him. Allah through the Imams of guidance from the family of His Prophet  has explained His religion. Through them He has clarified the ways of His system. Through them He has opened the inside of His knowledge. He has made them to be the path to know Him, the sources of knowledge of His religion, the medium between Him and His creatures, the gate that lead to know His right and has given them the knowledge of His hidden secret. Whenever, an Imam from them would leave this world He would establish a clearly known successor for that Imam for His creatures as a bright guide, an Imam and guardian with the truth and justice. Allah and those who preach for Him and supervise over His creatures have established their authority. Through their guidance people follow the religion and through their light people of the lands find their way. Allah has made them, (Imams  the life for people, the light in darkness, the key to the words and the pillars of Islam. He has based the system of His obedience and the fulfillment of obligation submission to them (Imams  in all that one would know and ask them what one is ignorant of. He has prohibited others from engaging in what they are ignorant of and from rejecting what they would not know. It is because Allah has willed to save, from His creatures whoever He would will, from injustice and darkness. May Allah grant blessings upon Muhammad  and the select members of his family whom Allah has cleansed thoroughly. After my words about Allah and His Messenger, above herein below is my response to your note. I have understood your concerns about the conditions of the people of our times who seem to have agreed up on ignorance to be the standard and authority in their dealings. They cooperate and work together to establish the ways and the manners of ignorance and distance themselves from knowledge and the people of knowledge. Consequently, knowledge is almost banished and the sources of knowledge are about to depart the people. It is all because they rely so much on ignorance (ignorant people) and lose the (blessing of) the people of knowledge. You have asked, \"Can the dealings of the people be considered proper in following a religion without knowing the rules and laws therein that show what is lawful or otherwise? Can they decide and settle all matters on the basis of what they feel is good and live a life in such a manner? Can they just do what their ancestors had been doing and rely on their own understanding of the issues great or small?\" To understand the answer to your question, O brother in faith, may Allah grant you blessings, note the following: Allah, the Most Holy, the Most High, has created human beings and has given them distinction over the animals. He has given them the ability to understand and distinguish good from bad. Human beings have been given the ability to understand Allah’s commands and prohibitions. There are two kinds of people.  There are those who are physically and mentally safe and sound and (b) those who lack such abilities. Safe and sound people are held responsible to follow the commands and prohibitions of Allah. Those who lack such abilities are exempt because of their inability to learn, discipline and fulfill responsibilities. Allah, the Most Majestic, the Most Gracious, has designed education, good manners and moral discipline to serve as means of survival for the people who are safe and sound. Had it been permissible for safe and sound people to follow ignorance it would have been permissible for them not to become obligated to fulfill responsibilities. Such a condition would amount to make the coming of the Divine messengers and education useless. Ignoring the book of guidance, the Divine messengers and education would destroy the whole civilization. This would be a return to atheism. The justice and wisdom of Allah, the Most Majestic, the Most Gracious, required the creation of creatures who would understand the commands and prohibitions of Allah so that people would not live a useless life. Instead they realize the greatness of Allah, acknowledge His Oneness and that He is the Lord. They must know that He is their Creator Who gives them sustenance. The proof of His existence is so clear and obvious. The signs of His authority are shinning and manifest. His lighthouses are visible everywhere and call people to believe in Allah, the Most Majestic, and the Most Gracious. Each sign testifies to the existence of the Lord and the One Who deserves to be worshipped. Such proofs that exist in each sign are proofs of the effect of the creation in them. Each creature is a marvelous proof of His plan. He invites them to know Him so that they will not remain ignorant of His existence and ignorant of His religion and laws. People of wisdom do not consider ignorance of his existence a permissible attitude, as is the case of denying His religion. Allah, the Most Majestic, the Most Gracious, said: \"Did they not make a covenant (with Allah) in the Book not to speak any thing other than the Truth about Allah and to study its contents well? \" (7:169) They call a lie something that is beyond the limit of their knowledge . . .\" (10:39) People are bound to obey the commands of Allah and His prohibitions. It is not permissible for them to follow ignorance (ignorant people). It is obligatory for them to ask if they would not already know and to acquire proper understanding of religion. Allah, the Most Majestic, the Most Gracious, has said, \"Not all believers have to become specialists in religious learning. Why do not some people from each group of believers seek to become specialists in religious learning and, after completing their studies, guide their group so that they will have fear of Allah.\" (9:122) If people who are physically and mentally safe and sound were permitted to stay ignorant Allah would not have asked them to ask and learn. He would not have needed to send any messengers, books and guidance. In such case, they would have lived like animals or like people physically and mentally defective and if so they would not remain in existence even for a blinking of an eye. In fact, it is not permissible for them to live without discipline and education. Thus, it became necessary for those physically and mentally sound to find instructors to educate and discipline them and provide answer to their questions. The best and most important education for people of reason, the education worthwhile for one to study assiduously is the religious education. The education that would teach one about the Creator, His Oneness and how to worship Him, is the most important one. It is important to be educated in the issues of Shari‘a, His laws of guidance, His commandments, prohibitions, warnings and discipline. This is necessary because there is solid evidence to support the need for such education, that responsibility is real, life is short, indifference and procrastination is not acceptable. The condition for a worship to be proper and acceptable is to fulfil all the obligations on the basis of certainty, knowledge and proper understanding. Only than the worshiper would be considered praiseworthy in the sight of Allah and deserving rewards and His great blessings. On the other hand, one who acts without proper knowledge and understanding does not know what and for what reason one is acting. Ignorant people do not have trust in what they do. They do not acknowledge any thing because acknowledgement does not come without doubt free knowledge of the subject to be acknowledged. The person who has doubts is not like a person who has certainty of the matters of piety, humbleness before the Lord and the need to seek nearness to Him. Allah, the Most Majestic, the Most Gracious, has said, \"Those who have witnessed the truth only they have proper knowledge.\" (43:87) Only the testimony of those who possess proper knowledge is accepted and it is because of the knowledge of the subject of the testimony. Without the knowledge of the subject of the testimony it would not have been accepted. The acceptance of the deeds of the people who act with doubts is up to Allah to decide. He may accept such deeds because of His grace or He may refuse to accept because of the absence of the conditions such as knowledge and certainty. It is Knowledge, proper understanding and certainty that separate one from those mentioned in the following words of Allah, the Most Majestic, the Most Gracious, \"Certain people worship Allah to achieve worldly gains. They are confident when they are prosperous, but when they face hardships they turn away from (worship). They are lost in this life and will be lost in the life to come. Such loss is indeed destructive.\" (22:11) It is all because of acting without knowledge and certainty in the beginning and in the end. The scholar has said, \"One who accepts the faith with certainty he remains in it steadfast and the faith benefits him. Those who accept the faith without certainty they leave it just as they came in.\" He has also said, \"Those who get their religion from the Book of Allah and the Sunnah of the Messenger of Allah  the strength of their faith is as such that mountains may be destroyed but not their faith. Those who get their religion from the words of the people they may reject it\" He has also said, \"Those who do not know us through the Holy Quran they fail to protect themselves against mischief.\" For this reason so many religions have emerged in our times as well as disgraceful systems that almost have entered the level of disbelief. This is because of the opportunity that Allah has provided for every one. One whose faith in the will of Allah is to remain solid He makes the means that would make it so happen, available. He then gets his religion from the Book of Allah and the Sunnah of His Messenger  with certainty and proper understanding. His religion is stronger than the heavy mountains. Those whose faith in the will of Allah is to be temporary and bound to failure, - may He grant us refuge- He gives them the opportunity to follow certain ideas that are devoid of Divine authority. They follow what seems good to one to follow and such other matters like following what others do, certain interpretations and so on without proper understand and certainty. In such case Allah may or may not accept their deeds. They may live as a believer in the morning and a disbeliever in the evening or vice versa. It is because such people may easily follow the influential elements in the society or act upon what they feel is good. The scholar  has said, \"Allah, the Most Majestic, the Most Gracious, has created the prophets with prophet-hood they can be nothing but prophets. He has created the executors of the will of the prophets as the executors thus they can be nothing but the executors of the wills of the prophets. He has given temporary faith to certain people. He may complete it for them or remove it from them as mentioned in this Quranic expression, \" The established faith the temporary faith.\" You have mentioned that you are confused in the issues of the verification of hadith due to the difference in variously narrated texts and that you know the reason for variation but you do not find reliable people to discuss with. You have said that you wish you had a book sufficient (Kafi) that would contain all issues of the religion. A book that would provide a student all the material that he would need is urgently needed. A book is needed that would help people to have proper guidance in the matters of religion to follow the correct instructions of the truthful people  and the prevailing Sunnah, the basis of practices. So that one would fulfil his responsibilities towards Allah, the Most Majestic, the Most Gracious, and follow the Sunnah of (the Holy Prophet). You have said, that you hope such a book would, Allah willing, help our brothers in faith to find the right guidance. My brother in faith, may Allah grant you proper guidance, please note that there is no other way to sort out the confusion that comes from the variation of the narration of the scholars except by the help of the principles that the scholar  has set. \"Compare a narration with the text of the Holy Quran. Whatever agrees with the Holy Quran is acceptable and what does not agree is rejected.\" Also he has said, \"Leave alone what agrees with the views of the others because the right is in what is opposite to them.\" Also there are his  words, \"Follow what is unanimously agreed upon because there is no harm in what is unanimously agreed upon.\" We are only able to apply such principles to a very few of such cases. We do not find any thing better and more precautionary than to refer to the scholar  and accept that which is within the limit of his  words, \"Whichever you would follow in submission and obedience is excusable for you.\" Allah, the Most Majestic, the Most Gracious, has made the compilation of the book that you had wished for possible. I hope it will prove to be up to your expectations. It may have shortcomings, but our intentions have not been insincere to provide good advice because to provide good advice to our people is obligatory. We also hoped to be considered as partners of all benefits of this book up to the end of time. The Lord is one, the Messenger is one, the last prophet  is one and the Shari‘a is one. What Muhammad  has made lawful will remain lawful up to the Day of Judgment and what he has made unlawful will remain unlawful to the Day of Judgment. We extended the Book on ‘People with Divine Authority’ to a certain degree although not as it should have been done because we did not like to be deprived of the benefits thereof. I hope Allah, the Most Majestic, the Most Gracious, will approve what is based on our intentions. If life will give us a chance we intend to compile a book of a bigger volume to serve the causes as they should be served, by the will of Allah, the Most High. From Him comes the power and means. From Him one expects help and increase in rewards and opportunity. May Allah grant blessings up on Muhammad and his purified family. The first thing is the book of Intelligence and the virtue of knowledge, the excellence of the people of knowledge, the defects of the people of ignorance and its harms. Intelligence is the focal point and the axes of the matters. On the basis of Intelligence come the rewards and sufferings and Allah is the best One to provide good opportunities."
          }
        ]
      }
    },
    "2": {
      "3": {
        "Al-Kafi - Volume 1: Chapter on Kinds of People": [
          {
            "number": "Hadith #4",
            "url": "https://thaqalayn.net/hadith/1/2/3/4",
            "arabicText": "4ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ جَمِيلٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ سَمِعْتُهُ يَقُولُ يَغْدُو النَّاسُ عَلَى ثَلاثَةِ أَصْنَافٍ عَالِمٍ وَمُتَعَلِّمٍ وَغُثَاءٍ فَنَحْنُ الْعُلَمَاءُ وَشِيعَتُنَا الْمُتَعَلِّمُونَ وَسَائِرُ النَّاسِ غُثَاءٌ.",
            "englishTranslation": "4. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from Jamil who has said the following. “I heard Imam abu ‘Abdallah  saying, ‘People become of three groups: Scholars, those who learn and garbled ones. We are the scholars. Our followers are the ones who learn. The rest of the people are garbled ones.’”"
          }
        ]
      },
      "4": {
        "Al-Kafi - Volume 1: Chapter on the reward for the scholars and those who seek knowledge": [
          {
            "number": "Hadith #1",
            "url": "https://thaqalayn.net/hadith/1/2/4/1",
            "arabicText": "1ـ مُحَمَّدُ بْنُ الْحَسَنِ وَعَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ وَمُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ الاشْعَرِيِّ عَنْ عَبْدِ الله بْنِ مَيْمُونٍ الْقَدَّاحِ وَعَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنِ الْقَدَّاحِ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) مَنْ سَلَكَ طَرِيقاً يَطْلُبُ فِيهِ عِلْماً سَلَكَ الله بِهِ طَرِيقاً إِلَى الْجَنَّةِ وَإِنَّ الْمَلائِكَةَ لَتَضَعُ أَجْنِحَتَهَا لِطَالِبِ الْعِلْمِ رِضًا بِهِ وَإِنَّهُ يَسْتَغْفِرُ لِطَالِبِ الْعِلْمِ مَنْ فِي السَّمَاءِ وَمَنْ فِي الارْضِ حَتَّى الْحُوتِ فِي الْبَحْرِ وَفَضْلُ الْعَالِمِ عَلَى الْعَابِدِ كَفَضْلِ الْقَمَرِ عَلَى سَائِرِ النُّجُومِ لَيْلَةَ الْبَدْرِ وَإِنَّ الْعُلَمَاءَ وَرَثَةُ الانْبِيَاءِ إِنَّ الانْبِيَاءَ لَمْ يُوَرِّثُوا دِينَاراً وَلا دِرْهَماً وَلَكِنْ وَرَّثُوا الْعِلْمَ فَمَنْ أَخَذَ مِنْهُ أَخَذَ بِحَظٍّ وَافِرٍ.",
            "englishTranslation": "1. Muhammad ibn al-Hassan and Ali ibn Muhammad has narrated from Sahl ibn Ziyad and Muhammad ibn Yahya from Ahmad ibn Muhammad, all from Ja’far ibn Muhammad al-Ash’ari from ’Abdullah ibn Maymun al-Qaddah and Ali ibn Ibrahim from his father from Hammad ibn ‘Isa from al-Qaddah from abu ‘Abdallah  who has said the following. “The holy Prophet has said, ‘If one sets out on a journey to seek knowledge Allah will lead him to the way that would take him to paradise. The angels will stretch their wings for the pleasure of the seeker of knowledge and all that is in the heavens and earth even the whales in the oceans will ask forgiveness for him (from Allah). The excellence of the scholar over other people is like that of the moon over other stars during a full-moon night. The scholars are the heirs of the prophets. The prophets did not leave any Dirham or Dinar (wealth) as their legacy but they did leave knowledge as their legacy. Whoever acquires a share from such legacy has gained a very large share.’”"
          }
        ]
      },
      "9": {
        "Al-Kafi - Volume 1: Chapter on Asking the Scholar and Discussing with him": [
          {
            "number": "Hadith #3",
            "url": "https://thaqalayn.net/hadith/1/2/9/3",
            "arabicText": "3ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ الاشْعَرِيِّ عَنْ عَبْدِ الله بْنِ مَيْمُونٍ الْقَدَّاحِ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ قَالَ إِنَّ هَذَا الْعِلْمَ عَلَيْهِ قُفْلٌ وَمِفْتَاحُهُ الْمَسْأَلَةُ.  عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) مِثْلَهُ.",
            "englishTranslation": "3. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Ja’far ibn Muhammad al-Ash‘ari from ’Abdallah ibn Maymun al-Qaddah from abu ‘Abdallah  who has said the following. “This knowledge (the knowledge of the holy Prophet and Ahlul Bayt) is under a lock and the key to it is asking” Ali ibn Ibrahim, from his father from al-Nawfali, from al-Sakuni from Imam abu ‘Abdallah has narrated the same Hadith."
          }
        ]
      },
      "19": {
        "Al-Kafi - Volume 1: Chapter on Innovations, Personal Opinions and Analogies": [
          {
            "number": "Hadith #22",
            "url": "https://thaqalayn.net/hadith/1/2/19/22",
            "arabicText": "22ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ مُرْسَلاً قَالَ قَالَ أَبُو جَعْفَرٍ (عَلَيْهِ السَّلام) لا تَتَّخِذُوا مِنْ دُونِ الله وَلِيجَةً فَلا تَكُونُوا مُؤْمِنِينَ فَإِنَّ كُلَّ سَبَبٍ وَنَسَبٍ وَقَرَابَةٍ وَوَلِيجَةٍ وَبِدْعَةٍ وَشُبْهَةٍ مُنْقَطِعٌ إِلا مَا أَثْبَتَهُ الْقُرْآنُ.",
            "englishTranslation": "22. A number of our people has narrated from Ahmad ibn Muhammad ibn Khalid from his father in mursal manner (Mursalan) from abu Ja‘far  who has said the following. “Do not take anyone closely and intimately between your selves and Allah lest you will not be believers. Every means, ancestral and relative relations and intimacy, innovations and doubts will be cut off except for what is established in the holy Quran.”"
          }
        ]
      },
      "20": {
        "Al-Kafi - Volume 1: Chapter on the need to refer to the book and Sunnah": [
          {
            "number": "Hadith #10",
            "url": "https://thaqalayn.net/hadith/1/2/20/10",
            "arabicText": "10ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ أَبِي الْمَغْرَاءِ عَنْ سَمَاعَةَ عَنْ أَبِي الْحَسَنِ مُوسَى (عَلَيْهِ السَّلام) قَالَ قُلْتُ لَهُ أَ كُلُّ شَيْ‏ءٍ فِي كِتَابِ الله وَسُنَّةِ نَبِيِّهِ (صَلَّى اللهُ عَلَيْهِ وَآلِه) أَوْ تَقُولُونَ فِيهِ قَالَ بَلْ كُلُّ شَيْ‏ءٍ فِي كِتَابِ الله وَسُنَّةِ نَبِيِّهِ (صَلَّى اللهُ عَلَيْهِ وَآلِه )",
            "englishTranslation": "10. A number of our people has narrated from Ahmad ibn Muhammad ibn Khalid from ‘Isma’il ibn Mihran from Sayf ibn ‘Umayra from abu al-Maghra from Sama‘a from abu al-Hassan Musa  who has said the following. “I asked the Imam, ‘Is everything in the book of Allah and the Sunnah of His messenger or you have a say in it?’ The Imam replied, “As a matter of fact, everything is in the book of Allah and the Sunnah of His messenger (s.a.)’”"
          }
        ]
      },
      "21": {
        "Al-Kafi - Volume 1: Chapter on the Differences in al-Hadith": [
          {
            "number": "Hadith #4",
            "url": "https://thaqalayn.net/hadith/1/2/21/4",
            "arabicText": "4ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ أَبِي عُبَيْدَةَ عَنْ ابي جعفر (عَلَيْهِ السَّلام) قَالَ قَالَ لِي يَا زِيَادُ مَا تَقُولُ لَوْ أَفْتَيْنَا رَجُلاً مِمَّنْ يَتَوَلانَا بِشَيْ‏ءٍ مِنَ التَّقِيَّةِ قَالَ قُلْتُ لَهُ أَنْتَ أَعْلَمُ جُعِلْتُ فِدَاكَ قَالَ إِنْ أَخَذَ بِهِ فَهُوَ خَيْرٌ لَهُ وَأَعْظَمُ أَجْراً وَفِي رِوَايَةٍ أُخْرَى إِنْ أَخَذَ بِهِ أُوجِرَ وَإِنْ تَرَكَهُ وَالله أَثِمَ.",
            "englishTranslation": "4. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from ibn Mahbub from Ali ibn Ri’ab from abu ‘Ubayda who has said the following. “Abu Ja‘far  has said, ‘O Ziyad, What would you say if we give a Fatwa to one of our followers under pressure (and concealed the truth)?” I said, “You know better, may Allah take my soul in your service.’” The Imam said, “If would follow such Fatwa it would be better for him and of a greater rewarding.” In another Hadith it says, “If follows it, he will be rewarded and if he disregarded it he has sinned.”"
          }
        ]
      }
    },
    "3": {
      "1": {
        "Al-Kafi - Volume 1: Chapter on Contingency of the Universe and Proof of the Existence of its Creator": [
          {
            "number": "Hadith #3",
            "url": "https://thaqalayn.net/hadith/1/3/1/3",
            "arabicText": "3ـ حَدَّثَنِي مُحَمَّدُ بْنُ جَعْفَرٍ الاسَدِيُّ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ الْبَرْمَكِيِّ الرَّازِيِّ عَنِ الْحُسَيْنِ بْنِ الْحَسَنِ بْنِ بُرْدٍ الدِّينَوَرِيِّ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الله الْخُرَاسَانِيِّ خَادِمِ الرِّضَا (عَلَيْهِ السَّلام) قَالَ دَخَلَ رَجُلٌ مِنَ الزَّنَادِقَةِ عَلَى أَبِي الْحَسَنِ (عَلَيْهِ السَّلام) وَعِنْدَهُ جَمَاعَةٌ فَقَالَ أَبُو الْحَسَنِ (عَلَيْهِ السَّلام) أَيُّهَا الرَّجُلُ أَ رَأَيْتَ إِنْ كَانَ الْقَوْلُ قَوْلَكُمْ وَلَيْسَ هُوَ كَمَا تَقُولُونَ أَ لَسْنَا وَإِيَّاكُمْ شَرَعاً سَوَاءً لا يَضُرُّنَا مَا صَلَّيْنَا وَصُمْنَا وَزَكَّيْنَا وَأَقْرَرْنَا فَسَكَتَ الرَّجُلُ ثُمَّ قَالَ أَبُو الْحَسَنِ (عَلَيْهِ السَّلام) وَإِنْ كَانَ الْقَوْلُ قَوْلَنَا وَهُوَ قَوْلُنَا أَ لَسْتُمْ قَدْ هَلَكْتُمْ وَنَجَوْنَا فَقَالَ رَحِمَكَ الله أَوْجِدْنِي كَيْفَ هُوَ وَأَيْنَ هُوَ فَقَالَ وَيْلَكَ إِنَّ الَّذِي ذَهَبْتَ إِلَيْهِ غَلَطٌ هُوَ أَيَّنَ الايْنَ بِلا أَيْنٍ وَكَيَّفَ الْكَيْفَ بِلا كَيْفٍ فَلا يُعْرَفُ بِالْكَيْفُوفِيَّةِ وَلا بِأَيْنُونِيَّةٍ وَلا يُدْرَكُ بِحَاسَّةٍ وَلا يُقَاسُ بِشَيْ‏ءٍ فَقَالَ الرَّجُلُ فَإِذاً إِنَّهُ لا شَيْ‏ءَ إِذَا لَمْ يُدْرَكْ بِحَاسَّةٍ مِنَ الْحَوَاسِّ فَقَالَ أَبُو الْحَسَنِ (عَلَيْهِ السَّلام) وَيْلَكَ لَمَّا عَجَزَتْ حَوَاسُّكَ عَنْ إِدْرَاكِهِ أَنْكَرْتَ رُبُوبِيَّتَهُ وَنَحْنُ إِذَا عَجَزَتْ حَوَاسُّنَا عَنْ إِدْرَاكِهِ أَيْقَنَّا أَنَّهُ رَبُّنَا بِخِلافِ شَيْ‏ءٍ مِنَ الاشْيَاءِ قَالَ الرَّجُلُ فَأَخْبِرْنِي مَتَى كَانَ قَالَ أَبُو الْحَسَنِ (عَلَيْهِ السَّلام) أَخْبِرْنِي مَتَى لَمْ يَكُنْ فَأُخْبِرَكَ مَتَى كَانَ قَالَ الرَّجُلُ فَمَا الدَّلِيلُ عَلَيْهِ فَقَالَ أَبُو الْحَسَنِ (عَلَيْهِ السَّلام) إِنِّي لَمَّا نَظَرْتُ إِلَى جَسَدِي وَلَمْ يُمْكِنِّي فِيهِ زِيَادَةٌ وَلا نُقْصَانٌ فِي الْعَرْضِ وَالطُّولِ وَدَفْعِ الْمَكَارِهِ عَنْهُ وَجَرِّ الْمَنْفَعَةِ إِلَيْهِ عَلِمْتُ أَنَّ لِهَذَا الْبُنْيَانِ بَانِياً فَأَقْرَرْتُ بِهِ مَعَ مَا أَرَى مِنْ دَوَرَانِ الْفَلَكِ بِقُدْرَتِهِ وَإِنْشَاءِ السَّحَابِ وَتَصْرِيفِ الرِّيَاحَ وَمَجْرَى الشَّمْسِ وَالْقَمَرِ وَالنُّجُومِ وَغَيْرِ ذَلِكَ مِنَ الايَاتِ الْعَجِيبَاتِ الْمُبَيِّنَاتِ عَلِمْتُ أَنَّ لِهَذَا مُقَدِّراً وَمُنْشِئاً.",
            "englishTranslation": "3. Muhammad ibn Ja‘far al-Asadi has narrated from Muhammad ibn Esma‘il al-Barmaki al-Razi from al-Husayn ibn al-Hassan ibn Bard al-Daynuri from Muhammad ibn Ali from Muhammad ibn ‘Abdallah al-Khurasani the an employee of Imam al-Rida  who has said the following. “An atheist man came to Imam abu al-Hassan  while group of people was present there. The Imam  said to him, “Consider, if what you say would be true which is not true, in such case, we all will be equal. Our fasting, prayers, giving charity and belief will not harm us.” The man remained quite. The Imam then said, “If what we say would be true, which, in fact, is true then you will be the one facing your destruction and we will be saved.” The man then said, “Please help me learn where is He and how is He?” The Imam then said, “What is the matter with you? What you say is not right. He is the ‘where’ of ‘where’ but without ‘where’. He is the ‘how’ of ‘how’ without ‘how’. He can not be defined with ‘how’ and ‘where’ and can not be comprehended with the senses or compared with anything.” The man then asked, “Tell me then when was He?” The Imam replied, “You tell me, when He was not there so that I would tell when He was there?” The man then asked, “What is the proof for His existence?” The Imam said, “When I look at my body I find that I can not do any addition or alteration to it such as width and breadth or remove its sufferings and attract all its interests. I then come to understand that for this establishment there must be a founder and then I acknowledge His existence. Besides, I see all the orbiting planets and stars, the creation of the clouds and driving of the winds, the paths of the sun, the moon, the stars and other things of the marvelous clear signs I come to believe that there is One who has designed and created all such wonderful things”"
          }
        ]
      },
      "2": {
        "Al-Kafi - Volume 1: Chapter on Can Allah (God) be Considered a Thing?": [
          {
            "number": "Hadith #6",
            "url": "https://thaqalayn.net/hadith/1/3/2/6",
            "arabicText": "6ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْعَبَّاسِ بْنِ عَمْرٍو الْفُقَيْمِيِّ عَنْ هِشَامِ بْنِ الْحَكَمِ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) أَنَّهُ قَالَ لِلزِّنْدِيقِ حِينَ سَأَلَهُ مَا هُوَ قَالَ هُوَ شَيْ‏ءٌ بِخِلافِ الاشْيَاءِ ارْجِعْ بِقَوْلِي إِلَى إِثْبَاتِ مَعْنًى وَأَنَّهُ شَيْ‏ءٌ بِحَقِيقَةِ الشَّيْئِيَّةِ غَيْرَ أَنَّهُ لا جِسْمٌ وَلا صُورَةٌ وَلا يُحَسُّ وَلا يُجَسُّ وَلا يُدْرَكُ بِالْحَوَاسِّ الْخَمْسِ لا تُدْرِكُهُ الاوْهَامُ وَلا تَنْقُصُهُ الدُّهُورُ وَلا تُغَيِّرُهُ الازْمَانُ فَقَالَ لَهُ السَّائِلُ فَتَقُولُ إِنَّهُ سَمِيعٌ بَصِيرٌ قَالَ هُوَ سَمِيعٌ بَصِيرٌ سَمِيعٌ بِغَيْرِ جَارِحَةٍ وَبَصِيرٌ بِغَيْرِ آلَةٍ بَلْ يَسْمَعُ بِنَفْسِهِ وَيُبْصِرُ بِنَفْسِهِ لَيْسَ قَوْلِي إِنَّهُ سَمِيعٌ يَسْمَعُ بِنَفْسِهِ وَبَصِيرٌ يُبْصِرُ بِنَفْسِهِ أَنَّهُ شَيْ‏ءٌ وَالنَّفْسُ شَيْ‏ءٌ آخَرُ وَلَكِنْ أَرَدْتُ عِبَارَةً عَنْ نَفْسِي إِذْ كُنْتُ مَسْئُولاً وَإِفْهَاماً لَكَ إِذْ كُنْتَ سَائِلاً فَأَقُولُ إِنَّهُ سَمِيعٌ بِكُلِّهِ لا أَنَّ الْكُلَّ مِنْهُ لَهُ بَعْضٌ وَلَكِنِّي أَرَدْتُ إِفْهَامَكَ وَالتَّعْبِيرُ عَنْ نَفْسِي وَلَيْسَ مَرْجِعِي فِي ذَلِكَ إِلا إِلَى أَنَّهُ السَّمِيعُ الْبَصِيرُ الْعَالِمُ الْخَبِيرُ بِلا اخْتِلافِ الذَّاتِ وَلا اخْتِلافِ الْمَعْنَى قَالَ لَهُ السَّائِلُ فَمَا هُوَ قَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) هُوَ الرَّبُّ وَهُوَ الْمَعْبُودُ وَهُوَ الله وَلَيْسَ قَوْلِي الله إِثْبَاتَ هَذِهِ الْحُرُوفِ أَلِفٍ وَلامٍ وَهَاءٍ وَلا رَاءٍ وَلا بَاءٍ وَلَكِنِ ارْجِعْ إِلَى مَعْنًى وَشَيْ‏ءٍ خَالِقِ الاشْيَاءِ وَصَانِعِهَا وَنَعْتِ هَذِهِ الْحُرُوفِ وَهُوَ الْمَعْنَى سُمِّيَ بِهِ الله وَالرَّحْمَنُ وَالرَّحِيمُ وَالْعَزِيزُ وَأَشْبَاهُ ذَلِكَ مِنْ أَسْمَائِهِ وَهُوَ الْمَعْبُودُ جَلَّ وَعَزَّ قَالَ لَهُ السَّائِلُ فَإِنَّا لَمْ نَجِدْ مَوْهُوماً إِلا مَخْلُوقاً قَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) لَوْ كَانَ ذَلِكَ كَمَا تَقُولُ لَكَانَ التَّوْحِيدُ عَنَّا مُرْتَفِعاً لانَّا لَمْ نُكَلَّفْ غَيْرَ مَوْهُومٍ وَلَكِنَّا نَقُولُ كُلُّ مَوْهُومٍ بِالْحَوَاسِّ مُدْرَكٍ بِهِ تَحُدُّهُ الْحَوَاسُّ وَتُمَثِّلُهُ فَهُوَ مَخْلُوقٌ إِذْ كَانَ النَّفْيُ هُوَ الابْطَالَ وَالْعَدَمَ وَالْجِهَةُ الثَّانِيَةُ التَّشْبِيهُ إِذْ كَانَ التَّشْبِيهُ هُوَ صِفَةَ الْمَخْلُوقِ الظَّاهِرِ التَّرْكِيبِ وَالتَّأْلِيفِ فَلَمْ يَكُنْ بُدٌّ مِنْ إِثْبَاتِ الصَّانِعِ لِوُجُودِ الْمَصْنُوعِينَ وَالاضْطِرَارِ إِلَيْهِمْ أَنَّهُمْ مَصْنُوعُونَ وَأَنَّ صَانِعَهُمْ غَيْرُهُمْ وَلَيْسَ مِثْلَهُمْ إِذْ كَانَ مِثْلُهُمْ شَبِيهاً بِهِمْ فِي ظَاهِرِ التَّرْكِيبِ وَالتَّأْلِيفِ وَفِيمَا يَجْرِي عَلَيْهِمْ مِنْ حُدُوثِهِمْ بَعْدَ إِذْ لَمْ يَكُونُوا وَتَنَقُّلِهِمْ مِنَ صِغَرٍ إِلَى كِبَرٍ وَسَوَادٍ إِلَى بَيَاضٍ وَقُوَّةٍ إِلَى ضَعْفٍ وَأَحْوَالٍ مَوْجُودَةٍ لا حَاجَةَ بِنَا إِلَى تَفْسِيرِهَا لِبَيَانِهَا وَوُجُودِهَا قَالَ لَهُ السَّائِلُ فَقَدْ حَدَدْتَهُ إِذْ أَثْبَتَّ وُجُودَهُ قَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) لَمْ أَحُدَّهُ وَلَكِنِّي أَثْبَتُّهُ إِذْ لَمْ يَكُنْ بَيْنَ النَّفْيِ وَالاثْبَاتِ مَنْزِلَةٌ قَالَ لَهُ السَّائِلُ فَلَهُ إِنِّيَّةٌ وَمَائِيَّةٌ قَالَ نَعَمْ لا يُثْبَتُ الشَّيْ‏ءُ إِلا بِإِنِّيَّةٍ وَمَائِيَّةٍ قَالَ لَهُ السَّائِلُ فَلَهُ كَيْفِيَّةٌ قَالَ لا لانَّ الْكَيْفِيَّةَ جِهَةُ الصِّفَةِ وَالاحَاطَةِ وَلَكِنْ لا بُدَّ مِنَ الْخُرُوجِ مِنْ جِهَةِ التَّعْطِيلِ وَالتَّشْبِيهِ لانَّ مَنْ نَفَاهُ فَقَدْ أَنْكَرَهُ وَدَفَعَ رُبُوبِيَّتَهُ وَأَبْطَلَهُ وَمَنْ شَبَّهَهُ بِغَيْرِهِ فَقَدْ أَثْبَتَهُ بِصِفَةِ الْمَخْلُوقِينَ الْمَصْنُوعِينَ الَّذِينَ لا يَسْتَحِقُّونَ الرُّبُوبِيَّةَ وَلَكِنْ لا بُدَّ مِنْ إِثْبَاتِ أَنَّ لَهُ كَيْفِيَّةً لا يَسْتَحِقُّهَا غَيْرُهُ وَلا يُشَارِكُ فِيهَا وَلا يُحَاطُ بِهَا وَلا يَعْلَمُهَا غَيْرُهُ قَالَ السَّائِلُ فَيُعَانِي الاشْيَاءَ بِنَفْسِهِ قَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) هُوَ أَجَلُّ مِنْ أَنْ يُعَانِيَ الاشْيَاءَ بِمُبَاشَرَةٍ وَمُعَالَجَةٍ لانَّ ذَلِكَ صِفَةُ الْمَخْلُوقِ الَّذِي لا تَجِي‏ءُ الاشْيَاءُ لَهُ إِلا بِالْمُبَاشَرَةِ وَالْمُعَالَجَةِ وَهُوَ مُتَعَالٍ نَافِذُ الارَادَةِ وَالْمَشِيئَةِ فَعَّالٌ لِمَا يَشَاءُ.",
            "englishTranslation": "6. It is narrated from Imam abu “Abdallah , who said this to an atheist on being asked a question. “He (Allah) is a thing but different from all other things. I repeat my statement that speaks about Him as a thing. He is a thing in the sense of the reality of things except that He does not have a body and form. He does not have a feeling (like our sense of feeling) or touching and He does not comprehend with the five senses (as we do). Imaginations can not comprehend Him and the timeless (Dahr) times does not reduce Him and the times do not change Him.” The man asking questions then said, “Do you say that He hears and sees?” The Imam said, “He does hear and see: He hears without a hearing organ and sees without a means. He Himself hears and He Himself sees. My saying “He hears without a hearing organ and sees without a means. He Himself hears and He Himself sees” does not mean that He is a thing and His-self is another thing but that I only meant to express my self thereby as I was questioned and explained to you as you had asked a question. Thus, I can say that He hears with the whole of His-self but not in the sense that His whole self has parts but that I intended to explain it to you and to express my self. All I meant thereby is that He does hear, see and He is all-knowing and is the expert in knowing without any multiplicity in His-self or meaning. The man asking questions then said, “What then is He?” The Imam said, “He is the Lord. He is the One Who is worshipped and He is Allah. When I say Allah, it does not mean establishing the proof for these letters (of alphabet) like Alif, Lam, Ha’, al-Ra’ or al-Ba’ but I intend thereby the meaning of a thing and a thing that is the Creator of all things and the Designer of all things. These letters only refer to the meaning that is called Allah, al-Rahman (the Beneficent), al-Rahim (the Merciful), al-‘Aziz (the Majestic) etc., of the other such names and He is the One Who is worshipped, the Majestic, the Glorious One.” The man asking questions then said, “Given the above, whatever we can think of is but a creature.” The Imam then said, “Were it to the way you said we would not have had any responsibility to believe in the Oneness of the Creator because we will not have any responsibility towards something of whose existence we can not even think of. In fact we say that whatever is thought of in our senses is comprehended thereby by means of drawing limits around it and is analogized, thus, such a thing is a creature. (It then becomes necessary for us to find proof for the existence of the Creator of things.(We must find that is) clear of the two invalid and confusing aspects) if the meaning of negation would be nullification and nothingness or as is the case of the second aspect, the similarity and analogy which is of the attributes of the creatures that under go manifest composition and assemblage. It becomes necessary to prove the existence of the Creator. It is because of the existence of the creatures and their evident dependency on Him as His creatures and that their Creator is something other than them and that He is not similar to them because something similar to them would resemble them in manifest composition and assemblage. It would be as such also in the matters such as coming into existence from nothing and their changing from a smaller size to a full grown size, from blackness to whiteness from strength to weakness and other existing conditions that we do not need to explain their existence.” The man asking questions then said, “You have already defined and limited Him in your proving His existence.” The Imam  then said, “I did not limit Him. I only proved His existence if (as you think) there is no difference between proving and disproving.” The man asking questions then said, “Can His existence be proved through a reasoning from the effect to the cause or the cause to the effect?” The Imam said, “Yes, there is nothing whose existence can be proved without adopting either of the two above process of reasoning.” The man then asked, “Does the question how apply to Him?” The Imam said, “No, this question does not apply to Him because it is the aspect of qualities and limitations. However, it is necessary to avoid abandoning and analogizing Him because negating Him is denying His existence and refusing to accept Him as the Lord and abandoning Him altogether. Whoever would analogize Him with other things from His creatures he has proved the qualities of the creature in Him, the creatures that do not deserve being called the Lord. It, however, is necessary to believe that the question how applies to Him only in a way that would not apply to things other than Him and things other than Him would not deserve and share Him in it. The how question can not apply to Him if it would limit Him or make Him the subject of knowing for others.” The man then asked, “Do things make Him tired?” The Imam then said, “He is far Exalted and above experiencing such conditions. Such conditions are due to coming into physical association or dealing with the creatures. They are of the qualities of the creatures who can only associate with others through physical contact but He is the Most High and His will and demand are effective and He does whatever He wants.”"
          }
        ]
      },
      "5": {
        "Al-Kafi - Volume 1: Chapter on Who is Worshipped": [
          {
            "number": "Hadith #3",
            "url": "https://thaqalayn.net/hadith/1/3/5/3",
            "arabicText": "3ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنِ الْعَبَّاسِ بْنِ مَعْرُوفٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي نَجْرَانَ قَالَ كَتَبْتُ إِلَى ابي جعفر (عَلَيْهِ السَّلام) أَوْ قُلْتُ لَهُ جَعَلَنِي الله فِدَاكَ نَعْبُدُ الرَّحْمَنَ الرَّحِيمَ الْوَاحِدَ الاحَدَ الصَّمَدَ قَالَ فَقَالَ إِنَّ مَنْ عَبَدَ الاسْمَ دُونَ الْمُسَمَّى بِالاسْمَاءِ أَشْرَكَ وَكَفَرَ وَجَحَدَ وَلَمْ يَعْبُدْ شَيْئاً بَلِ اعْبُدِ الله الْوَاحِدَ الاحَدَ الصَّمَدَ الْمُسَمَّى بِهَذِهِ الاسْمَاءِ دُونَ الاسْمَاءِ إِنَّ الاسْمَاءَ صِفَاتٌ وَصَفَ بِهَا نَفْسَهُ.",
            "englishTranslation": "3. Ali ibn Ibrahim has narrated from ‘Abbass al-Ma‘ruf from ‘Abd al-Rahman ibn abu Najran who has the following. I wrote or said to Imam abu Ja‘far ’Abdallah , “May Allah take my soul in your service. Do we worship the Beneficent, the Merciful, the One who is One only and Self-sufficient?” The Imam then said, “Whoever worships the names without the meaning for which they stand he has become a polytheist and has denied the existence of Allah and has worshipped nothing. You must worship Allah who is the One and only One, the Self-sufficient, Who is the meaning for these names but not these names. The names are attributes that He has said are of His attributes.”"
          }
        ]
      },
      "7": {
        "Al-Kafi - Volume 1: Chapter On The relationships (Nisbah) Of Allah": [
          {
            "number": "Hadith #4",
            "url": "https://thaqalayn.net/hadith/1/3/7/4",
            "arabicText": "4ـ مُحَمَّدُ بْنُ أَبِي عَبْدِ الله رَفَعَهُ عَنْ عَبْدِ الْعَزِيزِ بْنِ الْمُهْتَدِي قَالَ سَأَلْتُ الرِّضَا (عَلَيْهِ السَّلام) عَنِ التَّوْحِيدِ فَقَالَ كُلُّ مَنْ قَرَأَ قُلْ هُوَ الله أَحَدٌ وَآمَنَ بِهَا فَقَدْ عَرَفَ التَّوْحِيدَ قُلْتُ كَيْفَ يَقْرَأُهَا قَالَ كَمَا يَقْرَأُهَا النَّاسُ وَزَادَ فِيهِ كَذَلِكَ الله رَبِّي كَذَلِكَ الله رَبِّي.",
            "englishTranslation": "4. Muhammad ibn abu ‘Abdallah in a marfu‘ manner has narrated from ’Abd al-‘Aziz ibn al-Muhtadi who has said the following. “I asked Imam Ali al-Rida  about the Oneness of Allah.” He replied, “Whoever recites Chapter 112 of the holy Quran: In the Name of Allah, the Beneficent, the Merciful (Muhammad), say, “He is the only God (112:1). God is Absolute (112:2). He neither begets nor was He begotten (112:3). There is no one equal to Him (112:4). and also believes in it, he has really acknowledged the Oneness of Allah.” I asked, “How should I recite it (the chapter 112)?” The Imam replied, “Recite it as the people do.” And then the Imam added, “Such is Allah, my Lord. Such is Allah, my Lord.”"
          }
        ]
      },
      "8": {
        "Al-Kafi - Volume 1: Chapter On Prohibition on Saying How is Allah (al-Kayfiyyah)": [
          {
            "number": "Hadith #3",
            "url": "https://thaqalayn.net/hadith/1/3/8/3",
            "arabicText": "3ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي أَيُّوبَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) يَا مُحَمَّدُ إِنَّ النَّاسَ لا يَزَالُ بِهِمُ الْمَنْطِقُ حَتَّى يَتَكَلَّمُوا فِي الله فَإِذَا سَمِعْتُمْ ذَلِكَ فَقُولُوا لا إِلَهَ إِلا الله الْوَاحِدُ الَّذِي لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ.",
            "englishTranslation": "3. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from abu Ayyub from Muhammad ibn Muslim from Imam abu ‘Abdallah  who has said the following. “O Muhammad, people rationalize everything. They even speak about Allah’s self. When you hear such discources, say to them ‘There is no god but Allah, the One and no one is similar to Him.’”"
          }
        ]
      },
      "9": {
        "Al-Kafi - Volume 1: Chapter On The Invalidity of the Belief to see God (Ru’yah of Allah)": [
          {
            "number": "Hadith #4",
            "url": "https://thaqalayn.net/hadith/1/3/9/4",
            "arabicText": "4ـ وَعَنْهُ عَنْ أَحْمَدَ بْنِ إِسْحَاقَ قَالَ كَتَبْتُ إِلَى أَبِي الْحَسَنِ الثَّالِثِ (عَلَيْهِ السَّلام) أَسْأَلُهُ عَنِ الرُّؤْيَةِ وَمَا اخْتَلَفَ فِيهِ النَّاسُ فَكَتَبَ لا تَجُوزُ الرُّؤْيَةُ مَا لَمْ يَكُنْ بَيْنَ الرَّائِي وَالْمَرْئِيِّ هَوَاءٌ لَمْ يَنْفُذْهُ الْبَصَرُ فَإِذَا انْقَطَعَ الْهَوَاءُ عَنِ الرَّائِي وَالْمَرْئِيِّ لَمْ تَصِحَّ الرُّؤْيَةُ وَكَانَ فِي ذَلِكَ الاشْتِبَاهُ لانَّ الرَّائِيَ مَتَى سَاوَى الْمَرْئِيَّ فِي السَّبَبِ الْمُوجِبِ بَيْنَهُمَا فِي الرُّؤْيَةِ وَجَبَ الاشْتِبَاهُ وَكَانَ ذَلِكَ التَّشْبِيهُ لانَّ الاسْبَابَ لا بُدَّ مِنِ اتِّصَالِهَا بِالْمُسَبَّبَاتِ.",
            "englishTranslation": "4. It is narrated from the same narrator (Ahmad ibn Idris) from Ahmad ibn Ishaq who has said the following. “I wrote to Imam abul Hassan the 3rd and asked him about eye-witnessing Allah’s self and the differences among people about this issue. The Imam  answered in writing.” “Eye-witnessing Allah’s self is not possible until there is air (light-carrier medium) that would let the light reach the eye. If air is remove from (space between) the viewer and the object, no eye-witnessing will take place. In this is ground for similarity. When the viewer and the object in view would have the same medium that make eye-witnessing possible a similarity must exist therein. (When applying this to the case of Allah) it is an analogy and similarity. The means must have a connection with the source.”"
          }
        ]
      },
      "10": {
        "Al-Kafi - Volume 1: Chapter On Prohibition on Attributing to Allah What He Himself has not Done so": [
          {
            "number": "Hadith #2",
            "url": "https://thaqalayn.net/hadith/1/3/10/2",
            "arabicText": "2ـ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ عَنْ أَبِي حَمْزَةَ قَالَ قَالَ لِي عَلِيُّ بن الحسين (عَلَيْهما السَّلام) يَا أَبَا حَمْزَةَ إِنَّ الله لا يُوصَفُ بِمَحْدُودِيَّةٍ عَظُمَ رَبُّنَا عَنِ الصِّفَةِ فَكَيْفَ يُوصَفُ بِمَحْدُودِيَّةٍ مَنْ لا يُحَدُّ وَلا تُدْرِكُهُ الابْصَارُ وَهُوَ يُدْرِكُ الابْصَارَ وَهُوَ اللَّطِيفُ الْخَبِيرُ.",
            "englishTranslation": "2. Muhammad ibn Isma‘il has narrated from al-Fadl ibn Shadhan from Ibn Abi ‘Umayr from Ibrahim ibn ‘Abd al-Hamid from abu Hamzah who has said that Imam Ali ibn al-Husayn said to me, “O abu Hamzah, Allah cannot be defined by the created things. Our Lord is far above being described through the attributes. How can the infinite be defined by the finite? ‘ No mortal eyes can see Him, but He can see all eyes. He is All-kind and All-aware.’” (6:103)"
          }
        ]
      },
      "11": {
        "Al-Kafi - Volume 1: Chapter On Prohibition on Considering Allah as having Body (JISM) and Form (SURAH)": [
          {
            "number": "Hadith #3",
            "url": "https://thaqalayn.net/hadith/1/3/11/3",
            "arabicText": "3ـ مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ مُحَمَّدِ بْنِ زَيْدٍ قَالَ جِئْتُ إِلَى الرِّضَا (عَلَيْهِ السَّلام) أَسْأَلُهُ عَنِ التَّوْحِيدِ فَأَمْلَى عَلَيَّ الْحَمْدُ لله فَاطِرِ الاشْيَاءِ إِنْشَاءً وَمُبْتَدِعِهَا ابْتِدَاعاً بِقُدْرَتِهِ وَحِكْمَتِهِ لا مِنْ شَيْ‏ءٍ فَيَبْطُلَ الاخْتِرَاعُ وَلا لِعِلَّةٍ فَلا يَصِحَّ الابْتِدَاعُ خَلَقَ مَا شَاءَ كَيْفَ شَاءَ مُتَوَحِّداً بِذَلِكَ لاظْهَارِ حِكْمَتِهِ وَحَقِيقَةِ رُبُوبِيَّتِهِ لا تَضْبِطُهُ الْعُقُولُ وَلا تَبْلُغُهُ الاوْهَامُ وَلا تُدْرِكُهُ الابْصَارُ وَلا يُحِيطُ بِهِ مِقْدَارٌ عَجَزَتْ دُونَهُ الْعِبَارَةُ وَكَلَّتْ دُونَهُ الابْصَارُ وَضَلَّ فِيهِ تَصَارِيفُ الصِّفَاتِ احْتَجَبَ بِغَيْرِ حِجَابٍ مَحْجُوبٍ وَاسْتَتَرَ بِغَيْرِ سِتْرٍ مَسْتُورٍ عُرِفَ بِغَيْرِ رُؤْيَةٍ وَوُصِفَ بِغَيْرِ صُورَةٍ وَنُعِتَ بِغَيْرِ جِسْمٍ لا إِلَهَ إِلا الله الْكَبِيرُ الْمُتَعَالِ.",
            "englishTranslation": "3. Muhammad ibn al-Hassan has narrated from Sahl ibn Ziyad from Muhammad ibn Isma‘il ibn Bazi‘ from Muhammad ibn Zayd who has said the following. “I went to Imam al-Rida  to ask about the Oneness of Allah (God). The Imam dictated to me thus, ‘All praise belongs to Allah, Who is the originator of all things. He is the inventor of all things, an invention that came from His power and wisdom but not from a thing so it would invalidate the invention and not from a cause so it would invalidate the novelty. He created whatever He wanted and howsoever He liked. He alone did all this to manifest His Wisdom and the truth of His Providence. Intelligence cannot comprehend Him, (Awham) imagination cannot reach Him, eyes cannot see Him and measurements cannot confine Him. The power of expression is unable to express Him in words. All sights are exhausted from reaching Him and the power of describing and defining have gone astray in its description and definition of His-self. He is hidden without any veil and is concealed without any covering. He is known without being seen; described without any form, and praised without any body. There is no god, except Allah, the Great, the Most High.’”"
          },
          {
            "number": "Hadith #5",
            "url": "https://thaqalayn.net/hadith/1/3/11/5",
            "arabicText": "5ـ عَلِيُّ بْنُ مُحَمَّدٍ رَفَعَهُ عَنْ مُحَمَّدِ بْنِ الْفَرَجِ الرُّخَّجِيِّ قَالَ كَتَبْتُ إِلَى أَبِي الْحَسَنِ (عَلَيْهِ السَّلام) أَسْأَلُهُ عَمَّا قَالَ هِشَامُ بْنُ الْحَكَمِ فِي الْجِسْمِ وَهِشَامُ بْنُ سَالِمٍ فِي الصُّورَةِ فَكَتَبَ دَعْ عَنْكَ حَيْرَةَ الْحَيْرَانِ وَاسْتَعِذْ بِالله مِنَ الشَّيْطَانِ لَيْسَ الْقَوْلُ مَا قَالَ الْهِشَامَانِ.",
            "englishTranslation": "5. Ali ibn Muhammad, in a marfu‘ manner, has narrated from Muhammad ibn al-Faraj al-Rukhkhaji who has said the following. “I wrote to Imam abu al-Hassan , about the words of Hisham ibn al-Hakam, about the body and the words of Hisham ibn Salim about the form (of Allah). He wrote in reply, ‘Remove from thyself the confusion of the confounded people and seek refuge from Allah against Shaytan (Satan). What the two Hishams have said is not correct.’”"
          }
        ]
      },
      "16": {
        "Al-Kafi - Volume 1: Chapter On The Meanings of the Names of Allah and their Derivatives": [
          {
            "number": "Hadith #12",
            "url": "https://thaqalayn.net/hadith/1/3/16/12",
            "arabicText": "12ـ عَلِيُّ بْنُ مُحَمَّدٍ وَمُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ وَمُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى جَمِيعاً عَنْ أَبِي هَاشِمٍ الْجَعْفَرِيِّ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ الثَّانِيَ (عَلَيْهِ السَّلام) مَا مَعْنَى الْوَاحِدِ فَقَالَ إِجْمَاعُ الالْسُنِ عَلَيْهِ بِالْوَحْدَانِيَّةِ كَقَوْلِهِ تَعَالَى وَلَئِنْ سَأَلْتَهُمْ مَنْ خَلَقَهُمْ لَيَقُولُنَّ الله.",
            "englishTranslation": "12. Ali ibn Muhammad and Muhammad ibn al-Hassan has narrated from Sahl ibn Ziyad and Muhammad ibn Yahya from Ahmad ibn Muhammad ibn ‘Isa all of them from abu Hashim al-Ja‘fari who has said the following. “I asked abu Ja‘far al-Thani, the 2nd , “What is the meaning of the One?” The Imam replied, “It means the unanimity of all tongues in speaking of Allah’s Oneness. If you ask them as to who has created them, they all say it is Allah, Who has created them.”"
          }
        ]
      },
      "19": {
        "Al-Kafi - Volume 1: Chapter on Motion and Change": [
          {
            "number": "Hadith #4",
            "url": "https://thaqalayn.net/hadith/1/3/19/4",
            "arabicText": "4ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عِيسَى قَالَ كَتَبْتُ إِلَى أَبِي الْحَسَنِ عَلِيِّ بْنِ مُحَمَّدٍ (عَلَيْهما السَّلام) جَعَلَنِيَ الله فِدَاكَ يَا سَيِّدِي قَدْ رُوِيَ لَنَا أَنَّ الله فِي مَوْضِعٍ دُونَ مَوْضِعٍ عَلَى الْعَرْشِ اسْتَوَى وَأَنَّهُ يَنْزِلُ كُلَّ لَيْلَةٍ فِي النِّصْفِ الاخِيرِ مِنَ اللَّيْلِ إِلَى السَّمَاءِ الدُّنْيَا وَرُوِيَ أَنَّهُ يَنْزِلُ عَشِيَّةَ عَرَفَةَ ثُمَّ يَرْجِعُ إِلَى مَوْضِعِهِ فَقَالَ بَعْضُ مَوَالِيكَ فِي ذَلِكَ إِذَا كَانَ فِي مَوْضِعٍ دُونَ مَوْضِعٍ فَقَدْ يُلاقِيهِ الْهَوَاءُ وَيَتَكَنَّفُ عَلَيْهِ وَالْهَوَاءُ جِسْمٌ رَقِيقٌ يَتَكَنَّفُ عَلَى كُلِّ شَيْ‏ءٍ بِقَدْرِهِ فَكَيْفَ يَتَكَنَّفُ عَلَيْهِ جَلَّ ثَنَاؤُهُ عَلَى هَذَا الْمِثَالِ فَوَقَّعَ (عَلَيْهِ السَّلام) عِلْمُ ذَلِكَ عِنْدَهُ وَهُوَ الْمُقَدِّرُ لَهُ بِمَا هُوَ أَحْسَنُ تَقْدِيراً وَاعْلَمْ أَنَّهُ إِذَا كَانَ فِي السَّمَاءِ الدُّنْيَا فَهُوَ كَمَا هُوَ عَلَى الْعَرْشِ وَالاشْيَاءُ كُلُّهَا لَهُ سَوَاءٌ عِلْماً وَقُدْرَةً وَمُلْكاً وَإِحَاطَةً.  وَعَنْهُ عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ الْكُوفِيِّ عَنْ مُحَمَّدِ بْنِ عِيسَى مِثْلَهُ.  فِي قَوْلِهِ تَعَالَى ما يَكُونُ مِنْ نَجْوى‏ ثَلاثَةٍ إِلا هُوَ رابِعُهُمْ.",
            "englishTranslation": "4. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Muhammad ibn ‘Isa who has said the following. “I wrote to Imam abu al-Hassan, Ali ibn Muhammad  to clarify a question. May Allah take my soul in your service, O my master, it is narrated to us that Allah is in one place and not in another place on ‘Arsh, (the Throne) resting. He comes down to the sky above the earth every night during the last half of the night. It is narrated that He comes down at the ninth evening of the month of Dhul Hajj and then He returns back to His place. Certain individuals among your friends have said that if He would be found in certain places and not in other places the air must have come in contact with Him and would surround Him because air is a thin form of body that surrounds everything proportionate to its size. How then the air would surround Allah, the Most Holy and the Most High, According to this assumption? The Imam replied in writing, “He has the knowledge of this. He is the best One in having the true measurements of all things. You must, However, note that His being in the sky over the earth is just as He on the Throne. All things to Him are the same in the matters of His knowledge and power, domination and control.” Muhammad ibn Ja‘far al-Kufi has narrated from Muhammad ibn ’Isa a similar Hadith About the words of Allah “There is not a single place wherein any secret counsel can take place between any three people without God being the fourth, . .” (58:7)."
          }
        ]
      },
      "22": {
        "Al-Kafi - Volume 1: Chapter on Comprehensive (Ahadith) about the Oneness of Allah": [
          {
            "number": "Hadith #1",
            "url": "https://thaqalayn.net/hadith/1/3/22/1",
            "arabicText": "1ـ مُحَمَّدُ بْنُ أَبِي عَبْدِ الله وَمُحَمَّدُ بْنُ يَحْيَى جَمِيعاً رَفَعَاهُ إِلَى أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) أَنَّ أَمِيرَ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) اسْتَنْهَضَ النَّاسَ فِي حَرْبِ مُعَاوِيَةَ فِي الْمَرَّةِ الثَّانِيَةِ فَلَمَّا حَشَدَ النَّاسُ قَامَ خَطِيباً فَقَالَ الْحَمْدُ لله الْوَاحِدِ الاحَدِ الصَّمَدِ الْمُتَفَرِّدِ الَّذِي لا مِنْ شَيْ‏ءٍ كَانَ وَلا مِنْ شَيْ‏ءٍ خَلَقَ مَا كَانَ قُدْرَةٌ بَانَ بِهَا مِنَ الاشْيَاءِ وَبَانَتِ الاشْيَاءُ مِنْهُ فَلَيْسَتْ لَهُ صِفَةٌ تُنَالُ وَلا حَدٌّ تُضْرَبُ لَهُ فِيهِ الامْثَالُ كَلَّ دُونَ صِفَاتِهِ تَحْبِيرُ اللُّغَاتِ وَضَلَّ هُنَاكَ تَصَارِيفُ الصِّفَاتِ وَحَارَ فِي مَلَكُوتِهِ عَمِيقَاتُ مَذَاهِبِ التَّفْكِيرِ وَانْقَطَعَ دُونَ الرُّسُوخِ فِي عِلْمِهِ جَوَامِعُ التَّفْسِيرِ وَحَالَ دُونَ غَيْبِهِ الْمَكْنُونِ حُجُبٌ مِنَ الْغُيُوبِ تَاهَتْ فِي أَدْنَى أَدَانِيهَا طَامِحَاتُ الْعُقُولِ فِي لَطِيفَاتِ الامُورِ فَتَبَارَكَ الله الَّذِي لا يَبْلُغُهُ بُعْدُ الْهِمَمِ وَلا يَنَالُهُ غَوْصُ الْفِطَنِ وَتَعَالَى الَّذِي لَيْسَ لَهُ وَقْتٌ مَعْدُودٌ وَلا أَجَلٌ مَمْدُودٌ وَلا نَعْتٌ مَحْدُودٌ سُبْحَانَ الَّذِي لَيْسَ لَهُ أَوَّلٌ مُبْتَدَأٌ وَلا غَايَةٌ مُنْتَهًى وَلا آخِرٌ يَفْنَى سُبْحَانَهُ هُوَ كَمَا وَصَفَ نَفْسَهُ وَالْوَاصِفُونَ لا يَبْلُغُونَ نَعْتَهُ وَحَدَّ الاشْيَاءَ كُلَّهَا عِنْدَ خَلْقِهِ إِبَانَةً لَهَا مِنْ شِبْهِهِ وَإِبَانَةً لَهُ مِنْ شِبْهِهَا لَمْ يَحْلُلْ فِيهَا فَيُقَالَ هُوَ فِيهَا كَائِنٌ وَلَمْ يَنْأَ عَنْهَا فَيُقَالَ هُوَ مِنْهَا بَائِنٌ وَلَمْ يَخْلُ مِنْهَا فَيُقَالَ لَهُ أَيْنَ لَكِنَّهُ سُبْحَانَهُ أَحَاطَ بِهَا عِلْمُهُ وَأَتْقَنَهَا صُنْعُهُ وَأَحْصَاهَا حِفْظُهُ لَمْ يَعْزُبْ عَنْهُ خَفِيَّاتُ غُيُوبِ الْهَوَاءِ وَلا غَوَامِضُ مَكْنُونِ ظُلَمِ الدُّجَى وَلا مَا فِي السَّمَاوَاتِ الْعُلَى إِلَى الارَضِينَ السُّفْلَى لِكُلِّ شَيْ‏ءٍ مِنْهَا حَافِظٌ وَرَقِيبٌ وَكُلُّ شَيْ‏ءٍ مِنْهَا بِشَيْ‏ءٍ مُحِيطٌ وَالْمُحِيطُ بِمَا أَحَاطَ مِنْهَا الْوَاحِدُ الاحَدُ الصَّمَدُ الَّذِي لا يُغَيِّرُهُ صُرُوفُ الازْمَانِ وَلا يَتَكَأَّدُهُ صُنْعُ شَيْ‏ءٍ كَانَ إِنَّمَا قَالَ لِمَا شَاءَ كُنْ فَكَانَ ابْتَدَعَ مَا خَلَقَ بِلا مِثَالٍ سَبَقَ وَلا تَعَبٍ وَلا نَصَبٍ وَكُلُّ صَانِعِ شَيْ‏ءٍ فَمِنْ شَيْ‏ءٍ صَنَعَ وَالله لا مِنْ شَيْ‏ءٍ صَنَعَ مَا خَلَقَ وَكُلُّ عَالِمٍ فَمِنْ بَعْدِ جَهْلٍ تَعَلَّمَ وَالله لَمْ يَجْهَلْ وَلَمْ يَتَعَلَّمْ أَحَاطَ بِالاشْيَاءِ عِلْماً قَبْلَ كَوْنِهَا فَلَمْ يَزْدَدَ بِكَوْنِهَا عِلْماً عِلْمُهُ بِهَا قَبْلَ أَنْ يُكَوِّنَهَا كَعِلْمِهِ بَعْدَ تَكْوِينِهَا لَمْ يُكَوِّنْهَا لِتَشْدِيدِ سُلْطَانٍ وَلا خَوْفٍ مِنْ زَوَالٍ وَلا نُقْصَانٍ وَلا اسْتِعَانَةٍ عَلَى ضِدٍّ مُنَاوٍ وَلا نِدٍّ مُكَاثِرٍ وَلا شَرِيكٍ مُكَابِرٍ لَكِنْ خَلائِقُ مَرْبُوبُونَ وَعِبَادٌ دَاخِرُونَ فَسُبْحَانَ الَّذِي لا يَئُودُهُ خَلْقُ مَا ابْتَدَأَ وَلا تَدْبِيرُ مَا بَرَأَ وَلا مِنْ عَجْزٍ وَلا مِنْ فَتْرَةٍ بِمَا خَلَقَ اكْتَفَى عَلِمَ مَا خَلَقَ وَخَلَقَ مَا عَلِمَ لا بِالتَّفْكِيرِ فِي عِلْمٍ حَادِثٍ أَصَابَ مَا خَلَقَ وَلا شُبْهَةٍ دَخَلَتْ عَلَيْهِ فِيمَا لَمْ يَخْلُقْ لَكِنْ قَضَاءٌ مُبْرَمٌ وَعِلْمٌ مُحْكَمٌ وَأَمْرٌ مُتْقَنٌ تَوَحَّدَ بِالرُّبُوبِيَّةِ وَخَصَّ نَفْسَهُ بِالْوَحْدَانِيَّةِ وَاسْتَخْلَصَ بِالْمَجْدِ وَالثَّنَاءِ وَتَفَرَّدَ بِالتَّوْحِيدِ وَالْمَجْدِ وَالسَّنَاءِ وَتَوَحَّدَ بِالتَّحْمِيدِ وَتَمَجَّدَ بِالتَّمْجِيدِ وَعَلا عَنِ اتِّخَاذِ الابْنَاءِ وَتَطَهَّرَ وَتَقَدَّسَ عَنْ مُلامَسَةِ النِّسَاءِ وَعَزَّ وَجَلَّ عَنْ مُجَاوَرَةِ الشُّرَكَاءِ فَلَيْسَ لَهُ فِيمَا خَلَقَ ضِدٌّ وَلا لَهُ فِيمَا مَلَكَ نِدٌّ وَلَمْ يَشْرَكْهُ فِي مُلْكِهِ أَحَدٌ الْوَاحِدُ الاحَدُ الصَّمَدُ الْمُبِيدُ لِلابَدِ وَالْوَارِثُ لِلامَدِ الَّذِي لَمْ يَزَلْ وَلا يَزَالُ وَحْدَانِيّاً أَزَلِيّاً قَبْلَ بَدْءِ الدُّهُورِ وَبَعْدَ صُرُوفِ الامُورِ الَّذِي لا يَبِيدُ وَلا يَنْفَدُ بِذَلِكَ أَصِفُ رَبِّي فَلا إِلَهَ إِلا الله مِنْ عَظِيمٍ مَا أَعْظَمَهُ وَمِنْ جَلِيلٍ مَا أَجَلَّهُ وَمِنْ عَزِيزٍ مَا أَعَزَّهُ وَتَعَالَى عَمَّا يَقُولُ الظَّالِمُونَ عُلُوّاً كَبِيراً.",
            "englishTranslation": "1. Muhammad ibn abu ‘Abdallah and Muhammad ibn Yahya - both in a marfu‘ manner- have narrated from Imam abu ‘Abdallah  who has said the following. “Imam Amirul Mu’minin mobilized people against Mu’awiya for the second time and when people came in multitudes he stood up to give a speeCh ‘All praise is due to Allah, the One, only One, the Self-sufficient, the Single one Who did not cone into being from anything and was not created from something that had come into being before. He is the power. With His power He is distinct from others and the other things became manifest through His power. There is no attribute that would reach Him and He has no limit for a definition or an analogy. All the linguistic beauty and expressions fall far short to express His attributes. In speaking of Him all attributes prove to be misleading. The depth of the schools of thoughts are perplexed and confused about the wonders of His kingdom. All the comprehensive interpretations have remained far short of establishing any footing in His knowledge. The barriers of the unseen have curtained His treasured secrets. The high flying ambitious intelligence with the ability to reach the depth of very subtle matters lose their way at the very beginning of their journey to Him. Most Holy is Allah. To Him not even the far-reaching ambitions are able to reaCh No deep diving intelligence is able to comprehend Him. Most High is He Who is not subject to the effects of any calculated time or extended period or limited attributes. Glorious is He Who has no beginning for His start, a destination to approach or an end to diminish. Glorious is He Who is just the way He Himself has introduced. All those who speak of His praise can never praise fully and duly. He designed a limit for everything at the time He created them. It is because that there is no similarity between them and He and that because He is not similar to any thing else. He is not absolved in anything so that it could be said He is within anything and He is far from anything so that it could be said He has nothing to do with them (the creatures). He has not distanced Himself from them so that it can be said where is He? He is far Glorious (and above such associations). He has encompassed all things through His knowledge. He has made their design firm and has enumerated them for safe preservation. Even the unseen and hidden things in the air, is not unnoticed to Him. Nor things deeply hidden in the darkness of black nights, all things high above in heavens and down to the lowest earth are not unnoticed to Him. For everything there is a protector and a guard and everything therein has limits within something and a limit for that limit. He is the One, the only One, the self sufficient, Who is not subject to the changes due to times. The creation of things never over burdens Him. He only, when willing, commands it to exist (and it comes into existence). He invented whatever He has created without any examples to follow and without feeling of over burdened or exhaustion. All manufacturers manufacture things from something. Allah has not created whatever He has created from anything. Every knowledgeable one learns after being ignorant. He has not being ignorant and has not learned from any one. He has encompassed all things through His knowledge before their coming into existence and their existence has not increased any thing to His knowledge. He knew them before their coming into existence just as He knows them after their coming into existence. He did not bring them into existence to strengthen His authority or for fear of banishment or reduction. He did not bring them into existence as helpers against a competing opponent, and a peer who would be of more (power) or a partner who would show greatness. He created them as creatures that required preservation and protection as subdued servants. Glorious is He, Who does not become tired in the creation of what He has created or the preservation of all that He has formed into beings. He does not undergo in this work any weakness or exhaustion. Whatever He has created has deemed it sufficient. He knows what He has created and created what He knew. It did not happen as a result of new thinking that He found to be a correct one not because of some doubts that He may have found in whatever that He had not yet created. It is due His unchangeable decree, His firm knowledge and resolute command. He is the One only Lord and is very special in His Oneness. He is pure in His Glory and praise. He is the only one in Oneness, the Glory, in Highness, in Oneness in praiseworthiness and in Glory and Gloriousness. He is Far High above having children. He is far Holy and clean above involvement in touching women and by far Majestic and Glorious above the association of the partners. In whatever He has created there is nothing to oppose Him nor there is any thing in what He created to stand parallel to Him and no one shares Him His kingdom. He the One and only the Self-sufficient, Who brings the timeless time to an end, is the owner of the extended duration of time. He is the one Who is eternal with eternal Oneness before the beginning of the times and after all the changes in the creation. He is the one who never banishes or diminishes. Thus, I speak of my Lord. There is no lord besides Allah. He is the Great and of un-matching greatness. He is the Most Majestic and of unmatched Majesty. He is the Most Glorious and of unmatched Glory. He is far above what the unjust think of Him to be.”"
          },
          {
            "number": "Hadith #3",
            "url": "https://thaqalayn.net/hadith/1/3/22/3",
            "arabicText": "3ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنِ الْمُخْتَارِ بْنِ مُحَمَّدِ بْنِ الْمُخْتَارِ وَمُحَمَّدُ بْنُ الْحَسَنِ عَنْ عَبْدِ الله بْنِ الْحَسَنِ الْعَلَوِيِّ جَمِيعاً عَنِ الْفَتْحِ بْنِ يَزِيدَ الْجُرْجَانِيِّ قَالَ ضَمَّنِي وَأَبَا الْحَسَنِ (عَلَيْهِ السَّلام) الطَّرِيقُ فِي مُنْصَرَفِي مِنْ مَكَّةَ إِلَى خُرَاسَانَ وَهُوَ سَائِرٌ إِلَى الْعِرَاقِ فَسَمِعْتُهُ يَقُولُ مَنِ اتَّقَى الله يُتَّقَى وَمَنْ أَطَاعَ الله يُطَاعُ فَتَلَطَّفْتُ فِي الْوُصُولِ إِلَيْهِ فَوَصَلْتُ فَسَلَّمْتُ عَلَيْهِ فَرَدَّ عَلَيَّ السَّلامَ ثُمَّ قَالَ يَا فَتْحُ مَنْ أَرْضَى الْخَالِقَ لَمْ يُبَالِ بِسَخَطِ الْمَخْلُوقِ وَمَنْ أَسْخَطَ الْخَالِقَ فَقَمَنٌ أَنْ يُسَلِّطَ الله عَلَيْهِ سَخَطَ الْمَخْلُوقِ وَإِنَّ الْخَالِقَ لا يُوصَفُ إِلا بِمَا وَصَفَ بِهِ نَفْسَهُ وَأَنَّى يُوصَفُ الَّذِي تَعْجِزُ الْحَوَاسُّ أَنْ تُدْرِكَهُ وَالاوْهَامُ أَنْ تَنَالَهُ وَالْخَطَرَاتُ أَنْ تَحُدَّهُ وَالابْصَارُ عَنِ الاحَاطَةِ بِهِ جَلَّ عَمَّا وَصَفَهُ الْوَاصِفُونَ وَتَعَالَى عَمَّا يَنْعَتُهُ النَّاعِتُونَ نَأَى فِي قُرْبِهِ وَقَرُبَ فِي نَأْيِهِ فَهُوَ فِي نَأْيِهِ قَرِيبٌ وَفِي قُرْبِهِ بَعِيدٌ كَيَّفَ الْكَيْفَ فَلا يُقَالُ كَيْفَ وَأَيَّنَ الايْنَ فَلا يُقَالُ أَيْنَ إِذْ هُوَ مُنْقَطِعُ الْكَيْفُوفِيَّةِ وَالايْنُونِيَّةِ.",
            "englishTranslation": "3. Ali ibn Ibrahim has narrated from al-Mukhtar ibn Muhammad ibn al-Mukhtar and Muhammad ibn al-Hassan from ‘Abdallah ibn al-Hassan al-‘Alawi all from al-Fath ibn Yazid al-Jurjani who has said the following. “A road on my way back from Makkah to Khuransan joined me with Imam abu al-Hassan  the 2nd who was going to Iraq and I heard him saying, “Whoever observes piety before Allah he is protected and whoever obeys Allah he is obeyed.” I calmly walked to him and on reaching him I offered my salutation and he responded likewise and said, “O fath whoever pleases Allah is not worried about the anger of people. Whoever causes the Creator to become angry with him he deserves that Allah would cause to subject him to the anger of the people. One can only speak of the attributes of the Creator the way he Himself has spoken about Himself. How can a person speak of One from Whose perceiving all the senses are frustrated and even the imagination is not able to comprehend Him or ones sharp feelings would reach Him in any way or manner or the eyes would limit Him in any manner. He is far above the description of those who speak of His attributes and the praise of those who speak of His praise. He is far in His nearness and is near in His being far. He in His far-ness is near and is far in His nearness. He is the condition of the conditions and no one can say that He is in a condition or is somewhere. No one can about Him where because He is far above the conditions and places.”"
          }
        ]
      }
    }
  }
}