{
  "Volume #2": {
    "Book #1": {
      "Chapter #10": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 2: Serenity Is Belief",
          "Link": "https://thaqalayn.net/hadith/2/1/10/1",
          "Arabic Text": "1ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي جَعْفَرٍ (عَلَيهِ السَّلام) قَالَ سَأَلْتُهُ عَنْ قَوْلِ الله عَزَّ وَجَلَّ أَنْزَلَ السَّكِينَةَ فِي قُلُوبِ الْمُؤْمِنِينَ قَالَ هُوَ الإيمَانُ قَالَ وَسَأَلْتُهُ عَنْ قَوْلِ الله عَزَّ وَجَلَّ وَأَيَّدَهُمْ بِرُوحٍ مِنْهُ قَالَ هُوَ الإيمَانُ.",
          "English Text": "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Hakam from abu Hamza from abu Ja’far  who has said the following: “Once I asked abu Ja’far  about the words of Allah, the Majestic, the Glorious, ‘He sent down serenity into the hearts of the believers. . . (48:4) The Imam said, ‘It (serenity) is belief.’ I (the narrator) then asked him about the words of Allah, the Majestic, the Glorious, ‘He supported them with a spirit from Him. . . .’ (58:22) The Imam said, ‘It (spirit) is belief.’” "
        }
      },
      "Chapter #18": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 2: Belief Spreads In all Parts of the Body",
          "Link": "https://thaqalayn.net/hadith/2/1/18/1",
          "Arabic Text": "1ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ بَكْرِ بْنِ صَالِحٍ عَنِ الْقَاسِمِ بْنِ بُرَيْدٍ قَالَ حَدَّثَنَا أَبُو عَمْرٍو الزُّبَيْرِيُّ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ قُلْتُ لَهُ أَيُّهَا الْعَالِمُ أَخْبِرْنِي أَيُّ الأعْمَالِ أَفْضَلُ عِنْدَ الله قَالَ مَا لا يَقْبَلُ الله شَيْئاً إِلا بِهِ قُلْتُ وَمَا هُوَ قَالَ الإيمَانُ بِالله الَّذِي لا إِلَهَ إِلا هُوَ أَعْلَى الأعْمَالِ دَرَجَةً وَأَشْرَفُهَا مَنْزِلَةً وَأَسْنَاهَا حَظّاً قَالَ قُلْتُ أَ لا تُخْبِرُنِي عَنِ الإيمَانِ أَ قَوْلٌ هُوَ وَعَمَلٌ أَمْ قَوْلٌ بِلا عَمَلٍ فَقَالَ الإيمَانُ عَمَلٌ كُلُّهُ وَالْقَوْلُ بَعْضُ ذَلِكَ الْعَمَلِ بِفَرْضٍ مِنَ الله بَيَّنَ فِي كِتَابِهِ وَاضِحٍ نُورُهُ ثَابِتَةٍ حُجَّتُهُ يَشْهَدُ لَهُ بِهِ الْكِتَابُ وَيَدْعُوهُ إِلَيْهِ قَالَ قُلْتُ صِفْهُ لِي جُعِلْتُ فِدَاكَ حَتَّى أَفْهَمَهُ قَالَ الإيمَانُ حَالاتٌ وَدَرَجَاتٌ وَطَبَقَاتٌ وَمَنَازِلُ فَمِنْهُ التَّامُّ الْمُنْتَهَى تَمَامُهُ وَمِنْهُ النَّاقِصُ الْبَيِّنُ نُقْصَانُهُ وَمِنْهُ الرَّاجِحُ الزَّائِدُ رُجْحَانُهُ قُلْتُ إِنَّ الإيمَانَ لَيَتِمُّ وَيَنْقُصُ وَيَزِيدُ قَالَ نَعَمْ قُلْتُ كَيْفَ ذَلِكَ قَالَ لأنَّ الله تَبَارَكَ وَتَعَالَى فَرَضَ الإيمَانَ عَلَى جَوَارِحِ ابْنِ آدَمَ وَقَسَّمَهُ عَلَيْهَا وَفَرَّقَهُ فِيهَا فَلَيْسَ مِنْ جَوَارِحِهِ جَارِحَةٌ إِلا وَقَدْ وُكِّلَتْ مِنَ الإيمَانِ بِغَيْرِ مَا وُكِّلَتْ بِهِ أُخْتُهَا فَمِنْهَا قَلْبُهُ الَّذِي بِهِ يَعْقِلُ وَيَفْقَهُ وَيَفْهَمُ وَهُوَ أَمِيرُ بَدَنِهِ الَّذِي لا تَرِدُ الْجَوَارِحُ وَلا تَصْدُرُ إِلا عَنْ رَأْيِهِ وَأَمْرِهِ وَمِنْهَا عَيْنَاهُ اللَّتَانِ يُبْصِرُ بِهِمَا وَأُذُنَاهُ اللَّتَانِ يَسْمَعُ بِهِمَا وَيَدَاهُ اللَّتَانِ يَبْطِشُ بِهِمَا وَرِجْلاهُ اللَّتَانِ يَمْشِي بِهِمَا وَفَرْجُهُ الَّذِي الْبَاهُ مِنْ قِبَلِهِ وَلِسَانُهُ الَّذِي يَنْطِقُ بِهِ وَرَأْسُهُ الَّذِي فِيهِ وَجْهُهُ فَلَيْسَ مِنْ هَذِهِ جَارِحَةٌ إِلا وَقَدْ وُكِّلَتْ مِنَ الإيمَانِ بِغَيْرِ مَا وُكِّلَتْ بِهِ أُخْتُهَا بِفَرْضٍ مِنَ الله تَبَارَكَ اسْمُهُ يَنْطِقُ بِهِ الْكِتَابُ لَهَا وَيَشْهَدُ بِهِ عَلَيْهَا فَفَرَضَ عَلَى الْقَلْبِ غَيْرَ مَا فَرَضَ عَلَى السَّمْعِ وَفَرَضَ عَلَى السَّمْعِ غَيْرَ مَا فَرَضَ عَلَى الْعَيْنَيْنِ وَفَرَضَ عَلَى الْعَيْنَيْنِ غَيْرَ مَا فَرَضَ عَلَى اللِّسَانِ وَفَرَضَ عَلَى اللِّسَانِ غَيْرَ مَا فَرَضَ عَلَى الْيَدَيْنِ وَفَرَضَ عَلَى الْيَدَيْنِ غَيْرَ مَا فَرَضَ عَلَى الرِّجْلَيْنِ وَفَرَضَ عَلَى الرِّجْلَيْنِ غَيْرَ مَا فَرَضَ عَلَى الْفَرْجِ وَفَرَضَ عَلَى الْفَرْجِ غَيْرَ مَا فَرَضَ عَلَى الْوَجْهِ فَأَمَّا مَا فَرَضَ عَلَى الْقَلْبِ مِنَ الإيمَانِ فَالإقْرَارُ وَالْمَعْرِفَةُ وَالْعَقْدُ وَالرِّضَا وَالتَّسْلِيمُ بِأَنْ لا إِلَهَ إِلا الله وَحْدَهُ لا شَرِيكَ لَهُ إِلَهاً وَاحِداً لَمْ يَتَّخِذْ صَاحِبَةً وَلا وَلَداً وَأَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ (صَلَّى اللهُ عَلَيْهِ وآلِه) وَالإقْرَارُ بِمَا جَاءَ مِنْ عِنْدِ الله مِنْ نَبِيٍّ أَوْ كِتَابٍ فَذَلِكَ مَا فَرَضَ الله عَلَى الْقَلْبِ مِنَ الإقْرَارِ وَالْمَعْرِفَةِ وَهُوَ عَمَلُهُ وَهُوَ قَوْلُ الله. عَزَّ وَجَلَّ إِلا مَنْ أُكْرِهَ وَقَلْبُهُ مُطْمَئِنٌّ بِالإيمانِ وَلكِنْ مَنْ شَرَحَ بِالْكُفْرِ صَدْراً وَقَالَ أَلا بِذِكْرِ الله تَطْمَئِنُّ الْقُلُوبُ وَقَالَ الَّذِينَ آمَنُوا بِأَفْوَاهِهِمْ وَلَمْ تُؤْمِنْ قُلُوبُهُمْ وَقَالَ إِنْ تُبْدُوا ما فِي أَنْفُسِكُمْ أَوْ تُخْفُوهُ يُحاسِبْكُمْ بِهِ الله فَيَغْفِرُ لِمَنْ يَشاءُ وَيُعَذِّبُ مَنْ يَشاءُ فَذَلِكَ مَا فَرَضَ الله عَزَّ وَجَلَّ عَلَى الْقَلْبِ مِنَ الإقْرَارِ وَالْمَعْرِفَةِ وَهُوَ عَمَلُهُ وَهُوَ رَأْسُ الإيمَانِ وَفَرَضَ الله عَلَى اللِّسَانِ الْقَوْلَ وَالتَّعْبِيرَ عَنِ الْقَلْبِ بِمَا عَقَدَ عَلَيْهِ وَأَقَرَّ بِهِ قَالَ الله تَبَارَكَ وَتَعَالَى وَقُولُوا لِلنَّاسِ حُسْناً وَقَالَ وَقُولُوا آمَنَّا بِالَّذِي أُنْزِلَ إِلَيْنا وَأُنْزِلَ إِلَيْكُمْ وَإِلهُنا وَإِلهُكُمْ واحِدٌ وَنَحْنُ لَهُ مُسْلِمُونَ فَهَذَا مَا فَرَضَ الله عَلَى اللِّسَانِ وَهُوَ عَمَلُهُ وَفَرَضَ عَلَى السَّمْعِ أَنْ يَتَنَزَّهَ عَنِ الإسْتِمَاعِ إِلَى مَا حَرَّمَ الله وَأَنْ يُعْرِضَ عَمَّا لا يَحِلُّ لَهُ مِمَّا نَهَى الله عَزَّ وَجَلَّ عَنْهُ وَالإصْغَاءِ إِلَى مَا أَسْخَطَ الله عَزَّ وَجَلَّ فَقَالَ فِي ذَلِكَ وَقَدْ نَزَّلَ عَلَيْكُمْ فِي الْكِتابِ أَنْ إِذا سَمِعْتُمْ آياتِ الله يُكْفَرُ بِها وَيُسْتَهْزَأُ بِها فَلا تَقْعُدُوا مَعَهُمْ حَتَّى يَخُوضُوا فِي حَدِيثٍ غَيْرِهِ ثُمَّ اسْتَثْنَى الله عَزَّ وَجَلَّ مَوْضِعَ النِّسْيَانِ فَقَالَ وَإِمَّا يُنْسِيَنَّكَ الشَّيْطانُ فَلا تَقْعُدْ بَعْدَ الذِّكْرى‏ مَعَ الْقَوْمِ الظَّالِمِينَ وَقَالَ فَبَشِّرْ عِبادِ الَّذِينَ يَسْتَمِعُونَ الْقَوْلَ فَيَتَّبِعُونَ أَحْسَنَهُ أُولئِكَ الَّذِينَ هَداهُمُ الله وَأُولئِكَ هُمْ أُولُوا الألْبابِ وَقَالَ عَزَّ وَجَلَّ قَدْ أَفْلَحَ الْمُؤْمِنُونَ الَّذِينَ هُمْ فِي صَلاتِهِمْ خاشِعُونَ وَالَّذِينَ هُمْ عَنِ اللَّغْوِ مُعْرِضُونَ وَالَّذِينَ هُمْ لِلزَّكاةِ فاعِلُونَ وَقَالَ وَإِذا سَمِعُوا اللَّغْوَ أَعْرَضُوا عَنْهُ وَقالُوا لَنا أَعْمالُنا وَلَكُمْ أَعْمالُكُمْ وَقَالَ وَإِذا مَرُّوا بِاللَّغْوِ مَرُّوا كِراماً فَهَذَا مَا فَرَضَ الله عَلَى السَّمْعِ مِنَ الإيمَانِ أَنْ لا يُصْغِيَ إِلَى مَا لا يَحِلُّ لَهُ وَهُوَ عَمَلُهُ وَهُوَ مِنَ الإيمَانِ وَفَرَضَ عَلَى الْبَصَرِ أَنْ لا يَنْظُرَ إِلَى مَا حَرَّمَ الله عَلَيْهِ وَأَنْ يُعْرِضَ عَمَّا نَهَى الله عَنْهُ مِمَّا لا يَحِلُّ لَهُ وَهُوَ عَمَلُهُ وَهُوَ مِنَ الإيمَانِ فَقَالَ تَبَارَكَ وَتَعَالَى قُلْ لِلْمُؤْمِنِينَ يَغُضُّوا مِنْ أَبْصارِهِمْ وَيَحْفَظُوا فُرُوجَهُمْ فَنَهَاهُمْ أَنْ يَنْظُرُوا إِلَى عَوْرَاتِهِمْ وَأَنْ يَنْظُرَ الْمَرْءُ إِلَى فَرْجِ أَخِيهِ وَيَحْفَظَ فَرْجَهُ أَنْ يُنْظَرَ إِلَيْهِ وَقَالَ وَقُلْ لِلْمُؤْمِناتِ يَغْضُضْنَ مِنْ أَبْصارِهِنَّ وَيَحْفَظْنَ فُرُوجَهُنَّ. مِنْ أَنْ تَنْظُرَ إِحْدَاهُنَّ إِلَى فَرْجِ أُخْتِهَا وَتَحْفَظَ فَرْجَهَا مِنْ أَنْ يُنْظَرَ إِلَيْهَا وَقَالَ كُلُّ شَيْ‏ءٍ فِي الْقُرْآنِ مِنْ حِفْظِ الْفَرْجِ فَهُوَ مِنْ الزِّنَا إِلا هَذِهِ الآيَةَ فَإِنَّهَا مِنَ النَّظَرِ ثُمَّ نَظَمَ مَا فَرَضَ عَلَى الْقَلْبِ وَاللِّسَانِ وَالسَّمْعِ وَالْبَصَرِ فِي آيَةٍ أُخْرَى فَقَالَ وَما كُنْتُمْ تَسْتَتِرُونَ أَنْ يَشْهَدَ عَلَيْكُمْ سَمْعُكُمْ وَلا أَبْصارُكُمْ وَلا جُلُودُكُمْ يَعْنِي بِالْجُلُودِ الْفُرُوجَ وَالأفْخَاذَ وَقَالَ وَلا تَقْفُ ما لَيْسَ لَكَ بِهِ عِلْمٌ إِنَّ السَّمْعَ وَالْبَصَرَ وَالْفُؤادَ كُلُّ أُولئِكَ كانَ عَنْهُ مَسْؤُلاً فَهَذَا مَا فَرَضَ الله عَلَى الْعَيْنَيْنِ مِنْ غَضِّ الْبَصَرِ عَمَّا حَرَّمَ الله عَزَّ وَجَلَّ وَهُوَ عَمَلُهُمَا وَهُوَ مِنَ الإيمَانِ وَفَرَضَ الله عَلَى الْيَدَيْنِ أَنْ لا يَبْطِشَ بِهِمَا إِلَى مَا حَرَّمَ الله وَأَنْ يَبْطِشَ بِهِمَا إِلَى مَا أَمَرَ الله عَزَّ وَجَلَّ وَفَرَضَ عَلَيْهِمَا مِنَ الصَّدَقَةِ وَصِلَةِ الرَّحِمِ وَالْجِهَادِ فِي سَبِيلِ الله وَالطَّهُورِ لِلصَّلاةِ فَقَالَ يا أَيُّهَا الَّذِينَ آمَنُوا إِذا قُمْتُمْ إِلَى الصَّلاةِ فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى الْمَرافِقِ وَامْسَحُوا بِرُؤُسِكُمْ وَأَرْجُلَكُمْ إِلَى الْكَعْبَيْنِ وَقَالَ فَإِذا لَقِيتُمُ الَّذِينَ كَفَرُوا فَضَرْبَ الرِّقابِ حَتَّى إِذا أَثْخَنْتُمُوهُمْ فَشُدُّوا الْوَثاقَ فَإِمَّا مَنًّا بَعْدُ وَإِمَّا فِداءً حَتَّى تَضَعَ الْحَرْبُ أَوْزارَها فَهَذَا مَا فَرَضَ الله عَلَى الْيَدَيْنِ لأنَّ الضَّرْبَ مِنْ عِلاجِهِمَا وَفَرَضَ عَلَى الرِّجْلَيْنِ أَنْ لا يَمْشِيَ بِهِمَا إِلَى شَيْ‏ءٍ مِنْ مَعَاصِي الله وَفَرَضَ عَلَيْهِمَا الْمَشْيَ إِلَى مَا يُرْضِي الله عَزَّ وَجَلَّ فَقَالَ وَلا تَمْشِ فِي الأرْضِ مَرَحاً إِنَّكَ لَنْ تَخْرِقَ الأرْضَ وَلَنْ تَبْلُغَ الْجِبالَ طُولاً وَقَالَ وَاقْصِدْ فِي مَشْيِكَ وَاغْضُضْ مِنْ صَوْتِكَ إِنَّ أَنْكَرَ الأصْواتِ لَصَوْتُ الْحَمِيرِ وَقَالَ فِيمَا شَهِدَتِ الأيْدِي وَالأرْجُلُ عَلَى أَنْفُسِهِمَا وَعَلَى أَرْبَابِهِمَا مِنْ تَضْيِيعِهِمَا لِمَا أَمَرَ الله عَزَّ وَجَلَّ بِهِ وَفَرَضَهُ عَلَيْهِمَا الْيَوْمَ نَخْتِمُ عَلى‏ أَفْواهِهِمْ وَتُكَلِّمُنا أَيْدِيهِمْ وَتَشْهَدُ أَرْجُلُهُمْ بِما كانُوا يَكْسِبُونَ فَهَذَا أَيْضاً مِمَّا فَرَضَ الله عَلَى الْيَدَيْنِ وَعَلَى الرِّجْلَيْنِ وَهُوَ عَمَلُهُمَا وَهُوَ مِنَ الإيمَانِ وَفَرَضَ عَلَى الْوَجْهِ السُّجُودَ لَهُ بِاللَّيْلِ وَالنَّهَارِ فِي مَوَاقِيتِ الصَّلاةِ فَقَالَ يا أَيُّهَا الَّذِينَ آمَنُوا ارْكَعُوا وَاسْجُدُوا وَاعْبُدُوا رَبَّكُمْ وَافْعَلُوا الْخَيْرَ لَعَلَّكُمْ تُفْلِحُونَ فَهَذِهِ فَرِيضَةٌ جَامِعَةٌ عَلَى الْوَجْهِ وَالْيَدَيْنِ وَالرِّجْلَيْنِ وَقَالَ فِي مَوْضِعٍ آخَرَ وَأَنَّ الْمَساجِدَ لله فَلا تَدْعُوا مَعَ الله أَحَداً وَقَالَ فِيمَا فَرَضَ عَلَى الْجَوَارِحِ مِنَ الطَّهُورِ وَالصَّلاةِ بِهَا وَذَلِكَ أَنَّ الله عَزَّ وَجَلَّ لَمَّا صَرَفَ نَبِيَّهُ (صَلَّى اللهُ عَلَيْهِ وآلِه) إِلَى الْكَعْبَةِ عَنِ الْبَيْتِ الْمُقَدَّسِ فَأَنْزَلَ الله عَزَّ وَجَلَّ وَما كانَ الله لِيُضِيعَ إِيمانَكُمْ إِنَّ الله بِالنَّاسِ لَرَؤُفٌ رَحِيمٌ فَسَمَّى الصَّلاةَ إِيمَاناً فَمَنْ لَقِيَ الله عَزَّ وَجَلَّ حَافِظاً لِجَوَارِحِهِ مُوفِياً كُلُّ جَارِحَةٍ مِنْ جَوَارِحِهِ مَا فَرَضَ الله عَزَّ وَجَلَّ عَلَيْهَا لَقِيَ الله عَزَّ وَجَلَّ مُسْتَكْمِلاً لِإِيمَانِهِ وَهُوَ مِنْ أَهْلِ الْجَنَّةِ وَمَنْ خَانَ فِي شَيْ‏ءٍ مِنْهَا أَوْ تَعَدَّى مَا أَمَرَ الله عَزَّ وَجَلَّ فِيهَا لَقِيَ الله عَزَّ وَجَلَّ نَاقِصَ الإيمَانِ قُلْتُ قَدْ فَهِمْتُ نُقْصَانَ الإيمَانِ وَتَمَامَهُ فَمِنْ أَيْنَ جَاءَتْ زِيَادَتُهُ فَقَالَ قَوْلُ الله عَزَّ وَجَلَّ وَإِذا ما أُنْزِلَتْ سُورَةٌ فَمِنْهُمْ مَنْ يَقُولُ أَيُّكُمْ زادَتْهُ هذِهِ إِيماناً فَأَمَّا الَّذِينَ آمَنُوا فَزادَتْهُمْ إِيماناً وَهُمْ يَسْتَبْشِرُونَ وَأَمَّا الَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ فَزادَتْهُمْ رِجْساً إِلَى رِجْسِهِمْ وَقَالَ نَحْنُ نَقُصُّ عَلَيْكَ نَبَأَهُمْ بِالْحَقِّ إِنَّهُمْ فِتْيَةٌ آمَنُوا بِرَبِّهِمْ وَزِدْناهُمْ هُدىً وَلَوْ كَانَ كُلُّهُ وَاحِداً لا زِيَادَةَ فِيهِ وَلا نُقْصَانَ لَمْ يَكُنْ لأحَدٍ مِنْهُمْ فَضْلٌ عَلَى الآخَرِ وَلاسْتَوَتِ النِّعَمُ فِيهِ وَلاسْتَوَى النَّاسُ وَبَطَلَ التَّفْضِيلُ وَلَكِنْ بِتَمَامِ الإيمَانِ دَخَلَ الْمُؤْمِنُونَ الْجَنَّةَ وَبِالزِّيَادَةِ فِي الإيمَانِ تَفَاضَلَ الْمُؤْمِنُونَ بِالدَّرَجَاتِ عِنْدَ الله وَبِالنُّقْصَانِ دَخَلَ الْمُفَرِّطُونَ النَّارَ.",
          "English Text": "1. Ali ibn Ibrahim has narrated from his father from Bakr ibn Salih from al-Qasim ibn Burayd who has said that narrated to us abu ‘Amr al-Zubayri who has said the following: “I said to Abu ‘Abdillah  ‘O scholar, tell me which deed is more virtuous before Allah?’ He said, ‘It is the deed without which Allah does not accept any (deed).’ I asked, ‘What is such a thing?’ He said, ‘Belief in Allah besides whom no one deserves to be worshipped. It (belief) is the highest in degree among the deeds, the most valuable among them and the topmost among them in (matters of) reward.’ I then said, ‘Please, tell me then about belief, is it deeds or it is words without deeds?’ “He said, ‘All of belief is deeds and certain parts of such deeds are words. Allah has made it obligatory as is explained in His book. Its light is clear, its evidence well established. The (Holy) book testifies to it for one, and calls one to it.’ I (the narrator) then asked, ‘May Allah keep my soul in service for your cause, explain it to me so I may understand.’ He (the Imam) said, ‘Belief is of degrees, conditions, levels and stages. Of belief there is that which is perfect and complete in perfection. Of belief there is that which is defective and the defect is clear. Of belief there is that which is heavier on the perfection side.’ I then asked, ‘Does belief become perfect, decrease and increase?’ He said, ‘Yes, it does.’ I then asked, ‘How does it happen?’ He said, ‘It is because Allah, the Most Blessed, the Most High, has written belief for each part of the body of the children of Adam and has divided and distributed it among them. There is no part of thier body but that has a guard of belief different from such guard assigned to other parts. Of such part is one’s heart, with which one understands and reasons to comprehend, and it is the commander of his body. It oversees the body and without its opinion no part moves to act. Of the parts of the body are one’s eyes with which one sees and his ears with which one listens. There are one’s hands with which one works, one’s legs with which one walks, one’s sexual organs from which comes carnal desires, one’s tongue with which one speaks and one’s head on which there is one’s face. For each of these parts a different guard of belief is assigned. It is all due to what Allah, Most Blessed is Whose name, has written, to which His Holy book speaks and testifies. ‘For each of these parts a different obligation is written. The obligation of the heart is different from the obligation of the ears. What is made obligatory for the ears is different from the obligation of the eyes and what is made obligatory for the eyes is different from what is made obligatory for the tongue. What is made obligatory for the tongue is different from what is made obligatory for the hands and what is made obligatory for the hands is different from what is made obligatory for the legs. The obligation of the legs is different from the obligations of the sexual organs. What is obligatory for the sexual organs is different from the obligation of the face. ‘What is made obligatory for the heart of belief is affirmation, recognition and the formation of belief, consent and submission to the fact that no one deserves to be worshipped except Allah Who is One and has no partner. He is the One and only. He has not taken any companion and children. That Muhammad is His servant and messenger, he and his family being recipients of Divine supreme covenant, and to affirm that whatever he has brought is from Allah, be it about a prophet or a book. That is what Allah has made obligatory for the heart; the task of affirmation and recognition, which is its deed. This is stated in the words of Allah, the Most Majestic, the Most Holy, “. . . but his heart is confident about his faith. However, those whose breasts have become open to disbelief will be subject to the wrath of Allah and will suffer a great torment.” (16: 106) ‘Allah has said, “. . . Remembrance (speaking) of Allah certainly brings comfort to all hearts.” (13:28) ‘Allah has said, “. . . They only say that they believe but, in fact, they have no faith in their hearts. . . .” (5:41) ‘Allah has said, ‘‘Allah will call you to account for all that you may reveal from your souls and all that you may conceal. Allah will forgive or punish whoever He wants. . . .” (2:284) ‘These are what Allah, the Most Majestic, the Most Holy, has made obligatory on the hearts of affirmation and recognition, and these are its deeds and this is the head of the belief. ‘On the tongue Allah has made it obligatory to speak and express what the heart has established and has confirmed as Allah, the Most Blessed, the Most High, has said, “ . . . that they should speak righteous words to people . . .” (2:83) ‘Allah has said, “Tell them, we believe in Allah and in what is revealed to us and to you. Our Lord and your Lord are one. We have submitted ourselves to His will.” (29:46) ‘This is what Allah has made obligatory for the tongue and this is its deed. He has made it obligatory for the ears to keep it clean from what is unlawful to listen to, and to keep away from things that Allah, the Most Majestic, the Most Holy, has prohibited to listen to attentively; it angers Allah, the Most Majestic, the Most Holy. And in this regard He has said, “Allah has told you (believers) in the Book that when you hear people disbelieving and mocking Allah’s revelations, do not sit with them unless they change the subject . . .” (4: 140) ‘Allah, the Most Majestic, the Most Holy, then has made an exception for the case of forgetfulness, ‘If Satan causes you to forget this, do not sit with the unjust people when you recall.” ( 6 : 68 ) ‘Allah has also said, “(Muhammad), give the glad news to those of My servants who listen to the words and follow only the best ones. Tell them that they are those whom Allah has guided. They are the people of understanding.” (39:18) ‘Allah, the Most Majestic, the Most Holy, has said, “Triumphant indeed are the believers, (23:1) who are submissive to Allah in their prayers, (23:2) who avoid impious talks (23:3) and pay al- Zakat (charity).” (23:4) ‘Allah has said, “When they hear impious words, they ignore them, saying, ‘We shall be responsible for our deeds and you will be responsible for yours. . . (28:55) ‘Allah has said, “. . . when they come across something impious, they pass it by nobly.” (25:72) ‘This is what Allah has made obligatory for the ears in relation to belief; that they must not listen to what is unlawful to listen to, and such matters are of its deeds, which is of belief. He has made it obligatory for the eyes not to look at things He has made unlawful to look at and to stay away from what Allah has prohibited of the things that are not lawful for them. Such things are of their deeds and of belief. ‘Allah, the Most Blessed, the Most High, has said, “(Muhammad), tell the believing men to cast down their eyes and guard their carnal desires.” (24:30) ‘Allah has prohibited looking at the privacy of one’s brother and to keep one’s privacy protected from the onlookers. Allah has said, “. . .Tell the believing woman to cast down their eyes, guard their chastity (private parts).” (24:31) ‘They must find protection against being looked upon and keep away from looking at their sisters (private parts). The Imam said that everywhere in the Holy Quran where protection of private parts is mentioned it is a reference to fornication except this verse which is a reference to looking. ‘Allah has spoken about the obligations of the heart, tongue, ears and eyes in another verse also: “You did not (think to) hide your deeds from your ears, eyes and skin and you felt that Allah would not know all that you had been doing.” (41 :22) ‘Skin is reference to private parts and thighs. Allah has said, “Do not follow what you do not know; the ears, eyes, and hearts will all be held responsible for their deeds.” (17:36) ‘This is what Allah has made obligatory for the eyes; to cast down away from what Allah, the Most Majestic, the Most Holy, has prohibited. This is their deed and it is of belief. Allah has made it obligatory for the hands not to move to what He has prohibited, instead move to what Allah, the Most Majestic, the Most Holy, has commanded to move to such as charity, good relation with relatives and striving for the cause of Allah and cleansing for prayer. ‘Allah has said, “Believers, when you are about to pray, wash your face and your hands along with the elbows and wipe your head and your feet to the ankles. . . .” (5:6) ‘Allah has said, “If you encounter the unbelievers in a battle, strike-off their heads. Take them as captives when they are defeated. Then you may set them free as a favor to them, with or without a ransom, when the battle is over. . . .” (47:4) ‘This is what Allah has made obligatory for the hands; striking is their task. Allah has made it obligatory for the legs not to walk to what is made unlawful and in disobedience to Allah. He has made it obligatory for them to walk to what makes Allah, the Most Majestic, the Most Holy, happy. Allah has said, “Do not walk proudly on the earth; your feet cannot tear apart the earth nor are you as tall as the mountains.” (17:37) “Do not walk around inflated with pride; be moderate in your walking and your talking. The most unpleasant sound is the braying of donkeys.” (31:19) ‘About the testifying of the hands and legs against their ownselves and their master for their disregard of the commands of Allah, the Most Majestic, the Most Holy, and the obligation upon them, Allah has said: “. . . this Day, We seal their mouths and their hands will speak to Us and their feet will testify to what they had achieved.” (36:65) ‘This also is what Allah has made obligatory for the hands and the legs and this is their deed and it is of belief. Allah has made it obligatory for the face to prostrate before Him in the days and nights in the times of the prayers. Allah has said, “Believers, worship your Lord, bow down and prostrate yourselves before Him and do virtuous deeds so that perhaps you will have everlasting happiness.” (22:77) ‘This is an obligation that involves the face, hands and legs. In another passage He has said, ‘All the parts of the body to be placed on the ground during prostration belong to Allah. Do not prostrate before anyone other than Him. . . .” (72:18) It was in regards to the obligations upon the parts of the body in the form of purification for prayer that Allah, the Most Majestic, the Most Holy, made His prophet to change facing the Holy House in Palestine to facing al-Ka’ba. Allah, the Most Majestic, the Most Holy, revealed this: “Allah did not want to make your previous belief (prayers) worthless; Allah is Compassionate and All- Merciful to people.” (2:143) He has called prayer ‘Belief.’ Therefore, whoever meets Allah, the Most Majestic, the Most Holy, perfecting his belief is of the people of paradise. Whoever cheats in any of the obligations or violates the commands of Allah, the Most Majestic, the Most Holy, will meet Allah, the Most Majestic, the Most Holy, with a defective belief.’ “I then asked the Imam, ‘I now understand perfect and defective belief. Where does the increase in belief come from?’ The Imam said, ‘Consider the words of Allah, the Most Majestic, the Most Holy, “When a Chapter (of the Quran) is revealed, certain people ask others, ‘Whose belief among you people has received strength from this (revelation)?’ It (the revelation) certainly strengthens the belief of the believers and they consider it to be glad news. (9:124) But to those whose hearts are sick, it adds more filth to their hearts and they die as unbelievers.” (9:125) Allah has said, “. . .We tell you this story for a genuine purpose. They were young people who believed in their Lord and We gave them further guidance.” (18:13) ‘Had belief been the same and without any difference in defects and in perfections no one of them would have had any distinction over the others and the favors would have been equal to all. People had been all equal and excellence would become void. However, with perfection in belief believers enter paradise. By increase in belief the believers excel in degrees before Allah and for the defect in belief the extremists go in fire.’” "
        }
      },
      "Chapter #27": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 2: The Essence of Belief and Certainty",
          "Link": "https://thaqalayn.net/hadith/2/1/27/3",
          "Arabic Text": "3ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ عَبْدِ الله بْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ اسْتَقْبَلَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) حَارِثَةَ بْنَ مَالِكِ بْنِ النُّعْمَانِ الأنْصَارِيَّ فَقَالَ لَهُ كَيْفَ أَنْتَ يَا حَارِثَةَ بْنَ مَالِكٍ فَقَالَ يَا رَسُولَ الله مُؤْمِنٌ حَقّاً فَقَالَ لَهُ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) لِكُلِّ شَيْ‏ءٍ حَقِيقَةٌ فَمَا حَقِيقَةُ قَوْلِكَ فَقَالَ يَا رَسُولَ الله عَزَفَتْ نَفْسِي عَنِ الدُّنْيَا فَأَسْهَرَتْ لَيْلِي وَأَظْمَأَتْ هَوَاجِرِي وَكَأَنِّي أَنْظُرُ إِلَى عَرْشِ رَبِّي [ وَ] قَدْ وُضِعَ لِلْحِسَابِ وَكَأَنِّي أَنْظُرُ إِلَى أَهْلِ الْجَنَّةِ يَتَزَاوَرُونَ فِي الْجَنَّةِ وَكَأَنِّي أَسْمَعُ عُوَاءَ أَهْلِ النَّارِ فِي النَّارِ فَقَالَ لَهُ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) عَبْدٌ نَوَّرَ الله قَلْبَهُ أَبْصَرْتَ فَاثْبُتْ فَقَالَ يَا رَسُولَ الله ادْعُ الله لِي أَنْ يَرْزُقَنِي الشَّهَادَةَ مَعَكَ فَقَالَ اللهمَّ ارْزُقْ حَارِثَةَ الشَّهَادَةَ فَلَمْ يَلْبَثْ إِلا أَيَّاماً حَتَّى بَعَثَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) سَرِيَّةً فَبَعَثَهُ فِيهَا فَقَاتَلَ فَقُتِلَ تِسْعَةٌ أَوْ ثَمَانِيَةٌ ثُمَّ قُتِلَ. وَفِي رِوَايَةِ الْقَاسِمِ بْنِ بُرَيْدٍ عَنْ أَبِي بَصِيرٍ قَالَ اسْتُشْهِدَ مَعَ جَعْفَرِ بْنِ أَبِي طَالِبٍ بَعْدَ تِسْعَةِ نَفَرٍ وَكَانَ هُوَ الْعَاشِرَ.",
          "English Text": "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Sinan from ‘Abd Allah ibn Muskan from abu Basir from Abu ‘Abdillah  who has said the following: ‘‘The Messenger of Allah once met Harithah ibn Malik al- Nu’man al-Ansari and asked him, ‘How are you, O Harithah ibn Malik?’ He replied, ‘O Messenger of Allah, I am a believer in a real sense.’ The Messenger of Allah then asked, ‘Everything has a reality and essence. What are the reality and essence of your words?’ “He replied, ‘O Messenger of Allah, my soul has withdrawn from this world; it has kept me awake all night and to endure thirst in the middle of the day. It is as if I am looking to the Throne of my Lord that is established to bring all people to account. It is as if I am looking at the people of paradise who are visiting each other and I hear the barking of the people of hell therefrom.’ The Messenger of Allah, then said, ‘He is a servant whose heart is brightened (by the command of) Allah. You have reached (true) understanding, remain steadfast.’ He then asked, ‘O Messenger of Allah, pray to Allah for me to grant me martyrdom (while working hard to support your cause) along with you.’ The Messenger of Allah prayed, ‘O Allah, grant him martyrdom.’ Within very few days thereafter, he (the messenger of Allah) dispatched a group of people for an armed expedition and Harithah was among them. He (Harithah) fought the enemy and did away with eight or nine people before he became a martyr. “In the narration of al-Qasim from his father from abu Basir it is said that Harithah was martyred in the army of Ja’far ibn abu Talib after the martyrdom of nine people.” "
        }
      },
      "Chapter #30": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 2: Excellence of Certainty",
          "Link": "https://thaqalayn.net/hadith/2/1/30/2",
          "Arabic Text": "2ـ عَنْهُ عَنْ مُعَلىً عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ عَبْدِ الله بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) وَمُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي وَلادٍ الْحَنَّاطِ وَعَبْدِ الله بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ مِنْ صِحَّةِ يَقِينِ الْمَرْءِ الْمُسْلِمِ أَنْ لا يُرْضِيَ النَّاسَ بِسَخَطِ الله وَلا يَلُومَهُمْ عَلَى مَا لَمْ يُؤْتِهِ الله فَإِنَّ الرِّزْقَ لا يَسُوقُهُ حِرْصُ حَرِيصٍ وَلا يَرُدُّهُ كَرَاهِيَةُ كَارِهٍ وَلَوْ أَنَّ أَحَدَكُمْ فَرَّ مِنْ رِزْقِهِ كَمَا يَفِرُّ مِنَ الْمَوْتِ لأدْرَكَهُ رِزْقُهُ كَمَا يُدْرِكُهُ الْمَوْتُ ثُمَّ قَالَ إِنَّ الله بِعَدْلِهِ وَقِسْطِهِ جَعَلَ الرَّوْحَ وَالرَّاحَةَ فِي الْيَقِينِ وَالرِّضَا وَجَعَلَ الْهَمَّ وَالْحَزَنَ فِي الشَّكِّ وَالسَّخَطِ.",
          "English Text": "2. It is narrated from him from Mu’alla from al-Hassan ibn Ali al-Washsha’ from ‘Abd Allah ibn Sinan from Abu ‘Abdillah  and Muhammad ibn Yahya from Ahmad ibn Muhammad from ibn Mahbub from abu Wallad al-Hannat and ‘Abd Allah ibn Sinan from Abu ‘Abdillah  who has said the following: “Abu ‘Abd Allah  once said, ‘It is due to a Muslim’s correctness of certainty that he does not make people happy to anger Allah and does not blame them for what (of belongings) Allah has not given him. The share of sustenance is something that is not driven by the greed of the greedy ones and is not pushed back due to the dislike of those who dislike. Even if one of you may run away from his share of sustenance just as one runs away from death, still his share of sustenance reaches him just as death one day will reach him.’ He then said, ‘Allah through His justice and fairness has placed in certainty spirit and comfort and agreement with the decision of Allah. He has placed anxiety and sadness in doubts and anger.’” "
        }
      },
      "Chapter #62": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 2: Additional Ahadith on the Above Subject",
          "Link": "https://thaqalayn.net/hadith/2/1/62/1",
          "Arabic Text": "1ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ الأشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ أَبِي عُبَيْدَةَ عَنْ أَبِي جَعْفَرٍ (عَلَيهِ السَّلام) قَالَ إِنَّ الله عَزَّ وَجَلَّ يَقُولُ وَعِزَّتِي وَجَلالِي وَعَظَمَتِي وَعُلُوِّي وَارْتِفَاعِ مَكَانِي لا يُؤْثِرُ عَبْدٌ هَوَايَ عَلَى هَوَى نَفْسِهِ إِلا كَفَفْتُ عَلَيْهِ ضَيْعَتَهُ وَضَمَّنْتُ السَّمَاوَاتِ وَالأرْضَ رِزْقَهُ وَكُنْتُ لَهُ مِنْ وَرَاءِ تِجَارَةِ كُلِّ تَاجِرٍ.",
          "English Text": "1. Al-Husayn ibn Muhammad al-Ash’ari has narrated from Mu’alla ibn Muhammad from al-Hassan ibn Ali al-Washsha’ from ‘Asim ibn Humayd from abu ‘Ubaydah from abu Ja’far  who has said the following: “Allah, the Most Majestic, the Most Holy, says, ‘I swear by My Majesty, Glory, Greatness, Height and the height of My position, if anyone of My servant acts as I wish instead of acting according to his own wish, I will protect his lost and straying property and guarantee to provide him sustenance from the heavens and earth, and I will be for him (his supporter) in his business with every merchant.’” "
        }
      },
      "Chapter #68": {
        "Hadith #17": {
          "Title": "Al-Kafi - Volume 2: Good Relation with Relatives",
          "Link": "https://thaqalayn.net/hadith/2/1/68/17",
          "Arabic Text": "17ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) مَا نَعْلَمُ شَيْئاً يَزِيدُ فِي الْعُمُرِ إِلا صِلَةَ الرَّحِمِ حَتَّى إِنَّ الرَّجُلَ يَكُونُ أَجَلُهُ ثَلاثَ سِنِينَ فَيَكُونُ وَصُولاً لِلرَّحِمِ فَيَزِيدُ الله فِي عُمُرِهِ ثَلاثِينَ سَنَةً فَيَجْعَلُهَا ثَلاثاً وَثَلاثِينَ سَنَةً وَيَكُونُ أَجَلُهُ ثَلاثاً وَثَلاثِينَ سَنَةً فَيَكُونُ قَاطِعاً لِلرَّحِمِ فَيَنْقُصُهُ الله ثَلاثِينَ سَنَةً وَيَجْعَلُ أَجَلَهُ إِلَى ثَلاثِ سِنِينَ. الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ أَبِي الْحَسَنِ الرِّضَا (عَلَيهِ السَّلام) مِثْلَهُ.",
          "English Text": "17. Ali ibn Ibrahim has narrated from his father from Safwan ibn Y ahya from Ishaq ibn ‘ Ammar who has said the following: “Abu ‘Abd Allah  has said, ‘We do not know of anything that may increase one’s lifespan like maintaining good relations with relatives does. It is so much so that a man’s life span may have only three years been left, but he maintains good relations with relatives, Allah will increase his life to last for thirty years. The total will be thirty-three years, thus the appointed time for his death will be after thirty-three years. In such case, if one is of the neglectors of good relations with relatives will live only for three years.’” Al-Husayn ibn Muhammad has narrated from Mu’alla ibn Muhammad from al- Hassan ibn Ali al-Washsha’ from abu al-Hassan al-Rida  a similar Hadith. "
        }
      },
      "Chapter #78": {
        "Hadith #5": {
          "Title": "Al-Kafi - Volume 2: Greeting with Handshake",
          "Link": "https://thaqalayn.net/hadith/2/1/78/5",
          "Arabic Text": "5ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ صَفْوَانَ الْجَمَّالِ عَنْ أَبِي عُبَيْدَةَ الْحَذَّاءِ قَالَ زَامَلْتُ أَبَا جَعْفَرٍ (عَلَيهِ السَّلام) فِي شِقِّ مَحْمِلٍ مِنَ الْمَدِينَةِ إِلَى مَكَّةَ فَنَزَلَ فِي بَعْضِ الطَّرِيقِ فَلَمَّا قَضَى حَاجَتَهُ وَعَادَ قَالَ هَاتِ يَدَكَ يَا أَبَا عُبَيْدَةَ فَنَاوَلْتُهُ يَدِي فَغَمَزَهَا حَتَّى وَجَدْتُ الأذَى فِي أَصَابِعِي ثُمَّ قَالَ يَا أَبَا عُبَيْدَةَ مَا مِنْ مُسْلِمٍ لَقِيَ أَخَاهُ الْمُسْلِمَ فَصَافَحَهُ وَشَبَّكَ أَصَابِعَهُ فِي أَصَابِعِهِ إِلا تَنَاثَرَتْ عَنْهُمَا ذُنُوبُهُمَا كَمَا يَتَنَاثَرُ الْوَرَقُ مِنَ الشَّجَرِ فِي الْيَوْمِ الشَّاتِي.",
          "English Text": "5. A number of our people have narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad ibn abu Nasr from Safwan al-Jammal from abu ‘Ubaydah al- Hadhdha’ who has said the following: “Once I was a partner of abu Ja’far  on a journey on one side of the carriage on the camel from Madina to Makka. On the way he dismounted for rest and, when he returned, he asked me for a handshake. He squeezed my hand so hard that my fingers began to hurt. He then said, ‘O abu ‘Ubaydah, when two Muslims meet, shake hands and crisscross their fingers, their sins begin to fall from them like leaves fall from trees on a fall day.’” "
        }
      },
      "Chapter #84": {
        "Hadith #11": {
          "Title": "Al-Kafi - Volume 2: Endeavor to help a Believer",
          "Link": "https://thaqalayn.net/hadith/2/1/84/11",
          "Arabic Text": "11ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عُمَارَةَ قَالَ كَانَ حَمَّادُ بْنُ أَبِي حَنِيفَةَ إِذَا لَقِيَنِي قَالَ كَرِّرْ عَلَيَّ حَدِيثَكَ فَأُحَدِّثُهُ قُلْتُ رُوِّينَا أَنَّ عَابِدَ بَنِي إِسْرَائِيلَ كَانَ إِذَا بَلَغَ الْغَايَةَ فِي الْعِبَادَةِ صَارَ مَشَّاءً فِي حَوَائِجِ النَّاسِ عَانِياً بِمَا يُصْلِحُهُمْ. ",
          "English Text": "11. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from his father from certain individuals of his people from abu ‘ Ammarah who has said: “Hammad ibn abu Hanifah during a meeting said to me, ‘Repeat your Hadith to me.’ I then narrate to him, ‘It is narrated to us that the worshippers of Israelites on reaching the perfect stage of worshipping would become the walkers to help meet the needs of people and paid proper attention to benefit them.’” "
        }
      },
      "Chapter #96": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 2: Sound Religion",
          "Link": "https://thaqalayn.net/hadith/2/1/96/3",
          "Arabic Text": "3ـ عَلِيٌّ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ رِبْعِيِّ بْنِ عَبْدِ الله عَنْ فُضَيْلِ بْنِ يَسَارٍ عَنْ أَبِي جَعْفَرٍ (عَلَيهِ السَّلام) قَالَ سَلامَةُ الدِّينِ وَصِحَّةُ الْبَدَنِ خَيْرٌ مِنَ الْمَالِ وَالْمَالُ زِينَةٌ مِنْ زِينَةِ الدُّنْيَا حَسَنَةٌ. مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَن�� الْفَضْلِ بْنِ شَاذَانَ عَنْ حَمَّادٍ عَنْ رِبْعِيٍّ عَنِ الْفُضَيْلِ عَنْ أَبِي جَعْفَرٍ (عَلَيهِ السَّلام) مِثْلَهُ.",
          "English Text": "3. Ali has narrated from his father from Hammad ibn ‘Isa from Rib’i ibn ‘Abd Allah from Fudayl ibn Yasar from abu Ja’far  who has said the following: “Soundness of religion and good health is better than property. Property is a beauty of the worldly beauties and it is a good thing.” Muhammad ibn Isma’il has narrated from Fadl ibn Shadhan from Hammad from Rib’i from al-Fudayl from abu Ja’far  a similar Hadith. "
        }
      },
      "Chapter #99": {
        "Hadith #10": {
          "Title": "Al-Kafi - Volume 2: A Believer’s Signs and Qualities",
          "Link": "https://thaqalayn.net/hadith/2/1/99/10",
          "Arabic Text": "10ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنِ ابْنِ أَبِي يَعْفُورٍ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ إِنَّ شِيعَةَ عَلِيٍّ كَانُوا خُمُصَ الْبُطُونِ ذُبُلَ الشِّفَاهِ أَهْلَ رَأْفَةٍ وَعِلْمٍ وَحِلْمٍ يُعْرَفُونَ بِالرَّهْبَانِيَّةِ فَأَعِينُوا عَلَى مَا أَنْتُمْ عَلَيْهِ بِالْوَرَعِ وَالإجْتِهَادِ.",
          "English Text": "10. A number of our people have narrated from Sahl ibn Ziyad from ibn Mahbub from Ali ibn Ri’ab ibn abu Ya’fur from Abu ‘Abdillah  who has said the following: “The Shi’a (followers) of Ali  were of slim and lean bellies, and withered lips. They were people of compassion, knowledge, and forbearance. They were known as of monkish practice. You should assist each other in your cause with restraint from worldly attractions (sins) and be very hard working.” "
        }
      },
      "Chapter #104": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 2: Believing People are of Two Kinds",
          "Link": "https://thaqalayn.net/hadith/2/1/104/3",
          "Arabic Text": "3ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ يُونُسَ بْنِ يَعْقُوبَ عَنْ أَبِي مَرْيَمَ الأنْصَارِيِّ عَنْ أَبِي جَعْفَرٍ (عَلَيهِ السَّلام) قَالَ قَامَ رَجُلٌ بِالْبَصْرَةِ إِلَى أَمِيرِ الْمُؤْمِنِينَ (عَلَيهِ السَّلام) فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ أَخْبِرْنَا عَنِ الإخْوَانِ فَقَالَ الإخْوَانُ صِنْفَانِ إِخْوَانُ الثِّقَةِ وَإِخْوَانُ الْمُكَاشَرَةِ فَأَمَّا إِخْوَانُ الثِّقَةِ فَهُمُ الْكَفُّ وَالْجَنَاحُ وَالأهْلُ وَالْمَالُ فَإِذَا كُنْتَ مِنْ أَخِيكَ عَلَى حَدِّ الثِّقَةِ فَابْذُلْ لَهُ مَالَكَ وَبَدَنَكَ وَصَافِ مَنْ صَافَاهُ وَعَادِ مَنْ عَادَاهُ وَاكْتُمْ سِرَّهُ وَعَيْبَهُ وَأَظْهِرْ مِنْهُ الْحَسَنَ وَاعْلَمْ أَيُّهَا السَّائِلُ أَنَّهُمْ أَقَلُّ مِنَ الْكِبْرِيتِ الأحْمَرِ وَأَمَّا إِخْوَانُ الْمُكَاشَرَةِ فَإِنَّكَ تُصِيبُ لَذَّتَكَ مِنْهُمْ فَلا تَقْطَعَنَّ ذَلِكَ مِنْهُمْ وَلا تَطْلُبَنَّ مَا وَرَاءَ ذَلِكَ مِنْ ضَمِيرِهِمْ وَابْذُلْ لَهُمْ مَا بَذَلُوا لَكَ مِنْ طَلاقَةِ الْوَجْهِ وَحَلاوَةِ اللِّسَانِ. ",
          "English Text": "3. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from Isma’il ibn Mehran from Yunus ibn Ya’qub from abu Maryam al-Ansari from abu Ja’far  who has said the following: “Once a man in Basra stood before Amir al-Mu’minin (Ali ibn abu Talib)  and asked, ‘O Amir al-Mu’minin, speak to us of brothers (in belief).’ The Imam said, ‘Brothers are of two kinds: Trustworthy brothers and smiling brothers. The trustworthy brothers are one’s palms, wings, the family and wealth. If they are trustworthy you may spend and work for them, be sincere to those sincere to him, and be the enemy of his enemies, conceal his secrets and faults and publicize his virtuous qualities. You (questioning person) must know that they are as rare as red sulphur. On the other hand, you may enjoy the smiling brother’s association that you should not cut it off from them but do not seek anything beyond it of their conscience. Do for them as much as they do for you like a happy face and sweet expressions.’” "
        }
      },
      "Chapter #106": {
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 2: The Severity of the Trial of a Believer",
          "Link": "https://thaqalayn.net/hadith/2/1/106/4",
          "Arabic Text": "4ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَمُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنْ حَمَّادِ بْنِ عِيسَى عَنْ رِبْعِيِّ بْنِ عَبْدِ الله عَنْ فُضَيْلِ بْنِ يَسَارٍ عَنْ أَبِي جَعْفَرٍ (عَلَيهِ السَّلام) قَالَ أَشَدُّ النَّاسِ بَلاءً الأنْبِيَاءُ ثُمَّ الأوْصِيَاءُ ثُمَّ الأمَاثِلُ فَالأمَاثِلُ.",
          "English Text": "4. Ali ibn Ibrahim has narrated from his father and Muhammad ibn Isma’il from Fadl ibn Shadhan all from Hammad ibn ‘Isa from Rib’i ibn ‘Abd Allah from Fudayl ibn Yasar from abu Ja’far  who has said the following: “People who are put to the most severe trials and sufferings are the prophets, then the successors of the prophets and then those similar to the last group in position and so forth.” "
        }
      },
      "Chapter #108": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 2: No name",
          "Link": "https://thaqalayn.net/hadith/2/1/108/2",
          "Arabic Text": "2ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ الْفَقْرُ الْمَوْتُ الأحْمَرُ فَقُلْتُ لأبِي عَبْدِ الله (عَلَيهِ السَّلام) الْفَقْرُ مِنَ الدِّينَارِ وَالدِّرْهَمِ فَقَالَ لا وَلَكِنْ مِنَ الدِّينِ.",
          "English Text": "2. A number of our people have narrated from Sahl ibn Ziyad from Ali ibn Asbat from those he has mentioned (in his book) from Abu ‘Abdillah  who has said the following: “Abu ‘Abd Allah  has said, ‘Poverty is a painful death.’ I (the narrator) then asked him, ‘Is it poverty due to deficiency of Dirham and Dinar (units of money)?’ The Imam said, ‘No, in fact, it is poverty due to deficiency in religion.’” "
        }
      },
      "Chapter #112": {
        "Hadith #8": {
          "Title": "Al-Kafi - Volume 2: The Major Sins",
          "Link": "https://thaqalayn.net/hadith/2/1/112/8",
          "Arabic Text": "8ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ عَنْ عُبَيْدِ بْنِ زُرَارَةَ قَالَ سَأَلْتُ أَبَا عَبْدِ الله (عَلَيهِ السَّلام) عَنِ الْكَبَائِرِ فَقَالَ هُنَّ فِي كِتَابِ عَلِيٍّ (عَلَيهِ السَّلام) سَبْعٌ الْكُفْرُ بِالله وَقَتْلُ النَّفْسِ وَعُقُوقُ الْوَالِدَيْنِ وَأَكْلُ الرِّبَا بَعْدَ الْبَيِّنَةِ وَأَكْلُ مَالِ الْيَتِيمِ ظُلْماً وَالْفِرَارُ مِنَ الزَّحْفِ وَالتَّعَرُّبُ بَعْدَ الْهِجْرَةِ قَالَ فَقُلْتُ فَهَذَا أَكْبَرُ الْمَعَاصِي قَالَ نَعَمْ قُلْتُ فَأَكْلُ دِرْهَمٍ مِنْ مَالِ الْيَتِيمِ ظُلْماً أَكْبَرُ أَمْ تَرْكُ الصَّلاةِ قَالَ تَرْكُ الصَّلاةِ قُلْتُ فَمَا عَدَدْتَ تَرْكَ الصَّلاةِ فِي الْكَبَائِرِ فَقَالَ أَيُّ شَيْ‏ءٍ أَوَّلُ مَا قُلْتُ لَكَ قَالَ قُلْتُ الْكُفْرُ قَالَ فَإِنَّ تَارِكَ الصَّلاةِ كَافِرٌ يَعْنِي مِنْ غَيْرِ عِلَّةٍ.",
          "English Text": "8. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from ‘Abd al- Rahman ibn al-Hajjaj from ‘Ubayd ibn Zurara who has said the following: “Once I asked Abu ‘Abdillah  about the major sins. The Imam said, ‘They according to the book of Ali  are seven: Disbelief in Allah, Murdering a soul. Disregard of good relations with parents. Consuming unlawful interest from trade with evidence, Consuming the properties of orphans unjustly. Running away from the enemy in battlefield during an offensive and Alienation from religion after accepting it.’ I (the narrator) then asked, ‘Are these the biggest sins?’ The Imam said, ‘Yes, they are.’ I then asked, ‘Is consuming one dirham from the property of an orphan unjustly a bigger sin or disregarding the prayer?’ The Imam said, ‘Disregard of the prayer is a bigger sin.’ “I then said, ‘You did not mention disregard of prayer among the major sins.’ The Imam said, ‘What was the first item that I mentioned to you?’ I said, ‘It was disbelief in Allah.’ The Imam said, ‘One who disregards prayer is an unbeliever (that is, he is considered as such for ignoring prayer without reason?)”’ "
        }
      },
      "Chapter #115": {
        "Hadith #10": {
          "Title": "Al-Kafi - Volume 2: Roots of Disbelief",
          "Link": "https://thaqalayn.net/hadith/2/1/115/10",
          "Arabic Text": "10ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مَنْصُورِ بْنِ الْعَبَّاسِ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ رَفَعَهُ إِلَى سَلْمَانَ قَالَ إِذَا أَرَادَ الله عَزَّ وَجَلَّ هَلاكَ عَبْدٍ نَزَعَ مِنْهُ الْحَيَاءَ فَإِذَا نَزَعَ مِنْهُ الْحَيَاءَ لَمْ تَلْقَهُ إِلا خَائِناً مَخُوناً فَإِذَا كَانَ خَائِناً مَخُوناً نُزِعَتْ مِنْهُ الأمَانَةُ فَإِذَا نُزِعَتْ مِنْهُ الأمَانَةُ لَمْ تَلْقَهُ إِلا فَظّاً غَلِيظاً فَإِذَا كَانَ فَظّاً غَلِيظاً نُزِعَتْ مِنْهُ رِبْقَةُ الإيمَانِ فَإِذَا نُزِعَتْ مِنْهُ رِبْقَةُ الإيمَانِ لَمْ تَلْقَهُ إِلا شَيْطَاناً مَلْعُوناً.",
          "English Text": "10. Al-Husayn ibn Muhammad has narrated from Mu’alla ibn Muhammad from Mansur ibn al-‘Abbas from Ali ibn Asbat in a marfu’ manner from Salman who has said the following: “When Allah, the Most Majestic, the Most Holy, wants to destroy a person He removes bashfulness from him. When bashfulness is removed, you will not find anything in him but deceit and causing deception. When one is deceitful and deceptive, no one trusts him and when he can no longer be trusted you will not find him anything but an intensely harsh tempered one. When one is intensely harsh tempered the harness of belief is removed from him and when the harness of belief is removed from him you will find him to be nothing else but a condemned Satan.” "
        }
      },
      "Chapter #116": {
        "Hadith #11": {
          "Title": "Al-Kafi - Volume 2: Showing off",
          "Link": "https://thaqalayn.net/hadith/2/1/116/11",
          "Arabic Text": "11ـ أَبُو عَلِيٍّ الأشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنْ فَضْلٍ أَبِي الْعَبَّاسِ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ مَا يَصْنَعُ أَحَدُكُمْ أَنْ يُظْهِرَ حَسَناً وَيُسِرَّ سَيِّئاً أَ لَيْسَ يَرْجِعُ إِلَى نَفْسِهِ فَيَعْلَمَ أَنَّ ذَلِكَ لَيْسَ كَذَلِكَ وَالله عَزَّ وَجَلَّ يَقُولُ بَلِ الإنْسانُ عَلى‏ نَفْسِهِ بَصِيرَةٌ إِنَّ السَّرِيرَةَ إِذَا صَحَّتْ قَوِيَتِ الْعَلانِيَةُ. الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ عَنْ فَضَالَةَ عَنْ مُعَاوِيَةَ عَنِ الْفُضَيْلِ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) مِثْلَهُ.",
          "English Text": "11. Abu Ali al-Ash’ari has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan from Fadl abu al-‘Abbas from abu ‘Abd Allah who has said the following: “Why should one of you publicize a good deed and hide an evil one? Can he not find in his own-self that it is not right? Allah, the Most Majestic, the Most Holy, has said, ‘In fact, human beings are well aware of their souls.’ (75:14) When the private side is correct, the public side becomes strong.’” Al-Husayn ibn Muhammad has narrated from Mu’alla ibn Muhammad from Muhammad ibn Jumhur from Fadalah from Mu’awiyah from al-Fudayl from Abu ‘Abdillah  a similar Hadith. "
        },
        "Hadith #14": {
          "Title": "Al-Kafi - Volume 2: Showing off",
          "Link": "https://thaqalayn.net/hadith/2/1/116/14",
          "Arabic Text": "14ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) سَيَأْتِي عَلَى النَّاسِ زَمَانٌ تَخْبُثُ فِيهِ سَرَائِرُهُمْ وَتَحْسُنُ فِيهِ عَلانِيَتُهُمْ طَمَعاً فِي الدُّنْيَا لا يُرِيدُونَ بِهِ مَا عِنْدَ رَبِّهِمْ يَكُونُ دِينُهُمْ رِيَاءً لا يُخَالِطُهُمْ خَوْفٌ يَعُمُّهُمُ الله بِعِقَابٍ فَيَدْعُونَهُ دُعَاءَ الْغَرِيقِ فَلا يَسْتَجِيبُ لَهُمْ.",
          "English Text": "14. Ali ibn Ibrahim has narrated from his father from al-Nawfali from al-Sakuni from Abu ‘Abdillah  who has said the following: “The Messenger of Allah has said, ‘There will come a time when people will be filthy from the inside but good looking from the outside due to worldly greed. They will not have any intention of seeking the rewards with Allah. Their religion will be a showoff and not for fear (from the hereafter). Allah will punish them universally, even though they may pray like a drowning person (in desperation) but it will not be accepted.’” "
        }
      },
      "Chapter #118": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 2: Abuse of Religion for Worldly Matters",
          "Link": "https://thaqalayn.net/hadith/2/1/118/1",
          "Arabic Text": "1ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ إِسْمَاعِيلَ بْنِ جَابِرٍ عَنْ يُونُسَ بْنِ ظَبْيَانَ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيهِ السَّلام) يَقُولُ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) إِنَّ الله عَزَّ وَجَلَّ يَقُولُ وَيْلٌ لِلَّذِينَ يَخْتِلُونَ الدُّنْيَا بِالدِّينِ وَوَيْلٌ لِلَّذِينَ يَقْتُلُونَ الَّذِينَ يَأْمُرُونَ بِالْقِسْطِ مِنَ النَّاسِ وَوَيْلٌ لِلَّذِينَ يَسِيرُ الْمُؤْمِنُ فِيهِمْ بِالتَّقِيَّةِ أَ بِي يَغْتَرُّونَ أَمْ عَلَيَّ يَجْتَرِءُونَ فَبِي حَلَفْتُ لأتِيحَنَّ لَهُمْ فِتْنَةً تَتْرُكُ الْحَلِيمَ مِنْهُمْ حَيْرَانَ.",
          "English Text": "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Sinan from Isma’il ibn Jabir from Yunus ibn Zabyan who has said the following: “I heard Abu ‘Abdillah  saying, ‘The Messenger of Allah has said, “Allah, the Most Majestic, the Most Holy, has said, ‘Woe upon those who treacherously use religion for their worldly goals and fight those who command people to yield to justice. Woe upon those among whom the believers live frightened and hide their belief. Are they deceiving Me or that they dare to oppose Me? I swear by Myself that I will allow them to be afflicted by means of such strife whereby the most forbearing will suffer confusion.’” "
        }
      },
      "Chapter #130": {
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 2: Dimwittedness",
          "Link": "https://thaqalayn.net/hadith/2/1/130/4",
          "Arabic Text": "4ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ صَفْوَانَ عَنْ عِيصِ بْنِ الْقَاسِمِ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ إِنَّ أَبْغَضَ خَلْقِ الله عَبْدٌ اتَّقَى النَّاسُ لِسَانَهُ. ",
          "English Text": "4. A number of our people have narrated from Sahl ibn Ziyad from Safwan from ‘Iys ibn al-Qasim from Abu ‘Abdillah  who has said the following: “Abu ‘Abd Allah  has said, ‘The most hated of the creatures of Allah is one from whose tongue people are afraid.’” "
        }
      },
      "Chapter #149": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 2: Narration Against a Believer",
          "Link": "https://thaqalayn.net/hadith/2/1/149/1",
          "Arabic Text": "1ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ مُفَضَّلِ بْنِ عُمَرَ قَالَ قَالَ لِي أَبُو عَبْدِ الله (عَلَيهِ السَّلام) مَنْ رَوَى عَلَى مُؤْمِنٍ رِوَايَةً يُرِيدُ بِهَا شَيْنَهُ وَهَدْمَ مُرُوءَتِهِ لِيَسْقُطَ مِنْ أَعْيُنِ النَّاسِ أَخْرَجَهُ الله مِنْ وَلايَتِهِ إِلَى وَلايَةِ الشَّيْطَانِ فَلا يَقْبَلُهُ الشَّيْطَانُ.",
          "English Text": "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Sinan from Mufaddal ibn ‘Umar who has said the following: “Once Abu ‘Abdillah  said to me, ‘Whoever makes a narration against a believer intending thereby to defame him and destroy his honor to discredit him in the eyes of people, Allah moves him out of His guardianship to that of Satan, and Satan will not accept him.’” "
        }
      },
      "Chapter #158": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 2: Frightening a Believer",
          "Link": "https://thaqalayn.net/hadith/2/1/158/3",
          "Arabic Text": "3ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ مَنْ أَعَانَ عَلَى مُؤْمِنٍ بِشَطْرِ كَلِمَةٍ لَقِيَ الله عَزَّ وَجَلَّ يَوْمَ الْقِيَامَةِ مَكْتُوبٌ بَيْنَ عَيْنَيْهِ آيِسٌ مِنْ رَحْمَتِي. ",
          "English Text": "3. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from certain individuals of his people from Abu ‘Abdillah  who has said the following: ‘‘Whoever helps (someone) against a believer, even with a part of a word, will meet Allah, the Most Majestic, the Most Holy, on the Day of Judgment with a writing between his eyes that will say, ‘Deprived of My mercy.’” "
        }
      },
      "Chapter #160": {
        "Hadith #10": {
          "Title": "Al-Kafi - Volume 2: Publicity of Confidentialities",
          "Link": "https://thaqalayn.net/hadith/2/1/160/10",
          "Arabic Text": "10ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ نَصْرِ بْنِ صَاعِدٍ مَوْلَى أَبِي عَبْدِ الله (عَلَيهِ السَّلام) عَنْ أَبِيهِ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيهِ السَّلام) يَقُولُ مُذِيعُ السِّرِّ شَاكٌّ وَقَائِلُهُ عِنْدَ غَيْرِ أَهْلِهِ كَافِرٌ وَمَنْ تَمَسَّكَ بِالْعُرْوَةِ الْوُثْقَى فَهُوَ نَاجٍ قُلْتُ مَا هُوَ قَالَ التَّسْلِيمُ.",
          "English Text": "10. Al-Husayn ibn Muhammad has narrated from Mu’alla ibn Muhammad from Ahmad ibn Muhammad from Nasr ibn Sa’id, Mawla Abu ‘Abdillah  from his father who has said the following: “I heard Abu ‘Abdillah  saying, ‘The propagator (of the confidential Hadith of ‘ A’immah ) is in doubt (about his belief in ‘ A’immah ) and the narrator (of confidential matter) before a stranger (unreliable audience) is an unbeliever. Whoever holds fast to the firm ring, is saved.’ I (the narrator) then asked, ‘What is it (the ring)?’ The Imam said, ‘It is submission (to the commands of ‘ A’immah , and acceptance of the same).”’ "
        }
      },
      "Chapter #165": {
        "Hadith #21": {
          "Title": "Al-Kafi - Volume 2: Disbelief",
          "Link": "https://thaqalayn.net/hadith/2/1/165/21",
          "Arabic Text": "21ـ يُونُسُ عَنْ مُوسَى بْنِ بَكْرٍ عَنْ أَبِي إِبْرَاهِيمَ (عَلَيهِ السَّلام) قَالَ إِنَّ عَلِيّاً (عَلَيهِ السَّلام) بَابٌ مِنْ أَبْوَابِ الْجَنَّةِ فَمَنْ دَخَلَ بَابَهُ كَانَ مُؤْمِناً وَمَنْ خَرَجَ مِنْ بَابِهِ كَانَ كَافِراً وَمَنْ لَمْ يَدْخُلْ فِيهِ وَلَمْ يَخْرُجْ مِنْهُ كَانَ فِي الطَّبَقَةِ الَّتِي لله فِيهِمُ الْمَشِيئَةُ. ",
          "English Text": "21. Yunus has narrated from Musa ibn Bukayr from abu Ibrahim  who has said the following: “Ali  is a door of the doors of paradise. Whoever approaches through him is a believer, those who depart him are unbelievers, and those who do not approach or leave are among the group about whom Allah has the will to decide.” "
        }
      },
      "Chapter #172": {
        "Hadith #9": {
          "Title": "Al-Kafi - Volume 2: The Feeble-minded People",
          "Link": "https://thaqalayn.net/hadith/2/1/172/9",
          "Arabic Text": "9ـ عَنْهُ عَنْ عَلِيِّ بْنِ الْحَسَنِ التَّيْمِيِّ عَنْ أَخَوَيْهِ مُحَمَّدٍ وَأَحْمَدَ ابْنَيِ الْحَسَنِ عَنْ عَلِيِّ بْنِ يَعْقُوبَ عَنْ مَرْوَانَ بْنِ مُسْلِمٍ عَنْ أَيُّوبَ بْنِ الْحُرِّ قَالَ قَالَ رَجُلٌ لأبِي عَبْدِ الله (عَلَيهِ السَّلام) وَنَحْنُ عِنْدَهُ جُعِلْتُ فِدَاكَ إِنَّا نَخَافُ أَنْ نَنْزِلَ بِذُنُوبِنَا مَنَازِلَ الْمُسْتَضْعَفِينَ قَالَ فَقَالَ لا وَالله لا يَفْعَلُ الله ذَلِكَ بِكُمْ أَبَداً. عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) مِثْلَهُ.",
          "English Text": "9. It is narrated from him (narrator of the Hadith above) from Ali ibn al-Hassan al- Taymi from his two brothers, Muhammad and Ahmad sons of al-Hassan from Ali ibn Ya’qub from Marwan ibn Muslim from Ayyub ibn al-Hurr who has said the following: “Once a man said to Abu ‘Abdillah  while we were present, ‘May Allah keep my soul in service for your cause, we are afraid that because of our sins we will be treated as feeble-minded people.’ The narrator has said that the Imam said, ‘No, by Allah, Allah will never do that to you.’” Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from a man from Abu ‘Abdillah  a similar Hadith. "
        }
      },
      "Chapter #176": {
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 2: People with Inclined Hearts",
          "Link": "https://thaqalayn.net/hadith/2/1/176/4",
          "Arabic Text": "4ـ عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ عَنْ إِسْحَاقَ بْنِ غَالِبٍ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) يَا إِسْحَاقُ كَمْ تَرَى أَهْلَ هَذِهِ الآيَةِ فَإِنْ أُعْطُوا مِنْها رَضُوا وَإِنْ لَمْ يُعْطَوْا مِنْها إِذا هُمْ يَسْخَطُونَ قَالَ ثُمَّ قَالَ هُمْ أَكْثَرُ مِنْ ثُلُثَيِ النَّاسِ.",
          "English Text": "4. Ali has narrated from his father from Ibn Abi ‘Umayr from Ibrahim ibn ‘Abd al- Hamid from Ishaq ibn Ghalib who has said the following: “Abu ‘Abd Allah  once asked, ‘O Ishaq, how many people can you find to whom this verse, ‘ . . . They are pleased when you give them something from it, but if they receive nothing, they become angry with you,’ (9:58) applies? The Imam then said, ‘They are more than two thirds of the people.’” "
        }
      },
      "Chapter #178": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 2: About the Words of Allah, the Most High, Certain people worship Allah with deviance",
          "Link": "https://thaqalayn.net/hadith/2/1/178/2",
          "Arabic Text": "2ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مُوسَى بْنِ بَكْرٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ (عَلَيهِ السَّلام) قَالَ سَأَلْتُهُ عَنْ قَوْلِ الله عَزَّ وَجَلَّ وَمِنَ النَّاسِ مَنْ يَعْبُدُ الله عَلى‏ حَرْفٍ قَالَ هُمْ قَوْمٌ وَحَّدُوا الله وَخَلَعُوا عِبَادَةَ مَنْ يُعْبَدُ مِنْ دُونِ الله فَخَرَجُوا مِنَ الشِّرْكِ وَلَمْ يَعْرِفُوا أَنَّ مُحَمَّداً (صَلَّى اللهُ عَلَيْهِ وآلِه) رَسُولُ الله فَهُمْ يَعْبُدُونَ الله عَلَى شَكٍّ فِي مُحَمَّدٍ (صَلَّى اللهُ عَلَيْهِ وآلِه) وَمَا جَاءَ بِهِ فَأَتَوْا رَسُولَ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) وَقَالُوا نَنْظُرُ فَإِنْ كَثُرَتْ أَمْوَالُنَا وَعُوفِينَا فِي أَنْفُسِنَا وَأَوْلادِنَا عَلِمْنَا أَنَّهُ صَادِقٌ وَأَنَّهُ رَسُولُ الله وَإِنْ كَانَ غَيْرَ ذَلِكَ نَظَرْنَا قَالَ الله عَزَّ وَجَلَّ فَإِنْ أَصابَهُ خَيْرٌ اطْمَأَنَّ بِهِ يَعْنِي عَافِيَةً فِي الدُّنْيَا وَإِنْ أَصابَتْهُ فِتْنَةٌ يَعْنِي بَلاءً فِي نَفْسِهِ وَمَالِهِ انْقَلَبَ عَلى‏ وَجْهِهِ انْقَلَبَ عَلَى شَكِّهِ إِلَى الشِّرْكِ خَسِرَ الدُّنْيا وَالآخِرَةَ ذلِكَ هُوَ الْخُسْرانُ الْمُبِينُ يَدْعُوا مِنْ دُونِ الله ما لا يَضُرُّهُ وَما لا يَنْفَعُهُ قَالَ يَنْقَلِبُ مُشْرِكاً يَدْعُو غَيْرَ الله وَيَعْبُدُ غَيْرَهُ فَمِنْهُمْ مَنْ يَعْرِفُ وَيَدْخُلُ الإيمَانُ قَلْبَهُ فَيُؤْمِنُ وَيُصَدِّقُ وَيَزُولُ عَنْ مَنْزِلَتِهِ مِنَ الشَّكِّ إِلَى الإيمَانِ وَمِنْهُمْ مَنْ يَثْبُتُ عَلَى شَكِّهِ وَمِنْهُمْ مَنْ يَنْقَلِبُ إِلَى الشِّرْكِ. عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ رَجُلٍ عَنْ زُرَارَةَ مِثْلَهُ. ",
          "English Text": "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Musa ibn Bakr from Zurara who has said the following: “Once I asked abu Ja’far  about the words of Allah, the Most Majestic, the Most Holy, ‘Certain people worship Allah for worldly gains.’ (22:11) The Imam said, ‘They were a people who accepted Allah only, gave up the worship of things worshipped besides Allah; thus they came out of paganism and did not know that Muhammad is the Messenger of Allah. Therefore they worshipped Allah with doubts in Muhammad and what he had brought from Allah. They would come to the Messenger of Allah and say (to each other), ‘We will see if our properties increase, we and our children enjoy good health then we will believe that he is the Messenger of Allah; otherwise, we will think.’ “Allah, the Most Majestic, the Most Holy, has said, ‘When they receive good things they enjoy confidence in it, . . .’ [worldly well being], ‘ . . . when they suffer hardships . . .’ [misfortune in his life and property], ‘ ... he turns backwards,’ [in doubt to paganism, thus] ‘. . . they suffer loses in this world and in the next life, an obvious loss. They call for help from things other than Allah that do not harm or benefit them.’ (22:12) The Imam said, ‘He turns to paganism and calls for help from things other than Allah and worships things besides Allah. There are those of them who learn true knowledge and belief enters their heart. They become believers. They acknowledge the truth and move from their doubtful position to belief. There are those of them who remain in doubt and still others of them return to paganism.’” Ali ibn Ibrahim has narrated from his father from Muhammad ibn ‘Isa from Yunus from a man from Zurara a similar Hadith. "
        }
      },
      "Chapter #203": {
        "Hadith #15": {
          "Title": "Al-Kafi - Volume 2: Evaluation of Deeds",
          "Link": "https://thaqalayn.net/hadith/2/1/203/15",
          "Arabic Text": "15ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَعَلِيِّ بْنِ مُحَمَّدٍ الْقَاسَانِيِّ جَمِيعاً عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ سُلَيْمَانَ الْمِنْقَرِيِّ عَنْ حَفْصِ بْنِ غِيَاثٍ قَالَ سَمِعْتُ أَبَا عَبْدِ الله يَقُولُ إِنْ قَدَرْتَ أَنْ لا تُعْرَفَ فَافْعَلْ وَمَا عَلَيْكَ أَلا يُثْنِيَ عَلَيْكَ النَّاسُ وَمَا عَلَيْكَ أَنْ تَكُونَ مَذْمُوماً عِنْدَ النَّاسِ إِذَا كُنْتَ مَحْمُوداً عِنْدَ الله ثُمَّ قَالَ قَالَ أَبِي عَلِيُّ بْنُ أَبِي طَالِبٍ (عَلَيهِ السَّلام) لا خَيْرَ فِي الْعَيْشِ إِلا لِرَجُلَيْنِ رَجُلٍ يَزْدَادُ كُلَّ يَوْمٍ خَيْراً وَرَجُلٍ يَتَدَارَكُ مَنِيَّتَهُ بِالتَّوْبَةِ وَأَنَّى لَهُ بِالتَّوْبَةِ وَالله لَوْ سَجَدَ حَتَّى يَنْقَطِعَ عُنُقُهُ مَا قَبِلَ الله تَبَارَكَ وَتَعَالَى مِنْهُ إِلا بِوَلايَتِنَا أَهْلَ الْبَيْتِ أَلا وَمَنْ عَرَفَ حَقَّنَا وَرَجَا الثَّوَابَ فِينَا وَرَضِيَ بِقُوتِهِ نِصْفِ مُدٍّ فِي كُلِّ يَوْمٍ وَمَا سَتَرَ عَوْرَتَهُ وَمَا أَكَنَّ رَأْسَهُ وَهُمْ وَالله فِي ذَلِكَ خَائِفُونَ وَجِلُونَ وَدُّوا أَنَّهُ حَظُّهُمْ مِنَ الدُّنْيَا وَكَذَلِكَ وَصَفَهُمُ الله عَزَّ وَجَلَّ فَقَالَ وَالَّذِينَ يُؤْتُونَ ما آتَوْا وَقُلُوبُهُمْ وَجِلَةٌ أَنَّهُمْ إِلى‏ رَبِّهِمْ راجِعُونَ ثُمَّ قَالَ مَا الَّذِي آتَوْا آتَوْا وَالله مَعَ الطَّاعَةِ الْمَحَبَّةَ وَالْوَلايَةَ وَهُمْ فِي ذَلِكَ خَائِفُونَ لَيْسَ خَوْفُهُمْ خَوْفَ شَكٍّ وَلَكِنَّهُمْ خَافُوا أَنْ يَكُونُوا مُقَصِّرِينَ فِي مَحَبَّتِنَا وَطَاعَتِنَا.",
          "English Text": "15. Ali ibn Ibrahim has narrated from his father and Ali ibn Muhammad al-Qasani have all narrated from al-Qasim ibn Muhammad from Sulayman al-Minqari from Hafs ibn Ghiyath who has said the following: “Once I heard Abu ‘Abdillah  saying, ‘If you can remain unknown, then do so. There will be nothing wrong if people will not praise you. There is nothing wrong for you if people censure you if you are praiseworthy before Allah.’ The Imam said, ‘My father Amir al- Mu’minin, Ali ibn abu Talib  has said, “There is nothing good in life except for two kinds of people: a man who every day increases his good deeds and a man who every day remedies a destructive deed with repentance. How can repentance be of any benefit for him? By Allah, if he would perform a Sajdah prostration for such a length of time that his neck severs off of his body still, Allah, the Most Blessed, the Most High, will not accept his repentance without his acknowledgement of the Wilayah (Divine Authority) of our Ahl al-Bayt (family of Holy Prophet). You must know that whoever recognizes our rights can have hope for rewards because of us. He agrees, for his survival, to half of a one time meal every day, and with that which provides him covering for his privacy, his or her head, and with it, by Allah, they live in fear and apprehension and love to agree with this much as their share from the world and this is how Allah, the Majestic, the Glorious, has described them, ‘. . . who bring what is brought to them and whose hearts are afraid of their return to their Lord.’ (23:60) What do they bring? They, by Allah, will bring along with obedience, love and (acknowledgement of) the guardianship (of Allah and Ahl al-Bayt (family of Holy Prophet) and they still will be afraid. Such fear is not due to doubts, but it is due to their fear of falling short in our love and obedience.’”” "
        },
        "Hadith #20": {
          "Title": "Al-Kafi - Volume 2: Evaluation of Deeds",
          "Link": "https://thaqalayn.net/hadith/2/1/203/20",
          "Arabic Text": "20ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِهِ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ أَبِي عُثْمَانَ عَنْ وَاصِلٍ عَنْ عَبْدِ الله بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ جَاءَ رَجُلٌ إِلَى أَبِي ذَرٍّ فَقَالَ يَا أَبَا ذَرٍّ مَا لَنَا نَكْرَهُ الْمَوْتَ فَقَالَ لأنَّكُمْ عَمَرْتُمُ الدُّنْيَا وَأَخْرَبْتُمُ الآخِرَةَ فَتَكْرَهُونَ أَنْ تُنْقَلُوا مِنْ عُمْرَانٍ إِلَى خَرَابٍ فَقَالَ لَهُ فَكَيْفَ تَرَى قُدُومَنَا عَلَى الله فَقَالَ أَمَّا الْمُحْسِنُ مِنْكُمْ فَكَالْغَائِبِ يَقْدَمُ عَلَى أَهْلِهِ وَأَمَّا الْمُسِي‏ءُ مِنْكُمْ فَكَالآبِقِ يُرَدُّ عَلَى مَوْلاهُ قَالَ فَكَيْفَ تَرَى حَالَنَا عِنْدَ الله قَالَ اعْرِضُوا أَعْمَالَكُمْ عَلَى الْكِتَابِ إِنَّ الله يَقُولُ إِنَّ الأبْرارَ لَفِي نَعِيمٍ وَإِنَّ الْفُجَّارَ لَفِي جَحِيمٍ قَالَ فَقَالَ الرَّجُلُ فَأَيْنَ رَحْمَةُ الله قَالَ رَحْمَةُ الله قَرِيبٌ مِنَ الْمُحْسِنِينَ قَالَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) وَكَتَبَ رَجُلٌ إِلَى أَبِي ذَرٍّ رَضِيَ الله عَنْهُ يَا أَبَا ذَرٍّ أَطْرِفْنِي بِشَيْ‏ءٍ مِنَ الْعِلْمِ فَكَتَبَ إِلَيْهِ أَنَّ الْعِلْمَ كَثِيرٌ وَلَكِنْ إِنْ قَدَرْتَ أَنْ لا تُسِي‏ءَ إِلَى مَنْ تُحِبُّهُ فَافْعَلْ قَالَ فَقَالَ لَهُ الرَّجُلُ وَهَلْ رَأَيْتَ أَحَداً يُسِي‏ءُ إِلَى مَنْ يُحِبُّهُ فَقَالَ لَهُ نَعَمْ نَفْسُكَ أَحَبُّ الأنْفُسِ إِلَيْكَ فَإِذَا أَنْتَ عَصَيْتَ الله فَقَدْ أَسَأْتَ إِلَيْهَا.",
          "English Text": "20. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from certain individuals of his people from al-Hassan ibn Ali ibn abu ‘Uthman from Wasil from ‘Abd Allah ibn Sinan from Abu ‘Abdillah  who has said the following: “A man came to abu Dhar and asked, ‘O abu Dhar, why do we dislike death?’ He said, ‘It is because you have developed the world and destroyed the next life and you dislike moving from developed to that which is mined.’ The man asked, ‘How do you see our moving in the presence of Allah?’ He replied, ‘The people of good deeds among you will be like one coming home from a journey. The evil doers among you, however, will be like a runaway slave returned to his master.’ The man then asked, ‘How do you see our condition before Allah?’ He said, ‘Present your deeds before the book of Allah. Allah has said, ‘‘The virtuous ones will live in bounties and the evil doers will live in fire.” (82:14,15) The man than asked, ‘Where then is the mercy of Allah?’ He replied, ‘The mercy of Allah is very close to the people who do good deeds.’ “Abu ‘Abd Allah  then said, ‘A man wrote to abu Dhar, may Allah be pleased with him, “O abu Dhar instruct me with a few things of knowledge.” He wrote back to him, ‘Knowledge is of many kinds, however, if you are able not to disappoint those whom you love, then do so. Yes, your soul is the most beloved to you. When you disobey Allah, you are doing bad and disappointing things to your own soul.’” "
        },
        "Hadith #23": {
          "Title": "Al-Kafi - Volume 2: Evaluation of Deeds",
          "Link": "https://thaqalayn.net/hadith/2/1/203/23",
          "Arabic Text": "23ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ قِيلَ لأمِيرِ الْمُؤْمِنِينَ (عَلَيهِ السَّلام) عِظْنَا وَأَوْجِزْ فَقَالَ الدُّنْيَا حَلالُهَا حِسَابٌ وَحَرَامُهَا عِقَابٌ وَأَنَّى لَكُمْ بِالرَّوْحِ وَلَمَّا تَأَسَّوْا بِسُنَّةِ نَبِيِّكُمْ تَطْلُبُونَ مَا يُطْغِيكُمْ وَلا تَرْضَوْنَ مَا يَكْفِيكُمْ. ",
          "English Text": "23. A number of our people have narrated from Sahl ibn Ziyad from Ya’qub ibn Yazid from those whom has mentioned (in his book) from Abu ‘Abdillah  who has said the following: “It was said to Amir al-Mu’minin, Ali ibn abu Talib  ‘Instinct us briefly with good advice.’ He then said, ‘For the lawful things of the world there is accountability and for the unlawful things of the world there is torment. How can you have comfort without following the traditions of your prophet? You seek what takes you to transgression and you do not agree with what is sufficient for you.’” "
        }
      }
    },
    "Book #2": {
      "Chapter #3": {
        "Hadith #9": {
          "Title": "Al-Kafi - Volume 2: Prayer Diverts Misfortune and Allah ’s Decision",
          "Link": "https://thaqalayn.net/hadith/2/2/3/9",
          "Arabic Text": "9ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ رَفَعَهُ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) إِنَّ الله عَزَّ وَجَلَّ لَيَدْفَعُ بِالدُّعَاءِ الأمْرَ الَّذِي عَلِمَهُ أَنْ يُدْعَى لَهُ فَيَسْتَجِيبُ وَلَوْ لا مَا وُفِّقَ الْعَبْدُ مِنْ ذَلِكَ الدُّعَاءِ لأصَابَهُ مِنْهُ مَا يَجُثُّهُ مِنْ جَدِيدِ الأرْضِ. ",
          "English Text": "9. Al-Husayn ibn Muhammad has narrated in a marfu ’ manner from Ishaq ibn ‘ Ammar who has said the following: ‘‘Abu ‘Abd Allah  has said, ‘By means of prayer, Allah, the Most Majestic, the Most Holy, repels a thing (a misfortune) that He knows He will divert it if a plea will be made before Him. However, if the servant (of Allah) fails to pray and plead before Allah for help, the misfortune will afflict him to the extent of pulling him to pieces from the face of earth.’” "
        }
      },
      "Chapter #13": {
        "Hadith #8": {
          "Title": "Al-Kafi - Volume 2: The Times and Conditions in which there is Hope for Acceptance",
          "Link": "https://thaqalayn.net/hadith/2/2/13/8",
          "Arabic Text": "8ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عَلِيِّ بْنِ حَدِيدٍ رَفَعَهُ إِلَى أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ إِذَا اقْشَعَرَّ جِلْدُكَ وَدَمَعَتْ عَيْنَاكَ فَدُونَكَ دُونَكَ فَقَدْ قُصِدَ قَصْدُكَ‏. قَالَ وَرَوَاهُ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنْ أَبِي إِسْمَاعِيلَ السَّرَّاجِ عَنْ مُحَمَّدِ بْنِ أَبِي حَمْزَةَ عَنْ سَعِيدٍ مِثْلَهُ.",
          "English Text": "8. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from Ali ibn Hadid in a marfu’ manner from Abu ‘Abdillah  who has said the following: “Whenever your skin feels a tingling sensation and your eyes tear up, you must pray and plead before Allah for help, it (your wish) is coming your way.” The narrator has said that Muhammad ibn Isma’il has narrated from abu Isma’il al-Sarraj from Muhammad ibn abu Hamza from Sa’id a similar Hadith. "
        }
      },
      "Chapter #15": {
        "Hadith #10": {
          "Title": "Al-Kafi - Volume 2: Weeping",
          "Link": "https://thaqalayn.net/hadith/2/2/15/10",
          "Arabic Text": "10ـ عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) لأبِي بَصِيرٍ إِنْ خِفْتَ أَمْراً يَكُونُ أَوْ حَاجَةً تُرِيدُهَا فَابْدَأْ بِالله وَمَجِّدْهُ وَأَثْنِ عَلَيْهِ كَمَا هُوَ أَهْلُهُ وَصَلِّ عَلَى النَّبِيِّ (صَلَّى اللهُ عَلَيْهِ وآلِه) وَسَلْ حَاجَتَكَ وَتَبَاكَ وَلَوْ مِثْلَ رَأْسِ الذُّبَابِ إِنَّ أَبِي (عَلَيهِ السَّلام) كَانَ يَقُولُ إِنَّ أَقْرَبَ مَا يَكُونُ الْعَبْدُ مِنَ الرَّبِّ عَزَّ وَجَلَّ وَهُوَ سَاجِدٌ بَاكٍ.",
          "English Text": "10. It is narrated from him (narrator of the Hadith above) from Ahmad ibn Muhammad from Ali ibn al-Hakam from Ali ibn abu Hamza who has said the following: “Abu ‘Abd Allah  has said to abu Basir, ‘If you are afraid of something or need help, then begin with Allah and His glory and praise Him as He deserves. Then ask Allah’s favors for the Holy Prophet and ask for help, tiy to weep even if your tears are of the size of the head of a fly. Abu ‘Abd Allah  would say, ‘a servant (of Allah) in prostration and weeping is in the nearest position to Allah, the Most Majestic, the Most Holy.’” "
        }
      },
      "Chapter #16": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 2: Praising Allah Before Praying and Pleading for Help",
          "Link": "https://thaqalayn.net/hadith/2/2/16/3",
          "Arabic Text": "3ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنِ ابْنِ سِنَانٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ إِنَّمَا هِيَ الْمِدْحَةُ ثُمَّ الثَّنَاءُ ثُمَّ الإقْرَارُ بِالذَّنْبِ ثُمَّ الْمَسْأَلَةُ إِنَّهُ وَالله مَا خَرَجَ عَبْدٌ مِنْ ذَنْبٍ إِلا بِالإقْرَارِ.",
          "English Text": "3. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from his father from ibn Sinan from Mu’awiyah ibn ‘Ammar from Abu ‘Abdillah  who has said the following: “Abu ‘Abd Allah  has said, ‘It is thanking then praising, then confession of sins then pleading before Allah for help. By Allah, no servant (of Allah) can come out of sins without confession.’” "
        }
      },
      "Chapter #22": {
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 2: Speaking of Allah, the Most Majestic, the Most Holy, Very Often",
          "Link": "https://thaqalayn.net/hadith/2/2/22/4",
          "Arabic Text": "4ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ بَكْرِ بْنِ أَبِي بَكْرٍ عَنْ زُرَارَةَ بْنِ أَعْيَنَ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ تَسْبِيحُ فَاطِمَةَ الزَّهْرَاءِ (عليها السلام) مِنَ الذِّكْرِ الْكَثِيرِ الَّذِي قَالَ الله عَزَّ وَجَلَّ اذْكُرُوا الله ذِكْراً كَثِيراً. عَنْهُ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ أَبِي أُسَامَةَ زَيْدٍ الشَّحَّامِ وَمَنْصُورِ بْنِ حَازِمٍ وَسَعِيدٍ الأعْرَجِ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) مِثْلَهُ.",
          "English Text": "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Hakam from Sayf ibn ‘Amirah from Bakr ibn Bukayr from Zurara ibn ‘A’Yun from Abu ‘Abdillah  who has said the following: “Tasbih of Fatimah al-Zahra  is a form of ‘Often speaking and remembering Allah’ about which Allah, the Most Majestic, the Most Holy, has said, ‘Believers, remember Allah very often (33:41) and glorify Him both in the mornings and in the evenings.’” (33:42) It is narrated from him (narrator of the Hadith above) from Ali ibn al-Hakam from Sayf ibn ‘Amirah from abu ‘Usamah Zayd al-Shahham and Mansur ibn Hazim and Sa’id al-‘A’raj from Abu ‘Abdillah  a similar Hadith. "
        }
      },
      "Chapter #33": {
        "Hadith #5": {
          "Title": "Al-Kafi - Volume 2: Prayer Against the Enemy",
          "Link": "https://thaqalayn.net/hadith/2/2/33/5",
          "Arabic Text": "5ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنِ الْمِسْمَعِيِّ قَالَ لَمَّا قَتَلَ دَاوُدُ بْنُ عَلِيٍّ الْمُعَلَّى بْنَ خُنَيْسٍ قَالَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) لأدْعُوَنَّ الله عَلَى مَنْ قَتَلَ مَوْلايَ وَأَخَذَ مَالِي فَقَالَ لَهُ دَاوُدُ بْنُ عَلِيٍّ إِنَّكَ لَتُهَدِّدُنِي بِدُعَائِكَ قَالَ حَمَّادٌ قَالَ الْمِسْمَعِيُّ فَحَدَّثَنِي مُعَتِّبٌ أَنَّ أَبَا عَبْدِ الله (عَلَيهِ السَّلام) لَمْ يَزَلْ لَيْلَتَهُ رَاكِعاً وَسَاجِداً فَلَمَّا كَانَ فِي السَّحَرِ سَمِعْتُهُ يَقُولُ وَهُوَ سَاجِدٌ اللهمَّ إِنِّي أَسْأَلُكَ بِقُوَّتِكَ الْقَوِيَّةِ وَبِجَلالِكَ الشَّدِيدِ الَّذِي كُلُّ خَلْقِكَ لَهُ ذَلِيلٌ أَنْ تُصَلِّيَ عَلَى مُحَمَّدٍ وَأَهْلِ بَيْتِهِ وَأَنْ تَأْخُذَهُ السَّاعَةَ السَّاعَةَ فَمَا رَفَعَ رَأْسَهُ حَتَّى سَمِعْنَا الصَّيْحَةَ فِي دَارِ دَاوُدَ بْنِ عَلِيٍّ فَرَفَعَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) رَأْسَهُ وَقَالَ إِنِّي دَعَوْتُ الله بِدَعْوَةٍ بَعَثَ الله عَزَّ وَجَلَّ عَلَيْهِ مَلَكاً فَضَرَبَ رَأْسَهُ بِمِرْزَبَةٍ مِنْ حَدِيدٍ انْشَقَّتْ مِنْهَا مَثَانَتُهُ فَمَاتَ. ",
          "English Text": "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn abu Najran from Hammad ibn ‘Uthman from al-Misma’I who has said that when Dawud ibn Ali killed al-Mu’alla’ ibn Khunays, Abu ‘Abdillah  said the following: “Abu ‘Abd Allah  said, ‘I will pray to Allah against whoever has murdered my Mawla (servant) and has seized my property.’ Dawud ibn Ali then said, ‘You threaten me with your prayer! (But I am not afraid).’ Hammad has said that al-Misma’i said that Mu’attib said to me, ‘Abu ‘Abd Allah  that night continued his Ruku ’ and Sajdah and, when it was morning, I hear him saying in Sajdah (prostration) “O Lord, I ask You through Your power that is strong, through Your glory that is intense, that has humbled Your creatures, grant favors to Muhammad and his family and seize him (the enemy) in this hour! Seize him in this hour!’ He had not yet raised his head that we heard crying and wailing from the house of Dawud ibn Ali. Abu ‘Abd Allah  raised his head and said, ‘I prayed to Allah with a prayer and Allah, the Most Majestic, the Most Holy, sent an angel over him to hit his head with an iron bar that ruptured his bladder and caused his death.’” Note: Dawud ibn Ali was the governor of Madinah during the rule of abu al- ‘Abbas al-Saffah. He ordered al-Mu’alla to identify for him every Shi’a (follower A ’ immah ) of abu ‘Abd Allah . He refused saying, ‘Even if they were under my foot I would not raise it to expose them.’ He was murdered and the properties of Abu ‘Abdillah  with him was seized. "
        }
      },
      "Chapter #48": {
        "Hadith #35": {
          "Title": "Al-Kafi - Volume 2: The Word in the Morning and Evening",
          "Link": "https://thaqalayn.net/hadith/2/2/48/35",
          "Arabic Text": "35ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ إِسْمَاعِيلَ بْنِ جَابِرٍ عَنْ أَبِي عُبَيْدَةَ الْحَذَّاءِ قَالَ قَالَ أَبُو جَعْفَرٍ (عَلَيهِ السَّلام) مَنْ قَالَ حِينَ يَطْلُعُ الْفَجْرُ لا إِلَهَ إِلا الله وَحْدَهُ لا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَيُمِيتُ وَيُحْيِي وَهُوَ حَيٌّ لا يَمُوتُ بِيَدِهِ الْخَيْرُ وَهُوَ عَلَى كُلِّ شَيْ‏ءٍ قَدِيرٌ عَشْرَ مَرَّاتٍ وَصَلَّى عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ عَشْرَ مَرَّاتٍ وَسَبَّحَ خَمْساً وَثَلاثِينَ مَرَّةً وَهَلَّلَ خَمْساً وَثَلاثِينَ مَرَّةً وَحَمِدَ الله خَمْساً وَثَلاثِينَ مَرَّةً لَمْ يُكْتَبْ فِي ذَلِكَ الصَّبَاحِ مِنَ الْغَافِلِينَ وَإِذَا قَالَهَا فِي الْمَسَاءِ لَمْ يُكْتَبُ فِي تِلْكَ اللَّيْلَةِ مِنَ الْغَافِلِينَ.",
          "English Text": "35. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Sinan from Isma’Il ibn Jabir from ‘Ubaydah al-Hadhdha’ who has said the following: “Abu Ja’far  has said, ‘Whoever says before dawn, “No one deserves to be worshipped except Allah alone, Who has no partner, to Him belongs the kingdom and all praise, He gives life, causes death, causes death and gives life. He is living and does not die, in His hand is all good and He has power over all things,” ten times and says, ‘O Lord, grant al-Salat (favors) upon Muhammad and his family,’ ten times, and says, ‘Allah is free of all defects,’ thirty-five times, ‘No one deserves to be worshipped except Allah,’ thirty- five times, ‘All praise belongs to Allah,’ thirty-five times, he will not be written that morning among the careless ones and if he says this in the evening, he will not be written of the careless ones in that night.’” "
        },
        "Hadith #37": {
          "Title": "Al-Kafi - Volume 2: The Word in the Morning and Evening",
          "Link": "https://thaqalayn.net/hadith/2/2/48/37",
          "Arabic Text": "37ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ إِسْحَاقَ عَنْ سَعْدَانَ عَنْ دَاوُدَ الرَّقِّيِّ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ لا تَدَعْ أَنْ تَدْعُوَ بِهَذَا الدُّعَاءِ ثَلاثَ مَرَّاتٍ إِذَا أَصْبَحْتَ وَثَلاثَ مَرَّاتٍ إِذَا أَمْسَيْتَ اللهمَّ اجْعَلْنِي فِي دِرْعِكَ الْحَصِينَةِ الَّتِي تَجْعَلُ فِيهَا مَنْ تُرِيدُ فَإِنَّ أَبِي (عَلَيهِ السَّلام) كَانَ يَقُولُ هَذَا مِنَ الدُّعَاءِ الْمَخْزُونِ.",
          "English Text": "37. Al-Husayn ibn Muhammad has narrated from Ahmad ibn Ishaq from Su’Dan from Dawud al-Raqqi from Abu ‘Abdillah  who has said the following: “Do not miss saying in the morning and in the evening three times this, ‘O Lord, place me in Your strong coat of arms in which You place whomever You will’; my father would say that this is of the prayer that is treasured.’” "
        }
      },
      "Chapter #49": {
        "Hadith #13": {
          "Title": "Al-Kafi - Volume 2: Prayer Before Sleeping and After Waking Up",
          "Link": "https://thaqalayn.net/hadith/2/2/49/13",
          "Arabic Text": "13ـ أَبُو عَلِيٍّ الأشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ وَمُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ كَانَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) إِذَا قَامَ آخِرَ اللَّيْلِ يَرْفَعُ صَوْتَهُ حَتَّى يُسْمِعَ أَهْلَ الدَّارِ وَيَقُولُ اللهمَّ أَعِنِّي عَلَى هَوْلِ الْمُطَّلَعِ وَوَسِّعْ عَلَيَّ ضِيقَ الْمَضْجَعِ وَارْزُقْنِي خَيْرَ مَا قَبْلَ الْمَوْتِ وَارْزُقْنِي خَيْرَ مَا بَعْدَ الْمَوْتِ.",
          "English Text": "13. Abu Ali al-Ash’ari has narrated from Muhammad ibn ‘Abd al-Jabbar and Muhammad ibn Isma’Il from al-Fadl ibn Shadhan all from Safwan ibn Yahya from ‘Abd al-Rahman ibn al-Hajjaj who has said the following: “When Abu ‘Abdillah  toward the end of night was to wake up he would raise his voice so people of the house could hear him, saying, ‘O Lord, support me against the horror of the Day of Judgment, expand for me the congestion of the grave, grant me the best of what is before death and grant me what is best thereafter.’” "
        }
      },
      "Chapter #50": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 2: Prayer When Leaving One ’s Home",
          "Link": "https://thaqalayn.net/hadith/2/2/50/1",
          "Arabic Text": "1ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي أَيُّوبَ الْخَزَّازِ عَنْ أَبِي حَمْزَةَ قَالَ رَأَيْتُ أَبَا عَبْدِ الله (عَلَيهِ السَّلام) يُحَرِّكُ شَفَتَيْهِ حِينَ أَرَادَ أَنْ يَخْرُجَ وَهُوَ قَائِمٌ عَلَى الْبَابِ فَقُلْتُ إِنِّي رَأَيْتُكَ تُحَرِّكُ شَفَتَيْكَ حِينَ خَرَجْتَ فَهَلْ قُلْتَ شَيْئاً قَالَ نَعَمْ إِنَّ الإنْسَانَ إِذَا خَرَجَ مِنْ مَنْزِلِهِ قَالَ حِينَ يُرِيدُ أَنْ يَخْرُجَ الله أَكْبَرُ الله أَكْبَرُ ثَلاثاً بِالله أَخْرُجُ وَبِالله أَدْخُلُ وَعَلَى الله أَتَوَكَّلُ ثَلاثَ مَرَّاتٍ اللهمَّ افْتَحْ لِي فِي وَجْهِي هَذَا بِخَيْرٍ وَاخْتِمْ لِي بِخَيْرٍ وَقِنِي شَرَّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ لَمْ يَزَلْ فِي ضَمَانِ الله عَزَّ وَجَلَّ حَتَّى يَرُدَّهُ الله إِلَى الْمَكَانِ الَّذِي كَانَ فِيهِ. مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبِي أَيُّوبَ عَنْ أَبِي حَمْزَةَ مِثْلَهُ.",
          "English Text": "1. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from abu Ayyub al-Khazzaz from abu Hamza who has said the following: “Once I saw Abu ‘Abdillah  moving his lips when he wanted to go out of his house while standing at the door. I said, ‘I saw you at the door moving your lips when coming out, did you say something?’ The Imam said, ‘Yes, when a man is leaving his home he should say, “Allah is greater than can be described, [three times], by the help of Allah I come out and by the help of Allah I enter and in Allah I place my trust, [three times]. O Lord, open to me this with goodness and finish it with goodness, protect me against the evil of every moving thing on earth that You keep in Your control. My Lord is on the right path,” he will continue to be under the protection of Allah, the Most Majestic, the Most Holy, until He brings him back to the place where he was before.’” Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Hakam from abu Ayyub from abu Hamza has narrated a similar Hadith. "
        },
        "Hadith #12": {
          "Title": "Al-Kafi - Volume 2: Prayer When Leaving One ’s Home",
          "Link": "https://thaqalayn.net/hadith/2/2/50/12",
          "Arabic Text": "12ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ الْحَسَنِ بْنِ الْجَهْمِ عَنْ أَبِي الْحَسَنِ (عَلَيهِ السَّلام) قَالَ إِذَا خَرَجْتَ مِنْ مَنْزِلِكَ فِي سَفَرٍ أَوْ حَضَرٍ فَقُلْ بِسْمِ الله آمَنْتُ بِالله تَوَكَّلْتُ عَلَى الله مَا شَاءَ الله لا حَوْلَ وَلا قُوَّةَ إِلا بِالله فَتَلَقَّاهُ الشَّيَاطِينُ فَتَنْصَرِفُ وَتَضْرِبُ الْمَلائِكَةُ وُجُوهَهَا وَتَقُولُ مَا سَبِيلُكُمْ عَلَيْهِ وَقَدْ سَمَّى الله وَآمَنَ بِهِ وَتَوَكَّلَ عَلَيْهِ وَقَالَ مَا شَاءَ الله لا حَوْلَ وَلا قُوَّةَ إِلا بِالله. ",
          "English Text": "12. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal from al-Hassan ibn al-Jahm from abu al-Hassan  who has said the following: “When you come out of your house for a journey or arrive home say, ‘In the name of Allah, I believe in Allah, I place my trust in Allah, as Allah wills. There are no means and no power without Allah. Devils are on his way but they move away; the angels strike their faces and say, “You have no way to him. He has spoken of the name of Allah, has belief in Him, placed his trust in Him and has said, ‘What Allah wills happens. There are no means and no power without Allah.’” "
        }
      },
      "Chapter #52": {
        "Hadith #9": {
          "Title": "Al-Kafi - Volume 2: Supplications After the Prayer (Daily Prayers)",
          "Link": "https://thaqalayn.net/hadith/2/2/52/9",
          "Arabic Text": "9ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ مَنْ قَالَ فِي دُبُرِ الْفَرِيضَةِ يَا مَنْ يَفْعَلُ مَا يَشَاءُ وَلا يَفْعَلُ مَا يَشَاءُ أَحَدٌ غَيْرُهُ ثَلاثاً ثُمَّ سَأَلَ أُعْطِيَ مَا سَأَلَ.",
          "English Text": "9. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from Mu’awiyah ibn ‘ Ammar who has said the following: “Whoever, after every obligatory prayer says: ‘O the One who does as He wills and does not do as others will,’ three times, and pleads (before Allah) for his wishes they will be granted.’” "
        },
        "Hadith #10": {
          "Title": "Al-Kafi - Volume 2: Supplications After the Prayer (Daily Prayers)",
          "Link": "https://thaqalayn.net/hadith/2/2/52/10",
          "Arabic Text": "10ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ إِسْحَاقَ عَنْ سَعْدَانَ عَنْ سَعِيدِ بْنِ يَسَارٍ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) إِذَا صَلَّيْتَ الْمَغْرِبَ فَأَمِرَّ يَدَكَ عَلَى جَبْهَتِكَ وَقُلْ بِسْمِ الله الَّذِي لا إِلَهَ إِلا هُوَ عَالِمِ الْغَيْبِ وَالشَّهَادَةِ الرَّحْمَنِ الرَّحِيمِ اللهمَّ أَذْهِبْ عَنِّي الْهَمَّ وَالْغَمَّ وَالْحَزَنَ ثَلاثَ مَرَّاتٍ.",
          "English Text": "10. Al-Husayn ibn Muhammad has narrated from Ahmad ibn Ishaq from Su’Dan from Sa’Id ibn Yasar who has said the following: “Abu ‘Abd Allah  has said, ‘When you complete your Maghrib (sunset) prayer wipe your hand over your forehead and say, “(I begin) with the name of Allah, besides whom no one deserves to be worshipped. Who knows the unseen and seen, the Beneficent, the Merciful. O Lord, remove from me the sorrow, anxiety, and sadness,’ three times.’” "
        }
      },
      "Chapter #55": {
        "Hadith #22": {
          "Title": "Al-Kafi - Volume 2: Supplication for Pain, Worries, Sadness and Fear",
          "Link": "https://thaqalayn.net/hadith/2/2/55/22",
          "Arabic Text": "22ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ إِبْرَاهِيمَ بْنِ إِسْحَاقَ الأحْمَرِ عَنْ أَبِي الْقَاسِمِ الْكُوفِيِّ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ وَالْعَلاءِ بْنِ سَيَابَةَ وَظَرِيفِ بْنِ نَاصِحٍ قَالَ لَمَّا بَعَثَ أَبُو الدَّوَانِيقِ إِلَى أَبِي عَبْدِ الله (عَلَيهِ السَّلام) رَفَعَ يَدَهُ إِلَى السَّمَاءِ ثُمَّ قَالَ اللهمَّ إِنَّكَ حَفِظْتَ الْغُلامَيْنِ بِصَلاحِ أَبَوَيْهِمَا فَاحْفَظْنِي بِصَلاحِ آبَائِي مُحَمَّدٍ وَعَلِيٍّ وَالْحَسَنِ وَالْحُسَيْنِ وَعَلِيِّ بْنِ الْحُسَيْنِ وَمُحَمَّدِ بْنِ عَلِيٍّ اللهمَّ إِنِّي أَدْرَأُ بِكَ فِي نَحْرِهِ وَأَعُوذُ بِكَ مِنْ شَرِّهِ ثُمَّ قَالَ لِلْجَمَّالِ سِرْ فَلَمَّا اسْتَقْبَلَهُ الرَّبِيعُ بِبَابِ أَبِي الدَّوَانِيقِ قَالَ لَهُ يَا أَبَا عَبْدِ الله مَا أَشَدَّ بَاطِنَهُ عَلَيْكَ لَقَدْ سَمِعْتُهُ يَقُولُ وَالله لا تَرَكْتُ لَهُمْ نَخْلاً إِلا عَقَرْتُهُ وَلا مَالاً إِلا نَهَبْتُهُ وَلا ذُرِّيَّةً إِلا سَبَيْتُهَا قَالَ فَهَمَسَ بِشَيْ‏ءٍ خَفِيٍّ وَحَرَّكَ شَفَتَيْهِ فَلَمَّا دَخَلَ سَلَّمَ وَقَعَدَ فَرَدَّ (عَلَيهِ السَّلام) ثُمَّ قَالَ أَمَا وَالله لَقَدْ هَمَمْتُ أَنْ لا أَتْرُكَ لَكَ نَخْلاً إِلا عَقَرْتُهُ وَلا مَالاً إِلا أَخَذْتُهُ فَقَالَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) يَا أَمِيرَ الْمُؤْمِنِينَ إِنَّ الله ابْتَلَى أَيُّوبَ فَصَبَرَ وَأَعْطَى دَاوُدَ فَشَكَرَ وَقَدَّرَ يُوسُفَ فَغَفَرَ وَأَنْتَ مِنْ ذَلِكَ النَّسْلِ وَلا يَأْتِي ذَلِكَ النَّسْلُ إِلا بِمَا يُشْبِهُهُ فَقَالَ صَدَقْتَ قَدْ عَفَوْتُ عَنْكُمْ فَقَالَ لَهُ يَا أَمِيرَ الْمُؤْمِنِينَ إِنَّهُ لَمْ يَنَلْ مِنَّا أَهْلَ الْبَيْتِ أَحَدٌ دَماً إِلا سَلَبَهُ الله مُلْكَهُ فَغَضِبَ لِذَلِكَ وَاسْتَشَاطَ فَقَالَ عَلَى رِسْلِكَ يَا أَمِيرَ الْمُؤْمِنِينَ إِنَّ هَذَا الْمُلْكَ كَانَ فِي آلِ أَبِي سُفْيَانَ فَلَمَّا قَتَلَ يَزِيدُ حُسَيْناً سَلَبَهُ الله مُلْكَهُ فَوَرَّثَهُ آلَ مَرْوَانَ فَلَمَّا قَتَلَ هِشَامٌ زَيْداً سَلَبَهُ الله مُلْكَهُ فَوَرَّثَهُ مَرْوَانَ بْنَ مُحَمَّدٍ فَلَمَّا قَتَلَ مَرْوَانُ إِبْرَاهِيمَ سَلَبَهُ الله مُلْكَهُ فَأَعْطَاكُمُوهُ فَقَالَ صَدَقْتَ هَاتِ أَرْفَعْ حَوَائِجَكَ فَقَالَ الإذْنُ فَقَالَ هُوَ فِي يَدِكَ مَتَى شِئْتَ فَخَرَجَ فَقَالَ لَهُ الرَّبِيعُ قَدْ أَمَرَ لَكَ بِعَشَرَةِ آلافِ دِرْهَمٍ قَالَ لا حَاجَةَ لِيَ فِيهَا قَالَ إِذَنْ تُغْضِبَهُ فَخُذْهَا ثُمَّ تَصَدَّقْ بِهَا.",
          "English Text": "22. Ali ibn Muhammad has narrated from Ibrahim ibn Ishaq al-Ahmar from abu al- Qasim al-Kufi from Muhammad ibn Isma’Il from Mu’awiyah ibn ‘Ammar and al-‘Ala’ ibn Sayabah and Zarif ibn Nasih who has said the following: “When abu Dawaniq (Mansur, one of ‘Abbasi rulers) summoned Abu ‘Abdillah  he raised his hand to the sky and said, ‘O Lord, You protected the two boys (mentioned in the Holy Quran in the story of Moses and Khidr) for the goodness and virtue of their father, protect me for the goodness and virtue of my ancestors, Muhammad, Ali, al-Hassan, al-Husayn, Ali ibn al-Husayn, and Muhammad ibn Ali, recipients of divine supreme covenant. O Lord, with Your help I pray that he be repelled against his throat, I seek protection in You against his evil.’ Then he told the camel man to leave for the journey. When Rabi’ met him at the door of abu Dawaniq, he said, ‘O Abu ‘Abdillah  his inside is intensely full against you. I have heard him saying, “By Allah I will not leave any of their palm trees without being uprooted, properties without being looted and descendents without being arrested as captives.” The narrator has said that the Imam then said something quietly moving his lips. When he entered in the office of abu Dawaniq he offered the greeting of peace and sat down. Abu Dawaniq responded to his greeting and said, ‘By Allah 1 have intended not to leave any of your palm trees without being uprooted, and any property without being seized.’ Abu ‘Abd Allah  then said, ‘O Amir al-Mu’Minin, Allah placed Ayyub under the trial and he exercised patience, Dawud was given to him and he thanked. It was determined for Joseph who was forgiven. You are from that lineage and that lineage’s behaviors are similar.’ Abu Dawaniq said, ‘You have spoken the truth. I forgive you.’ The Imam said, ‘O Amir al- Mu’Minin, whoever so far has spilled the blood of anyone from our family Allah has taken away the power from him.’ Abu Dawaniq became angry and excited. The Imam said, ‘Hold on O Amir al- Mu’Minin, this power once was with family of abu Sufyan. When they murdered al-Husayn  Allah took away the power from them and the family of Marwan inherited it. When Hisham murdered Zayd, Allah took it away from him and Marwan ibn Muhammad inherited it. When Marwan murdered Ibrahim, Allah took away the power from him and gave it to you.’ Abu Dawaniq then said, ‘You have spoken the truth. Tell me what do you need?’ The Imam said, ‘I need permission to leave.’ Abu Dawaniq said, ‘It is in your own hands whenever you like.’ The Imam then left and Rabi’ said, ‘He has ordered ten thousand dirham for you.’ The Imam said, ‘I do not need it.’ He said, ‘You are making him (Abu Dawaniq) angiy, take it and then give it to charity.’” "
        }
      },
      "Chapter #56": {
        "Hadith #7": {
          "Title": "Al-Kafi - Volume 2: Supplications for Healing Ailments and Diseases",
          "Link": "https://thaqalayn.net/hadith/2/2/56/7",
          "Arabic Text": "7ـ عَنْهُ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ دَاوُدَ عَنْ مُفَضَّلٍ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) لِلأوْجَاعِ تَقُولُ بِسْمِ الله وَبِالله كَمْ مِنْ نِعْمَةٍ لله فِي عِرْقٍ سَاكِنٍ وَغَيْرِ سَاكِنٍ عَلَى عَبْدٍ شَاكِرٍ وَغَيْرِ شَاكِرٍ وَتَأْخُذْ لِحْيَتَكَ بِيَدِكَ الْيُمْنَى بَعْدَ صَلاةٍ مَفْرُوضَةٍ وَتَقُولُ اللهمَّ فَرِّجْ عَنِّي كُرْبَتِي وَعَجِّلْ عَافِيَتِي وَاكْشِفْ ضُرِّي ثَلاثَ مَرَّاتٍ وَاحْرِصْ أَنْ يَكُونَ ذَلِكَ مَعَ دُمُوعٍ وَبُكَاءٍ.",
          "English Text": "7. It is narrated from him (narrator of the Hadith above) from Muhammad ibn ‘Isa from Dawud from Mufaddal from Abu ‘Abdillah  who has said the following: “For pains say, ‘In the name of Allah, and with (the help of) Allah, how much is of the bounties of Allah in a painful or painless vein of a thankful or unthankful servant (of Allah).’ After an obligatory prayer hold your beard in your hand and say, ‘O Lord, relieve me from my pain with an immediate good health and remove hardships from me, say it three times and try it to happen with tears coming from your eyes and a feeling of weeping.’” "
        }
      }
    },
    "Book #3": {
      "Chapter #11": {
        "Hadith #5": {
          "Title": "Al-Kafi - Volume 2: Within What Period of Time the Holy Quran Should be Read and Completed?",
          "Link": "https://thaqalayn.net/hadith/2/3/11/5",
          "Arabic Text": "5ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ قَالَ سَأَلَ أَبُو بَصِيرٍ أَبَا عَبْدِ الله (عَلَيهِ السَّلام) وَأَنَا حَاضِرٌ فَقَالَ لَهُ جُعِلْتُ فِدَاكَ أَقْرَأُ الْقُرْآنَ فِي لَيْلَةٍ فَقَالَ لا فَقَالَ فِي لَيْلَتَيْنِ فَقَالَ لا حَتَّى بَلَغَ سِتَّ لَيَالٍ فَأَشَارَ بِيَدِهِ فَقَالَ هَا ثُمَّ قَالَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) يَا أَبَا مُحَمَّدٍ إِنَّ مَنْ كَانَ قَبْلَكُمْ مِنْ أَصْحَابِ مُحَمَّدٍ (صَلَّى اللهُ عَلَيْهِ وآلِه) كَانَ يَقْرَأُ الْقُرْآنَ فِي شَهْرٍ وَأَقَلَّ إِنَّ الْقُرْآنَ لا يُقْرَأُ هَذْرَمَةً وَلَكِنْ يُرَتَّلُ تَرْتِيلاً إِذَا مَرَرْتَ بِ‏آيَةٍ فِيهَا ذِكْرُ النَّارِ وَقَفْتَ عِنْدَهَا وَتَعَوَّذْتَ بِالله مِنَ النَّارِ فَقَالَ أَبُو بَصِيرٍ أَقْرَأُ الْقُرْآنَ فِي رَمَضَانَ فِي لَيْلَةٍ فَقَالَ لا فَقَالَ فِي لَيْلَتَيْنِ فَقَالَ لا فَقَالَ فِي ثَلاثٍ فَقَالَ هَا وَأَوْمَأَ بِيَدِهِ نَعَمْ شَهْرُ رَمَضَانَ لا يُشْبِهُهُ شَيْ‏ءٌ مِنَ الشُّهُورِ لَهُ حَقٌّ وَحُرْمَةٌ أَكْثِرْ مِنَ الصَّلاةِ مَا اسْتَطَعْتَ. ",
          "English Text": "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Ali ibn abu Hamza who has said the following: “Once, abu Basil’ asked Abu ‘Abdillah  when I was also present, ‘May Allah keep my soul in service for your cause, can I read the Holy Quran in one night?’ The Imam said, ‘No.’ He then asked, ‘Can I read it in two nights?’ The Imam said, ‘No,’ until he reached six nights, the Imam  made a hand gesture saying ‘Ha’ a,’ (a hint for approval). Then the Imam  said, ‘O abu Muhammad, note that among the companions of Muhammad  before you, there were those who would read the Holy Quran once in a month or less. The Holy Quran is not read in a big rush but it is read with proper elocution and distinct pronunciation. When you come across a verse that speaks of the fire you pause and ask Allah for protection.’ Abu Basir then asked, ‘Can I read the Holy Quran in the month of Ramadan once every night?’ The Imam said, ‘No.’ He then asked, ‘Can I read it in two nights?’ The Imam said, ‘No.’ He then asked, ‘Can I read it in three nights?’ The Imam said, ‘Ha’ a, ’ with a hand gesture for approval saying, ‘Yes, the month of Ramadan is not like the other months. It has its rights and respect. Increase in prayer as much as you can.’” "
        }
      },
      "Chapter #13": {
        "Hadith #16": {
          "Title": "Al-Kafi - Volume 2: The Excellence of the Holy Quran",
          "Link": "https://thaqalayn.net/hadith/2/3/13/16",
          "Arabic Text": "16ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ لَوْ قُرِئَتِ الْحَمْدُ عَلَى مَيِّتٍ سَبْعِينَ مَرَّةً ثُمَّ رُدَّتْ فِيهِ الرُّوحُ مَا كَانَ ذَلِكَ عَجَباً.",
          "English Text": "16. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from Mu’awiyah ibn ‘Ammar from Abu ‘Abdillah  who has said the following: “If you read al-Hamd (Chapter One of the Holy Quran) seventy times over a dead body and it comes back to life, do not be astonished.” "
        }
      }
    },
    "Book #4": {
      "Chapter #13": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 2: Overlooking",
          "Link": "https://thaqalayn.net/hadith/2/4/13/2",
          "Arabic Text": "2ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ وَمُحَمَّدِ بْنِ سِنَانٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) لا تُفَتِّشِ النَّاسَ فَتَبْقَى بِلا صَدِيقٍ.",
          "English Text": "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Hakam and Muhammad ibn Sinan from, Ali ibn abu Hamza from abu Basir who has said the following: “Abu ‘Abd Allah  has said, ‘Do not be a spy against people; you will remain without friends.’” "
        }
      },
      "Chapter #23": {
        "Hadith #12": {
          "Title": "Al-Kafi - Volume 2: Funny Stories and Laughing",
          "Link": "https://thaqalayn.net/hadith/2/4/23/12",
          "Arabic Text": "12ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ الأشْعَرِيِّ عَنِ ابْنِ الْقَدَّاحِ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ (عَلَيهِ السَّلام) إِيَّاكُمْ وَالْمِزَاحَ فَإِنَّهُ يَجُرُّ السَّخِيمَةَ وَيُورِثُ الضَّغِينَةَ وَهُوَ السَّبُّ الأصْغَرُ.",
          "English Text": "12. A number of our people have narrated from Sahl ibn Ziyad from Ja’far ibn Muhammad al-Ash’ari from ibn al-Qaddah from Abu ‘Abdillah  who has said the following: “Amir al-Mu’minin, Ali ibn abu Talib  has said, ‘Beware of joking; it attracts hatred and hostility and it is a minor form of name-calling.’” "
        }
      },
      "Chapter #30": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 2: Prohibition of Burning Papers With Writings on Them",
          "Link": "https://thaqalayn.net/hadith/2/4/30/2",
          "Arabic Text": "2ـ عَنْهُ عَنِ الْوَشَّاءِ عَنْ عَبْدِ الله بْنِ سِنَانٍ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيهِ السَّلام) يَقُولُ لا تُحْرِقُوا الْقَرَاطِيسَ وَلَكِنِ امْحُوهَا وَحَرِّقُوهَا.",
          "English Text": "2. It is narrated from him (narrator of the Hadith above) from al-Washsha’from ‘Abd Allah ibn Sinan who has said the following: “I heard Abu ‘Abdillah  saying, ‘Do not burn the papers, but wipe or wash them away and then you may burn them.’” "
        },
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 2: Prohibition of Burning Papers With Writings on Them",
          "Link": "https://thaqalayn.net/hadith/2/4/30/3",
          "Arabic Text": "3ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ زُرَارَةَ قَالَ سُئِلَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) عَنِ الإسْمِ مِنْ أَسْمَاءِ الله يَمْحُوهُ الرَّجُلُ بِالتُّفْلِ قَالَ امْحُوهُ بِأَطْهَرِ مَا تَجِدُونَ.",
          "English Text": "3. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from Hammad ibn ‘Uthman from Zurara who has said the following: “Once Abu ‘Abdillah  was asked about a name of the names of Allah that a man tries to delete with his saliva. The Imam said, ‘It should be deleted with the cleanest thing that you can find.’” "
        },
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 2: Prohibition of Burning Papers With Writings on Them",
          "Link": "https://thaqalayn.net/hadith/2/4/30/4",
          "Arabic Text": "4ـ عَلِيٌّ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) امْحُوا كِتَابَ الله تَعَالَى وَذِكْرَهُ بِأَطْهَرِ مَا تَجِدُونَ وَنَهَى أَنْ يُحْرَقَ كِتَابُ الله وَنَهَى أَنْ يُمْحَى بِالأقْلامِ.",
          "English Text": "4. Ali has narrated from his father from al-Nawfali from al-Sakuni from Abu ‘Abdillah  who has said the following: “The Messenger of Allah has said, ‘You may delete (writing of) the book of Allah, the Most High and words mentioning Him with the cleanest thing that you can find.’ He prohibited the burning of the book of Allah and to delete it with a pen.’” "
        },
        "Hadith #5": {
          "Title": "Al-Kafi - Volume 2: Prohibition of Burning Papers With Writings on Them",
          "Link": "https://thaqalayn.net/hadith/2/4/30/5",
          "Arabic Text": "5ـ عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي الْحَسَنِ مُوسَى (عَلَيهِ السَّلام) فِي الظُّهُورِ الَّتِي فِيهَا ذِكْرُ الله عَزَّ وَجَلَّ قَالَ اغْسِلْهَا.",
          "English Text": "5. Ali has narrated from his father from Ibn Abi ‘Umayr from Muhammad ibn Ishaq ibn ‘Ammar from abu al-Hassan Musa  who has said the following: “The Imam  was asked about the surfaces on which a mention of Allah, the Most Majestic, the Most Holy, is written. The Imam said, ‘Wash it clean.’” "
        }
      }
    }
  }
}