{
  "Volume #2": {
    "Book #1": {
      "Chapter #9": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 2: The Coloring (referred to in the Holy Quran) Is Islam",
          "Link": "https://thaqalayn.net/hadith/2/1/9/3",
          "Arabic Text": "3ـ حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَحَدِهِمَا (عَلَيهِما السَّلام) فِي قَوْلِ الله عَزَّ وَجَلَّ صِبْغَةَ الله وَمَنْ أَحْسَنُ مِنَ الله صِبْغَةً قَالَ الصِّبْغَةُ هِيَ الإسْلامُ وَقَالَ فِي قَوْلِهِ عَزَّ وَجَلَّ فَمَنْ يَكْفُرْ بِالطَّاغُوتِ وَيُؤْمِنْ بِالله فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقى‏ قَالَ هِيَ الإيمَانُ.",
          "English Text": "3. Hamid ibn Ziyad has narrated from al-Hassan ibn Muhammad ibn Sama’a from more than one persons from Aban from Muhammad ibn Muslim from one of them  who has said the following: “About the words of Allah, the Majestic, the Glorious, ‘. . . it is the coloring of Allah. Who has a better color than Allah’s color?’ (2:138), the Imam said, ‘Color stands for al-lslam, the religion.’ He, about the words of Allah, the Majestic, the Glorious, also said, ‘Whoever then rejects the Devil and establishes belief in Allah he, thus, has established his grasp securely with the strong ring,’ it (strong ring) means belief.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالموثق   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/70)"
          }
        }
      },
      "Chapter #11": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 2: Purely Sincere",
          "Link": "https://thaqalayn.net/hadith/2/1/11/2",
          "Arabic Text": "2ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ الله عَنْ أَبِيهِ رَفَعَهُ إِلَى أَبِي جَعْفَرٍ (عَلَيهِ السَّلام) قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) يَا أَيُّهَا النَّاسُ إِنَّمَا هُوَ الله وَالشَّيْطَانُ وَالْحَقُّ وَالْبَاطِلُ وَالْهُدَى وَالضَّلالَةُ وَالرُّشْدُ وَالْغَيُّ وَالْعَاجِلَةُ وَالآجِلَةُ وَالْعَاقِبَةُ وَالْحَسَنَاتُ وَالسَّيِّئَاتُ فَمَا كَانَ مِنْ حَسَنَاتٍ فَلله وَمَا كَانَ مِنْ سَيِّئَاتٍ فَلِلشَّيْطَانِ لَعَنَهُ الله.",
          "English Text": "2. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from his father in a Marfa* manner from abu Ja’far  who has said the following: “The Messenger of Allah  has said, ‘O people, what there is, is Allah and Satan, Truth and falsehood, guidance and straying, wisdom and error, present and future, the consequences, the good deeds and evil deeds. Good deeds are for Allah and evil deeds are for Satan, may Allah condemn him.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (75/ 7)"
          }
        }
      },
      "Chapter #15": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 2: Belief Is Inclusive of Islam but Islam Is Not Inclusive of Belief",
          "Link": "https://thaqalayn.net/hadith/2/1/15/2",
          "Arabic Text": "2ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ مُوسَى بْنِ بَكْرٍ عَنْ فُضَيْلِ بْنِ يَسَارٍ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ الإيمَانُ يُشَارِكُ الإسْلامَ وَالإسْلامُ لا يُشَارِكُ الإيمَانَ.",
          "English Text": "2. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus ibn ‘Abd al- Rahman from Musa ibn Bakr from Fudayl ibn Yasar from Abu ‘Abdillah  who has said the following: “Belief is inclusive of Islam but Islam is not inclusive of belief.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف كالموثق   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/153)"
          }
        }
      },
      "Chapter #22": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 2: Description of Islam",
          "Link": "https://thaqalayn.net/hadith/2/1/22/1",
          "Arabic Text": "1ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ بَعْضِ أَصْحَابِنَا رَفَعَهُ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ (عَلَيهِ السَّلام) لأنْسُبَنَّ الإسْلامَ نِسْبَةً لا يَنْسُبُهُ أَحَدٌ قَبْلِي وَلا يَنْسُبُهُ أَحَدٌ بَعْدِي إِلا بِمِثْلِ ذَلِكَ إِنَّ الإسْلامَ هُوَ التَّسْلِيمُ وَالتَّسْلِيمَ هُوَ الْيَقِينُ وَالْيَقِينَ هُوَ التَّصْدِيقُ وَالتَّصْدِيقَ هُوَ الإقْرَارُ وَالإقْرَارَ هُوَ الْعَمَلُ وَالْعَمَلَ هُوَ الأدَاءُ إِنَّ الْمُؤْمِنَ لَمْ يَأْخُذْ دِينَهُ عَنْ رَأْيِهِ وَلَكِنْ أَتَاهُ مِنْ رَبِّهِ فَأَخَذَهُ إِنَّ الْمُؤْمِنَ يُرَى يَقِينُهُ فِي عَمَلِهِ وَالْكَافِرَ يُرَى إِنْكَارُهُ فِي عَمَلِهِ فَوَ الَّذِي نَفْسِي بِيَدِهِ مَا عَرَفُوا أَمْرَهُمْ فَاعْتَبِرُوا إِنْكَارَ الْكَافِرِينَ وَالْمُنَافِقِينَ بِأَعْمَالِهِمُ الْخَبِيثَةِ.",
          "English Text": "1. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from certain individuals of our people in a marfu’ manner from Amir al- Mu’minin (Ali ibn abu Talib) who has said the following: “I will describe Islam in a way that no one could have done before or would do after me except just as my description: ‘Islam is submission and submission is certainty. Certainty is affirmation (and confirmation). Affirmation is professing. Professing is action. Action and deeds are completion and remittance. A believer does not take his religion from his own personal opinion. It comes from his Lord and he accepts it. A believer finds his certainty in his deeds. An unbeliever finds his rejection in his deeds. I swear by the One in whose hands is my soul, they did not recognize their goal. Take a lesson from the case of the filthy deeds of the unbelievers and the hypocrites.”’ ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/282)"
          }
        },
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 2: Description of Islam",
          "Link": "https://thaqalayn.net/hadith/2/1/22/3",
          "Arabic Text": "3ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَبْدِ الْعَظِيمِ بْنِ عَبْدِ الله الْحَسَنِيِّ عَنْ أَبِي جَعْفَرٍ الثَّانِي (عَلَيهِ السَّلام) عَنْ أَبِيهِ عَنْ جَدِّهِ صَلَوَاتُ الله عَلَيْهِمْ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ (عَلَيهِ السَّلام) قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) إِنَّ الله خَلَقَ الإسْلامَ فَجَعَلَ لَهُ عَرْصَةً وَجَعَلَ لَهُ نُوراً وَجَعَلَ لَهُ حِصْناً وَجَعَلَ لَهُ نَاصِراً فَأَمَّا عَرْصَتُهُ فَالْقُرْآنُ وَأَمَّا نُورُهُ فَالْحِكْمَةُ وَأَمَّا حِصْنُهُ فَالْمَعْرُوفُ وَأَمَّا أَنْصَارُهُ فَأَنَا وَأَهْلُ بَيْتِي وَشِيعَتُنَا فَأَحِبُّوا أَهْلَ بَيْتِي وَشِيعَتَهُمْ وَأَنْصَارَهُمْ فَإِنَّهُ لَمَّا أُسْرِيَ بِي إِلَى السَّمَاءِ الدُّنْيَا فَنَسَبَنِي جَبْرَئِيلُ (عَلَيهِ السَّلام) لأهْلِ السَّمَاءِ اسْتَوْدَعَ الله حُبِّي وَحُبَّ أَهْلِ بَيْتِي وَشِيعَتِهِمْ فِي قُلُوبِ الْمَلائِكَةِ فَهُوَ عِنْدَهُمْ وَدِيعَةٌ إِلَى يَوْمِ الْقِيَامَةِ ثُمَّ هَبَطَ بِي إِلَى أَهْلِ الأرْضِ فَنَسَبَنِي إِلَى أَهْلِ الأرْضِ فَاسْتَوْدَعَ الله عَزَّ وَجَلَّ حُبِّي وَحُبَّ أَهْلِ بَيْتِي وَشِيعَتِهِمْ فِي قُلُوبِ مُؤْمِنِي أُمَّتِي فَمُؤْمِنُو أُمَّتِي يَحْفَظُونَ وَدِيعَتِي فِي أَهْلِ بَيْتِي إِلَى يَوْمِ الْقِيَامَةِ أَلا فَلَوْ أَنَّ الرَّجُلَ مِنْ أُمَّتِي عَبَدَ الله عَزَّ وَجَلَّ عُمُرَهُ أَيَّامَ الدُّنْيَا ثُمَّ لَقِيَ الله عَزَّ وَجَلَّ مُبْغِضاً لأهْلِ بَيْتِي وَشِيعَتِي مَا فَرَّجَ الله صَدْرَهُ إِلا عَنِ النِّفَاقِ. ",
          "English Text": "3. A number of our people have narrated from Ahmad ibn Muhammad from ‘Abd al-‘Azim from ‘Abd Allah al-Hassani from Abu Ja’far al-Thani  from his father from his grandfather  who has said the following: “Amir al-Mu’minin (Ali ibn abu Talib)  has said that the Messenger of Allah said, ‘Allah created Islam and made for it a backyard and front-yard, a light, a fortress and supporter. Its backyard and front-yard are the Holy Quran. Wisdom is its light. Lawfulness is its fortress. My Ahl al-Bayt (my family), our Shi’a (followers) and I are its supporters. You must love my Ahl al-Bayt (members of my family), their followers (Shi’a) and their supporters. When I was taken to heaven above the earth, Gibril introduced me to its inhabitants. Allah entrusted the love for me, my Ahl al-Bayt and their followers (Shi’a) to the hearts of the angels. It is with them in trust until the Day of Judgment. Then I was brought to earth and he introduced me to the inhabitants of earth. Allah entrusted the love for me, my Ahl al-Bayt and their followers (Shi’a) to the hearts of the believers of my people. They will keep my trust and the trust of my Ahl al-Bayt until the Day of Judgment. One must know that if a man of my people would worship Allah, the Most Majestic, the Most Holy, all the time of his life and then would meet Allah, the Most Majestic, the Most Holy, while hating my Ahl al-Bayt and my followers (Shi’a) Allah will not open his chest for anything but in hypocrisy.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " حسن كالصحيح بل صحيح عند ي  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (289/ 7)"
          }
        }
      },
      "Chapter #26": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 2: Superiority of Belief over Islam and Certainty over Belief",
          "Link": "https://thaqalayn.net/hadith/2/1/26/2",
          "Arabic Text": "2ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَالْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ جَمِيعاً عَنِ الْوَشَّاءِ عَنْ أَبِي الْحَسَنِ (عَلَيهِ السَّلام) قَالَ سَمِعْتُهُ يَقُولُ الإيمَانُ فَوْقَ الإسْلامِ بِدَرَجَةٍ وَالتَّقْوَى فَوْقَ الإيمَانِ بِدَرَجَةٍ وَالْيَقِينُ فَوْقَ التَّقْوَى بِدَرَجَةٍ وَمَا قُسِمَ فِي النَّاسِ شَيْ‏ءٌ أَقَلُّ مِنَ الْيَقِينِ.",
          "English Text": "2. A number of our people have narrated from Sahl ibn Ziyad and al-Husayn ibn Muhammad from Mu’alla ibn Muhammad all from al-Washsha’ who has said the following: “I heard abu Al-Hassan  saying, ‘Belief is above Islam by one degree. Piety is above belief by one degree. Certainty is above piety by one degree. Nothing is distributed so little among people as certainty is.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف على المشهور معتبر   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (325/ 7)"
          }
        }
      },
      "Chapter #29": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 2: The Noble Qualities (of Man)",
          "Link": "https://thaqalayn.net/hadith/2/1/29/2",
          "Arabic Text": "2ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ عَبْدِ الله بْنِ مُسْكَانَ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ إِنَّ الله عَزَّ وَجَلَّ خَصَّ رُسُلَهُ بِمَكَارِمِ الأخْلاقِ فَامْتَحِنُوا أَنْفُسَكُمْ فَإِنْ كَانَتْ فِيكُمْ فَاحْمَدُوا الله وَاعْلَمُوا أَنَّ ذَلِكَ مِنْ خَيْرٍ وَإِنْ لا تَكُنْ فِيكُمْ فَاسْأَلُوا الله وَارْغَبُوا إِلَيْهِ فِيهَا قَالَ فَذَكَرَهَا عَشَرَةً الْيَقِينَ وَالْقَنَاعَةَ وَالصَّبْرَ وَالشُّكْرَ وَالْحِلْمَ وَحُسْنَ الْخُلُقِ وَالسَّخَاءَ وَالْغَيْرَةَ وَالشَّجَاعَةَ وَالْمُرُوءَةَ قَالَ وَرَوَى بَعْضُهُمْ بَعْدَ هَذِهِ الْخِصَالِ الْعَشَرَةِ وَزَادَ فِيهَا الصِّدْقَ وَأَدَاءَ الأمَانَةِ.",
          "English Text": "2. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from ‘Uthman ibn ‘Isa from ‘Abd Allah ibn Muskan from Abu ‘Abdillah  who has said the following: “Allah, the Most Majestic, the Most Holy, chose His messengers for noble moral (human) qualities. You must test yourselves. If you find the noble qualities in you then be thankful to Allah and understand that it is of goodness. If you do not find them in you, then pray to Allah to grant them to you and show Him that you are interested in having them. The narrator has said that the Imam counted the noble qualities up to ten: They consist of Certainty, Contentment, Patience, Thankfulness, Forbearance, Good Moral Behavior, Generosity, Dignity, Bravery and Kindness. “Certain narrators have listed other qualities after the above- mentioned ones and have added to them Truthfulness and Keeping Trust.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " موثق وآخره مرسل   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (347/ 7)"
          }
        }
      },
      "Chapter #30": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 2: Excellence of Certainty",
          "Link": "https://thaqalayn.net/hadith/2/1/30/1",
          "Arabic Text": "1ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنِ الْمُثَنَّى بْنِ الْوَلِيدِ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ لَيْسَ شَيْ‏ءٌ إِلا وَلَهُ حَدٌّ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ فَمَا حَدُّ التَّوَكُّلِ قَالَ الْيَقِينُ قُلْتُ فَمَا حَدُّ الْيَقِينِ قَالَ أَلا تَخَافَ مَعَ الله شَيْئاً.",
          "English Text": "1. Al-Husayn ibn Muhammad has narrated from Mu’alla ibn Muhammad from al- Hassan ibn Ali al-Washsha’ from al-Muthanna ibn al-Walid from abu Basir from Abu ‘Abdillah  who has said the following: “Abu ‘Abd Allah  once said, ‘There is nothing without a limit.’ I (the narrator) then asked, ‘May Allah keep my soul in service for your cause, what is the limit of trust?’ The Imam said, ‘It is certainty.’ 1 then asked, ‘What is the limit of certainty?’ The Imam said, ‘It is when, with having Allah on your side, you do not fear anything.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف على المشهور معتب ر   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/354)"
          }
        },
        "Hadith #9": {
          "Title": "Al-Kafi - Volume 2: Excellence of Certainty",
          "Link": "https://thaqalayn.net/hadith/2/1/30/9",
          "Arabic Text": "9ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ قَالَ سَمِعْتُ أَبَا الْحَسَنِ الرِّضَا (عَلَيهِ السَّلام) يَقُولُ كَانَ فِي الْكَنْزِ الَّذِي قَالَ الله عَزَّ وَجَلَّ وَكانَ تَحْتَهُ كَنْزٌ لَهُما كَانَ فِيهِ بِسْمِ الله الرَّحْمَنِ الرَّحِيمِ عَجِبْتُ لِمَنْ أَيْقَنَ بِالْمَوْتِ كَيْفَ يَفْرَحُ وَعَجِبْتُ لِمَنْ أَيْقَنَ بِالْقَدَرِ كَيْفَ يَحْزَنُ وَعَجِبْتُ لِمَنْ رَأَى الدُّنْيَا وَتَقَلُّبَهَا بِأَهْلِهَا كَيْفَ يَرْكَنُ إِلَيْهَا وَيَنْبَغِي لِمَنْ عَقَلَ عَنِ الله أَنْ لا يَتَّهِمَ الله فِي قَضَائِهِ وَلا يَسْتَبْطِئَهُ فِي رِزْقِهِ فَقُلْتُ جُعِلْتُ فِدَاكَ أُرِيدُ أَنْ أَكْتُبَهُ قَالَ فَضَرَبَ وَالله يَدَهُ إِلَى الدَّوَاةِ لِيَضَعَهَا بَيْنَ يَدَيَّ فَتَنَاوَلْتُ يَدَهُ فَقَبَّلْتُهَا وَأَخَذْتُ الدَّوَاةَ فَكَتَبْتُهُ.",
          "English Text": "9. Al-Husayn ibn Muhammad has narrated from Mu’alla ibn Muhammad from Ali ibn Asbat who has said the following: “I heard abu al-Hassan al-Rida  saying, ‘In the treasure mentioned in the words of Allah, the Most Majestic, the Most Holy: “Underneath the wall there was a treasure that belonged to them. . . .,” ( 18 : 82 ) there were the following statements: ‘In the name of Allah, the Beneficent, the Merciful, strange to me is the case of a person who is certain of the coming of death but he feels happy. Strange to me is the case of a person who is certain of the strict measurement of Allah but he feels depressed. Strange to me is the case of a person who is aware of all the up and down in the world with its inhabitants but he still relies on it. It is expected from a man who has understanding of Allah not to accuse Allah in His decision and not to consider Him slow in His Providence.’ I then said, ‘May Allah keep my soul in service for your cause, I want to write it down. The Imam gave me, I swear by Allah, the inkpot so I can write. I reached out to his hands and kissed them and then took the inkpot and wrote down the Hadith.”’ ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف على المشهور معتبر عند ي    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/368)"
          }
        }
      },
      "Chapter #31": {
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 2: To Agree With the Decision (of Allah)",
          "Link": "https://thaqalayn.net/hadith/2/1/31/4",
          "Arabic Text": "4ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ مَحْبُوبٍ عَنْ دَاوُدَ الرَّقِّيِّ عَنْ أَبِي عُبَيْدَةَ الْحَذَّاءِ عَنْ أَبِي جَعْفَرٍ (عَلَيهِ السَّلام) قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) قَالَ الله عَزَّ وَجَلَّ إِنَّ مِنْ عِبَادِيَ الْمُؤْمِنِينَ عِبَاداً لا يَصْلُحُ لَهُمْ أَمْرُ دِينِهِمْ إِلا بِالْغِنَى وَالسَّعَةِ وَالصِّحَّةِ فِي الْبَدَنِ فَأَبْلُوهُمْ بِالْغِنَى وَالسَّعَةِ وَصِحَّةِ الْبَدَنِ فَيُصْلِحُ عَلَيْهِمْ أَمْرَ دِينِهِمْ وَإِنَّ مِنْ عِبَادِيَ الْمُؤْمِنِينَ لَعِبَاداً لا يَصْلُحُ لَهُمْ أَمْرُ دِينِهِمْ إِلا بِالْفَاقَةِ وَالْمَسْكَنَةِ وَالسُّقْمِ فِي أَبْدَانِهِمْ فَأَبْلُوهُمْ بِالْفَاقَةِ وَالْمَسْكَنَةِ وَالسُّقْمِ فَيُصْلِحُ عَلَيْهِمْ أَمْرَ دِينِهِمْ وَأَنَا أَعْلَمُ بِمَا يَصْلُحُ عَلَيْهِ أَمْرُ دِينِ عِبَادِيَ الْمُؤْمِنِينَ وَإِنَّ مِنْ عِبَادِيَ الْمُؤْمِنِينَ لَمَنْ يَجْتَهِدُ فِي عِبَادَتِي فَيَقُومُ مِنْ رُقَادِهِ وَلَذِيذِ وِسَادِهِ فَيَتَهَجَّدُ لِيَ اللَّيَالِيَ فَيُتْعِبُ نَفْسَهُ فِي عِبَادَتِي فَأَضْرِبُهُ بِالنُّعَاسِ اللَّيْلَةَ وَاللَّيْلَتَيْنِ نَظَراً مِنِّي لَهُ وَإِبْقَاءً عَلَيْهِ فَيَنَامُ حَتَّى يُصْبِحَ فَيَقُومُ وَهُوَ مَاقِتٌ لِنَفْسِهِ زَارِئٌ عَلَيْهَا وَلَوْ أُخَلِّي بَيْنَهُ وَبَيْنَ مَا يُرِيدُ مِنْ عِبَادَتِي لَدَخَلَهُ الْعُجْبُ مِنْ ذَلِكَ فَيُصَيِّرُهُ الْعُجْبُ إِلَى الْفِتْنَةِ بِأَعْمَالِهِ فَيَأْتِيهِ مِنْ ذَلِكَ مَا فِيهِ هَلاكُهُ لِعُجْبِهِ بِأَعْمَالِهِ وَرِضَاهُ عَنْ نَفْسِهِ حَتَّى يَظُنَّ أَنَّهُ قَدْ فَاقَ الْعَابِدِينَ وَجَازَ فِي عِبَادَتِهِ حَدَّ التَّقْصِيرِ فَيَتَبَاعَدُ مِنِّي عِنْدَ ذَلِكَ وَهُوَ يَظُنُّ أَنَّهُ يَتَقَرَّبُ إِلَيَّ فَلا يَتَّكِلِ الْعَامِلُونَ عَلَى أَعْمَالِهِمُ الَّتِي يَعْمَلُونَهَا لِثَوَابِي فَإِنَّهُمْ لَوِ اجْتَهَدُوا وَأَتْعَبُوا أَنْفُسَهُمْ وَأَفْنَوْا أَعْمَارَهُمْ فِي عِبَادَتِي كَانُوا مُقَصِّرِينَ غَيْرَ بَالِغِينَ فِي عِبَادَتِهِمْ كُنْهَ عِبَادَتِي فِيمَا يَطْلُبُونَ عِنْدِي مِنْ كَرَامَتِي وَالنَّعِيمِ فِي جَنَّاتِي وَرَفِيعِ دَرَجَاتِيَ الْعُلَى فِي جِوَارِي وَلَكِنْ فَبِرَحْمَتِي فَلْيَثِقُوا وَبِفَضْلِي فَلْيَفْرَحُوا وَإِلَى حُسْنِ الظَّنِّ بِي فَلْيَطْمَئِنُّوا فَإِنَّ رَحْمَتِي عِنْدَ ذَلِكَ تَدَارَكُهُمْ وَمَنِّي يُبَلِّغُهُمْ رِضْوَانِي وَمَغْفِرَتِي تُلْبِسُهُمْ عَفْوِي فَإِنِّي أَنَا الله الرَّحْمَنُ الرَّحِيمُ وَبِذَلِكَ تَسَمَّيْتُ.",
          "English Text": "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from ibn Mahbub from Dawud al-Riqqiy from ‘Ubayda al-Hadhdha’ from abu Ja’far  who has said the following: “The Messenger of Allah has said that Allah, the Most Majestic, the Most Holy, has said, ‘Among My believing servants there are those whose religious lives can only be at their best with wealth, comfort and good health. I try them by means of wealth, comfort and good health and this makes their religious affairs to be in the best condition. Also among My believing servants there are those whose religious lives are only at their best with poverty, destitution and ailing health. I try them by means of poverty, destitution and ailing health and this helps their religious lives to be in the best condition. I know what is good for the religious matters of my believing servants. Among My believing servants there are those who strive to worship Me. They wake up from sleep leaving their comfortable pillow for Tahajjud (special prayer at night). They experiences fatigue and I allow slumber overcome them on one or two nights, a trial from Me to see if he continues, he goes to sleep and wakes up upset and angry over his own self. If I allow him to do the way he wants to worship, he may develop a sense of conceit (unwanted pride) that can lead him to mischief in his deeds. This may bring about his destruction. It can so happen due to his happiness with whatever his soul desires. He may begin to feel as if he has excelled all worshippers and has surpassed the limits of defective worship. In so doing he moves away from Me even though he thinks that he is getting closer to Me. Therefore, they must not rely on their good deeds that they do to receive rewards from Me. Even if they strive hard, tire themselves and finish their lives worshipping Me they fall short, in worshipping Me truly, in their quest for My generous rewards, My bounties in paradise and high positions near Me. They must only trust in My mercy, be happy with My generosity and always be hopeful about Me. In such cases My mercy will reach them as well as my approval and forgiveness and my pardon will provide them cover; I am Allah, the Most Beneficent, the Most Merciful, and thus 1 have taken such names.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مختلف فيه صحيح على الظاهر    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/3)"
          }
        }
      },
      "Chapter #32": {
        "Hadith #5": {
          "Title": "Al-Kafi - Volume 2: Leaving It to Allah to Be the Person in Charge of Affairs, and Having Trust in Him",
          "Link": "https://thaqalayn.net/hadith/2/1/32/5",
          "Arabic Text": "5ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ غَيْرِ وَاحِدٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ أَحْمَدَ بْنِ عُمَرَ الْحَلالِ عَنْ عَلِيِّ بْنِ سُوَيْدٍ عَنْ أَبِي الْحَسَنِ الأوَّلِ (عَلَيهِ السَّلام) قَالَ سَأَلْتُهُ عَنْ قَوْلِ الله عَزَّ وَجَلَّ وَمَنْ يَتَوَكَّلْ عَلَى الله فَهُوَ حَسْبُهُ فَقَالَ التَّوَكُّلُ عَلَى الله دَرَجَاتٌ مِنْهَا أَنْ تَتَوَكَّلَ عَلَى الله فِي أُمُورِكَ كُلِّهَا فَمَا فَعَلَ بِكَ كُنْتَ عَنْهُ رَاضِياً تَعْلَمُ أَنَّهُ لا يَأْلُوكَ خَيْراً وَفَضْلاً وَتَعْلَمُ أَنَّ الْحُكْمَ فِي ذَلِكَ لَهُ فَتَوَكَّلْ عَلَى الله بِتَفْوِيضِ ذَلِكَ إِلَيْهِ وَثِقْ بِهِ فِيهَا وَفِي غَيْرِهَا.",
          "English Text": "5. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from more than one narrator from Ali ibn Asbat from Ahmad ibn Umar al-Hallal from Ali ibn Suwayd who has said the following: “I asked abu al-Hassan 1 st   about the words of Allah, the Most Majestic, the Most Holy: ‘Whoever trusts Allah, He is enough protection against all (harms).’ (65:3) ‘‘The Imam said, ‘Trust in Allah is of several degrees. One level of such trust is to trust Him in all matters. Whatever He does, you must remain happy and agree with His decision, knowing that He does not keep anything good and excellent from you and that the decision in the matter is in His hands. You then must leave all the affairs to Allah to be the person in charge (of all affairs) and have confidence in Him in this and other issues.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالموثق   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/ 8)"
          }
        }
      },
      "Chapter #33": {
        "Hadith #6": {
          "Title": "Al-Kafi - Volume 2: Fear and Hope",
          "Link": "https://thaqalayn.net/hadith/2/1/33/6",
          "Arabic Text": "6ـ وَرَوَاهُ عَلِيُّ بْنُ مُحَمَّدٍ رَفَعَهُ قَالَ قُلْتُ لأبِي عَبْدِ الله (عَلَيهِ السَّلام) إِنَّ قَوْماً مِنْ مَوَالِيكَ يُلِمُّونَ بِالْمَعَاصِي وَيَقُولُونَ نَرْجُو فَقَالَ كَذَبُوا لَيْسُوا لَنَا بِمَوَالٍ أُولَئِكَ قَوْمٌ تَرَجَّحَتْ بِهِمُ الأمَانِيُّ مَنْ رَجَا شَيْئاً عَمِلَ لَهُ وَمَنْ خَافَ مِنْ شَيْ‏ءٍ هَرَبَ مِنْهُ.",
          "English Text": "6. Ali ibn Muhammad has also narrated the above Hadith in a mafu’ manner from who has said the following: “I said to Abu ‘Abdillah  ‘Certain people of your supporters commit smaller sins and say that they have hope (in Allah’s forgiveness).’ The Imam said, ‘They lie. They are not our supporters. They are a people whose hope has caused them to deviate. Whoever has hope in something, he works to achieve it. Whoever is afraid of something, he keeps away from it.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/35)"
          }
        },
        "Hadith #7": {
          "Title": "Al-Kafi - Volume 2: Fear and Hope",
          "Link": "https://thaqalayn.net/hadith/2/1/33/7",
          "Arabic Text": "7ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ صَالِحِ بْنِ حَمْزَةَ رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) إِنَّ مِنَ الْعِبَادَةِ شِدَّةَ الْخَوْفِ مِنَ الله عَزَّ وَجَلَّ يَقُولُ الله إِنَّما يَخْشَى الله مِنْ عِبادِهِ الْعُلَماءُ وَقَالَ جَلَّ ثَنَاؤُهُ فَلا تَخْشَوُا النَّاسَ وَاخْشَوْنِ وَقَالَ تَبَارَكَ وَتَعَالَى وَمَنْ يَتَّقِ الله يَجْعَلْ لَهُ مَخْرَجاً قَالَ وَقَالَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) إِنَّ حُبَّ الشَّرَفِ وَالذِّكْرِ لا يَكُونَانِ فِي قَلْبِ الْخَائِفِ الرَّاهِبِ.",
          "English Text": "7. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from certain individuals of his people from Salih ibn Hamza in a mafu’ manner from Abu ‘Abdillah  who has said the following: “To have intense fear of Allah, the Most Majestic, the Most Holy, is part of worship. Allah has said, ‘Of the servants of Allah who fear Him are the scholars.’ (35:28) Allah, Whose praise is great, has said, ‘Do not fear people but fear Me.’ (5:44) Allah, the Most Blessed, the Most High, has said, ‘For those who fear Allah, He finds a way out (in their difficulties).’ (65:2) “The narrator has said that Abu ‘Abdillah  then said, ‘Love for fame and popularity (domination) will not exist in the heart of one who has fear and is concerned (about his relation toward Allah).’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/36)"
          }
        },
        "Hadith #10": {
          "Title": "Al-Kafi - Volume 2: Fear and Hope",
          "Link": "https://thaqalayn.net/hadith/2/1/33/10",
          "Arabic Text": "10ـ عَنْهُ عَنْ أَحْمَدَ عَنِ ابْنِ مَحْبُوبٍ عَنْ دَاوُدَ الرَّقِّيِّ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) فِي قَوْلِ الله عَزَّ وَجَلَّ وَلِمَنْ خافَ مَقامَ رَبِّهِ جَنَّتانِ قَالَ مَنْ عَلِمَ أَنَّ الله يَرَاهُ وَيَسْمَعُ مَا يَقُولُ وَيَعْلَمُ مَا يَعْمَلُهُ مِنْ خَيْرٍ أَوْ شَرٍّ فَيَحْجُزُهُ ذَلِكَ عَنِ الْقَبِيحِ مِنَ الأعْمَالِ فَذَلِكَ الَّذِي خَافَ مَقَامَ رَبِّهِ وَنَهَى النَّفْسَ عَنِ الْهَوَى.",
          "English Text": "10. It is narrated from him (narrator of the Hadith above) from Ahmad from ibn Mahbub from Dawud al-Ruqiyy from Abu ‘Abdillah  who has said the following: “About the words of Allah, the Most Majestic, the Most Holy, ‘For one who fears of the position of his Lord there are two gardens. ’(55:46) The Imam said, ‘One who knows that Allah sees him, hears what he says and knows what he does, good or evil, and it keeps him off wicked deeds, such person is the one who fears the position of his Lord and stops his soul from following his (negative) desires.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مختلف فيه صحيح عند ي  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (41/ 8)"
          }
        }
      },
      "Chapter #34": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 2: Hopefulness Toward Allah, the Most Majestic, the Most Holy",
          "Link": "https://thaqalayn.net/hadith/2/1/34/1",
          "Arabic Text": "1ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ دَاوُدَ بْنِ كَثِيرٍ عَنْ أَبِي عُبَيْدَةَ الْحَذَّاءِ عَنْ أَبِي جَعْفَرٍ (عَلَيهِ السَّلام) قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) قَالَ الله تَبَارَكَ وَتَعَالَى لا يَتَّكِلِ الْعَامِلُونَ عَلَى أَعْمَالِهِمُ الَّتِي يَعْمَلُونَهَا لِثَوَابِي فَإِنَّهُمْ لَوِ اجْتَهَدُوا وَأَتْعَبُوا أَنْفُسَهُمْ أَعْمَارَهُمْ فِي عِبَادَتِي كَانُوا مُقَصِّرِينَ غَيْرَ بَالِغِينَ فِي عِبَادَتِهِمْ كُنْهَ عِبَادَتِي فِيمَا يَطْلُبُونَ عِنْدِي مِنْ كَرَامَتِي وَالنَّعِيمِ فِي جَنَّاتِي وَرَفِيعِ الدَّرَجَاتِ الْعُلَى فِي جِوَارِي وَلَكِنْ بِرَحْمَتِي فَلْيَثِقُوا وَفَضْلِي فَلْيَرْجُوا وَإِلَى حُسْنِ الظَّنِّ بِي فَلْيَطْمَئِنُّوا فَإِنَّ رَحْمَتِي عِنْدَ ذَلِكَ تُدْرِكُهُمْ وَمَنِّي يُبَلِّغُهُمْ رِضْوَانِي وَمَغْفِرَتِي تُلْبِسُهُمْ عَفْوِي فَإِنِّي أَنَا الله الرَّحْمَنُ الرَّحِيمُ وَبِذَلِكَ تَسَمَّيْتُ.",
          "English Text": "1. A number of our people have narrated from Ahmad ibn Muhammad from ibn Mahbub from Dawud ibn Kathir from abu ‘Ubaydah al-Hadhdha’ from abu Ja’far  who has said the following: “The Messenger of Allah has said, ‘Allah, the Most Blessed, the Most High, has said, “The doers of good deeds must not rely on their deeds alone to receive rewards from Me. If they strive and tire themselves (for a lifetime) to worship Me they still have shortcomings in their worship. They cannot reach the essence of worshipping Me to find what they look for. They cannot receive My grace and bounties in My paradise and high ranks near Me without My kindness. They must rely on My kindness, hope for My additional rewards, be comfortable in their hopefulness about Me. My kindness and mercy, in such cases, will reach them, from Me My gratification and forgiveness will close up to them, and My pardon will provide them cover. I am Allah, the Beneficent, the Merciful, and thus I have named Myself.’”” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مختلف فيه صحيح عند ي   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (43/ 8)"
          }
        }
      },
      "Chapter #36": {
        "Hadith #7": {
          "Title": "Al-Kafi - Volume 2: Obedience and Piety",
          "Link": "https://thaqalayn.net/hadith/2/1/36/7",
          "Arabic Text": "7ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ مُفَضَّلِ بْنِ عُمَرَ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) فَذَكَرْنَا الأعْمَالَ فَقُلْتُ أَنَا مَا أَضْعَفَ عَمَلِي فَقَالَ مَهْ اسْتَغْفِرِ الله ثُمَّ قَالَ لِي إِنَّ قَلِيلَ الْعَمَلِ مَعَ التَّقْوَى خَيْرٌ مِنْ كَثِيرِ الْعَمَلِ بِلا تَقْوَى قُلْتُ كَيْفَ يَكُونُ كَثِيرٌ بِلا تَقْوَى قَالَ نَعَمْ مِثْلُ الرَّجُلِ يُطْعِمُ طَعَامَهُ وَيَرْفُقُ جِيرَانَهُ وَيُوَطِّئُ رَحْلَهُ فَإِذَا ارْتَفَعَ لَهُ الْبَابُ مِنَ الْحَرَامِ دَخَلَ فِيهِ فَهَذَا الْعَمَلُ بِلا تَقْوَى وَيَكُونُ الآخَرُ لَيْسَ عِنْدَهُ فَإِذَا ارْتَفَعَ لَهُ الْبَابُ مِنَ الْحَرَامِ لَمْ يَدْخُلْ فِيهِ.",
          "English Text": "7. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from ‘Uthman ibn ‘Isa from Mufaddal ibn ‘Umar who has said the following: “Once I was in the presence of abu ‘Abd Allah . We spoke about deeds and I said, ‘My deeds are the weakest.’ The Imam said, ‘Calm down. Ask forgiveness from Allah.’ Then the Imam said to me, ‘A little deed with piety is better than a great deal of deeds without piety.’ I then asked, ‘Can there be a great deal of deeds without piety?’ The Imam said, ‘Yes, it is true. It is like a man who feeds people, who is kind to his neighbors and entertains people at his home, but when a door to unlawful matters opens he enters such a door. Such are deeds without piety. There can be another person who does not have such deeds but when a door to unlawful matters opens he does not enter into such doors.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف على المشهور معتب ر  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (56/ 8)"
          }
        }
      },
      "Chapter #37": {
        "Hadith #13": {
          "Title": "Al-Kafi - Volume 2: Restraint from Worldly Matters (Sins)",
          "Link": "https://thaqalayn.net/hadith/2/1/37/13",
          "Arabic Text": "13ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ إِنَّا لا نَعُدُّ الرَّجُلَ مُؤْمِناً حَتَّى يَكُونَ لِجَمِيعِ أَمْرِنَا مُتَّبِعاً مُرِيداً أَلا وَإِنَّ مِنِ اتِّبَاعِ أَمْرِنَا وَإِرَادَتِهِ الْوَرَعَ فَتَزَيَّنُوا بِهِ يَرْحَمْكُمُ الله وَكَبِّدُوا أَعْدَاءَنَا بِهِ يَنْعَشْكُمُ الله.",
          "English Text": "13. Ali ibn Ibrahim has narrated from his father from ibn Mahbub from ibn Ri’ab from Abu ‘Abdillah  who has said the following: “We do not consider a person a believer until that person follows us in all of our orders and has firmly decided to do so. The decision to exercise restraint against worldly matters consists of following our orders and commands. You must have this beautiful quality. May Allah grant you blessings. With this Quality you defeat our enemies, and Allah will grant you delight and happiness.” ",
          "Grading": [
            {
              "English Grade": "Acceptable",
              "Arabic Grade": "معتبر",
              "Scholar": "Shaykh Asif al-Mohseni",
              "Book": "Mashra’at Bihar al-Anwar (2/350)"
            },
            {
              "English Grade": "Acceptable",
              "Arabic Grade": "صحيحة الإسناد",
              "Scholar": "Shaykh Hadi al-Najafi",
              "Book": "Mawsu'at Ahadith Ahlulbayt (12/142)"
            }
          ]
        }
      },
      "Chapter #38": {
        "Hadith #6": {
          "Title": "Al-Kafi - Volume 2: Chastity",
          "Link": "https://thaqalayn.net/hadith/2/1/38/6",
          "Arabic Text": "6ـ وَبِإِسْنَادِهِ قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) ثَلاثٌ أَخَافُهُنَّ عَلَى أُمَّتِي مِنْ بَعْدِي الضَّلالَةُ بَعْدَ الْمَعْرِفَةِ وَمَضَلاتُ الْفِتَنِ وَشَهْوَةُ الْبَطْنِ وَالْفَرْجِ.",
          "English Text": "6. Ali ibn Ibrahim has narrated from his sources of narrators who have said the following: “The Messenger of Allah has said, ‘There are three things about which I am afraid for my followers after me: misguidance after recognition of the truth, confusion because of mischief and the desires of stomach and genital organs.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " سكت عنه   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/67)"
          }
        }
      },
      "Chapter #39": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 2: Abstaining From Unlawful Matters",
          "Link": "https://thaqalayn.net/hadith/2/1/39/1",
          "Arabic Text": "1ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ دَاوُدَ بْنِ كَثِيرٍ الرَّقِّيِّ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) فِي قَوْلِ الله عَزَّ وَجَلَّ وَلِمَنْ خافَ مَقامَ رَبِّهِ جَنَّتانِ قَالَ مَنْ عَلِمَ أَنَّ الله عَزَّ وَجَلَّ يَرَاهُ وَيَسْمَعُ مَا يَقُولُهُ وَيَفْعَلُهُ مِنْ خَيْرٍ أَوْ شَرٍّ فَيَحْجُزُهُ ذَلِكَ عَنِ الْقَبِيحِ مِنَ الأعْمَالِ فَذَلِكَ الَّذِي خافَ مَقامَ رَبِّهِ وَنَهَى النَّفْسَ عَنِ الْهَوى‏.",
          "English Text": "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Hassan ibn Mahbub from Dawud ibn Kathir al-Riqqi from Abu ‘Abdillah  who has said the following: “About the words of Allah, the Most Majestic, the Most Holy, ‘. . . for one who has fear of the position of his Lord there are two gardens,’ (55:46) the Imam said, ‘Whoever knows that Allah, the Most Majestic, the Most Holy, sees him and hears whatever he says or acts for good or evil, and it keeps him back from the evil acts, such person is the “One who has fear of the position of his Lord,” and thus he prohibits the soul from acting according to desires.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مختلف فيه صحيح على القوى    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/68)"
          }
        }
      },
      "Chapter #47": {
        "Hadith #14": {
          "Title": "Al-Kafi - Volume 2: Patience",
          "Link": "https://thaqalayn.net/hadith/2/1/47/14",
          "Arabic Text": "14ـ عَنْهُ عَنْ أَبِيهِ عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ رَفَعَهُ عَنْ أَبِي جَعْفَرٍ (عَلَيهِ السَّلام) قَالَ الصَّبْرُ صَبْرَانِ صَبْرٌ عَلَى الْبَلاءِ حَسَنٌ جَمِيلٌ وَأَفْضَلُ الصَّبْرَيْنِ الْوَرَعُ عَنِ الْمَحَارِمِ.",
          "English Text": "14. It is narrated from him (narrator of the Hadith above) from his father from Yunus ibn ‘Abd al-Rahman who has narrated it in a marfu’ manner from abu Ja’far  who has said the following: “Abu Ja’far  has said, ‘Patience is of two kinds: to exercise patience in hardship, which is good and graceful, yet, the best of patience is that which is exercised to stop one from committing what Allah has prohibited.”’ ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (138/ 8)"
          }
        }
      },
      "Chapter #50": {
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 2: Delightful Appearance",
          "Link": "https://thaqalayn.net/hadith/2/1/50/4",
          "Arabic Text": "4ـ عَنْهُ عَنِ ابْنِ مَحْبُوبٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ قُلْتُ لَهُ مَا حَدُّ حُسْنِ الْخُلُقِ قَالَ تُلِينُ جَنَاحَكَ وَتُطِيبُ كَلامَكَ وَتَلْقَى أَخَاكَ بِبِشْرٍ حَسَنٍ.",
          "English Text": "4. It is narrated from him (narrator of the Hadith above) from ibn Mahbub from certain individuals of his people who has said the following: “Once I asked Abu ‘Abdillah  ‘What is the limit of excellent moral behavior?’ The Imam said, ‘It is to be relaxed (kindhearted), to have sweet expressions and to meet one’s fellow human beings with a delightful face.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالحسن   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/178)"
          }
        },
        "Hadith #5": {
          "Title": "Al-Kafi - Volume 2: Delightful Appearance",
          "Link": "https://thaqalayn.net/hadith/2/1/50/5",
          "Arabic Text": "5ـ عَنْهُ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ رِبْعِيٍّ عَنْ فُضَيْلٍ قَالَ صَنَائِعُ الْمَعْرُوفِ وَحُسْنُ الْبِشْرِ يَكْسِبَانِ الْمَحَبَّةَ وَيُدْخِلانِ الْجَنَّةَ وَالْبُخْلُ وَعُبُوسُ الْوَجْهِ يُبْعِدَانِ مِنَ الله وَيُدْخِلانِ النَّارَ.",
          "English Text": "5. It is narrated from him (narrator of the Hadith above) from his father from Hammad from Rib’I from Fudayl who has said the following: “Abu Ja’far or Abu ‘Abdillah  has said, ‘Doing lawful favors to others and having a delightful appearance earns love and lead one to paradise. Stinginess and a frowning face lead one away from Allah and into fire (of hell).”’ ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " كالصحيح موقو ف   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/179)"
          }
        }
      },
      "Chapter #51": {
        "Hadith #12": {
          "Title": "Al-Kafi - Volume 2: Truthfulness and Trust",
          "Link": "https://thaqalayn.net/hadith/2/1/51/12",
          "Arabic Text": "12ـ عَنْهُ عَنْ أَبِي طَالِبٍ رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) لا تَنْظُرُوا إِلَى طُولِ رُكُوعِ الرَّجُلِ وَسُجُودِهِ فَإِنَّ ذَلِكَ شَيْ‏ءٌ اعْتَادَهُ فَلَوْ تَرَكَهُ اسْتَوْحَشَ لِذَلِكَ وَلَكِنِ انْظُرُوا إِلَى صِدْقِ حَدِيثِهِ وَأَدَاءِ أَمَانَتِهِ. ",
          "English Text": "12. It is narrated from him (narrator of the Hadith above) from abu Talib in a marfu’ manner from Abu ‘Abdillah  who has said the following: “Abu ‘Abd Allah  has said, ‘Do not look to the long Ruku’ (bowing down on one’s knees for prayer) and Sajda (prostrating in prayer) of a man. It may have become his routine; without it he may feel frightened, but look to the truthfulness in his words and his credibility in keeping the trust.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/186)"
          }
        }
      },
      "Chapter #53": {
        "Hadith #6": {
          "Title": "Al-Kafi - Volume 2: Forgiveness",
          "Link": "https://thaqalayn.net/hadith/2/1/53/6",
          "Arabic Text": "6ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ أَبِي خَالِدٍ الْقَمَّاطِ عَنْ حُمْرَانَ عَنْ أَبِي جَعْفَرٍ (عَلَيهِ السَّلام) قَالَ النَّدَامَةُ عَلَى الْعَفْوِ أَفْضَلُ وَأَيْسَرُ مِنَ النَّدَامَةِ عَلَى الْعُقُوبَةِ.",
          "English Text": "6. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Sinan from abu Khalid al-Qammat from Humran from abu Ja’far  who has said the following: “Abu Ja’far  has said, ‘Regret for forgiving is better and easier than regret for being subjected to punishment.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف على المشهور حسن عند ي   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/194)"
          }
        }
      },
      "Chapter #55": {
        "Hadith #5": {
          "Title": "Al-Kafi - Volume 2: Forbearance",
          "Link": "https://thaqalayn.net/hadith/2/1/55/5",
          "Arabic Text": "5ـ عَنْهُ عَنْ عَلِيِّ بْنِ حَفْصٍ الْعَوْسِيِّ الْكُوفِيِّ رَفَعَهُ إِلَى أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) مَا أَعَزَّ الله بِجَهْلٍ قَطُّ وَلا أَذَلَّ بِحِلْمٍ قَطُّ.",
          "English Text": "5. It is narrated from him (narrator of the Hadith above) from Ali ibn Hafs al-‘Awsi al-Kufi in a marfu’ manner from Abu ‘Abdillah  who has said the following: “The Messenger of Allah has said, ‘Allah has never given respect to anyone because of ignorance and He has never humiliated anyone who possessed forbearance.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/207)"
          }
        }
      },
      "Chapter #56": {
        "Hadith #7": {
          "Title": "Al-Kafi - Volume 2: Silence and Controlling the Tongue",
          "Link": "https://thaqalayn.net/hadith/2/1/56/7",
          "Arabic Text": "7ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنِ الْحَلَبِيِّ رَفَعَهُ قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) أَمْسِكْ لِسَانَكَ فَإِنَّهَا صَدَقَةٌ تَصَدَّقُ بِهَا عَلَى نَفْسِكَ ثُمَّ قَالَ وَلا يَعْرِفُ عَبْدٌ حَقِيقَةَ الإيمَانِ حَتَّى يَخْزُنَ مِنْ لِسَانِهِ.",
          "English Text": "7. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from al- Halabi in a marfu’ manner from the Messenger of Allah who has said the following: “Control your tongue; it is a charity that you give to yourself. He then said, ‘A servant (of Allah) will not know the reality of his belief until he reserves (controls) his tongue.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/216)"
          }
        },
        "Hadith #9": {
          "Title": "Al-Kafi - Volume 2: Silence and Controlling the Tongue",
          "Link": "https://thaqalayn.net/hadith/2/1/56/9",
          "Arabic Text": "9ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنِ الْحَلَبِيِّ رَفَعَهُ قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) نَجَاةُ الْمُؤْمِنِ فِي حِفْظِ لِسَانِهِ.",
          "English Text": "9. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from al- Halabi in a marfu’ manner from the Messenger of Allah who has said the following: “The salvation of a believer is in his controlling his tongue.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (218/ 8)"
          }
        },
        "Hadith #14": {
          "Title": "Al-Kafi - Volume 2: Silence and Controlling the Tongue",
          "Link": "https://thaqalayn.net/hadith/2/1/56/14",
          "Arabic Text": "14ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَمُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ عَنْ قَيْسٍ أَبِي إِسْمَاعِيلَ وَذَكَرَ أَنَّهُ لا بَأْسَ بِهِ مِنْ أَصْحَابِنَا رَفَعَهُ قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ (صَلَّى اللهُ عَلَيْهِ وآلِه) فَقَالَ يَا رَسُولَ الله أَوْصِنِي فَقَالَ احْفَظْ لِسَانَكَ قَالَ يَا رَسُولَ الله أَوْصِنِي قَالَ احْفَظْ لِسَانَكَ قَالَ يَا رَسُولَ الله أَوْصِنِي قَالَ احْفَظْ لِسَانَكَ وَيْحَكَ وَهَلْ يَكُبُّ النَّاسَ عَلَى مَنَاخِرِهِمْ فِي النَّارِ إِلا حَصَائِدُ أَلْسِنَتِهِمْ.",
          "English Text": "14. Ali ibn Ibrahim has narrated from his father and Muhammad ibn Isma’il from Fadl ibn Shadhan all from Ibn Abi ‘Umayr from Ibrahim ibn ‘Abd al-Hamid from Qays abu Isma’il (he has said that he is fine and is of our people) in a marfu’ manner from the Messenger of Allah : “Once a man came to the Holy Prophet and said, ‘O Messenger of Allah, advise me.’ The Messenger of Allah  said, ‘Control your tongue.’ He then said, ‘O Messenger of Allah, advise me.’ The Messenger of Allah said, ‘Control your tongue.’ He again said, ‘O Messenger of Allah, advise me.’ The Messenger of Allah said, ‘Control your tongue. Fie upon you, do people get thrown into fire headlong for any reason other than being a victim due to their own tongue?”’ ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (220/ 8)"
          }
        },
        "Hadith #18": {
          "Title": "Al-Kafi - Volume 2: Silence and Controlling the Tongue",
          "Link": "https://thaqalayn.net/hadith/2/1/56/18",
          "Arabic Text": "18ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَالْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ جَمِيعاً عَنِ الْوَشَّاءِ قَالَ سَمِعْتُ الرِّضَا (عَلَيهِ السَّلام) يَقُولُ كَانَ الرَّجُلُ مِنْ بَنِي إِسْرَائِيلَ إِذَا أَرَادَ الْعِبَادَةَ صَمَتَ قَبْلَ ذَلِكَ عَشْرَ سِنِينَ.",
          "English Text": "18. A number of our people have narrated from Sahl ibn Ziyad and al-Husayn ibn Muhammad from Mu’alla ibn Muhammad all from al-Washsha’ who has said the following: “I heard al-Rida  say, ‘In the tribe of Israel if a man wanted to become a worshipper he was to keep silent for ten years before starting the deed.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف على المشهور معتب ر   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/223)"
          }
        }
      },
      "Chapter #59": {
        "Hadith #12": {
          "Title": "Al-Kafi - Volume 2: Humbleness",
          "Link": "https://thaqalayn.net/hadith/2/1/59/12",
          "Arabic Text": "12ـ عَنْهُ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ الْحَكَمِ رَفَعَهُ إِلَى أَبِي بَصِيرٍ قَالَ دَخَلْتُ عَلَى أَبِي الْحَسَنِ مُوسَى (عَلَيهِ السَّلام) فِي السَّنَةِ الَّتِي قُبِضَ فِيهَا أَبُو عَبْدِ الله (عَلَيهِ السَّلام) فَقُلْتُ جُعِلْتُ فِدَاكَ مَا لَكَ ذَبَحْتَ كَبْشاً وَنَحَرَ فُلانٌ بَدَنَةً فَقَالَ يَا أَبَا مُحَمَّدٍ إِنَّ نُوحاً (عَلَيهِ السَّلام) كَانَ فِي السَّفِينَةِ وَكَانَ فِيهَا مَا شَاءَ الله وَكَانَتِ السَّفِينَةُ مَأْمُورَةً فَطَافَتْ بِالْبَيْتِ وَهُوَ طَوَافُ النِّسَاءِ وَخَلَّى سَبِيلَهَا نُوحٌ (عَلَيهِ السَّلام) فَأَوْحَى الله عَزَّ وَجَلَّ إِلَى الْجِبَالِ أَنِّي وَاضِعٌ سَفِينَةَ نُوحٍ عَبْدِي عَلَى جَبَلٍ مِنْكُنَّ فَتَطَاوَلَتْ وَشَمَخَتْ وَتَوَاضَعَ الْجُودِيُّ وَهُوَ جَبَلٌ عِنْدَكُمْ فَضَرَبَتِ السَّفِينَةُ بِجُؤْجُؤِهَا الْجَبَلَ قَالَ فَقَالَ نُوحٌ (عَلَيهِ السَّلام) عِنْدَ ذَلِكَ يَا مَارِي أَتْقِنْ وَهُوَ بِالسُّرْيَانِيَّةِ يَا رَبِّ أَصْلِحْ قَالَ فَظَنَنْتُ أَنَّ أَبَا الْحَسَنِ (عَلَيهِ السَّلام) عَرَّضَ بِنَفْسِهِ.",
          "English Text": "12. It is narrated from him (narrator of the Hadith above) from a number of his people from Ali ibn Asbat from al-Hassan ibn al-Jahm from abu al-Hassan al- Rida  who has said the following: “Humbleness is a form of behavior that one expects others to behave that way toward him.” “In another Hadith the narrator asked, ‘What is the definition of humbleness for which a servant (of Allah) could be considered humble?’ The Imam said, ‘There are several levels of humbleness. One is to know the value of one’s soul to place it at the position that it deserves with a peaceful heart and should not love to behave toward others in a way different from what he loves others to behave toward him. If he may find an evil behavior he should change it to a virtuous one. Those who suppress their anger are safe from people and Allah loves those who do good. ’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/253)"
          }
        }
      },
      "Chapter #61": {
        "Hadith #7": {
          "Title": "Al-Kafi - Volume 2: Condemnation of Worldly Matters and Abstaining Thereby",
          "Link": "https://thaqalayn.net/hadith/2/1/61/7",
          "Arabic Text": "7ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى الْخَثْعَمِيِّ عَنْ طَلْحَةَ بْنِ زَيْدٍ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ مَا أَعْجَبَ رَسُولَ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) شَيْ‏ءٌ مِنَ الدُّنْيَا إِلا أَنْ يَكُونَ فِيهَا جَائِعاً خَائِفاً.",
          "English Text": "7. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Yahya al-Khath’ami from Talha ibn Zayd from Abu ‘Abdillah  who has said the following: “Abu ‘Abd Allah  has said, ‘Every one of things the Messenger of Allah liked from this world was associated with suffering, hunger or fear.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف كالموثق   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (273/ 8)"
          }
        },
        "Hadith #17": {
          "Title": "Al-Kafi - Volume 2: Condemnation of Worldly Matters and Abstaining Thereby",
          "Link": "https://thaqalayn.net/hadith/2/1/61/17",
          "Arabic Text": "17ـ عَنْهُ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مُوسَى بْنِ بَكْرٍ عَنْ أَبِي إِبْرَاهِيمَ (عَلَيهِ السَّلام) قَالَ قَالَ أَبُو ذَرٍّ رَحِمَهُ الله جَزَى الله الدُّنْيَا عَنِّي مَذَمَّةً بَعْدَ رَغِيفَيْنِ مِنَ الشَّعِيرِ أَتَغَدَّى بِأَحَدِهِمَا وَأَتَعَشَّى بِالآخَرِ وَبَعْدَ شَمْلَتَيِ الصُّوفِ أَتَّزِرُ بِإِحْدَاهُمَا وَأَتَرَدَّى بِالأخْرَى.",
          "English Text": "17. It is narrated from him (narrator of the Hadith above) from Ali ibn al-Hakam from Musa ibn Bakr from abu Ibrahim  who has said the following: “Abu Dhar, may Allah grant him favors, has said, ‘May Allah renounce the world, on my behalf, except for two loaves of barley bread daily, one for my lunch and the other for my dinner and two woolen pieces of cloth which I use one as a shirt and the other as trousers.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف كالموثق    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/298)"
          }
        },
        "Hadith #25": {
          "Title": "Al-Kafi - Volume 2: Condemnation of Worldly Matters and Abstaining Thereby",
          "Link": "https://thaqalayn.net/hadith/2/1/61/25",
          "Arabic Text": "25ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ قَالَ سَمِعْتُ الرِّضَا (عَلَيهِ السَّلام) يَقُولُ قَالَ عِيسَى ابْنُ مَرْيَمَ (صَلَّى اللهُ عَلَيْهِ وآلِه) لِلْحَوَارِيِّينَ يَا بَنِي إِسْرَائِيلَ لا تَأْسَوْا عَلَى مَا فَاتَكُمْ مِنَ الدُّنْيَا كَمَا لا يَأْسَى أَهْلُ الدُّنْيَا عَلَى مَا فَاتَهُمْ مِنْ دِينِهِمْ إِذَا أَصَابُوا دُنْيَاهُمْ. ",
          "English Text": "25. Al-Husayn ibn Muhammad has narrated from Mu’alla ibn Muhammad from al- Washsha’ who has said the following: “I heard al-Rida  say, ‘Jesus son of Mary (peace be upon him) said to his disciples, “O Israelites, do not regret for what you may miss of the world, just as the people of the world (who have no religion) do not regret for what they miss of religion when they find their worldly materials.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف على المشهور معتبر    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/314)"
          }
        }
      },
      "Chapter #63": {
        "Hadith #11": {
          "Title": "Al-Kafi - Volume 2: Contentment",
          "Link": "https://thaqalayn.net/hadith/2/1/63/11",
          "Arabic Text": "11ـ عَنْهُ عَنْ عِدَّةٍ مِنْ أَصْحَابِنَا عَنْ حَنَانِ بْنِ سَدِيرٍ رَفَعَهُ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ (عَلَيهِ السَّلام) مَنْ رَضِيَ مِنَ الدُّنْيَا بِمَا يُجْزِيهِ كَانَ أَيْسَرُ مَا فِيهَا يَكْفِيهِ وَمَنْ لَمْ يَرْضَ مِنَ الدُّنْيَا بِمَا يُجْزِيهِ لَمْ يَكُنْ فِيهَا شَيْ‏ءٌ يَكْفِيهِ. ",
          "English Text": "11. It is narrated from him (narrator of the Hadith above) from a number of our people have narrated from Hannan ibn Sadir in a marfu’ manner from Amir al- Mu’minin (Ali ibn abu Talib)  who has said the following: “Whoever is content, with worldly matters, with bare necessities, the minimum suffices him. Whoever is not content. with worldly matters, with bare necessities, then nothing will be able to suffice him.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/327)"
          }
        }
      },
      "Chapter #64": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 2: Adequacy",
          "Link": "https://thaqalayn.net/hadith/2/1/64/1",
          "Arabic Text": "1ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ غَيْرِ وَاحِدٍ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ أَبِي عُبَيْدَةَ الْحَذَّاءِ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ (عَلَيهِ السَّلام) يَقُولُ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) قَالَ الله عَزَّ وَجَلَّ إِنَّ مِنْ أَغْبَطِ أَوْلِيَائِي عِنْدِي رَجُلاً خَفِيفَ الْحَالِ ذَا حَظٍّ مِنْ صَلاةٍ أَحْسَنَ عِبَادَةَ رَبِّهِ بِالْغَيْبِ وَكَانَ غَامِضاً فِي النَّاسِ جُعِلَ رِزْقُهُ كَفَافاً فَصَبَرَ عَلَيْهِ عُجِّلَتْ مَنِيَّتُهُ فَقَلَّ تُرَاثُهُ وَقَلَّتْ بَوَاكِيهِ.",
          "English Text": "1. Ali ibn Ibrahim has narrated from his father from more than one person from ‘Asim from ibn Hamid from abu ‘Ubaydah al-Hadhdha’ who has said the following: “I heard abu Ja’far  say, ‘The Messenger of Allah has said, “Allah, the Most Majestic, the Most Holy, says, ‘The most envied person among My servants is a man whose needs are light, has a good share in prayer, who performs the worship of his Lord unseen, is obscure among the people, whose expenses are within the limits of bare necessities with which he exercises patience, whose death is quick (like a dead person free from worldly desires) and whose heirs and mourners are very few.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالحسن   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/327)"
          }
        },
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 2: Adequacy",
          "Link": "https://thaqalayn.net/hadith/2/1/64/4",
          "Arabic Text": "4ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ النَّوْفَلِيِّ رَفَعَهُ إِلَى عَلِيِّ بْنِ الْحُسَيْنِ (صَلَّى اللهُ عَلَيْهِ وآلِه) قَالَ مَرَّ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) بِرَاعِي إِبِلٍ فَبَعَثَ يَسْتَسْقِيهِ فَقَالَ أَمَّا مَا فِي ضُرُوعِهَا فَصَبُوحُ الْحَيِّ وَأَمَّا مَا فِي آنِيَتِنَا فَغَبُوقُهُمْ فَقَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) اللهمَّ أَكْثِرْ مَالَهُ وَوُلْدَهُ ثُمَّ مَرَّ بِرَاعِي غَنَمٍ فَبَعَثَ إِلَيْهِ يَسْتَسْقِيهِ فَحَلَبَ لَهُ مَا فِي ضُرُوعِهَا وَأَكْفَأَ مَا فِي إِنَائِهِ فِي إِنَاءِ رَسُولِ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) وَبَعَثَ إِلَيْهِ بِشَاةٍ وَقَالَ هَذَا مَا عِنْدَنَا وَإِنْ أَحْبَبْتَ أَنْ نَزِيدَكَ زِدْنَاكَ قَالَ فَقَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) اللهمَّ ارْزُقْهُ الْكَفَافَ فَقَالَ لَهُ بَعْضُ أَصْحَابِهِ يَا رَسُولَ الله دَعَوْتَ لِلَّذِي رَدَّكَ بِدُعَاءٍ عَامَّتُنَا نُحِبُّهُ وَدَعَوْتَ لِلَّذِي أَسْعَفَكَ بِحَاجَتِكَ بِدُعَاءٍ كُلُّنَا نَكْرَهُهُ فَقَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) إِنَّ مَا قَلَّ وَكَفَى خَيْرٌ مِمَّا كَثُرَ وَأَلْهَى اللهمَّ ارْزُقْ مُحَمَّداً وَآلَ مُحَمَّدٍ الْكَفَافَ.",
          "English Text": "4. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from Ya’qub ibn Yazid from Ibrahim ibn Muhammad al-Nawfali in a marfu’ manner from Ali ibn al-Husayn  who has said the following: “The Messenger of Allah once passed by a shepherd of camels and asked him for a drink and he said, ‘The milk in their udder is for the morning drink of the people of the village and the milk in the containers is for their evening drink.’ The Messenger of Allah then prayed, ‘O Lord, give him many children and much wealth.’ The Messenger of Allah then passed by a shepherd of sheep and sent his people to ask him for a drink. He milked them and poured it from his milk container altogether in the container for the Messenger of Allah. Along with all the milk he also sent a sheep for him, saying, ‘This is what we have and we can bring you more if you like.’ The Imam said, ‘The Messenger of Allah prayed for him, “O Lord, give him sustenance adequate only for his bare necessities.” A certain man of his companion then asked, ‘O Messenger of Allah, how is it that you prayed for the shepherd who refused to give you any milk in such a way that we all love. However, for the one who readily provided what you asked, you prayed for him with a prayer that we all dislike?’ The Messenger of Allah said, ‘The little thing that is adequate is better than a great deal that diverts one’s mind (from Allah). O Lord, grant to Muhammad and the family of Muhammad only that much which is adequate for them.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/331)"
          }
        }
      },
      "Chapter #66": {
        "Hadith #10": {
          "Title": "Al-Kafi - Volume 2: Fairness and Justice",
          "Link": "https://thaqalayn.net/hadith/2/1/66/10",
          "Arabic Text": "10ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ الله عَنْ يَحْيَى بْنِ إِبْرَاهِيمَ بْنِ أَبِي الْبِلادِ عَنْ أَبِيهِ عَنْ جَدِّهِ أَبِي الْبِلادِ رَفَعَهُ قَالَ جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ (صَلَّى اللهُ عَلَيْهِ وآلِه) وَهُوَ يُرِيدُ بَعْضَ غَزَوَاتِهِ فَأَخَذَ بِغَرْزِ رَاحِلَتِهِ فَقَالَ يَا رَسُولَ الله عَلِّمْنِي عَمَلاً أَدْخُلُ بِهِ الْجَنَّةَ فَقَالَ مَا أَحْبَبْتَ أَنْ يَأْتِيَهُ النَّاسُ إِلَيْكَ فَأْتِهِ إِلَيْهِمْ وَمَا كَرِهْتَ أَنْ يَأْتِيَهُ النَّاسُ إِلَيْكَ فَلا تَأْتِهِ إِلَيْهِمْ خَلِّ سَبِيلَ الرَّاحِلَةِ.",
          "English Text": "10. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from Yahya ibn Ibrahim ibn abu al-Bilad from his father from his grandfather, abu al- Bilad in a marfu’ manner saying: “Once an Arab man came to the Holy Prophet when he was about to leave for an armed campaign. The Arab held on to the harness of the horse of the Holy Prophet and said, ‘O Messenger of Allah, teach me a deed with which I can go to paradise.’ He said, ‘Do to people what you like them to do to you, and do not do anything to people that you do not like to be done to you. Now allow the horse to go.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (346/ 8)"
          }
        }
      },
      "Chapter #68": {
        "Hadith #21": {
          "Title": "Al-Kafi - Volume 2: Good Relation with Relatives",
          "Link": "https://thaqalayn.net/hadith/2/1/68/21",
          "Arabic Text": "21ـ عَنْهُ عَنْ غَيْرِ وَاحِدٍ عَنْ زِيَادٍ الْقَنْدِيِّ عَنْ عَبْدِ الله بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) إِنَّ الْقَوْمَ لَيَكُونُونَ فَجَرَةً وَلا يَكُونُونَ بَرَرَةً فَيَصِلُونَ أَرْحَامَهُمْ فَتَنْمِي أَمْوَالُهُمْ وَتَطُولُ أَعْمَارُهُمْ فَكَيْفَ إِذَا كَانُوا أَبْرَاراً بَرَرَةً.",
          "English Text": "21. It is narrated from him (narrator of the Hadith above) from more than one person from Ziyad al-Qandy from ‘Abd Allah ibn Sinan from Abu ‘Abdillah  who has said the following: “The Messenger of Allah has said, ‘A people who are evil doers and not of the virtuous ones but maintain good relations with relatives, their wealth increases, and they live longer. Can one imagine their benefits had they been virtuous and of good deeds?”’ ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالموثق  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (380/ 8)"
          }
        }
      },
      "Chapter #71": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 2: High Regards for the Elderly",
          "Link": "https://thaqalayn.net/hadith/2/1/71/2",
          "Arabic Text": "2ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) لَيْسَ مِنَّا مَنْ لَمْ يُوَقِّرْ كَبِيرَنَا وَيَرْحَمْ صَغِيرَنَا.",
          "English Text": "2. A number of our people have narrated from Ahmad ibn Muhammad in a marfu’ manner from Abu ‘Abdillah  who has said the following: “Whoever does not consider our elders as dignified and does not show kindness to our people who are yet to grow up, is not from our people.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (7/ 9)"
          }
        }
      },
      "Chapter #74": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 2: Brotherhood in Belief is not Due to Religion it only is a Way of Recognition",
          "Link": "https://thaqalayn.net/hadith/2/1/74/1",
          "Arabic Text": "1ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ حَمْزَةَ بْنِ مُحَمَّدٍ الطَّيَّارِ عَنْ أَبِيهِ عَنْ أَبِي جَعْفَرٍ (عَلَيهِ السَّلام) قَالَ لَمْ تَتَوَاخَوْا عَلَى هَذَا الأمْرِ وَإِنَّمَا تَعَارَفْتُمْ عَلَيْهِ.",
          "English Text": "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Sinan from Hamza ibn Muhammad al-Tayyar from his father from abu Ja’far  who has said the following: “You have not become brothers on the basis of this belief (of Shi’a Muslims) but you have recognized each other because of it.”’ ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف على المشهور معتبر عند ي  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (20/ 9)"
          }
        }
      },
      "Chapter #75": {
        "Hadith #6": {
          "Title": "Al-Kafi - Volume 2: The Rights of a Believer on his Brother (in belief) and his duty to observe Such Rights",
          "Link": "https://thaqalayn.net/hadith/2/1/75/6",
          "Arabic Text": "6ـ أَبُو عَلِيٍّ الأشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ ابْنِ فَضَّالٍ عَنْ عَلِيِّ بْنِ عُقْبَةَ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ لِلْمُسْلِمِ عَلَى أَخِيهِ الْمُسْلِمِ مِنَ الْحَقِّ أَنْ يُسَلِّمَ عَلَيْهِ إِذَا لَقِيَهُ وَيَعُودَهُ إِذَا مَرِضَ وَيَنْصَحَ لَهُ إِذَا غَابَ وَيُسَمِّتَهُ إِذَا عَطَسَ وَيُجِيبَهُ إِذَا دَعَاهُ وَيَتْبَعَهُ إِذَا مَاتَ. عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنِ ابْنِ فَضَّالٍ عَنْ عَلِيِّ بْنِ عُقْبَةَ مِثْلَهُ.",
          "English Text": "6. Abu Ali al-Ash’ari has narrated from Muhammad ibn ‘Abd al-Jabbar from ibn Faddal from Ali ibn ‘Uqbah from Abu ‘Abdillah  who has said the following: “Of the rights of Muslin on a Muslim is to offer him the greeting of peace upon meeting him, visit him when he is ill, protect his interest when he is absent, say, ‘May Allah bless you’ when he sneezes, accept his invitation and take part in the procession for his funeral.” A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from ibn Faddal from Ali ibn ‘Uqbah a similar Hadith. ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " موثق بسنديه  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (37/ 9)"
          }
        },
        "Hadith #12": {
          "Title": "Al-Kafi - Volume 2: The Rights of a Believer on his Brother (in belief) and his duty to observe Such Rights",
          "Link": "https://thaqalayn.net/hadith/2/1/75/12",
          "Arabic Text": "12ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ الْعَلاءِ بْنِ فُضَيْلٍ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ كَانَ أَبُو جَعْفَرٍ (صَلَّى اللهُ عَلَيْهِ وآلِه) يَقُولُ عَظِّمُوا أَصْحَابَكُمْ وَوَقِّرُوهُمْ وَلا يَتَجَهَّمُ بَعْضُكُمْ بَعْضاً وَلا تَضَارُّوا وَلا تَحَاسَدُوا وَإِيَّاكُمْ وَالْبُخْلَ كُونُوا عِبَادَ الله الْمُخْلَصِينَ.",
          "English Text": "12. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Sinan from al-‘Ala’ ibn Fudayl from Abu ‘Abdillah  who has said the following: “Abu Ja’far  would say, ‘Dignify your people, honor them and do not be aggressive toward each other, do not harm each other and do not be jealous of each other. You must never be miserly and always be sincere servants of Allah.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف على المشهور معتبر عند ي  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (46/ 9)"
          }
        }
      },
      "Chapter #78": {
        "Hadith #9": {
          "Title": "Al-Kafi - Volume 2: Greeting with Handshake",
          "Link": "https://thaqalayn.net/hadith/2/1/78/9",
          "Arabic Text": "9ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ عَمْرِو بْنِ الأفْرَقِ عَنْ أَبِي عُبَيْدَةَ عَنْ أَبِي جَعْفَرٍ (عَلَيهِ السَّلام) قَالَ يَنْبَغِي لِلْمُؤْمِنَيْنِ إِذَا تَوَارَى أَحَدُهُمَا عَنْ صَاحِبِهِ بِشَجَرَةٍ ثُمَّ الْتَقَيَا أَنْ يَتَصَافَحَا.",
          "English Text": "9. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Sinan from ‘Amr ibn al-Afraq from abu ‘Ubaydah from abu Ja’far  who has said the following: “It is a good idea for the believers to shake each other’s hands after one of them remains out of sight, even because of a tree in between.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف على المشهور معتبر عند ي  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (66/ 9)"
          }
        }
      },
      "Chapter #82": {
        "Hadith #6": {
          "Title": "Al-Kafi - Volume 2: To Please the Believers",
          "Link": "https://thaqalayn.net/hadith/2/1/82/6",
          "Arabic Text": "6ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ خَلَفِ بْنِ حَمَّادٍ عَنْ مُفَضَّلِ بْنِ عُمَرَ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ لا يَرَى أَحَدُكُمْ إِذَا أَدْخَلَ عَلَى مُؤْمِنٍ سُرُوراً أَنَّهُ عَلَيْهِ أَدْخَلَهُ فَقَطْ بَلْ وَالله عَلَيْنَا بَلْ وَالله عَلَى رَسُولِ الله (صَلَّى اللهُ عَلَيْهِ وآلِه).",
          "English Text": "6. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from his father from Khalaf ibn Hammad from Mufaddal ibn ‘Umar from Abu ‘Abdillah  who has said the following: “One of you must not think that when he brings joy to the heart of a believer he has brought joy to his heart only. I swear by Allah, in fact, he has done so to our hearts and also, I swear by Allah, he has done so to (the heart of) the Messenger of Allah.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف على المشهور معتبر عند ي   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/93)"
          }
        }
      },
      "Chapter #92": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 2: To Revive the Believer",
          "Link": "https://thaqalayn.net/hadith/2/1/92/2",
          "Arabic Text": "2ـ عَنْهُ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ فُضَيْلِ بْنِ يَسَارٍ قَالَ قُلْتُ لأبِي جَعْفَرٍ (عَلَيهِ السَّلام) قَوْلُ الله عَزَّ وَجَلَّ فِي كِتَابِهِ وَمَنْ أَحْياها فَكَأَنَّما أَحْيَا النَّاسَ جَمِيعاً قَالَ مِنْ حَرَقٍ أَوْ غَرَقٍ قُلْتُ فَمَنْ أَخْرَجَهَا مِنْ ضَلالٍ إِلَى هُدًى قَالَ ذَاكَ تَأْوِيلُهَا الأعْظَمُ. مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ وَعَبْدِ الله ابْنَيْ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبَانٍ مِثْلَهُ.",
          "English Text": "2. It is narrated from him (narrator of the Hadith above) from Ali ibn al-Hakam from Aban ibn ‘Uthman from Fudayl ibn Yasar who has said the following: “I asked abu Ja’far  about the words of Allah, the Most Majestic, the Most Holy, in His book, ‘ ... to save a life is as great a virtue as to save all of mankind. . . .’ (5:32) The Imam said, ‘It refers to burning or drowning someone.’ I asked, ‘What if someone takes him out of straying to guidance?’ The Imam said, ‘That is the greatest interpretation of the case in point.’” Muhammad ibn Yahya has narrated from Ahmad and ‘Abd Allah the two sons of Muhammad ibn ‘Isa from Ali ibn al-Hakam from Aban: a similar Hadith. ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " موثق بسنديه   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/151)"
          }
        }
      },
      "Chapter #97": {
        "Hadith #6": {
          "Title": "Al-Kafi - Volume 2: Al-Taqiyyah, Guarding and Cautiousness",
          "Link": "https://thaqalayn.net/hadith/2/1/97/6",
          "Arabic Text": "6ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَمَّنْ أَخْبَرَهُ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) فِي قَوْلِ الله عَزَّ وَجَلَّ وَلا تَسْتَوِي الْحَسَنَةُ وَلا السَّيِّئَةُ قَالَ الْحَسَنَةُ التَّقِيَّةُ وَالسَّيِّئَةُ الإذَاعَةُ وَقَوْلُهُ عَزَّ وَجَلَّ ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ السَّيِّئَةَ قَالَ الَّتِي هِيَ أَحْسَنُ التَّقِيَّةُ فَإِذَا الَّذِي بَيْنَكَ وَبَيْنَهُ عَداوَةٌ كَأَنَّهُ وَلِيٌّ حَمِيمٌ.",
          "English Text": "6. Ali ibn Ibrahim has narrated from his father from Hammad from Hariz from those who reported to him from Abu ‘Abdillah  who has said the following: “About the words of Allah, the Most Majestic, the Most Holy, ‘. . . virtue and evil are not equal. . . .’ , the Imam said that ‘Virtue’ refers to al-Taqiyyah and ‘Evil’ is disregarding it, and in the words of Allah, the Most Majestic, the Most Holy, ‘If you respond to evil with virtuous deeds . . .’, the Imam said, ‘Virtue’ refers to al-Taqiyyah, ‘. . . you will certainly find that your enemies will become your intimate friends.’” (4 1 :34) ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالحسن   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/171)"
          }
        }
      },
      "Chapter #98": {
        "Hadith #8": {
          "Title": "Al-Kafi - Volume 2: Silence and Restraint against Publicity",
          "Link": "https://thaqalayn.net/hadith/2/1/98/8",
          "Arabic Text": "8ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ عَبْدِ الله بْنِ يَحْيَى عَنْ حَرِيزٍ عَنْ مُعَلَّى بْنِ خُنَيْسٍ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) يَا مُعَلَّى اكْتُمْ أَمْرَنَا وَلا تُذِعْهُ فَإِنَّهُ مَنْ كَتَمَ أَمْرَنَا وَلَمْ يُذِعْهُ أَعَزَّهُ الله بِهِ فِي الدُّنْيَا وَجَعَلَهُ نُوراً بَيْنَ عَيْنَيْهِ فِي الآخِرَةِ يَقُودُهُ إِلَى الْجَنَّةِ يَا مُعَلَّى مَنْ أَذَاعَ أَمْرَنَا وَلَمْ يَكْتُمْهُ أَذَلَّهُ الله بِهِ فِي الدُّنْيَا وَنَزَعَ النُّورَ مِنْ بَيْنِ عَيْنَيْهِ فِي الآخِرَةِ وَجَعَلَهُ ظُلْمَةً تَقُودُهُ إِلَى النَّارِ يَا مُعَلَّى إِنَّ التَّقِيَّةَ مِنْ دِينِي وَدِينِ آبَائِي وَلا دِينَ لِمَنْ لا تَقِيَّةَ لَهُ يَا مُعَلَّى إِنَّ الله يُحِبُّ أَنْ يُعْبَدَ فِي السِّرِّ كَمَا يُحِبُّ أَنْ يُعْبَدَ فِي الْعَلانِيَةِ يَا مُعَلَّى إِنَّ الْمُذِيعَ لأمْرِنَا كَالْجَاحِدِ لَهُ.",
          "English Text": "8. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from his father from ‘Abd Allah ibn Yahya from Hariz from Mu’alla ibn Khanith who has said the following: “Once Abu ‘Abdillah  said to me, ‘O Mu’alla, conceal our cause and do not make it public; to those who conceal our cause and do not publicize it, Allah grants honor in this world. He will make it a light between his eyes in the next life and lead him to paradise. O Mu’alla, whoever publicizes our cause and does not conceal it, Allah humiliates him in this world, removes the light between his eyes in the next life and will make darkness to lead him to fire. O Mu’alla, al-Taqiyyah is my religion and the religion of my predecessors. There is no religion for one who does not observe al-Taqiyyah. O Mu’alla, Allah loves to be worshipped secretly just as He loves to be worshipped publicly. O Mu’alla, one who publicizes our cause is like one who rejects it altogather.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مختلف فيه   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (191/ 9)"
          }
        }
      },
      "Chapter #99": {
        "Hadith #5": {
          "Title": "Al-Kafi - Volume 2: A Believer’s Signs and Qualities",
          "Link": "https://thaqalayn.net/hadith/2/1/99/5",
          "Arabic Text": "5ـ عَنْهُ عَنْ بَعْضِ أَصْحَابِنَا رَفَعَهُ عَنْ أَحَدِهِمَا (عَلَيهِما السَّلام) قَالَ مَرَّ أَمِيرُ الْمُؤْمِنِينَ (عَلَيهِ السَّلام) بِمَجْلِسٍ مِنْ قُرَيْشٍ فَإِذَا هُوَ بِقَوْمٍ بِيضٍ ثِيَابُهُمْ صَافِيَةٍ أَلْوَانُهُمْ كَثِيرٍ ضِحْكُهُمْ يُشِيرُونَ بِأَصَابِعِهِمْ إِلَى مَنْ يَمُرُّ بِهِمْ ثُمَّ مَرَّ بِمَجْلِسٍ لِلأوْسِ وَالْخَزْرَجِ فَإِذَا قَوْمٌ بُلِيَتْ مِنْهُمُ الأبْدَانُ وَدَقَّتْ مِنْهُمُ الرِّقَابُ وَاصْفَرَّتْ مِنْهُمُ الألْوَانُ وَقَدْ تَوَاضَعُوا بِالْكَلامِ فَتَعَجَّبَ عَلِيٌّ (عَلَيهِ السَّلام) مِنْ ذَلِكَ وَدَخَلَ عَلَى رَسُولِ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) فَقَالَ بِأَبِي أَنْتَ وَأُمِّي إِنِّي مَرَرْتُ بِمَجْلِسٍ لآِلِ فُلانٍ ثُمَّ وَصَفَهُمْ وَمَرَرْتُ بِمَجْلِسٍ لِلأوْسِ وَالْخَزْرَجِ فَوَصَفَهُمْ ثُمَّ قَالَ وَجَمِيعٌ مُؤْمِنُونَ فَأَخْبِرْنِي يَا رَسُولَ الله بِصِفَةِ الْمُؤْمِنِ فَنَكَسَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) ثُمَّ رَفَعَ رَأْسَهُ فَقَالَ عِشْرُونَ خَصْلَةً فِي الْمُؤْمِنِ فَإِنْ لَمْ تَكُنْ فِيهِ لَمْ يَكْمُلْ إِيمَانُهُ إِنَّ مِنْ أَخْلاقِ الْمُؤْمِنِينَ يَا عَلِيُّ الْحَاضِرُونَ الصَّلاةَ وَالْمُسَارِعُونَ إِلَى الزَّكَاةِ وَالْمُطْعِمُونَ الْمِسْكِينَ الْمَاسِحُونَ رَأْسَ الْيَتِيمِ الْمُطَهِّرُونَ أَطْمَارَهُمْ الْمُتَّزِرُونَ عَلَى أَوْسَاطِهِمُ الَّذِينَ إِنْ حَدَّثُوا لَمْ يَكْذِبُوا وَإِذَا وَعَدُوا لَمْ يُخْلِفُوا وَإِذَا ائْتُمِنُوا لَمْ يَخُونُوا وَإِذَا تَكَلَّمُوا صَدَقُوا رُهْبَانٌ بِاللَّيْلِ أُسُدٌ بِالنَّهَارِ صَائِمُونَ النَّهَارَ قَائِمُونَ اللَّيْلَ لا يُؤْذُونَ جَاراً وَلا يَتَأَذَّى بِهِمْ جَارٌ الَّذِينَ مَشْيُهُمْ عَلَى الأرْضِ هَوْنٌ وَخُطَاهُمْ إِلَى بُيُوتِ الأرَامِلِ وَعَلَى أَثَرِ الْجَنَائِزِ جَعَلَنَا الله وَإِيَّاكُمْ مِنَ الْمُتَّقِينَ.",
          "English Text": "5. It is narrated from him (narrator of the Hadith above) from certain individuals of his people from in a marfu’ manner from one of them (abu Ja’far or Abu ‘Abdillah ) who has said the following: “Amir al-Mu’minin (Ali ibn abu Talib)  once passed by a gathering of Quraysh where he found the people in white clothes, of clear complexion, frequently laughing and who pointed out their fingers to whoever passed (near) by. Then he passed by a gathering of al- Aws and Khazraj where he found people of worn out bodies, whose necks were thinning, their colors had turned pale and were very humble in their words. “Amir al-Mu’minin (Ali ibn abu Talib)  wondered about his observation, he came to the Messenger of Allah and said, ‘May Allah keep my soul and the souls of my parents in service for your cause, I passed by a gathering of the tribe of so and so.’ He described them for the Holy Prophet. He then said, T also passed by a gathering of al- Aws and al-Khazraj.’ He described them for the Holy Prophet. He then said, ‘They all are believing people. O Messenger of Allah, describe for me the qualities of the believers.’ “The Messenger of Allah bent down his head for a while, then he raised his head and said, ‘There are twenty qualities in a believer without which his belief is not complete. Of the qualities of the believing people, O Ali, is their presence in prayer, quick payment of al-Zakat (charity), feeding the destitute, placing of their hand on the heads of the orphans (to comfort them), cleansing of their clothes, and their tying up their waist with covering. They are those who do not lie when speaking, do not disregard their promise, and do not violate their trust. They tell the truth when they speak up, at night they are monks and are lions during the day. During the days they fast and stand up for worship at night. They do not harm the neighbors and the neighbors do not experience any harm from them. They are those who walk on earth in humble manners, and their steps move to the homes of the widows (to help) and in the procession for funerals. May Allah make us of the pious ones.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/233)"
          }
        },
        "Hadith #9": {
          "Title": "Al-Kafi - Volume 2: A Believer’s Signs and Qualities",
          "Link": "https://thaqalayn.net/hadith/2/1/99/9",
          "Arabic Text": "9ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ مَنْصُورٍ بُزُرْجَ عَنْ مُفَضَّلٍ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) إِيَّاكَ وَالسَّفِلَةَ فَإِنَّمَا شِيعَةُ عَلِيٍّ مَنْ عَفَّ بَطْنُهُ وَفَرْجُهُ وَاشْتَدَّ جِهَادُهُ وَعَمِلَ لِخَالِقِهِ وَرَجَا ثَوَابَهُ وَخَافَ عِقَابَهُ فَإِذَا رَأَيْتَ أُولَئِكَ فَأُولَئِكَ شِيعَةُ جَعْفَرٍ.",
          "English Text": "9. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn ‘Isma’il from Mansur Bazarj from Mufaddal who has said the following: “Abu ‘Abd Allah  has said, ‘Beware of the thoughtless people. Shi’a (followers) of Ali  are only those whose stomach and private parts are chaste, and are intensely involved in Jihad. They work for the sake of their Creator in the hope for His rewards and for fear of His punishment. If you see such people they are the Shi’a (followers) of Ja’far ibn Muhammad .’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مختلف فيه ومعتبر عند ي    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/239)"
          }
        }
      },
      "Chapter #101": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 2: Accepting the Gift of Belief and to Exercise Patience in all Matters Thereafter",
          "Link": "https://thaqalayn.net/hadith/2/1/101/2",
          "Arabic Text": "2ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنِ ابْنِ مُسْكَانَ عَنْ مُعَلَّى بْنِ خُنَيْسٍ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) قَالَ الله تَبَارَكَ وَتَعَالَى لَوْ لَمْ يَكُنْ فِي الأرْضِ إِلا مُؤْمِنٌ وَاحِدٌ لاسْتَغْنَيْتُ بِهِ عَنْ جَمِيعِ خَلْقِي وَلَجَعَلْتُ لَهُ مِنْ إِيمَانِهِ أُنْساً لا يَحْتَاجُ إِلَى أَحَدٍ.",
          "English Text": "2. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from ibn Muskan from Mu’alla ibn Khanis from Abu ‘Abdillah  who has said the following: “The Messenger of Allah has said, ‘Allah, the Most Blessed, the Most High, has said, “Had there not been more than one believer on earth, he would have been sufficient for Me in place of all of My other creatures and I would have made his belief to provide him good company to help him live independent of all creatures.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مختلف فيه بالمعلى معتبر عند ي   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/292)"
          }
        }
      },
      "Chapter #105": {
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 2: The Matters in Which Allah Has Made a Covenant With Believing People in Exchange for Their Exercising Patience in Their Suffering",
          "Link": "https://thaqalayn.net/hadith/2/1/105/4",
          "Arabic Text": "4ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ دَاوُدَ بْنِ سِرْحَانَ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيهِ السَّلام) يَقُولُ أَرْبَعٌ لا يَخْلُو مِنْهُنَّ الْمُؤْمِنُ أَوْ وَاحِدَةٍ مِنْهُنَّ مُؤْمِنٌ يَحْسُدُهُ وَهُوَ أَشَدُّهُنَّ عَلَيْهِ وَمُنَافِقٌ يَقْفُو أَثَرَهُ أَوْ عَدُوٌّ يُجَاهِدُهُ أَوْ شَيْطَانٌ يُغْوِيهِ.",
          "English Text": "4. A number of our people have narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad from ibn abu Nasr from Dawud ibn Sarhan who has said the following: “I heard Abu ‘Abdillah  saying, ‘A believer is not without four things or at least one of them at a time: he suffers from the envy of a believer and it is the most difficult one, stalking of a hypocrite, the struggle of an enemy against him or the temptation of Satan.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف على المشهور معتبر   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (314/ 9)"
          }
        },
        "Hadith #8": {
          "Title": "Al-Kafi - Volume 2: The Matters in Which Allah Has Made a Covenant With Believing People in Exchange for Their Exercising Patience in Their Suffering",
          "Link": "https://thaqalayn.net/hadith/2/1/105/8",
          "Arabic Text": "8ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَجَّالِ عَنْ دَاوُدَ بْنِ أَبِي يَزِيدَ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ الْمُؤْمِنُ مُكَفَّرٌ. وَفِي رِوَايَةٍ أُخْرَى وَذَلِكَ أَنَّ مَعْرُوفَهُ يَصْعَدُ إِلَى الله فَلا يُنْشَرُ فِي النَّاسِ وَالْكَافِرُ مَشْكُورٌ.",
          "English Text": "8. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Hajjal from Dawud ibn abu Yazid from Abu ‘Abdillah  who has said the following: “Abu ‘Abd Allah  has said, ‘A believer is not appreciated.’ It is narrated in another Hadith : ‘This is because the virtues of a believer are taken to Allah, thus, they do not spread among the people and an unbeliever is appreciated.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " صحيح وآخره مرسل   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/317)"
          }
        }
      },
      "Chapter #106": {
        "Hadith #20": {
          "Title": "Al-Kafi - Volume 2: The Severity of the Trial of a Believer",
          "Link": "https://thaqalayn.net/hadith/2/1/106/20",
          "Arabic Text": "20ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ الله عَنْ نُوحِ بْنِ شُعَيْبٍ عَنْ أَبِي دَاوُدَ الْمُسْتَرِقِّ رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) دُعِيَ النَّبِيُّ (صَلَّى اللهُ عَلَيْهِ وآلِه) إِلَى طَعَامٍ فَلَمَّا دَخَلَ مَنْزِلَ الرَّجُلِ نَظَرَ إِلَى دَجَاجَةٍ فَوْقَ حَائِطٍ قَدْ بَاضَتْ فَتَقَعُ الْبَيْضَةُ عَلَى وَتِدٍ فِي حَائِطٍ فَثَبَتَتْ عَلَيْهِ وَلَمْ تَسْقُطْ وَلَمْ تَنْكَسِرْ فَتَعَجَّبَ النَّبِيُّ (صَلَّى اللهُ عَلَيْهِ وآلِه) مِنْهَا فَقَالَ لَهُ الرَّجُلُ أَ عَجِبْتَ مِنْ هَذِهِ الْبَيْضَةِ فَوَ الَّذِي بَعَثَكَ بِالْحَقِّ مَا رُزِئْتُ شَيْئاً قَطُّ قَالَ فَنَهَضَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) وَلَمْ يَأْكُلْ مِنْ طَعَامِهِ شَيْئاً وَقَالَ مَنْ لَمْ يُرْزَأْ فَمَا لله فِيهِ مِنْ حَاجَةٍ.",
          "English Text": "20. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from Nuh ibn Shu’ayb from abu Dawud al-Mustariqq in a marfu’ manner from Abu ‘Abdillah  who has said the following: “Once, the Holy Prophet was invited for food. When he entered the house he saw a hen that had laid an egg on a wall and it fell on the top of a stake. It stayed there and did not fall off or break. The Holy Prophet expressed astonishment and the man said, ‘Were you astonished because of this egg? I swear by the One who has sent you with the truth that I have never suffered any loss.’ The Imam said, ‘The Holy Prophet then stood up and left without having any food saying, ‘One who does not suffer any losses, Allah is not interested in him.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (9/337)"
          }
        }
      },
      "Chapter #107": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 2: The Excellence of the Poor Muslims",
          "Link": "https://thaqalayn.net/hadith/2/1/107/3",
          "Arabic Text": "3ـ وَعَنْهُ رَفَعَهُ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) يَا عَلِيُّ إِنَّ الله جَعَلَ الْفَقْرَ أَمَانَةً عِنْدَ خَلْقِهِ فَمَنْ سَتَرَهُ أَعْطَاهُ الله مِثْلَ أَجْرِ الصَّائِمِ الْقَائِمِ وَمَنْ أَفْشَاهُ إِلَى مَنْ يَقْدِرُ عَلَى قَضَاءِ حَاجَتِهِ فَلَمْ يَفْعَلْ فَقَدْ قَتَلَهُ أَمَا إِنَّهُ مَا قَتَلَهُ بِسَيْفٍ وَلا رُمْحٍ وَلَكِنَّهُ قَتَلَهُ بِمَا نَكَى مِنْ قَلْبِهِ.",
          "English Text": "3. It is narrated from him (narrator of the Hadith above) in a marfu’ manner from Abu ‘Abdillah  who has said the following: “The Messenger of Allah has said, ‘O Ali, Allah has made poverty a trust in His creatures. Whoever hides it, Allah grants him a reward equal to the reward for a fasting person who stands at night to worship Allah. One who reveals it to a person, who is able to help but does not help, it is then as if he has killed him. Although he has not killed him with a sword, or with a spear, but has done so by breaking his heart.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (357/ 9)"
          }
        },
        "Hadith #6": {
          "Title": "Al-Kafi - Volume 2: The Excellence of the Poor Muslims",
          "Link": "https://thaqalayn.net/hadith/2/1/107/6",
          "Arabic Text": "6ـ عَنْهُ عَنْ بَعْضِ أَصْحَابِهِ رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) مَا أُعْطِيَ عَبْدٌ مِنَ الدُّنْيَا إِلا اعْتِبَاراً وَمَا زُوِيَ عَنْهُ إِلا اخْتِبَاراً.",
          "English Text": "6. It is narrated from him (narrator of the Hadith above) from certain individuals of his people in a marfu’ manner from Abu ‘Abdillah  who has said the following: “Whatever a servant is given of worldly things is to make him learn a lesson and whatever is withheld from him is to place him under the trial.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (359/ 9)"
          }
        }
      },
      "Chapter #111": {
        "Hadith #28": {
          "Title": "Al-Kafi - Volume 2: The Sins",
          "Link": "https://thaqalayn.net/hadith/2/1/111/28",
          "Arabic Text": "28ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ رَفَعَهُ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ (عَلَيهِ السَّلام) لا وَجَعَ أَوْجَعُ لِلْقُلُوبِ مِنَ الذُّنُوبِ وَلا خَوْفَ أَشَدُّ مِنَ الْمَوْتِ وَكَفَى بِمَا سَلَفَ تَفَكُّراً وَكَفَى بِالْمَوْتِ وَاعِظاً.",
          "English Text": "28. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus in a marfu’ manner from Amir al-Mu’minin, Ali ibn abu Talib  who has said the following: “No pain is more painful to the heart than sins and there is no fear more intense than fear of death. Past experience is enough material for thinking and death is more than enough a preacher.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (427/ 9)"
          }
        }
      },
      "Chapter #112": {
        "Hadith #9": {
          "Title": "Al-Kafi - Volume 2: The Major Sins",
          "Link": "https://thaqalayn.net/hadith/2/1/112/9",
          "Arabic Text": "9ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ حَبِيبٍ عَنْ عَبْدِ الله بْنِ عَبْدِ الرَّحْمَنِ الأصَمِّ عَنْ عَبْدِ الله بْنِ مُسْكَانَ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ (صَلَّى اللهُ عَلَيْهِ وآلِه) مَا مِنْ عَبْدٍ إِلا وَعَلَيْهِ أَرْبَعُونَ جُنَّةً حَتَّى يَعْمَلَ أَرْبَعِينَ كَبِيرَةً فَإِذَا عَمِلَ أَرْبَعِينَ كَبِيرَةً انْكَشَفَتْ عَنْهُ الْجُنَنُ فَيُوحِي الله إِلَيْهِمْ أَنِ اسْتُرُوا عَبْدِي بِأَجْنِحَتِكُمْ فَتَسْتُرُهُ الْمَلائِكَةُ بِأَجْنِحَتِهَا قَالَ فَمَا يَدَعُ شَيْئاً مِنَ الْقَبِيحِ إِلا قَارَفَهُ حَتَّى يَمْتَدِحَ إِلَى النَّاسِ بِفِعْلِهِ الْقَبِيحِ فَيَقُولُ الْمَلائِكَةُ يَا رَبِّ هَذَا عَبْدُكَ مَا يَدَعُ شَيْئاً إِلا رَكِبَهُ وَإِنَّا لَنَسْتَحْيِي مِمَّا يَصْنَعُ فَيُوحِي الله عَزَّ وَجَلَّ إِلَيْهِمْ أَنِ ارْفَعُوا أَجْنِحَتَكُمْ عَنْهُ فَإِذَا فُعِلَ ذَلِكَ أَخَذَ فِي بُغْضِنَا أَهْلَ الْبَيْتِ فَعِنْدَ ذَلِكَ يَنْهَتِكُ سِتْرُهُ فِي السَّمَاءِ وَسِتْرُهُ فِي الأرْضِ فَيَقُولُ الْمَلائِكَةُ يَا رَبِّ هَذَا عَبْدُكَ قَدْ بَقِيَ مَهْتُوكَ السِّتْرِ فَيُوحِي الله عَزَّ وَجَلَّ إِلَيْهِمْ لَوْ كَانَتْ لله فِيهِ حَاجَةٌ مَا أَمَرَكُمْ أَنْ تَرْفَعُوا أَجْنِحَتَكُمْ عَنْهُ. وَرَوَاهُ ابْنُ فَضَّالٍ عَنِ ابْنِ مُسْكَانَ.",
          "English Text": "9. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from Muhammad ibn Habib from ‘Abd Allah ibn ‘Abd al-Rahman al-Asamm from ‘Abd Allah ibn Muskan from Abu ‘Abdillah  who has said the following: “Amir al-Mu’minin, Ali ibn abu Talib  has said, ‘There is no believer without forty shields on him until he commits forty major sins. When he commits forty major sins, the shields are removed. Allah then sends revelations to them (angels), “Cover My servant with your wings,” and the angels cover him with their wings. The Imam then said, ‘He then leaves no evil deeds without committing, praising himself among people for his evil deeds. The angels will say, ‘Lord, Your servant has left no evil deed uncommitted and we feel embarrassed for what he does. Allah, the Most Majestic, the Most Holy, will reveal this to them, ‘Move your wings away from him.’ When they do this he then is held responsible for his animosity to us (Ahl al-Bayt). At this point his privacy is disregarded in heaven and on earth and the angels will say, ‘O Lord Your servant is disgraced.’ Allah, the Most Majestic, the Most Holy, will reveal this to them: ‘Had Allah any interest in him He would not have commanded you to remove your wings from him.’” Ibn Faddal has narrated a similar Hadith from ibn Muskan. ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف وسنده الثاني موثق كالصحيح  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/21)"
          }
        },
        "Hadith #16": {
          "Title": "Al-Kafi - Volume 2: The Major Sins",
          "Link": "https://thaqalayn.net/hadith/2/1/112/16",
          "Arabic Text": "16ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ رَفَعَهُ عَنْ مُحَمَّدِ بْنِ دَاوُدَ الْغَنَوِيِّ عَنِ الأصْبَغِ بْنِ نُبَاتَةَ قَالَ جَاءَ رَجُلٌ إِلَى أَمِيرِ الْمُؤْمِنِينَ (صَلَّى اللهُ عَلَيْهِ وآلِه) فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ إِنَّ نَاساً زَعَمُوا أَنَّ الْعَبْدَ لا يَزْنِي وَهُوَ مُؤْمِنٌ وَلا يَسْرِقُ وَهُوَ مُؤْمِنٌ وَلا يَشْرَبُ الْخَمْرَ وَهُوَ مُؤْمِنٌ وَلا يَأْكُلُ الرِّبَا وَهُوَ مُؤْمِنٌ وَلا يَسْفِكُ الدَّمَ الْحَرَامَ وَهُوَ مُؤْمِنٌ فَقَدْ ثَقُلَ عَلَيَّ هَذَا وَحَرِجَ مِنْهُ صَدْرِي حِينَ أَزْعُمُ أَنَّ هَذَا الْعَبْدَ يُصَلِّي صَلاتِي وَيَدْعُو دُعَائِي وَيُنَاكِحُنِي وَأُنَاكِحُهُ وَيُوَارِثُنِي وَأُوَارِثُهُ وَقَدْ خَرَجَ مِنَ الإيمَانِ مِنْ أَجْلِ ذَنْبٍ يَسِيرٍ أَصَابَهُ فَقَالَ أَمِيرُ الْمُؤْمِنِينَ (صَلَّى اللهُ عَلَيْهِ وآلِه) صَدَقْتَ سَمِعْتُ رَسُولَ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) يَقُولُ وَالدَّلِيلُ عَلَيْهِ كِتَابُ الله خَلَقَ الله عَزَّ وَجَلَّ النَّاسَ عَلَى ثَلاثِ طَبَقَاتٍ وَأَنْزَلَهُمْ ثَلاثَ مَنَازِلَ وَذَلِكَ قَوْلُ الله عَزَّ وَجَلَّ فِي الْكِتَابِ أَصْحَابُ الْمَيْمَنَةِ وَأَصْحَابُ الْمَشْأَمَةِ وَالسَّابِقُونَ فَأَمَّا مَا ذَكَرَ مِنْ أَمْرِ السَّابِقِينَ فَإِنَّهُمْ أَنْبِيَاءُ مُرْسَلُونَ وَغَيْرُ مُرْسَلِينَ جَعَلَ الله فِيهِمْ خَمْسَةَ أَرْوَاحٍ رُوحَ الْقُدُسِ وَرُوحَ الإيمَانِ وَرُوحَ الْقُوَّةِ وَرُوحَ الشَّهْوَةِ وَرُوحَ الْبَدَنِ فَبِرُوحِ الْقُدُسِ بُعِثُوا أَنْبِيَاءَ مُرْسَلِينَ وَغَيْرَ مُرْسَلِينَ وَبِهَا عَلِمُوا الأشْيَاءَ وَبِرُوحِ الإيمَانِ عَبَدُوا الله وَلَمْ يُشْرِكُوا بِهِ شَيْئاً وَبِرُوحِ الْقُوَّةِ جَاهَدُوا عَدُوَّهُمْ وَعَالَجُوا مَعَاشَهُمْ وَبِرُوحِ الشَّهْوَةِ أَصَابُوا لَذِيذَ الطَّعَامِ وَنَكَحُوا الْحَلالَ مِنْ شَبَابِ النِّسَاءِ وَبِرُوحِ الْبَدَنِ دَبُّوا وَدَرَجُوا فَهَؤُلاءِ مَغْفُورٌ لَهُمْ مَصْفُوحٌ عَنْ ذُنُوبِهِمْ ثُمَّ قَالَ قَالَ الله عَزَّ وَجَلَّ تِلْكَ الرُّسُلُ فَضَّلْنا بَعْضَهُمْ عَلى‏ بَعْضٍ مِنْهُمْ مَنْ كَلَّمَ الله وَرَفَعَ بَعْضَهُمْ دَرَجاتٍ وَآتَيْنا عِيسَى ابْنَ مَرْيَمَ الْبَيِّناتِ وَأَيَّدْناهُ بِرُوحِ الْقُدُسِ ثُمَّ قَالَ فِي جَمَاعَتِهِمْ وَأَيَّدَهُمْ بِرُوحٍ مِنْهُ يَقُولُ أَكْرَمَهُمْ بِهَا فَفَضَّلَهُمْ عَلَى مَنْ سِوَاهُمْ فَهَؤُلاءِ مَغْفُورٌ لَهُمْ مَصْفُوحٌ عَنْ ذُنُوبِهِمْ ثُمَّ ذَكَرَ أَصْحَابَ الْمَيْمَنَةِ وَهُمُ الْمُؤْمِنُونَ حَقّاً بِأَعْيَانِهِمْ جَعَلَ الله فِيهِمْ أَرْبَعَةَ أَرْوَاحٍ رُوحَ الإيمَانِ وَرُوحَ الْقُوَّةِ وَرُوحَ الشَّهْوَةِ وَرُوحَ الْبَدَنِ فَلا يَزَالُ الْعَبْدُ يَسْتَكْمِلُ هَذِهِ الأرْوَاحَ الأرْبَعَةَ حَتَّى تَأْتِيَ عَلَيْهِ حَالاتٌ فَقَالَ الرَّجُلُ يَا أَمِيرَ الْمُؤْمِنِينَ مَا هَذِهِ الْحَالاتُ فَقَالَ أَمَّا أُولاهُنَّ فَهُوَ كَمَا قَالَ الله عَزَّ وَجَلَّ وَمِنْكُمْ مَنْ يُرَدُّ إِلى‏ أَرْذَلِ الْعُمُرِ لِكَيْ لا يَعْلَمَ بَعْدَ عِلْمٍ شَيْئاً فَهَذَا يَنْتَقِصُ مِنْهُ جَمِيعُ الأرْوَاحِ وَلَيْسَ بِالَّذِي يَخْرُجُ مِنْ دِينِ الله لأنَّ الْفَاعِلَ بِهِ رَدَّهُ إِلَى أَرْذَلِ عُمُرِهِ فَهُوَ لا يَعْرِفُ لِلصَّلاةِ وَقْتاً وَلا يَسْتَطِيعُ التَّهَجُّدَ بِاللَّيْلِ وَلا بِالنَّهَارِ وَلا الْقِيَامَ فِي الصَّفِّ مَعَ النَّاسِ فَهَذَا نُقْصَانٌ مِنْ رُوحِ الإيمَانِ وَلَيْسَ يَضُرُّهُ شَيْئاً وَمِنْهُمْ مَنْ يَنْتَقِصُ مِنْهُ رُوحُ الْقُوَّةِ فَلا يَسْتَطِيعُ جِهَادَ عَدُوِّهِ وَلا يَسْتَطِيعُ طَلَبَ الْمَعِيشَةِ وَمِنْهُمْ مَنْ يَنْتَقِصُ مِنْهُ رُوحُ الشَّهْوَةِ فَلَوْ مَرَّتْ بِهِ أَصْبَحُ بَنَاتِ آدَمَ لَمْ يَحِنَّ إِلَيْهَا وَلَمْ يَقُمْ وَتَبْقَى رُوحُ الْبَدَنِ فِيهِ فَهُوَ يَدِبُّ وَيَدْرُجُ حَتَّى يَأْتِيَهُ مَلَكُ الْمَوْتِ فَهَذَا الْحَالُ خَيْرٌ لأنَّ الله عَزَّ وَجَلَّ هُوَ الْفَاعِلُ بِهِ وَقَدْ تَأْتِي عَلَيْهِ حَالاتٌ فِي قُوَّتِهِ وَشَبَابِهِ فَيَهُمُّ بِالْخَطِيئَةِ فَيُشَجِّعُهُ رُوحُ الْقُوَّةِ وَيُزَيِّنُ لَهُ رُوحُ الشَّهْوَةِ وَيَقُودُهُ رُوحُ الْبَدَنِ حَتَّى تُوْقِعَهُ فِي الْخَطِيئَةِ فَإِذَا لامَسَهَا نَقَصَ مِنَ الإيمَانِ وَتَفَصَّى مِنْهُ فَلَيْسَ يَعُودُ فِيهِ حَتَّى يَتُوبَ فَإِذَا تَابَ تَابَ الله عَلَيْهِ وَإِنْ عَادَ أَدْخَلَهُ الله نَارَ جَهَنَّمَ فَأَمَّا أَصْحَابُ الْمَشْأَمَةِ فَهُمُ الْيَهُودُ وَالنَّصَارَى يَقُولُ الله عَزَّ وَجَلَّ الَّذِينَ آتَيْناهُمُ الْكِتابَ يَعْرِفُونَهُ كَما يَعْرِفُونَ أَبْناءَهُمْ يَعْرِفُونَ مُحَمَّداً وَالْوَلايَةَ فِي التَّوْرَاةِ وَالإنْجِيلِ كَمَا يَعْرِفُونَ أَبْنَاءَهُمْ فِي مَنَازِلِهِمْ وَإِنَّ فَرِيقاً مِنْهُمْ لَيَكْتُمُونَ الْحَقَّ وَهُمْ يَعْلَمُونَ الْحَقُّ مِنْ رَبِّكَ أَنَّكَ الرَّسُولُ إِلَيْهِمْ فَلا تَكُونَنَّ مِنَ الْمُمْتَرِينَ فَلَمَّا جَحَدُوا مَا عَرَفُوا ابْتَلاهُمُ الله بِذَلِكَ فَسَلَبَهُمْ رُوحَ الإيمَانِ وَأَسْكَنَ أَبْدَانَهُمْ ثَلاثَةَ أَرْوَاحٍ رُوحَ الْقُوَّةِ وَرُوحَ الشَّهْوَةِ وَرُوحَ الْبَدَنِ ثُمَّ أَضَافَهُمْ إِلَى الأنْعَامِ فَقَالَ إِنْ هُمْ إِلا كَالأنْعامِ لأنَّ الدَّابَّةَ إِنَّمَا تَحْمِلُ بِرُوحِ الْقُوَّةِ وَتَعْتَلِفُ بِرُوحِ الشَّهْوَةِ وَتَسِيرُ بِرُوحِ الْبَدَنِ فَقَالَ لَهُ السَّائِلُ أَحْيَيْتَ قَلْبِي بِإِذْنِ الله يَا أَمِيرَ الْمُؤْمِنِينَ.",
          "English Text": "16. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from his father in a marfu’ manner from Muhammad ibn Dawud al-Ghanawi from Asbagh ibn Nubatah who has said the following: “Once a man came to Amir al-Mu’minin, Ali ibn abu Talib  and said, ‘O Amir al- Mu’minin, certain people think a servant of Allah, who is a believer, does not fornicate, commit theft, drink wine, consume unlawful interest in trade, and does not spill blood that is not lawful to spill. This has become heavy on me and my chest feels constrained when 1 think that this servant (of Allah) prays the way I do, pleads to Allah the way I do, marries from us and agrees we marry from them, he can inherit us and I can inherit him but is out of belief just because of a few sins. ’ Amir al- Mu’minin, Ali ibn abu Talib  said, ‘You spoke the truth. I heard the Messenger of Allah saying, and evidence to it is the book of Allah, the Most Majestic, the Most Holy, ‘People are of three categories and of three stages as mentioned in the book of Allah, the Most Majestic, the Most Holy: people of the right, people of the left and the foremost people. The foremost people are the Messenger prophets and non-Messenger prophets. In these people Allah has placed five spirits: The Holy Spirit, the spirit of belief, the spirit of power, the spirit of desire and the spirit of the body. With the Holy Spirit they were raised as the prophets who were Messengers and non-Messengers and with this they received the knowledge about things. With the spirit of belief they worshipped Allah and did not consider anything as His partners. With the spirit of power they performed Jihad (hard work in the way of Allah) and managed their living. With the spirit of desire they enjoyed food, lawful carnal relations with young women. With the spirit of the body they were able to move and walk around. These people are forgiven and no sin is recorded against them. Then he (the Messenger of Allah) said, ‘Allah, the Most Majestic, the Most Holy, has said, ‘We gave certain ones of Our Messengers preference over others. There are those to whom Allah spoke and He raised the rank of certain others. We gave authoritative proof to Jesus, son of Mary, and supported him by means of the Holy Spirit. . . .’ (2:253) Then about one group He has said, ‘He has supported them with a spirit from Him.’ He (Allah) says that He has given them honor with it and has granted excellence over the others. These are forgiven and no sins are recorded against them.’ “He (the Messenger of Allah) then mentioned the people of the right hand and they are the believers in truth, in reality. Allah has placed four spirits in them: The spirit of belief, the spirit of power, the spirit of desire and the spirit of the body. A servant continues to perfect these four spirits and goes through conditions.’ The man then asked, ‘O Amir al-Mu’minin, what are these conditions?’ The Imam said, ‘The first condition is as Allah, the Most Majestic, the Most Holy, has said, ‘Certain individuals among you will grow to an extremely old age and lose their memory. . . .’ (16:70) All the spirits in him reduce and it is not a case wherein he is out of the religion of Allah. It is because the agent has returned him to the weakest point of life. He does not recognize the time for prayer, he is not able to perform Tahajjud (prayer at night) nor is he able to stand up in line with people. It is a reduction in the spirit of belief but it does not harm him. In certain ones of them the spirit of power is reduced; thus, they are not able to fight the enemy or make a living. In others the spirit of desire is reduced and a time comes when the daughters of Adam show no passion for him; he does not stand up. The spirit of the body remains with him. He moves and walks around until the angel of death comes. This condition is good because Allah, the Most Majestic, the Most Holy, is the power behind it. He faces other conditions when he is strong and young. He thinks of committing sins and the spirit of power encourages him, the spirit of desire makes it attractive to him and the spirit of the body leads him until he falls in sin. If he faces weakness in belief and it moves away from him it (belief) will not return to him before repentance. If he then repents, Allah turns to him (with forgiveness) but if he repeats the sin, Allah sends him to fire.’ “The people of the left are the Jews and the Christians as Allah, the Most Majestic, the Most Holy, has said, ‘Those to whom We have given the Book (Bible) know you (Muhammad) just as good as they know their sons.’ They know Muhammad and al- Walayah (the status of people who possess Divine Authority) from the Torah and the Gospel just as they know their sons in their homes. ‘ ... It is clear that certain individuals among them deliberately hide the truth. (2:146) Never doubt that the essence of truth (that you are the Messenger of Allah to them) comes from your Lord.’ (2:147) When they rejected what they knew Allah placed them under the trial. He removed the spirit of belief from them and allowed the three spirits to remain in them: The spirit of power, the spirit of desire and the spirit of the body. Thereafter He added them to the animals saying, ‘They are like cattle or even more, straying and confused.’ (25:44) The animals carry loads because of the spirit of power, feed themselves because of the spirit of desire and move around because of the spirit of the body.’ The man who had asked the question then said, ‘You brought life to my heart by the permission of Allah, O Amir al-Mu’minin .’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/29)"
          }
        },
        "Hadith #21": {
          "Title": "Al-Kafi - Volume 2: The Major Sins",
          "Link": "https://thaqalayn.net/hadith/2/1/112/21",
          "Arabic Text": "21ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُحَمَّدِ بْنِ حَكِيمٍ قَالَ قُلْتُ لأبِي الْحَسَنِ (عَلَيهِ السَّلام) الْكَبَائِرُ تُخْرِجُ مِنَ الإيمَانِ فَقَالَ نَعَمْ وَمَا دُونَ الْكَبَائِرِ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) لا يَزْنِي الزَّانِي وَهُوَ مُؤْمِنٌ وَلا يَسْرِقُ السَّارِقُ وَهُوَ مُؤْمِنٌ.",
          "English Text": "21. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from Muhammad ibn Hakim who has said the following: “I asked abu al-Hassan  ‘Does committing a major sin remove one away from belief?’ The Imam said, ‘Yes, even less than major sins do. The Messenger of Allah has said, “A fornicator does not commit such a thing while he is a believer and a thief does not steal while he is a believer.’”” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " حسن على الظاهر وقد يعد مجهول   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/44)"
          }
        }
      },
      "Chapter #116": {
        "Hadith #10": {
          "Title": "Al-Kafi - Volume 2: Showing off",
          "Link": "https://thaqalayn.net/hadith/2/1/116/10",
          "Arabic Text": "10ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ دَاوُدَ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ مَنْ أَظْهَرَ لِلنَّاسِ مَا يُحِبُّ الله وَبَارَزَ الله بِمَا كَرِهَهُ لَقِيَ الله وَهُوَ مَاقِتٌ لَهُ.",
          "English Text": "10. Ali ibn Ibrahim has narrated from his father from ibn Mahbub from Dawud from Abu ‘Abdillah  who has said the following: “Whoever shows off to people an act that Allah loves and opposes Allah with what He dislikes (showoff), he will find Allah at war with him.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مختلف فيه   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/111)"
          }
        }
      },
      "Chapter #117": {
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 2: Seeking Leadership",
          "Link": "https://thaqalayn.net/hadith/2/1/117/4",
          "Arabic Text": "4ـ عَنْهُ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ وَغَيْرِهِ رَفَعُوهُ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) مَلْعُونٌ مَنْ تَرَأَّسَ مَلْعُونٌ مَنْ هَمَّ بِهَا مَلْعُونٌ مَنْ حَدَّثَ بِهَا نَفْسَهُ.",
          "English Text": "4. It is narrated from him (narrator of the Hadith above) from Muhammad ibn Isma’il ibn Bazi’ and others in a marfu’ manner who has said the following: “Abu ‘Abd Allah  has said, ‘Condemned is one who seeks leadership, condemned is one who intends to become a leader and condemned is one who speaks to himself of leadership.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/123)"
          }
        }
      },
      "Chapter #119": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 2: Preaching Justice without Practice",
          "Link": "https://thaqalayn.net/hadith/2/1/119/1",
          "Arabic Text": "1ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ يُوسُفَ الْبَزَّازِ عَنْ مُعَلَّى بْنِ خُنَيْسٍ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) أَنَّهُ قَالَ إِنَّ مِنْ أَشَدِّ النَّاسِ حَسْرَةً يَوْمَ الْقِيَامَةِ مَنْ وَصَفَ عَدْلاً ثُمَّ عَمِلَ بِغَيْرِهِ.",
          "English Text": "1. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from Yusuf al- Bazzaz from Mu’alla ibn Khanis from Abu ‘Abdillah  who has said the following: “One who, on the Day of Judgment, will regret the most is he who preaches justice but himself acts otherwise.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مختلف فيه   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/127)"
          }
        }
      },
      "Chapter #120": {
        "Hadith #12": {
          "Title": "Al-Kafi - Volume 2: Disputation, Quarrels and Animosity to Men",
          "Link": "https://thaqalayn.net/hadith/2/1/120/12",
          "Arabic Text": "12ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ الله عَنْ بَعْضِ أَصْحَابِهِ رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) مَنْ زَرَعَ الْعَدَاوَةَ حَصَدَ مَا بَذَرَ. ",
          "English Text": "12. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from certain individuals of his people in a marfu’ manner the following: “Abu ‘Abd Allah  has said, ‘Whoever plants animosity will reap what he has sown.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/141)"
          }
        }
      },
      "Chapter #121": {
        "Hadith #7": {
          "Title": "Al-Kafi - Volume 2: Anger",
          "Link": "https://thaqalayn.net/hadith/2/1/121/7",
          "Arabic Text": "7ـ عَنْهُ عَنِ ابْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ حَبِيبٍ السِّجِسْتَانِيِّ عَنْ أَبِي جَعْفَرٍ (عَلَيهِ السَّلام) قَالَ مَكْتُوبٌ فِي التَّوْرَاةِ فِيمَا نَاجَى الله عَزَّ وَجَلَّ بِهِ مُوسَى (عَلَيهِ السَّلام) يَا مُوسَى أَمْسِكْ غَضَبَكَ عَمَّنْ مَلَّكْتُكَ عَلَيْهِ أَكُفَّ عَنْكَ غَضَبِي.",
          "English Text": "7. It is narrated from him (narrator of the Hadith above) from ibn Mahbub from Hisham ibn Salim from Habib al-Sajistani from abu Ja’far  who has said the following: “It is written in the Torah of the conversations of Musa and Allah, the Most Majestic, the Most Holy, ‘O Moses, control your anger against those whom I have given you to own, I will keep my anger away from you.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول أو حسن   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/150)"
          }
        },
        "Hadith #13": {
          "Title": "Al-Kafi - Volume 2: Anger",
          "Link": "https://thaqalayn.net/hadith/2/1/121/13",
          "Arabic Text": "13ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ الله عَنْ بَعْضِ أَصْحَابِهِ رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) الْغَضَبُ مَمْحَقَةٌ لِقَلْبِ الْحَكِيمِ وَقَالَ مَنْ لَمْ يَمْلِكْ غَضَبَهُ لَمْ يَمْلِكْ عَقْلَهُ.",
          "English Text": "13. A number of our people have narrated from Ahmad ibn ‘Abd Allah from certain individuals of his people in a marfu’ manner has said the following: “Abu ‘Abd Allah  has said, ‘Anger darkens the heart of a wise person.’ The Imam then said, ‘One who loses control of his anger loses his power of reason.”’ ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/153)"
          }
        }
      },
      "Chapter #122": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 2: Envy",
          "Link": "https://thaqalayn.net/hadith/2/1/122/3",
          "Arabic Text": "3ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ دَاوُدَ الرَّقِّيِّ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيهِ السَّلام) يَقُولُ اتَّقُوا الله وَلا يَحْسُدْ بَعْضُكُمْ بَعْضاً إِنَّ عِيسَى ابْنَ مَرْيَمَ كَانَ مِنْ شَرَائِعِهِ السَّيْحُ فِي الْبِلادِ فَخَرَجَ فِي بَعْضِ سَيْحِهِ وَمَعَهُ رَجُلٌ مِنْ أَصْحَابِهِ قَصِيرٌ وَكَانَ كَثِيرَ اللُّزُومِ لِعِيسَى (عَلَيهِ السَّلام) فَلَمَّا انْتَهَى عِيسَى إِلَى الْبَحْرِ قَالَ بِسْمِ الله بِصِحَّةِ يَقِينٍ مِنْهُ فَمَشَى عَلَى ظَهْرِ الْمَاءِ فَقَالَ الرَّجُلُ الْقَصِيرُ حِينَ نَظَرَ إِلَى عِيسَى (عَلَيهِ السَّلام) جَازَهُ بِسْمِ الله بِصِحَّةِ يَقِينٍ مِنْهُ فَمَشَى عَلَى الْمَاءِ وَلَحِقَ بِعِيسَى (عَلَيهِ السَّلام) فَدَخَلَهُ الْعُجْبُ بِنَفْسِهِ فَقَالَ هَذَا عِيسَى رُوحُ الله يَمْشِي عَلَى الْمَاءِ وَأَنَا أَمْشِي عَلَى الْمَاءِ فَمَا فَضْلُهُ عَلَيَّ قَالَ فَرُمِسَ فِي الْمَاءِ فَاسْتَغَاثَ بِعِيسَى فَتَنَاوَلَهُ مِنَ الْمَاءِ فَأَخْرَجَهُ ثُمَّ قَالَ لَهُ مَا قُلْتَ يَا قَصِيرُ قَالَ قُلْتُ هَذَا رُوحُ الله يَمْشِي عَلَى الْمَاءِ وَأَنَا أَمْشِي عَلَى الْمَاءِ فَدَخَلَنِي مِنْ ذَلِكَ عُجْبٌ فَقَالَ لَهُ عِيسَى لَقَدْ وَضَعْتَ نَفْسَكَ فِي غَيْرِ الْمَوْضِعِ الَّذِي وَضَعَكَ الله فِيهِ فَمَقَتَكَ الله عَلَى مَا قُلْتَ فَتُبْ إِلَى الله عَزَّ وَجَلَّ مِمَّا قُلْتَ قَالَ فَتَابَ الرَّجُلُ وَعَادَ إِلَى مَرْتَبَتِهِ الَّتِي وَضَعَهُ الله فِيهَا فَاتَّقُوا الله وَلا يَحْسُدَنَّ بَعْضُكُمْ بَعْضاً.",
          "English Text": "3. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from ibn Mahbub from Dawud al-Riqqi who has said the following: “I heard Abu ‘Abdillah  saying, ‘Be pious before Allah and do not envy each other. It was in the Shari’a of Jesus to travel in the land. During one of his journeys one of his companions, who was of short height, accompanied him very often. When they reached the sea, Jesus with correct certainty said, ‘(I begin) in the name of Allah,’ and began to walk over the water. The short man, looking at Jesus walking over the water, also with correct certainty said, ‘(I begin) in the name of Allah’, walked over the water and reached Jesus. At such time he felt proud of himself and said, ‘This is Jesus, the Spirit of Allah who walks over the water, and I also walk over the water. Why then should he be more excellent than me?’ The Imam said, ‘He then sunk in the water and cried for help from Jesus, who took him out of water and asked, ‘What did you say, O short man?’ He replied, ‘This is Jesus, the Spirit of Allah who walks over the water and I also walk over the water, and I sensed pride inside.’ Jesus said to him, ‘You placed yourself in a place where Allah had not placed it. Allah resented what you said. Repent and return to Allah, the Most Majestic, the Most Holy, because of what you have said.’ The man repented and returned to his position that Allah had given him. Be pious before Allah and no one of you must envy the others.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مختلف فيه وصحته أقو ى  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/163)"
          }
        },
        "Hadith #6": {
          "Title": "Al-Kafi - Volume 2: Envy",
          "Link": "https://thaqalayn.net/hadith/2/1/122/6",
          "Arabic Text": "6ـ يُونُسُ عَنْ دَاوُدَ الرَّقِّيِّ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) قَالَ الله عَزَّ وَجَلَّ لِمُوسَى بْنِ عِمْرَانَ (عَلَيهِ السَّلام) يَا ابْنَ عِمْرَانَ لا تَحْسُدَنَّ النَّاسَ عَلَى مَا آتَيْتُهُمْ مِنْ فَضْلِي وَلا تَمُدَّنَّ عَيْنَيْكَ إِلَى ذَلِكَ وَلا تُتْبِعْهُ نَفْسَكَ فَإِنَّ الْحَاسِدَ سَاخِطٌ لِنِعَمِي صَادٌّ لِقَسْمِيَ الَّذِي قَسَمْتُ بَيْنَ عِبَادِي وَمَنْ يَكُ كَذَلِكَ فَلَسْتُ مِنْهُ وَلَيْسَ مِنِّي.",
          "English Text": "6. Yunus has narrated from Dawud al-Riqqi from Abu ‘Abdillah  who has said the following: “The Messenger of Allah has said, ‘Allah, the Most Majestic, the Most Holy, said to Moses, “O son of ‘Imran, do not envy people for what I have given them of My favors, do not focus your eyes on it (what I have given to people), and do not allow your soul to follow it; an envious person is angry with My bounties, and blocks My distribution (favors) among My servants. Whoever is as such, I am not for him, and he is not from Me.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مختلف فيه صحيح عند ي   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/172)"
          }
        }
      },
      "Chapter #124": {
        "Hadith #12": {
          "Title": "Al-Kafi - Volume 2: Arrogance",
          "Link": "https://thaqalayn.net/hadith/2/1/124/12",
          "Arabic Text": "12ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ غَيْرِ وَاحِدٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ عَمِّهِ يَعْقُوبَ بْنِ سَالِمٍ عَنْ عَبْدِ الأعْلَى عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ قُلْتُ لَهُ مَا الْكِبْرُ فَقَالَ أَعْظَمُ الْكِبْرِ أَنْ تَسْفَهَ الْحَقَّ وَتَغْمِصَ النَّاسَ قُلْتُ وَمَا سَفَهُ الْحَقِّ قَالَ يَجْهَلُ الْحَقَّ وَيَطْعُنُ عَلَى أَهْلِهِ.",
          "English Text": "12. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from more than one person from Ali ibn Asbat from his uncle, Ya’qub ibn Salim from ‘Abd al-‘Ala’ who has said the following: “Once I asked Abu ‘Abdillah  ‘What is arrogance?’ The Imam said, ‘The biggest arrogance is to hoodwink the truth and look down upon the people.’ I then asked, ‘What is to hoodwink the truth and belittle the people?’ The Imam said, ‘It is one’s disregarding and ignoring the truth and his criticizing the people of the truth.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالحسن   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/212)"
          }
        }
      },
      "Chapter #125": {
        "Hadith #7": {
          "Title": "Al-Kafi - Volume 2: Feeling of Self-importance",
          "Link": "https://thaqalayn.net/hadith/2/1/125/7",
          "Arabic Text": "7ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ قُلْتُ لأبِي عَبْدِ الله (عَلَيهِ السَّلام) الرَّجُلُ يَعْمَلُ الْعَمَلَ وَهُوَ خَائِفٌ مُشْفِقٌ ثُمَّ يَعْمَلُ شَيْئاً مِنَ الْبِرِّ فَيَدْخُلُهُ شِبْهُ الْعُجْبِ بِهِ فَقَالَ هُوَ فِي حَالِهِ الأولَى وَهُوَ خَائِفٌ أَحْسَنُ حَالاً مِنْهُ فِي حَالِ عُجْبِهِ.",
          "English Text": "7. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from ‘Abd al-Rahman ibn al-Hajjaj who has said the following: “Once I asked Abu ‘Abdillah  ‘A man performs a deed and he is fearful and worried. Then he performs a good deed that gives him a feeling of self- importance.’ The Imam said, ‘His being in a fearful condition is better than his having a feeling of self-importance.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " كالصحيح   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/224)"
          }
        }
      },
      "Chapter #131": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 2: Abusiveness",
          "Link": "https://thaqalayn.net/hadith/2/1/131/3",
          "Arabic Text": "3ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ أَبَانِ بْنِ أَبِي عَيَّاشٍ عَنْ سُلَيْمِ بْنِ قَيْسٍ عَنْ أَمِيرِ الْمُؤْمِنِينَ (عَلَيهِ السَّلام) قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) إِنَّ الله حَرَّمَ الْجَنَّةَ عَلَى كُلِّ فَحَّاشٍ بَذِي‏ءٍ قَلِيلِ الْحَيَاءِ لا يُبَالِي مَا قَالَ وَلا مَا قِيلَ لَهُ فَإِنَّكَ إِنْ فَتَّشْتَهُ لَمْ تَجِدْهُ إِلا لِغَيَّةٍ أَوْ شِرْكِ شَيْطَانٍ فَقِيلَ يَا رَسُولَ الله وَفِي النَّاسِ شِرْكُ شَيْطَانٍ فَقَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) أَ مَا تَقْرَأُ قَوْلَ الله عَزَّ وَجَلَّ وَشارِكْهُمْ فِي الأمْوالِ وَالأوْلادِ قَالَ وَسَأَلَ رَجُلٌ فَقِيهاً هَلْ فِي النَّاسِ مَنْ لا يُبَالِي مَا قِيلَ لَهُ قَالَ مَنْ تَعَرَّضَ لِلنَّاسِ يَشْتِمُهُمْ وَهُوَ يَعْلَمُ أَنَّهُمْ لا يَتْرُكُونَهُ فَذَلِكَ الَّذِي لا يُبَالِي مَا قَالَ وَلا مَا قِيلَ فِيهِ.",
          "English Text": "3. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from ‘Uthman ibn ‘Isa from ‘Umar ibn ‘Udhaynah from Aban ibn abu ‘Ayyash from Sulaym ibn Qays from Amir al-Mu’minin, Ali ibn abu Talib  who has said the following: “The Messenger of Allah has said, ‘Allah has made paradise unlawful for every abusive, immoral, and (persons) lacking bashfulness who is not concerned about what he says or what is said to him. If (investigated) you find him to be an straying person or a partner of Satan.’ It was asked, O Messenger of Allah, ‘Does Satan become a partner of people?’ the Messenger of Allah said, ‘Have you not read the words of Allah, the Most Majestic, the Most Holy, ‘ . . . share them in their properties and children. . . .’ (17:64) “The narrator has said that a man then asked a one learned in the law (the Imam), ‘Is there among the people anyone who is not concerned about what he says or what is said about him?’ The Imam said, ‘One who disturbs people and abuses them knowing that people do not leave him without a response, such a person is the one who is not concerned about what he says or what is said about him.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مختلف فيه معتبر عند ي   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/270)"
          }
        },
        "Hadith #9": {
          "Title": "Al-Kafi - Volume 2: Abusiveness",
          "Link": "https://thaqalayn.net/hadith/2/1/131/9",
          "Arabic Text": "9ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ أَبِي عُبَيْدَةَ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ الْبَذَاءُ مِنَ الْجَفَاءِ وَالْجَفَاءُ فِي النَّارِ.",
          "English Text": "9. A number of our people have narrated from Sahl ibn Ziyad from ibn Mahbub from ibn Ri’ab from abu ‘Ubaydah from Abu ‘Abdillah  who has said the following: “Abu ‘Abd Allah  has said, ‘Using foul language is injustice and injustice is in the fire.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف على المشهور صحيح عند ي   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/276)"
          }
        }
      },
      "Chapter #134": {
        "Hadith #6": {
          "Title": "Al-Kafi - Volume 2: Pride and Arrogance",
          "Link": "https://thaqalayn.net/hadith/2/1/134/6",
          "Arabic Text": "6ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) آفَةُ الْحَسَبِ الإفْتِخَارُ. ",
          "English Text": "6. Ali ibn Ibrahim has narrated from his father from al-Nawfali from al-Sakuni from Abu ‘Abdillah  who has said the following: “The Messenger of Allah has said, ‘The misfortune for lineage is boastfulness.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " سكت عنه   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/292)"
          }
        }
      },
      "Chapter #136": {
        "Hadith #16": {
          "Title": "Al-Kafi - Volume 2: Injustice, Oppression",
          "Link": "https://thaqalayn.net/hadith/2/1/136/16",
          "Arabic Text": "16ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ طَلْحَةَ بْنِ زَيْدٍ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ الْعَامِلُ بِالظُّلْمِ وَالْمُعِينُ لَهُ وَالرَّاضِي بِهِ شُرَكَاءُ ثَلاثَتُهُمْ.",
          "English Text": "16. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Sinan from Talhah ibn Zayd from Abu ‘Abdillah  who has said the following: “Abu ‘Abd Allah  has said, ‘One acting unjustly, his supporter, and one who agrees with such act are three partners.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف كالموثق   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/305)"
          }
        }
      },
      "Chapter #138": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 2: Evil Plans, Treachery and Deceit",
          "Link": "https://thaqalayn.net/hadith/2/1/138/1",
          "Arabic Text": "1ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ رَفَعَهُ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ (عَلَيهِ السَّلام) لَوْ لا أَنَّ الْمَكْرَ وَالْخَدِيعَةَ فِي النَّارِ لَكُنْتُ أَمْكَرَ النَّاسِ.",
          "English Text": "1. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from Hisham ibn Salim in a marfu’ manner who has said the following: “Amir al-Mu’minin, Ali ibn abu Talib  has said, ‘Had evil planning and deceit not been in the fire, I would have been extremely skillful in evil planning.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع كالحسن   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/318)"
          }
        },
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 2: Evil Plans, Treachery and Deceit",
          "Link": "https://thaqalayn.net/hadith/2/1/138/4",
          "Arabic Text": "4ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ طَلْحَةَ بْنِ زَيْدٍ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ سَأَلْتُهُ عَنْ قَرْيَتَيْنِ مِنْ أَهْلِ الْحَرْبِ لِكُلِّ وَاحِدَةٍ مِنْهُمَا مَلِكٌ عَلَى حِدَةٍ اقْتَتَلُوا ثُمَّ اصْطَلَحُوا ثُمَّ إِنَّ أَحَدَ الْمَلِكَيْنِ غَدَرَ بِصَاحِبِهِ فَجَاءَ إِلَى الْمُسْلِمِينَ فَصَالَحَهُمْ عَلَى أَنْ يَغْزُوَ مَعَهُمْ تِلْكَ الْمَدِينَةَ فَقَالَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) لا يَنْبَغِي لِلْمُسْلِمِينَ أَنْ يَغْدِرُوا وَلا يَأْمُرُوا بِالْغَدْرِ وَلا يُقَاتِلُوا مَعَ الَّذِينَ غَدَرُوا وَلَكِنَّهُمْ يُقَاتِلُونَ الْمُشْرِكِينَ حَيْثُ وَجَدُوهُمْ وَلا يَجُوزُ عَلَيْهِمْ مَا عَاهَدَ عَلَيْهِ الْكُفَّارُ.",
          "English Text": "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Yahya from Talhah ibn Zayd who has said the following: “Once I asked Abu ‘Abdillah  ‘There are two towns of the people in the state of war against the Muslims. Each town has a king. They had a war and then made peace. Thereafter one king acted treacherously against the other king, came to the Muslims and made peace to help him against the other town.’ Abu ‘Abd Allah  said, ‘It is not worthy of the Muslims to act treacherously or command people to act treacherously or fight along side the treacherous people. However, they fight the pagans wherever they find them. The covenant of the unbelievers is not effective.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف كالموثق   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/322)"
          }
        }
      },
      "Chapter #139": {
        "Hadith #14": {
          "Title": "Al-Kafi - Volume 2: Lies and Forgery",
          "Link": "https://thaqalayn.net/hadith/2/1/139/14",
          "Arabic Text": "14ـ عَنْهُ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ مُحَمَّدِ بْنِ سَالِمٍ رَفَعَهُ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ (عَلَيهِ السَّلام) يَنْبَغِي لِلرَّجُلِ الْمُسْلِمِ أَنْ يَجْتَنِبَ مُوَاخَاةَ الْكَذَّابِ فَإِنَّهُ يَكْذِبُ حَتَّى يَجِي‏ءَ بِالصِّدْقِ فَلا يُصَدَّقُ.",
          "English Text": "14. It is narrated from him (narrator of the Hadith above) from ‘Amr ibn ‘Uthman from Muhammad ibn Salim in a marfu’ manner from Amir al-Mu’minin, Ali ibn abu Talib  who has said the following: “It is very proper for a Muslim man to avoid friendship and brotherhood with a liar; he lies and, even if he comes with truth, he is not believed and trusted.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/333)"
          }
        }
      },
      "Chapter #140": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 2: Duplicity",
          "Link": "https://thaqalayn.net/hadith/2/1/140/3",
          "Arabic Text": "3ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَمَّادٍ رَفَعَهُ قَالَ قَالَ الله تَبَارَكَ وَتَعَالَى لِعِيسَى ابْنِ مَرْيَمَ (عَلَيهِما السَّلام) يَا عِيسَى لِيَكُنْ لِسَانُكَ فِي السِّرِّ وَالْعَلانِيَةِ لِسَاناً وَاحِداً وَكَذَلِكَ قَلْبُكَ إِنِّي أُحَذِّرُكَ نَفْسَكَ وَكَفَى بِي خَبِيراً لا يَصْلُحُ لِسَانَانِ فِي فَمٍ وَاحِدٍ وَلا سَيْفَانِ فِي غِمْدٍ وَاحِدٍ وَلا قَلْبَانِ فِي صَدْرٍ وَاحِدٍ وَكَذَلِكَ الأذْهَانُ. ",
          "English Text": "3. Ali ibn Ibrahim has narrated from his father from Ali ibn Asbat from ‘Abd al- Rahman ibn Hammad in a marfu’ manner from the Imam who has said the following: “Allah, the Most Blessed, the Most High, said to Jesus, son of Mary (peace be upon them), ‘O Jesus, your tongue must be one tongue in private and in public so also must be your heart. I warn you against your own soul and Myself am a sufficient expert over your (activities). Two tongues are not proper for one mouth just as two swords are not proper in one sheath or two hearts in one chest, and so also are minds.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (0/356)"
          }
        }
      },
      "Chapter #141": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 2: Abandonment and Desertion",
          "Link": "https://thaqalayn.net/hadith/2/1/141/1",
          "Arabic Text": "1ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنِ الْقَاسِمِ بْنِ الرَّبِيعِ وَعِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ رَفَعَهُ قَالَ فِي وَصِيَّةِ الْمُفَضَّلِ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيهِ السَّلام) يَقُولُ لا يَفْتَرِقُ رَجُلانِ عَلَى الْهِجْرَانِ إِلا اسْتَوْجَبَ أَحَدُهُمَا الْبَرَاءَةَ وَاللَّعْنَةَ وَرُبَّمَا اسْتَحَقَّ ذَلِكَ كِلاهُمَا فَقَالَ لَهُ مُعَتِّبٌ جَعَلَنِيَ الله فِدَاكَ هَذَا الظَّالِمُ فَمَا بَالُ الْمَظْلُومِ قَالَ لأنَّهُ لا يَدْعُو أَخَاهُ إِلَى صِلَتِهِ وَلا يَتَغَامَسُ لَهُ عَنْ كَلامِهِ سَمِعْتُ أَبِي يَقُولُ إِذَا تَنَازَعَ اثْنَانِ فَعَازَّ أَحَدُهُمَا الآخَرَ فَلْيَرْجِعِ الْمَظْلُومُ إِلَى صَاحِبِهِ حَتَّى يَقُولَ لِصَاحِبِهِ أَيْ أَخِي أَنَا الظَّالِمُ حَتَّى يَقْطَعَ الْهِجْرَانَ بَيْنَهُ وَبَيْنَ صَاحِبِهِ فَإِنَّ الله تَبَارَكَ وَتَعَالَى حَكَمٌ عَدْلٌ يَأْخُذُ لِلْمَظْلُومِ مِنَ الظَّالِمِ.",
          "English Text": "1. Al-Husayn ibn Muhammad has narrated from Ja’far ibn Muhammad from al- Qasim ibn al-Rabi’ and certain individuals of our people from Ahmad ibn Muhammad ibn Khalid in a marfu’ manner it is in the advice to al-Mufaddal who has said the following: “I heard Abu ‘Abdillah  saying, ‘Of the two people who depart each other to abandon and walk out on each other, one is subject to disowning and condemnation or perhaps both of them will face such conditions.’ Mu’attib then said, ‘May Allah keep my soul in service for your cause, one is unjust, what about the oppressed?’ The Imam said, ‘It is because he did not ask his brother (in belief) to maintain good brotherly relations and did not ignore his words. I heard my father saying, “Whenever two people dispute and one of them over power the other, the oppressed should turn to his companion and say to him, ‘O brother (in belief), I am the unjust,”’ so that forsaking and abandonment would not take place among them. Allah, the Most Blessed, the Most High, is the Judge with justice, He judges with justice for the oppressed against the oppressor.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/359)"
          }
        }
      },
      "Chapter #142": {
        "Hadith #7": {
          "Title": "Al-Kafi - Volume 2: Failing to Maintain Good Relations with Relatives",
          "Link": "https://thaqalayn.net/hadith/2/1/142/7",
          "Arabic Text": "7ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ الله عَنْ أَبِيهِ رَفَعَهُ عَنْ أَبِي حَمْزَةَ الثُّمَالِيِّ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ (عَلَيهِ السَّلام) فِي خُطْبَتِهِ أَعُوذُ بِالله مِنَ الذُّنُوبِ الَّتِي تُعَجِّلُ الْفَنَاءَ فَقَامَ إِلَيْهِ عَبْدُ الله بْنُ الْكَوَّاءِ الْيَشْكُرِيُّ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ أَ وَتَكُونُ ذُنُوبٌ تُعَجِّلُ الْفَنَاءَ فَقَالَ نَعَمْ وَيْلَكَ قَطِيعَةُ الرَّحِمِ إِنَّ أَهْلَ الْبَيْتِ لَيَجْتَمِعُونَ وَيَتَوَاسَوْنَ وَهُمْ فَجَرَةٌ فَيَرْزُقُهُمُ الله وَإِنَّ أَهْلَ الْبَيْتِ لَيَتَفَرَّقُونَ وَيَقْطَعُ بَعْضُهُمْ بَعْضاً فَيَحْرِمُهُمُ الله وَهُمْ أَتْقِيَاءُ.",
          "English Text": "7. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from his father in a marfu’ manner from abu Hamza al-Thumali who has said the following: “Once Amir al-Mu’minin, Ali ibn abu Talib  said in one of his sermons, ‘I seek refuge in Allah from sins that accelerate destruction.’ The narrator has said that at this point ‘Abd Allah ibn al-Kawwa’ al-Yashkuri stood up and asked, ‘O Amir al-Mu’minin, do sins hasten one’s destruction?’ The Imam said, ‘Yes, it does. Woe upon you, it is failing to maintain good relations with relatives. A family lives together and cooperates with each other, even though they may happen to be a sinful people, Allah grants them sustenance. A family who fails to maintain good relations with relatives face Allah’s depriving them (from benefits), even though they are pious people.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/369)"
          }
        }
      },
      "Chapter #145": {
        "Hadith #5": {
          "Title": "Al-Kafi - Volume 2: One Who Causes Suffering to Muslims and Belittles Them",
          "Link": "https://thaqalayn.net/hadith/2/1/145/5",
          "Arabic Text": "5ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنِ ابْنِ مُسْكَانَ عَنْ مُعَلَّى بْنِ خُنَيْسٍ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيهِ السَّلام) يَقُولُ إِنَّ الله تَبَارَكَ وَتَعَالَى يَقُولُ مَنْ أَهَانَ لِي وَلِيّاً فَقَدْ أَرْصَدَ لِ��ُحَارَبَتِي وَأَنَا أَسْرَعُ شَيْ‏ءٍ إِلَى نُصْرَةِ أَوْلِيَائِي.",
          "English Text": "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Nu’man from ibn Muskan from Mu’alla ibn Khunayth who has said the following: “I heard Abu ‘Abdillah  saying, ‘Allah, the Most Blessed, the Most High, says, ‘Whoever insults any of My friends has waged a war against Me. I am the quickest to support My friends.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مختلف فيه معتبر عند ي   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/380)"
          }
        },
        "Hadith #11": {
          "Title": "Al-Kafi - Volume 2: One Who Causes Suffering to Muslims and Belittles Them",
          "Link": "https://thaqalayn.net/hadith/2/1/145/11",
          "Arabic Text": "11ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنِ ابْنِ مُسْكَانَ عَنْ مُعَلَّى بْنِ خُنَيْسٍ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) قَالَ الله عَزَّ وَجَلَّ مَنِ اسْتَذَلَّ عَبْدِيَ الْمُؤْمِنَ فَقَدْ بَارَزَنِي بِالْمُحَارَبَةِ وَمَا تَرَدَّدْتُ فِي شَيْ‏ءٍ أَنَا فَاعِلُهُ كَتَرَدُّدِي فِي عَبْدِيَ الْمُؤْمِنِ إِنِّي أُحِبُّ لِقَاءَهُ فَيَكْرَهُ الْمَوْتَ فَأَصْرِفُهُ عَنْهُ وَإِنَّهُ لَيَدْعُونِي فِي الأمْرِ فَأَسْتَجِيبُ لَهُ بِمَا هُوَ خَيْرٌ لَهُ. ",
          "English Text": "11. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from ibn Muskan from Mu’alla ibn Khunays from Abu ‘Abdillah  who has said the following: “The Messenger of Allah has said, ‘Allah, the Most Majestic, the Most Holy, has said, “Whoever humiliates My believing servant has asked Me for a fight. I have not hesitated as much as I did at the time of the death of My believing servant. I love to meet him and he dislikes death. I then divert it from him. He prays to Me in a matter and I answer his prayer in what is better for him.”’ ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مختلف فيه    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/398)"
          }
        }
      },
      "Chapter #146": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 2: Those Who Seek to Find Mistakes and (expose) Privacies of the Believers",
          "Link": "https://thaqalayn.net/hadith/2/1/146/2",
          "Arabic Text": "2ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيهِ السَّلام) يَقُولُ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) يَا مَعْشَرَ مَنْ أَسْلَمَ بِلِسَانِهِ وَلَمْ يُخْلِصِ الإيمَانَ إِلَى قَلْبِهِ لا تَذُمُّوا الْمُسْلِمِينَ وَلا تَتَبَّعُوا عَوْرَاتِهِمْ فَإِنَّهُ مَنْ تَتَبَّعَ عَوْرَاتِهِمْ تَتَبَّعَ الله عَوْرَتَهُ وَمَنْ تَتَبَّعَ الله تَعَالَى عَوْرَتَهُ يَفْضَحْهُ وَلَوْ فِي بَيْتِهِ. عَنْهُ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ أَبِي الْجَارُودِ عَنْ أَبِي جَعْفَرٍ (عَلَيهِ السَّلام) مِثْلَهُ.",
          "English Text": "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Nu’man from Ishaq ibn ‘ Ammar who has said the following: “I heard Abu ‘Abdillah  saying, ‘The Messenger of Allah has said, “O group of people who have accepted Islam with their tongue and belief has not yet purely and freely entered into their hearts, do not criticize the Muslims and do not seek to search into their privacies to find faults in them; Allah will then do the same to them and to whomever Allah will do such a thing, He may disgrace him even in the privacy of his own home.’” It is narrated from him (narrator of the Hadith above) from Ali ibn al-Nu’man from abu al-Jarud from abu Ja’far  a similar Hadith. ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " موثق وسنده الثاني ضعيف    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/400)"
          }
        }
      },
      "Chapter #147": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 2: Rebuking People",
          "Link": "https://thaqalayn.net/hadith/2/1/147/1",
          "Arabic Text": "1ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ الْحُسَيْنِ بْنِ عُثْمَانَ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ مَنْ أَنَّبَ مُؤْمِناً أَنَّبَهُ الله فِي الدُّنْيَا وَالآخِرَةِ.",
          "English Text": "1. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from al- Husayn ibn ‘Uthman from a man from Abu ‘Abdillah  who has said the following: “Abu ‘Abd Allah  has said, ‘Whoever rebukes a believer, Allah will debase him in this world and in the hereafter.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالحسن   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/403)"
          }
        }
      },
      "Chapter #148": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 2: Backbiting and Accusations",
          "Link": "https://thaqalayn.net/hadith/2/1/148/3",
          "Arabic Text": "3ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ دَاوُدَ بْنِ سِرْحَانَ قَالَ سَأَلْتُ أَبَا عَبْدِ الله (عَلَيهِ السَّلام) عَنِ الْغِيبَةِ قَالَ هُوَ أَنْ تَقُولَ لأخِيكَ فِي دِينِهِ مَا لَمْ يَفْعَلْ وَتَبُثَّ عَلَيْهِ أَمْراً قَدْ سَتَرَهُ الله عَلَيْهِ لَمْ يُقَمْ عَلَيْهِ فِيهِ حَدٌّ.",
          "English Text": "3. Al-Husayn ibn Muhammad has narrated from Mu’alla ibn Muhammad from al- Hassan ibn Ali al-Washsha’ from Dawud ibn Sarhan who has said the following: “Once I asked Abu ‘Abdillah  about backbiting. The Imam said, ‘It is when you say about your brother in belief something about his religion that he has not done, and publicize against him something that Allah has covered up for him and he is not convicted for such crimes.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف على المشهور معتبر عند ي    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (10/430)"
          }
        }
      },
      "Chapter #165": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 2: Disbelief",
          "Link": "https://thaqalayn.net/hadith/2/1/165/1",
          "Arabic Text": "1ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ دَاوُدَ بْنِ كَثِيرٍ الرَّقِّيِّ قَالَ قُلْتُ لأبِي عَبْدِ الله (عَلَيهِ السَّلام) سُنَنُ رَسُولِ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) كَفَرَائِضِ الله عَزَّ وَجَلَّ فَقَالَ إِنَّ الله عَزَّ وَجَلَّ فَرَضَ فَرَائِضَ مُوجَبَاتٍ عَلَى الْعِبَادِ فَمَنْ تَرَكَ فَرِيضَةً مِنَ الْمُوجَبَاتِ فَلَمْ يَعْمَلْ بِهَا وَجَحَدَهَا كَانَ كَافِراً وَأَمَرَ رَسُولُ الله بِأُمُورٍ كُلُّهَا حَسَنَةٌ فَلَيْسَ مَنْ تَرَكَ بَعْضَ مَا أَمَرَ الله عَزَّ وَجَلَّ بِهِ عِبَادَهُ مِنَ الطَّاعَةِ بِكَافِرٍ وَلَكِنَّهُ تَارِكٌ لِلْفَضْلِ مَنْقُوصٌ مِنَ الْخَيْرِ.",
          "English Text": "1. A number of our people have narrated from Ahmad ibn Muhammad from al- Hassan ibn Mahbub from Dawud ibn Kathir al-Raqqi who has said the following: “Once I asked Abu ‘Abdillah  ‘Are the traditions, Sunan of the Messenger of Allah like the obligations Allah, the Most Majestic, the Most Holy, has sanctioned?’ The Imam said, ‘Allah, the Most Majestic, the Most Holy, has sanctioned obligations that are compulsory for the servants (of Allah). Whoever ignores an obligation of the compulsory ones; does not perform it and rejects it, he becomes an unbeliever. The Messenger of Allah has commanded certain matters to be performed and they all are good deeds. One does not become an unbeliever for ignoring a few of the obligations that Allah, the Most Majestic, the Most Holy, has commanded His servant to perform, however, he has ignored a virtue and has cut down goodness.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مختلف فيه وصحته أرجح عند ي   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/108)"
          }
        },
        "Hadith #16": {
          "Title": "Al-Kafi - Volume 2: Disbelief",
          "Link": "https://thaqalayn.net/hadith/2/1/165/16",
          "Arabic Text": "16ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ عَبْدِ الله بْنِ سِنَانٍ عَنْ أَبِي حَمْزَةَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ (عَلَيهِ السَّلام) يَقُولُ إِنَّ عَلِيّاً (صَلَّى اللهُ عَلَيْهِ وآلِه) بَابٌ فَتَحَهُ الله مَنْ دَخَلَهُ كَانَ مُؤْمِناً وَمَنْ خَرَجَ مِنْهُ كَانَ كَافِراً.",
          "English Text": "16. Al-Husayn ibn Muhammad has narrated from Mu’alla’ ibn Muhammad from al- Washsha’ from ‘Abd Allah ibn Sinan from abu Hamza who has said the following: “I heard abu la’ far  saying, ‘Amir al-Mu’minin, Ali ibn abu Talib  is a (means of) access that Allah has prepared. Whoever approaches through this access is a believer and whoever departs is an unbeliever.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف على المشهور معتبر عند ي   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/122)"
          }
        }
      },
      "Chapter #167": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 2: Pillars and Branches of Disbelief",
          "Link": "https://thaqalayn.net/hadith/2/1/167/1",
          "Arabic Text": "1ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ إِبْرَاهِيمَ بْنِ عُمَرَ الْيَمَانِيِّ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ أَبَانِ بْنِ أَبِي عَيَّاشٍ عَنْ سُلَيْمِ بْنِ قَيْسٍ الْهِلالِيِّ عَنْ أَمِيرِ الْمُؤْمِنِينَ (صَلَّى اللهُ عَلَيْهِ وآلِه) قَالَ بُنِيَ الْكُفْرُ عَلَى أَرْبَعِ دَعَائِمَ الْفِسْقِ وَالْغُلُوِّ وَالشَّكِّ وَالشُّبْهَةِ وَالْفِسْقُ عَلَى أَرْبَعِ شُعَبٍ عَلَى الْجَفَاءِ وَالْعَمَى وَالْغَفْلَةِ وَالْعُتُوِّ فَمَنْ جَفَا احْتَقَرَ الْحَقَّ وَمَقَتَ الْفُقَهَاءَ وَأَصَرَّ عَلَى الْحِنْثِ الْعَظِيمِ وَمَنْ عَمِيَ نَسِيَ الذِّكْرَ وَاتَّبَعَ الظَّنَّ وَبَارَزَ خَالِقَهُ وَأَلَحَّ عَلَيْهِ الشَّيْطَانُ وَطَلَبَ الْمَغْفِرَةَ بِلا تَوْبَةٍ وَلا اسْتِكَانَةٍ وَلا غَفْلَةٍ وَمَنْ غَفَلَ جَنَى عَلَى نَفْسِهِ وَانْقَلَبَ عَلَى ظَهْرِهِ وَحَسِبَ غَيَّهُ رُشْداً وَغَرَّتْهُ الأمَانِيُّ وَأَخَذَتْهُ الْحَسْرَةُ وَالنَّدَامَةُ إِذَا قُضِيَ الأمْرُ وَانْكَشَفَ عَنْهُ الْغِطَاءُ وَبَدَا لَهُ مَا لَمْ يَكُنْ يَحْتَسِبُ وَمَنْ عَتَا عَنْ أَمْرِ الله شَكَّ وَمَنْ شَكَّ تَعَالَى الله عَلَيْهِ فَأَذَلَّهُ بِسُلْطَانِهِ وَصَغَّرَهُ بِجَلالِهِ كَمَا اغْتَرَّ بِرَبِّهِ الْكَرِيمِ وَفَرَّطَ فِي أَمْرِهِ وَالْغُلُوُّ عَلَى أَرْبَعِ شُعَبٍ عَلَى التَّعَمُّقِ بِالرَّأْيِ وَالتَّنَازُعِ فِيهِ وَالزَّيْغِ وَالشِّقَاقِ فَمَنْ تَعَمَّقَ لَمْ يُنِبْ إِلَى الْحَقِّ وَلَمْ يَزْدَدْ إِلا غَرَقاً فِي الْغَمَرَاتِ وَلَمْ تَنْحَسِرْ عَنْهُ فِتْنَةٌ إِلا غَشِيَتْهُ أُخْرَى وَانْخَرَقَ دِينُهُ فَهُوَ يَهْوِي فِي أَمْرٍ مَرِيجٍ وَمَنْ نَازَعَ فِي الرَّأْيِ وَخَاصَمَ شُهِرَ بِالْعَثَلِ مِنْ طُولِ اللَّجَاجِ وَمَنْ زَاغَ قَبُحَتْ عِنْدَهُ الْحَسَنَةُ وَحَسُنَتْ عِنْدَهُ السَّيِّئَةُ وَمَنْ شَاقَّ اعْوَرَّتْ عَلَيْهِ طُرُقُهُ وَاعْتَرَضَ عَلَيْهِ أَمْرُهُ فَضَاقَ عَلَيْهِ مَخْرَجُهُ إِذَا لَمْ يَتَّبِعْ سَبِيلَ الْمُؤْمِنِينَ وَالشَّكُّ عَلَى أَرْبَعِ شُعَبٍ عَلَى الْمِرْيَةِ وَالْهَوَى وَالتَّرَدُّدِ وَالإسْتِسْلامِ وَهُوَ قَوْلُ الله عَزَّ وَجَلَّ فَبِأَيِّ آلاءِ رَبِّكَ تَتَمارى‏ وَفِي رِوَايَةٍ أُخْرَى عَلَى الْمِرْيَةِ وَالْهَوْلِ مِنَ الْحَقِّ وَالتَّرَدُّدِ وَالإسْتِسْلامِ لِلْجَهْلِ وَأَهْلِهِ فَمَنْ هَالَهُ مَا بَيْنَ يَدَيْهِ نَكَصَ عَلَى عَقِبَيْهِ وَمَنِ امْتَرَى فِي الدِّينِ تَرَدَّدَ فِي الرَّيْبِ وَسَبَقَهُ الأوَّلُونَ مِنَ الْمُؤْمِنِينَ وَأَدْرَكَهُ الآخَرُونَ وَوَطِئَتْهُ سَنَابِكُ الشَّيْطَانِ وَمَنِ اسْتَسْلَمَ لِهَلَكَةِ الدُّنْيَا وَالآخِرَةِ هَلَكَ فِيمَا بَيْنَهُمَا وَمَنْ نَجَا مِنْ ذَلِكَ فَمِنْ فَضْلِ الْيَقِينِ وَلَمْ يَخْلُقِ الله خَلْقاً أَقَلَّ مِنَ الْيَقِينِ وَالشُّبْهَةُ عَلَى أَرْبَعِ شُعَبٍ إِعْجَابٍ بِالزِّينَةِ وَتَسْوِيلِ النَّفْسِ وَتَأَوُّلِ الْعِوَجِ وَلَبْسِ الْحَقِّ بِالْبَاطِلِ وَذَلِكَ بِأَنَّ الزِّينَةَ تَصْدِفُ عَنِ الْبَيِّنَةِ وَأَنَّ تَسْوِيلَ النَّفْسِ يُقَحِّمُ عَلَى الشَّهْوَةِ وَأَنَّ الْعِوَجَ يَمِيلُ بِصَاحِبِهِ مَيْلاً عَظِيماً وَأَنَّ اللَّبْسَ ظُلُمَاتٌ بَعْضُهَا فَوْقَ بَعْضٍ فَذَلِكَ الْكُفْرُ وَدَعَائِمُهُ وَشُعَبُهُ. ",
          "English Text": "1. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Ibrahim ibn ‘Umar al-Yamani from ‘Umar ibn ‘Udhaynah from Aban ibn abu ‘Ayyash from Sulaym ibn Qays al-Hilali from Amir al-Mu’minin, Ali ibn abu Talib  who has said the following: “Disbelief is established on four pillars: Sinfulness, Extremism, Doubt and Skepticism. Sinfulness has four branches: harshness of manners, blindness of heart, neglect, and arrogance. Whoever behaves in a harsh manner belittles the truth, hates the people of profound understanding and persists in great sins. Whoever becomes blind of heart forgets to remember (the truth), follows guesses, opposes his Creator and Satan turns bold toward him. He asks forgiveness without repenting, feeling humble and without being unaware of sin. Whoever is neglectful and careless commits a crime against his own soul, turns himself upside down and thinks of his misguidance as guidance. Yearnings deceives him, remorse and pangs of guilt seize him and when the matters settle and the curtain is raised, he finds it to be what he did not expect. Whoever is arrogant to obey the commands of Allah doubts and whoever doubts, Allah overpowers him and humiliates him by His Authority and makes him little by His Glory as he has played deceit against his Honorable Lord and has gone to extremes in his affairs. “Extremism is of four branches: Seeking profundity of opinion, disputation over an opinion, looking for deviations in it and creating a schism therein. “Whoever seeks extreme complexity he does not return to the truth, and does not gain anything except sinking in deeper troubles. He does not finish removing one before another trouble overwhelms him. His religion sustains holes and he falls deeper in chaos. Whoever seeks disputation in an opinion and quarrels, his absurdity comes in the open due to prolonged controversy. Whoever deviates, goodness seems terrible to him and evil begins to look lovelier. “Whoever creates a schism, his paths lead to dead end, his affairs burden him, his escape narrows if he would not follow the path of the believers. “Doubt is of four branches: Suspicion, desire, hesitation and submission. It is mentioned in the words of Allah, the Most Majestic, the Most Holy, ‘About which of the bounties of your Lord can they persistently dispute and cast doubts?’ (53:55) “In another Hadith it is said, ‘It branches in suspicion, fear of truth, hesitation and submission before ignorance and ignorant people.’ “Whoever fears what is before him turns back. Whoever is suspicious of religion remains hesitant in doubts and the foremost believing people move forward before him and those behind catch up with him. He turns out to be flattened under the hooves of Satan. Whoever submits to worldly destruction and that of the next life is destroyed between the two. Whoever is saved from such condition is due to the excellence of certainty. Allah has not created any creature fewer than certainty. “Casting doubt is of four branches: a liking of attractiveness, stimulation of soul, interpretation of crookedness and mixing of truth with falsehood. “This is because attractiveness clashes with evidence, stimulation of soul indulges in desires and crookedness bends its companion a great bent. Hiding and mixing truth with falsehood is darkness upon darkness. That is disbelief, its pillars and branches.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مختلف فيه  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/139)"
          }
        }
      },
      "Chapter #168": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 2: Description of Hypocrisy and Hypocrites",
          "Link": "https://thaqalayn.net/hadith/2/1/168/1",
          "Arabic Text": "1ـ قَالَ وَالنِّفَاقُ عَلَى أَرْبَعِ دَعَائِمَ عَلَى الْهَوَى وَالْهُوَيْنَا وَالْحَفِيظَةِ وَالطَّمَعِ فَالْهَوَى عَلَى أَرْبَعِ شُعَبٍ عَلَى الْبَغْيِ وَالْعُدْوَانِ وَالشَّهْوَةِ وَالطُّغْيَانِ فَمَنْ بَغَى كَثُرَتْ غَوَائِلُهُ وَتُخُلِّيَ مِنْهُ وَقُصِرَ عَلَيْهِ وَمَنِ اعْتَدَى لَمْ يُؤْمَنْ بَوَائِقُهُ وَلَمْ يَسْلَمْ قَلْبُهُ وَلَمْ يَمْلِكْ نَفْسَهُ عَنِ الشَّهَوَاتِ وَمَنْ لَمْ يَعْذِلْ نَفْسَهُ فِي الشَّهَوَاتِ خَاضَ فِي الْخَبِيثَاتِ وَمَنْ طَغَى ضَلَّ عَلَى عَمْدٍ بِلا حُجَّةٍ وَالْهُوَيْنَا عَلَى أَرْبَعِ شُعَبٍ عَلَى الْغِرَّةِ وَالأمَلِ وَالْهَيْبَةِ وَالْمُمَاطَلَةِ وَذَلِكَ بِأَنَّ الْهَيْبَةَ تَرُدُّ عَنِ الْحَقِّ وَالْمُمَاطَلَةَ تُفَرِّطُ فِي الْعَمَلِ حَتَّى يَقْدَمَ عَلَيْهِ الأجَلُ وَلَوْ لا الأمَلُ عَلِمَ الإنْسَانُ حَسَبَ مَا هُوَ فِيهِ وَلَوْ عَلِمَ حَسَبَ مَا هُوَ فِيهِ مَاتَ خُفَاتاً مِنَ الْهَوْلِ وَالْوَجَلِ وَالْغِرَّةَ تَقْصُرُ بِالْمَرْءِ عَنِ الْعَمَلِ وَالْحَفِيظَةُ عَلَى أَرْبَعِ شُعَبٍ عَلَى الْكِبْرِ وَالْفَخْرِ وَالْحَمِيَّةِ وَالْعَصَبِيَّةِ فَمَنِ اسْتَكْبَرَ أَدْبَرَ عَنِ الْحَقِّ وَمَنْ فَخَرَ فَجَرَ وَمَنْ حَمِيَ أَصَرَّ عَلَى الذُّنُوبِ وَمَنْ أَخَذَتْهُ الْعَصَبِيَّةُ جَارَ فَبِئْسَ الأمْرُ أَمْرٌ بَيْنَ إِدْبَارٍ وَفُجُورٍ وَإِصْرَارٍ وَجَوْرٍ عَلَى الصِّرَاطِ وَالطَّمَعُ عَلَى أَرْبَعِ شُعَبٍ الْفَرَحِ وَالْمَرَحِ وَاللَّجَاجَةِ وَالتَّكَاثُرِ فَالْفَرَحُ مَكْرُوهٌ عِنْدَ الله وَالْمَرَحُ خُيَلاءُ وَاللَّجَاجَةُ بَلاءٌ لِمَنِ اضْطَرَّتْهُ إِلَى حَمْلِ الآثَامِ وَالتَّكَاثُرُ لَهْوٌ وَلَعِبٌ وَشُغُلٌ وَاسْتِبْدَالُ الَّذِي هُوَ أَدْنَى بِالَّذِي هُوَ خَيْرٌ فَذَلِكَ النِّفَاقُ وَدَعَائِمُهُ وَشُعَبُهُ وَالله قَاهِرٌ فَوْقَ عِبَادِهِ تَعَالَى ذِكْرُهُ وَجَلَّ وَجْهُهُ وَأَحْسَنَ كُلَّ شَيْ‏ءٍ خَلَقَهُ وَانْبَسَطَتْ يَدَاهُ وَوَسِعَتْ كُلَّ شَيْ‏ءٍ رَحْمَتُهُ وَظَهَرَ أَمْرُهُ وَأَشْرَقَ نُورُهُ وَفَاضَتْ بَرَكَتُهُ وَاسْتَضَاءَتْ حِكْمَتُهُ وَهَيْمَن�� كِتَابُهُ وَفَلَجَتْ حُجَّتُهُ وَخَلَصَ دِينُهُ وَاسْتَظْهَرَ سُلْطَانُهُ وَحَقَّتْ كَلِمَتُهُ وَأَقْسَطَتْ مَوَازِينُهُ وَبَلَّغَتْ رُسُلُهُ فَجَعَلَ السَّيِّئَةَ ذَنْباً وَالذَّنْبَ فِتْنَةً وَالْفِتْنَةَ دَنَساً وَجَعَلَ الْحُسْنَى عُتْبَى وَالْعُتْبَى تَوْبَةً وَالتَّوْبَةَ طَهُوراً فَمَنْ تَابَ اهْتَدَى وَمَنِ افْتُتِنَ غَوَى مَا لَمْ يَتُبْ إِلَى الله وَيَعْتَرِفْ بِذَنْبِهِ وَلا يَهْلِكُ عَلَى الله إِلا هَالِكٌ الله الله فَمَا أَوْسَعَ مَا لَدَيْهِ مِنَ التَّوْبَةِ وَالرَّحْمَةِ وَالْبُشْرَى وَالْحِلْمِ الْعَظِيمِ وَمَا أَنْكَلَ مَا عِنْدَهُ مِنَ الأنْكَالِ وَالْجَحِيمِ وَالْبَطْشِ الشَّدِيدِ فَمَنْ ظَفِرَ بِطَاعَتِهِ اجْتَلَبَ كَرَامَتَهُ وَمَنْ دَخَلَ فِي مَعْصِيَتِهِ ذَاقَ وَبَالَ نَقِمَتِهِ وَعَمَّا قَلِيلٍ لَيُصْبِحُنَّ نَادِمِينَ.",
          "English Text": "1. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Ibrahim ibn ‘Umar al-Yamani from ‘Umar ibn ‘Udhaynah from Aban ibn abu ‘Ayyash from Sulaym ibn Qays al-Hilali from Amir al-Mu’minin, Ali ibn abu Talib  who has said the following:“‘Hypocrisy has four pillars: Desire, Neglect, Resentment and Greed. “Desire is of four branches: disproportionate behavior, transgression, lust and insubordination. Whoever behaves disproportionately faces great risks, remains lonely and without supporters. Whoever transgresses does not remain immune to harmful consequences, his heart is not in peace and he does not control his soul against lustful matters. Whoever has not balanced his soul in lustful matters he indulges in filthy activities. Whoever acts insubordinately purposely and without evidence strays in falsehood. “Neglect is of four branches: dishonesty, yearning, fear and procrastination. Fear and apprehension turns one away from the truth and procrastination leads to extremely reduced activities until the deadline approaches. If one does not have any yearnings he knows his true condition and measures. If he knows the true measure of his condition in which he is, he would die suddenly due to fear and apprehension. Dishonesty cuts short one’s deeds. “Resentment is of four branches: arrogance, boastfulness, egoistic, and racism. Whoever is arrogant turns his back to the truth. Whoever is boastful indulges in sins. Whoever is egoistic persists in sins. Whoever comes in the clench of racism commits injustice. “Thus, evil is the affair that swings in deterioration, indecency, persistence and injustice on the path. “Greed is of four branches: exhilaration, pleasure seeking, worrying and superfluity. Exhilaration is detestable before Allah. Pleasure seeking is feeblemindedness. Worrisome is a misfortune for one who is forced to carry sins. Seeking superfluity is useless, a childish manner, a vastful preoccupation and an effort to change what is of a lower quality to a better one. “This is how hypocrisy its pillars and branches are. Allah is dominant over his servants. Speaking of Him is exalted and glory is His. He has created all things in good fashion. His hands are free, His favor is universal. His command is manifest, His light shines, His blessing overflows. His wisdom is the source of light. His book is overriding. His evidence is overwhelming. His religion is pure. His kingdom is powerful. His word is the truth, His measures are just and His messengers have already preached. Thus, He has made evil a sin, sin a misfortune and misfortune a filth. “He has made virtuous deeds a threshold. The threshold is repentance and repentance is purification. One who repents finds guidance. One who plots goes astray, as long as he does not repent before Allah and confess to his sins. No one dares to act, to his own destruction, against Allah, except those who are doomed. “Allah! Allah! How vast is what He has for repentance, favors, joy and great forbearance. How severe is what is before Him of retribution, hell, and a hard grip! Whoever succeeds in obedience to Him attracts His generosity. Whoever indulges in disobedience to Him he will test the results of His disapproval and very shortly he will become regretful.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مختلف فيه    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/155)"
          }
        }
      },
      "Chapter #170": {
        "Hadith #7": {
          "Title": "Al-Kafi - Volume 2: Doubt",
          "Link": "https://thaqalayn.net/hadith/2/1/170/7",
          "Arabic Text": "7ـ عَنْهُ عَنْ أَبِيهِ رَفَعَهُ إِلَى أَبِي جَعْفَرٍ (عَلَيهِ السَّلام) قَالَ لا يَنْفَعُ مَعَ الشَّكِّ وَالْجُحُودِ عَمَلٌ.",
          "English Text": "7. It is narrated from him (narrator of the Hadith above) from his father in a marfu’ manner from abu la’ far  who has said the following: “Abu Ja’far  has said, ‘No deed with doubt and denial will be of any benefit.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/185)"
          }
        }
      },
      "Chapter #172": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 2: The Feeble-minded People",
          "Link": "https://thaqalayn.net/hadith/2/1/172/3",
          "Arabic Text": "3ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ زُرَارَةَ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ (عَلَيهِ السَّلام) عَنِ الْمُسْتَضْعَفِ فَقَالَ هُوَ الَّذِي لا يَسْتَطِيعُ حِيلَةً يَدْفَعُ بِهَا عَنْهُ الْكُفْرَ وَلا يَهْتَدِي بِهَا إِلَى سَبِيلِ الإيمَانِ لا يَسْتَطِيعُ أَنْ يُؤْمِنَ وَلا يَكْفُرَ قَالَ وَالصِّبْيَانُ وَمَنْ كَانَ مِنَ الرِّجَالِ وَالنِّسَاءِ عَلَى مِثْلِ عُقُولِ الصِّبْيَانِ.",
          "English Text": "3. A number of our people have narrated from Sahl ibn Ziyad from ibn Mahbub from ibn Ri’ab from Zurara who has said the following: “Once I asked abu Ja’far  about the feeble-minded people. The Imam said, ‘They are those who are not able to defend themselves against disbelief or find the means to the way in the direction of belief. They are not able to have belief and do not disbelieve.’ The Imam said, ‘Children and those of men and women who are of children’s mental condition are among such people.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف على المشهور معتبر عند ي   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/209)"
          }
        },
        "Hadith #6": {
          "Title": "Al-Kafi - Volume 2: The Feeble-minded People",
          "Link": "https://thaqalayn.net/hadith/2/1/172/6",
          "Arabic Text": "6ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ مُثَنًّى عَنْ إِسْمَاعِيلَ الْجُعْفِيِّ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ (عَلَيهِ السَّلام) عَنِ الدِّينِ الَّذِي لا يَسَعُ الْعِبَادَ جَهْلُهُ فَقَالَ الدِّينُ وَاسِعٌ وَلَكِنَّ الْخَوَارِجَ ضَيَّقُوا عَلَى أَنْفُسِهِمْ مِنْ جَهْلِهِمْ قُلْتُ جُعِلْتُ فِدَاكَ فَأُحَدِّثُكَ بِدِينِيَ الَّذِي أَنَا عَلَيْهِ فَقَالَ بَلَى فَقُلْتُ أَشْهَدُ أَنْ لا إِلَهَ إِلا الله وَأَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ وَالإقْرَارَ بِمَا جَاءَ مِنْ عِنْدِ الله وَأَتَوَلاكُمْ وَأَبْرَأُ مِنْ عَدُوِّكُمْ وَمَنْ رَكِبَ رِقَابَكُمْ وَتَأَمَّرَ عَلَيْكُمْ وَظَلَمَكُمْ حَقَّكُمْ فَقَالَ مَا جَهِلْتَ شَيْئاً هُوَ وَالله الَّذِي نَحْنُ عَلَيْهِ قُلْتُ فَهَلْ سَلِمَ أَحَدٌ لا يَعْرِفُ هَذَا الأمْرَ فَقَالَ لا إِلا الْمُسْتَضْعَفِينَ قُلْتُ مَنْ هُمْ قَالَ نِسَاؤُكُمْ وَأَوْلادُكُمْ ثُمَّ قَالَ أَ رَأَيْتَ أُمَّ أَيْمَنَ فَإِنِّي أَشْهَدُ أَنَّهَا مِنْ أَهْلِ الْجَنَّةِ وَمَا كَانَتْ تَعْرِفُ مَا أَنْتُمْ عَلَيْهِ.",
          "English Text": "6. Al-Husayn ibn Muhammad has narrated from Mu’alla ibn Muhammad from al- Washsha’ from Muthanna from Isma’il al-Ju’fi who has said the following: “Once I asked abu Ja’far  about how much religious knowledge people must have. The Imam said, ‘Religion is vast but the Khawarij (those who turned against Amir al-Mu’minin, Ali ibn abu Talib ) group has narrowed it down upon themselves due to their ignorance.’ I asked, ‘May Allah keep my soul in service for your cause, can I tell you what kind of religion I believe in?’ The Imam said, ‘Yes, you may do so.’ I said, ‘I testify that no one deserves to be worshipped except Allah and I testify that Muhammad is His servant and messenger. I affirm to whatever he has brought from Allah. I love you {AM al-Bayt) and disavow your enemies and those who have suppressed you, kept (unjust) control over you and who have usurped your rights.’ The Imam said, ‘You are not ignorant of anything. This, by Allah is what we follow.’ I asked, ‘Is one who does not know this (cause) safe?’ The Imam said, ‘No, except the feeble- minded people.’ I asked, ‘Who are they?’ The Imam said, ‘Your women and children.’ Then he said, ‘Consider ‘Umm ‘Ayman. I testify that she is of the people of paradise, but she did not know what you believe.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف على المشهور معتبر    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/211)"
          }
        }
      },
      "Chapter #173": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 2: People in Postponement for the Command of Allah",
          "Link": "https://thaqalayn.net/hadith/2/1/173/1",
          "Arabic Text": "1ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مُوسَى بْنِ بَكْرٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ (عَلَيهِ السَّلام) فِي قَوْلِ الله عَزَّ وَجَلَّ وَآخَرُونَ مُرْجَوْنَ لأمْرِ الله قَالَ قَوْمٌ كَانُوا مُشْرِكِينَ فَقَتَلُوا مِثْلَ حَمْزَةَ وَجَعْفَرٍ وَأَشْبَاهَهُمَا مِنَ الْمُؤْمِنِينَ ثُمَّ إِنَّهُمْ دَخَلُوا فِي الإسْلامِ فَوَحَّدُوا الله وَتَرَكُوا الشِّرْكَ وَلَمْ يَعْرِفُوا الإيمَانَ بِقُلُوبِهِمْ فَيَكُونُوا مِنَ الْمُؤْمِنِينَ فَتَجِبَ لَهُمُ الْجَنَّةُ وَلَمْ يَكُونُوا عَلَى جُحُودِهِمْ فَيَكْفُرُوا فَتَجِبَ لَهُمُ النَّارُ فَهُمْ عَلَى تِلْكَ الْحَالِ إِمَّا يُعَذِّبُهُمْ وَإِمَّا يَتُوبُ عَلَيْهِمْ.",
          "English Text": "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Musa ibn Bakr from Zurara from abu Ja’far  who has said the following: “About the words of Allah, the Most Majestic, the Most Holy, ‘. . . there are others who have no good deeds for which they may receive any reward or sins for which they may be punished. Their fate will be in the hands of Allah. Allah is All-knowing and All-wise,’ (9:106) the Imam said, ‘Certain people were pagans. They murdered people like Hamza and Ja’far and similar persons from the believers. Then they accepted Islam and Allah only and gave up paganism, but did not know belief with their heart so they could be among the believers to deserve paradise. They were not in denial and a rejecting attitude as unbelievers to be subjected to fire (of hell). They are in that condition as such that it will be up to Allah to punish or accept their repentance.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف كالموثق    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/214)"
          }
        }
      },
      "Chapter #179": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 2: The Minimum of what Establishes Belief, Disbelief or Straying",
          "Link": "https://thaqalayn.net/hadith/2/1/179/1",
          "Arabic Text": "1ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ إِبْرَاهِيمَ بْنِ عُمَرَ الْيَمَانِيِّ عَنِ ابْنِ أُذَيْنَةَ عَنْ أَبَانِ بْنِ عَيَّاشٍ عَنْ سُلَيْمِ بْنِ قَيْسٍ قَالَ سَمِعْتُ عَلِيّاً (صَلَّى اللهُ عَلَيْهِ وآلِه) يَقُولُ وَأَتَاهُ رَجُلٌ فَقَالَ لَهُ مَا أَدْنَى مَا يَكُونُ بِهِ الْعَبْدُ مُؤْمِناً وَأَدْنَى مَا يَكُونُ بِهِ الْعَبْدُ كَافِراً وَأَدْنَى مَا يَكُونُ بِهِ الْعَبْدُ ضَالاً فَقَالَ لَهُ قَدْ سَأَلْتَ فَافْهَمِ الْجَوَابَ أَمَّا أَدْنَى مَا يَكُونُ بِهِ الْعَبْدُ مُؤْمِناً أَنْ يُعَرِّفَهُ الله تَبَارَكَ وَتَعَالَى نَفْسَهُ فَيُقِرَّ لَهُ بِالطَّاعَةِ وَيُعَرِّفَهُ نَبِيَّهُ (صَلَّى اللهُ عَلَيْهِ وآلِه) فَيُقِرَّ لَهُ بِالطَّاعَةِ وَيُعَرِّفَهُ إِمَامَهَ وَحُجَّتَهُ فِي أَرْضِهِ وَشَاهِدَهُ عَلَى خَلْقِهِ فَيُقِرَّ لَهُ بِالطَّاعَةِ قُلْتُ لَهُ يَا أَمِيرَ الْمُؤْمِنِينَ وَإِنْ جَهِلَ جَمِيعَ الأشْيَاءِ إِلا مَا وَصَفْتَ قَالَ نَعَمْ إِذَا أُمِرَ أَطَاعَ وَإِذَا نُهِيَ انْتَهَى وَأَدْنَى مَا يَكُونُ بِهِ الْعَبْدُ كَافِراً مَنْ زَعَمَ أَنَّ شَيْئاً نَهَى الله عَنْهُ أَنَّ الله أَمَرَ بِهِ وَنَصَبَهُ دِيناً يَتَوَلَّى عَلَيْهِ وَيَزْعُمُ أَنَّهُ يَعْبُدُ الَّذِي أَمَرَهُ بِهِ وَإِنَّمَا يَعْبُدُ الشَّيْطَانَ وَأَدْنَى مَا يَكُونُ بِهِ الْعَبْدُ ضَالاً أَنْ لا يَعْرِفَ حُجَّةَ الله تَبَارَكَ وَتَعَالَى وَشَاهِدَهُ عَلَى عِبَادِهِ الَّذِي أَمَرَ الله عَزَّ وَجَلَّ بِطَاعَتِهِ وَفَرَضَ وَلايَتَهُ قُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ صِفْهُمْ لِي فَقَالَ الَّذِينَ قَرَنَهُمُ الله عَزَّ وَجَلَّ بِنَفْسِهِ وَنَبِيِّهِ فَقَالَ يا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا الله وَأَطِيعُوا الرَّسُولَ وَأُولِي الأمْرِ مِنْكُمْ قُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ جَعَلَنِيَ الله فِدَاكَ أَوْضِحْ لِي فَقَالَ الَّذِينَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) فِي آخِرِ خُطْبَتِهِ يَوْمَ قَبَضَهُ الله عَزَّ وَجَلَّ إِلَيْهِ إِنِّي قَدْ تَرَكْتُ فِيكُمْ أَمْرَيْنِ لَنْ تَضِلُّوا بَعْدِي مَا إِنْ تَمَسَّكْتُمْ بِهِمَا كِتَابَ الله وَعِتْرَتِي أَهْلَ بَيْتِي فَإِنَّ اللَّطِيفَ الْخَبِيرَ قَدْ عَهِدَ إِلَيَّ أَنَّهُمَا لَنْ يَفْتَرِقَا حَتَّى يَرِدَا عَلَيَّ الْحَوْضَ كَهَاتَيْنِ وَجَمَعَ بَيْنَ مُسَبِّحَتَيْهِ وَلا أَقُولُ كَهَاتَيْنِ وَجَمَعَ بَيْنَ الْمُسَبِّحَةِ وَالْوُسْطَى فَتَسْبِقَ إِحْدَاهُمَا الأخْرَى فَتَمَسَّكُوا بِهِمَا لا تَزِلُّوا وَلا تَضِلُّوا وَلا تَقَدَّمُوهُمْ فَتَضِلُّوا. ",
          "English Text": "1. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Ibrahim ibn ‘Umar al-Yamani from ibn ‘Udhaynah from Aban ibn ‘Uthman ibn abu ‘Ayyash from Sulaym ibn Qays who has said the following: “Once a man came to Amir al-Mu’minin, Ali ibn abu Talib  and asked him, ‘What is the least of that with which a servant (of Allah) becomes a believer, or an unbeliever or a straying person?’ I heard the Imam say, ‘You asked the question, now try to understand the answer. The least of that with which one may be considered a believer is that Allah, the Most Blessed, the Most High, makes him know His Ownself, then he professes to obey Him. He (Allah) makes him know His Holy Prophet, then he professes to obey him and He makes him know His Imam, His Authority on His earth and His witness over His creatures, then he professes to obey him. ’ “I then asked, ‘O Amir al-Mu’minin, does this hold true even if one is ignorant of all other things besides what you just mentioned?’ The Imam said, ‘Yes, if he when commanded obeys and when prohibited upholds it. The least of that with which a servant (of Allah) becomes an unbeliever is that when upon a mere guess one says that this is what Allah has commanded and this is what Allah has prohibited. Then he assigns it to be his religion upon which he bases his system of guardianship (religious authority). He guesses that he obeys the one who has commanded him to do it and, in fact, he worships Satan only.’ “The least of that with which a servant (of Allah) is considered straying is when he does not know the Authority of Allah, the Most Blessed, the Most High, His witness over His servants. The Authority about whom Allah, the Most Majestic, the Most Holy, has commanded His servants to obey and has made it obligatory to love him as one’s Divine Guardian.’ I then said, ‘O Amir al-Mu’minin, describe them (the people who possess Divine Authority) for me.’ The Imam said, ‘They are those whom Allah, the Most Majestic, the Most Holy, has mentioned along with His Ownself and His Holy Prophet saying, ‘Believers, obey Allah, His Messenger, and your leaders (people who possess Divine Authority). . . .’ (4:59) I said, ‘O Amir al- Mu’minin, May Allah keep my soul in service for your cause, explain it to me.’ The Imam said, ‘They (people who possess Divine Authority) are those about whom the Messenger of Allah in his last sermon on the day that Allah, the Most Majestic, the Most Holy, took him (from this world) said, ‘I leave among you behind me two matters. If you will hold firmly to these two you will never stray: the book of Allah and my descendents, my family. The Most Subtle and Most Expert, (Allah) has informed me that these two will never separate from each other until they will arrive before me at the pond in paradise like this - he joined his index finger and thumb - not like this - he joined his middle finger and thumb so that one may proceed before the other. You must hold firmly to these two, you will not slip, or stray and do not go before them; you will stray.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مختلف فيه معتبر عند ي   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/231)"
          }
        }
      },
      "Chapter #184": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 2: Confusion of the Heart",
          "Link": "https://thaqalayn.net/hadith/2/1/184/1",
          "Arabic Text": "1ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَعْفَرِ بْنِ عُثْمَانَ عَنْ سَمَاعَةَ عَنْ أَبِي بَصِيرٍ وَغَيْرِهِ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) إِنَّ الْقَلْبَ لَيَكُونُ السَّاعَةَ مِنَ اللَّيْلِ وَالنَّهَارِ مَا فِيهِ كُفْرٌ وَلا إِيمَانٌ كَالثَّوْبِ الْخَلَقِ قَالَ ثُمَّ قَالَ لِي أَ مَا تَجِدُ ذَلِكَ مِنْ نَفْسِكَ قَالَ ثُمَّ تَكُونُ النُّكْتَةُ مِنَ الله فِي الْقَلْبِ بِمَا شَاءَ مِنْ كُفْرٍ وَإِيمَانٍ. عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ أَبِي عُمَيْرٍ مِثْلَهُ.",
          "English Text": "1. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from la’ far ibn ‘Uthman from Sama’a from abu Basir and others who has said the following: “Abu ‘Abd Allah  has said, ‘The heart in certain hours of the night and day has no disbelief or belief in it and it is like an old mg.’ The narrator has said that the Imam then asked, ‘Do you not find that in yourself? Then there is a dot from Allah in the heart of the kind that He wills in the form of disbelief or belief.’” A number of our people have narrated from Sahl ibn Ziyad from Muhammad ibn al-Husayn from Muhammad Ibn Abi ‘Umayr a similar Hadith. ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول أو حسن موثق    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/250)"
          }
        }
      },
      "Chapter #185": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 2: About the Darkness of the Heart of the Hypocrite Even Though He Has a Tongue and the Light of the Heart of the Believer Even Though His Tongue May Fall Short",
          "Link": "https://thaqalayn.net/hadith/2/1/185/2",
          "Arabic Text": "2ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ هَارُونَ بْنِ الْجَهْمِ عَنِ الْمُفَضَّلِ عَنْ سَعْدٍ عَنْ أَبِي جَعْفَرٍ (عَلَيهِ السَّلام) قَالَ إِنَّ الْقُلُوبَ أَرْبَعَةٌ قَلْبٌ فِيهِ نِفَاقٌ وَإِيمَانٌ وَقَلْبٌ مَنْكُوسٌ وَقَلْبٌ مَطْبُوعٌ وَقَلْبٌ أَزْهَرُ أَجْرَدُ فَقُلْتُ مَا الأزْهَرُ قَالَ فِيهِ كَهَيْئَةِ السِّرَاجِ فَأَمَّا الْمَطْبُوعُ فَقَلْبُ الْمُنَافِقِ وَأَمَّا الأزْهَرُ فَقَلْبُ الْمُؤْمِنِ إِنْ أَعْطَاهُ شَكَرَ وَإِنِ ابْتَلاهُ صَبَرَ وَأَمَّا الْمَنْكُوسُ فَقَلْبُ الْمُشْرِكِ ثُمَّ قَرَأَ هَذِهِ الآيَةَ أَ فَمَنْ يَمْشِي مُكِبًّا عَلى‏ وَجْهِهِ أَهْدى‏ أَمَّنْ يَمْشِي سَوِيًّا عَلى‏ صِراطٍ مُسْتَقِيمٍ فَأَمَّا الْقَلْبُ الَّذِي فِيهِ إِيمَانٌ وَنِفَاقٌ فَهُمْ قَوْمٌ كَانُوا بِالطَّائِفِ فَإِنْ أَدْرَكَ أَحَدَهُمْ أَجَلُهُ عَلَى نِفَاقِهِ هَلَكَ وَإِنْ أَدْرَكَهُ عَلَى إِيمَانِهِ نَجَا.",
          "English Text": "2. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from his father from Harun ibn al-Jahm from al-Mufaddal from Sa’d from abu Ja’far  who has said the following: “There are four kinds of hearts: the heart in which there is hypocrisy and belief, the heart that is upside down, the heart that is stamped and the heart that is Azhar and is free. I then asked, ‘What is ‘Azhar’? The Imam said, ‘In it (the heart) there is something like a lamp. The stamped heart is the heart of hypocrite. Azhar is the heart of the believer who upon receiving favors, thanks, and in suffering exercises patience. The upside down heart is the heart of the pagans.’ The Imam then read this verse: ‘Can one who walks with his head hanging down be better guided than one who walks with his head upright?’ (67:22) The heart with belief and hypocrisy therein was the heart of a people in Ta’if. If death seized one of them upon his hypocrisy, he perished, and if it approached him upon belief he gained salvation.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مختلف فيه    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/257)"
          }
        }
      },
      "Chapter #188": {
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 2: Confessing Sins and Regret for it",
          "Link": "https://thaqalayn.net/hadith/2/1/188/4",
          "Arabic Text": "4ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيهِ السَّلام) يَقُولُ إِنَّهُ وَالله مَا خَرَجَ عَبْدٌ مِنْ ذَنْبٍ بِإِصْرَارٍ وَمَا خَرَجَ عَبْدٌ مِنْ ذَنْبٍ إِلا بِإِقْرَارٍ.",
          "English Text": "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Sinan from Mu’awiyah ibn ‘ Ammar who has said the following: “I heard Abu ‘Abdillah  saying, ‘By Allah a servant cannot get out of sin while persisting in it and a servant cannot get out of sin without confessing to it.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف على المشهور صحيح عند ي    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/284)"
          }
        }
      },
      "Chapter #191": {
        "Hadith #5": {
          "Title": "Al-Kafi - Volume 2: Repentance",
          "Link": "https://thaqalayn.net/hadith/2/1/191/5",
          "Arabic Text": "5ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ بَعْضِ أَصْحَابِنَا رَفَعَهُ قَالَ إِنَّ الله عَزَّ وَجَلَّ أَعْطَى التَّائِبِينَ ثَلاثَ خِصَالٍ لَوْ أَعْطَى خَصْلَةً مِنْهَا جَمِيعَ أَهْلِ السَّمَاوَاتِ وَالأرْضِ لَنَجَوْا بِهَا قَوْلُهُ عَزَّ وَجَلَّ إِنَّ الله يُحِبُّ التَّوَّابِينَ وَيُحِبُّ الْمُتَطَهِّرِينَ فَمَنْ أَحَبَّهُ الله لَمْ يُعَذِّبْهُ وَقَوْلُهُ الَّذِينَ يَحْمِلُونَ الْعَرْشَ وَمَنْ حَوْلَهُ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ... وَيَسْتَغْفِرُونَ لِلَّذِينَ آمَنُوا رَبَّنا وَسِعْتَ كُلَّ شَيْ‏ءٍ رَحْمَةً وَعِلْماً فَاغْفِرْ لِلَّذِينَ تابُوا وَاتَّبَعُوا سَبِيلَكَ وَقِهِمْ عَذابَ الْجَحِيمِ رَبَّنا وَأَدْخِلْهُمْ جَنَّاتِ عَدْنٍ الَّتِي وَعَدْتَهُمْ وَمَنْ صَلَحَ مِنْ آبائِهِمْ وَأَزْواجِهِمْ وَذُرِّيَّاتِهِمْ إِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ وَقِهِمُ السَّيِّئاتِ وَمَنْ تَقِ السَّيِّئاتِ يَوْمَئِذٍ فَقَدْ رَحِمْتَهُ وَذلِكَ هُوَ الْفَوْزُ الْعَظِيمُ وَقَوْلُهُ عَزَّ وَجَلَّ وَالَّذِينَ لا يَدْعُونَ مَعَ الله إِلهاً آخَرَ وَلا يَقْتُلُونَ النَّفْسَ الَّتِي حَرَّمَ الله إِلا بِالْحَقِّ وَلا يَزْنُونَ وَمَنْ يَفْعَلْ ذلِكَ يَلْقَ أَثاماً يُضاعَفْ لَهُ الْعَذابُ يَوْمَ الْقِيامَةِ وَيَخْلُدْ فِيهِ مُهاناً إِلا مَنْ تابَ وَآمَنَ وَعَمِلَ عَمَلاً صالِحاً فَأُوْلئِكَ يُبَدِّلُ الله سَيِّئاتِهِمْ حَسَناتٍ وَكانَ الله غَفُوراً رَحِيماً.",
          "English Text": "5. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from certain individuals of our people in a marfu ’ manner from the Imam  who has said the following: “Allah, the Most Majestic, the Most Holy, has given three things to the repenting people. Had any of it been given to all of those in the heavens and on earth, all have had their salvation. The following words of Allah, the Most Majestic, the Most Holy, mention those three things: ‘Allah loves those who ‘Repent’ and those who cleanse themselves, (2:222) whomever Allah loves He will not punish him.’ ‘The bearers of the Throne glorify their Lord with His praise. They believe in Him and ask Him to forgive the believers. They say, “Our Lord, Your mercy and knowledge encompass all things. Forgive those who turn to You in ‘Repentance’ and follow Your path. Lord, save them from the torment of hell. (40:7) Lord, admit them and their fathers, spouses, and offspring who have reformed themselves to the gardens of Eden which You have promised them. You are Majestic and All-wise. (40:8) “Lord, keep them away from evil deeds. Whomever You have saved from evil on the Day of Judgment has certainly been granted Your mercy and this is the greatest triumph.’ (40:9) “The last thing is in the words of Allah, the Most Majestic, the Most Holy, ‘ . . . who do not worship idols besides Allah, nor without a just cause murder a soul whom Allah has granted protection, who do not commit fornication; those who do so have committed a sin (25:68) and on the Day of Judgment their torment will be double. They will suffer forever in disgrace. (25:69) But only those who ‘Repent’ believe and act righteously will have their sins replaced with virtue; Allah is All-forgiving and All-merciful.’” (25:70) ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع كالحسن   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/299)"
          }
        }
      },
      "Chapter #192": {
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 2: Pleading for Forgiveness",
          "Link": "https://thaqalayn.net/hadith/2/1/192/4",
          "Arabic Text": "4ـ حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانٍ عَنْ زَيْدٍ الشَّحَّامِ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ كَانَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) يَتُوبُ إِلَى الله عَزَّ وَجَلَّ فِي كُلِّ يَوْمٍ سَبْعِينَ مَرَّةً فَقُلْتُ أَ كَانَ يَقُولُ أَسْتَغْفِرُ الله وَأَتُوبُ إِلَيْهِ قَالَ لا وَلَكِنْ كَانَ يَقُولُ أَتُوبُ إِلَى الله قُلْتُ إِنَّ رَسُولَ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) كَانَ يَتُوبُ وَلا يَعُودُ وَنَحْنُ نَتُوبُ وَنَعُودُ فَقَالَ الله الْمُسْتَعَانُ.",
          "English Text": "4. Humayd ibn Ziyad has narrated from al-Hassan ibn Muhammad from more than one narrator from Aban from Zayd al-Shahham from Abu ‘Abdillah  who has said the following: “The Messenger of Allah would plead before Allah, the Most Majestic, the Most Holy, seventy times every day.’ I (the narrator) then asked, ‘Would he say, ‘I ask Allah to forgive me and I turn to Him in repentance?’ The Imam said, ‘He, however, would say, ‘I return to Allah.’ I then said, ‘The Messenger of Allah would yatub (repent) and would not repeat, we repent and repeat.’ The Imam said, ‘Allah is the source of help.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالموثق   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/307)"
          }
        },
        "Hadith #8": {
          "Title": "Al-Kafi - Volume 2: Pleading for Forgiveness",
          "Link": "https://thaqalayn.net/hadith/2/1/192/8",
          "Arabic Text": "8ـ عَنْهُ عَنْ عِدَّةٍ مِنْ أَصْحَابِنَا رَفَعُوهُ قَالُوا قَالَ لِكُلِّ شَيْ‏ءٍ دَوَاءٌ وَدَوَاءُ الذُّنُوبِ الإسْتِغْفَارُ.",
          "English Text": "8. It is narrated from him (narrator of the Hadith above) from a number of our people in a marfu’ manner from him  who has said the following: “For everything there is a medicine and the medicine for sins is pleading (before Allah) for forgiveness.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/310)"
          }
        }
      },
      "Chapter #195": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 2: Sins Are of Three Kinds",
          "Link": "https://thaqalayn.net/hadith/2/1/195/1",
          "Arabic Text": "1ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَمَّادٍ عَنْ بَعْضِ أَصْحَابِهِ رَفَعَهُ قَالَ صَعِدَ أَمِيرُ الْمُؤْمِنِينَ (عَلَيهِ السَّلام) بِالْكُوفَةِ الْمِنْبَرَ فَحَمِدَ الله وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ أَيُّهَا النَّاسُ إِنَّ الذُّنُوبَ ثَلاثَةٌ ثُمَّ أَمْسَكَ فَقَالَ لَهُ حَبَّةُ الْعُرَنِيُّ يَا أَمِيرَ الْمُؤْمِنِينَ قُلْتَ الذُّنُوبُ ثَلاثَةٌ ثُمَّ أَمْسَكْتَ فَقَالَ مَا ذَكَرْتُهَا إِلا وَأَنَا أُرِيدُ أَنْ أُفَسِّرَهَا وَلَكِنْ عَرَضَ لِي بُهْرٌ حَالَ بَيْنِي وَبَيْنَ الْكَلامِ نَعَمْ الذُّنُوبُ ثَلاثَةٌ فَذَنْبٌ مَغْفُورٌ وَذَنْبٌ غَيْرُ مَغْفُورٍ وَذَنْبٌ نَرْجُو لِصَاحِبِهِ وَنَخَافُ عَلَيْهِ قَالَ يَا أَمِيرَ الْمُؤْمِنِينَ فَبَيِّنْهَا لَنَا قَالَ نَعَمْ أَمَّا الذَّنْبُ الْمَغْفُورُ فَعَبْدٌ عَاقَبَهُ الله عَلَى ذَنْبِهِ فِي الدُّنْيَا فَالله أَحْلَمُ وَأَكْرَمُ مِنْ أَنْ يُعَاقِبَ عَبْدَهُ مَرَّتَيْنِ وَأَمَّا الذَّنْبُ الَّذِي لا يُغْفَرُ فَمَظَالِمُ الْعِبَادِ بَعْضِهِمْ لِبَعْضٍ إِنَّ الله تَبَارَكَ وَتَعَالَى إِذَا بَرَزَ لِخَلْقِهِ أَقْسَمَ قَسَماً عَلَى نَفْسِهِ فَقَالَ وَعِزَّتِي وَجَلالِي لا يَجُوزُنِي ظُلْمُ ظَالِمٍ وَلَوْ كَفٌّ بِكَفٍّ وَلَوْ مَسْحَةٌ بِكَفٍّ وَلَوْ نَطْحَةٌ مَا بَيْنَ الْقَرْنَاءِ إِلَى الْجَمَّاءِ فَيَقْتَصُّ لِلْعِبَادِ بَعْضِهِمْ مِنْ بَعْضٍ حَتَّى لا تَبْقَى لأحَدٍ عَلَى أَحَدٍ مَظْلِمَةٌ ثُمَّ يَبْعَثُهُمْ لِلْحِسَابِ وَأَمَّا الذَّنْبُ الثَّالِثُ فَذَنْبٌ سَتَرَهُ الله عَلَى خَلْقِهِ وَرَزَقَهُ التَّوْبَةَ مِنْهُ فَأَصْبَحَ خَائِفاً مِنْ ذَنْبِهِ رَاجِياً لِرَبِّهِ فَنَحْنُ لَهُ كَمَا هُوَ لِنَفْسِهِ نَرْجُو لَهُ الرَّحْمَةَ وَنَخَافُ عَلَيْهِ الْعَذَابَ.",
          "English Text": "1. Ali ibn Ibrahim has narrated from his father from ‘Abd al-Rahman ibn Hammad from certain individuals of his people in a marfu’ manner who has said the following: “Once Amir al-Mu’minin, Ali ibn abu Talib  climbed the Minbar (pulpit) in al-Kufah, praised Allah and spoke of His glory and then said, ‘O people sins are of three kinds’ and he remained quiet. Habbah al-‘Arani, said, ‘O Amir al-Mu’minin, you just said, “Sins are of three kinds, and then remained silent.’ The Imam said, ‘Yes, I mentioned them and wanted to explain and inteipret them but a breathing problem prevented me from speaking. Yes, sins are of three kinds: A sin that is forgiven, a sin that is not forgiven and a sin for whose owner we have hopes and fears.’ The man said, ‘O Amir al-Mu’minin, explain them for us.’ “The Imam said, ‘Yes, the sin that is forgiven is one for which Allah has punished the sinner in this world and He is by far much Forbearing and Honorable to punish His servant twice. “The sin that is not forgiven is people’s injustice to each other (in the matters of property and so forth). When Allah, the Most Blessed, the Most High, will manifest himself to His creatures, He will swear by His Ownself saying, ‘By My Majesty and Glory that the injustice of the unjust cannot bypass Me, even though it is in the form of a slap for a slap, a nibbing for a slap, or blow by those having horns to those without horns.’ He will retaliate for His servants from the others until no one will be left without receiving justice and thereafter they will be sent for reckoning. “The third kind of sin is the sin that Allah has covered for His servants and has granted them repentance. He lives in fear because of his sin with hopes in his Lord. We toward him are just as he is to himself. We wish he will be granted mercy and fear for his suffering punishment.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/321)"
          }
        }
      },
      "Chapter #199": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 2: Other Rare Ahadith",
          "Link": "https://thaqalayn.net/hadith/2/1/199/3",
          "Arabic Text": "3ـ عَلِيُّ بْنُ إِبْرَاهِيمَ رَفَعَهُ قَالَ لَمَّا حُمِلَ عَلِيُّ بْنُ الْحُسَيْنِ (صَلَّى اللهُ عَلَيْهِ وآلِه) إِلَى يَزِيدَ بْنِ مُعَاوِيَةَ فَأُوقِفَ بَيْنَ يَدَيْهِ قَالَ يَزِيدُ لَعَنَهُ الله وَما أَصابَكُمْ مِنْ مُصِيبَةٍ فَبِما كَسَبَتْ أَيْدِيكُمْ فَقَالَ عَلِيُّ بْنُ الْحُسَيْنِ (عَلَيهِما السَّلام) لَيْسَتْ هَذِهِ الآيَةُ فِينَا إِنَّ فِينَا قَوْلَ الله عَزَّ وَجَلَّ ما أَصابَ مِنْ مُصِيبَةٍ فِي الأرْضِ وَلا فِي أَنْفُسِكُمْ إِلا فِي كِتابٍ مِنْ قَبْلِ أَنْ نَبْرَأَها إِنَّ ذلِكَ عَلَى الله يَسِيرٌ. ",
          "English Text": "3. Ali ibn Ibrahim has narrated in a marfu’ manner has narrated from Abu ‘Abd Allah  who has said the following: “When Ali ibn al-Husayn  was taken as a captive to Damascus and was made to stand before Yazid ibn Mu’awiyah, he, (Yazid) may Allah condemn him, read this verse: ‘Whatever affliction befalls you is because of what your hands have obtained,’ (42:30) Ali ibn al-Husayn  said, ‘This verse is not about us. What applies to us are the words of Allah, the Most Majestic, the Most Holy, ‘Whatever hardships you face on earth and in your souls, were written in the Book before the creation of souls. This is certainly easy for Allah.’” (57:22) ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/348)"
          }
        }
      },
      "Chapter #202": {
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 2: Gradual Progress",
          "Link": "https://thaqalayn.net/hadith/2/1/202/4",
          "Arabic Text": "4ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ الْمِنْقَرِيِّ عَنْ حَفْصِ بْنِ غِيَاثٍ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ كَمْ مِنْ مَغْرُورٍ بِمَا قَدْ أَنْعَمَ الله عَلَيْهِ وَكَمْ مِنْ مُسْتَدْرَجٍ بِسَتْرِ الله عَلَيْهِ وَكَمْ مِنْ مَفْتُونٍ بِثَنَاءِ النَّاسِ عَلَيْهِ. ",
          "English Text": "4. Ali ibn Ibrahim has narrated from his father from al-Qasim ibn Muhammad from Sulayman (ibn Dawud) al-Minqari from Hafs ibn Ghiyath from Abu ‘Abdillah  who has said the following: “How many are those who suffer losses due to the bounties that Allah grant them! How many are those who gradually move to destruction due to Allah’s covering their sins! How many are of the people misled due to other’s prais and applause for them!”’ ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " لم يذكره    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/354)"
          }
        }
      },
      "Chapter #203": {
        "Hadith #5": {
          "Title": "Al-Kafi - Volume 2: Evaluation of Deeds",
          "Link": "https://thaqalayn.net/hadith/2/1/203/5",
          "Arabic Text": "5ـ عَنْهُ عَنْ بَعْضِ أَصْحَابِنَا رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) احْمِلْ نَفْسَكَ لِنَفْسِكَ فَإِنْ لَمْ تَفْعَلْ لَمْ يَحْمِلْكَ غَيْرُكَ.",
          "English Text": "5. It is narrated from him (narrator of the Hadith above) from certain individuals of our people in a marfu’ manner who has said the following: “Abu ‘Abd Allah  has said, ‘Hold your soul responsible for yourself. If you did not do so others will not do for you.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/361)"
          }
        },
        "Hadith #6": {
          "Title": "Al-Kafi - Volume 2: Evaluation of Deeds",
          "Link": "https://thaqalayn.net/hadith/2/1/203/6",
          "Arabic Text": "6ـ عَنْهُ رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) لِرَجُلٍ إِنَّكَ قَدْ جُعِلْتَ طَبِيبَ نَفْسِكَ وَبُيِّنَ لَكَ الدَّاءُ وَعُرِّفْتَ آيَةَ الصِّحَّةِ وَدُلِلْتَ عَلَى الدَّوَاءِ فَانْظُرْ كَيْفَ قِيَامُكَ عَلَى نَفْسِكَ.",
          "English Text": "6. It is narrated from him (narrator of the Hadith above) in a marfu’ manner from Abu ‘Abdillah  who has said the following to a man: “You have been made the physician for your own self. Medicine is prescribed for you; signs of good health are shown to you, and the direction for medicine is given to you. It is all up to you how you treat yourself.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/361)"
          }
        },
        "Hadith #7": {
          "Title": "Al-Kafi - Volume 2: Evaluation of Deeds",
          "Link": "https://thaqalayn.net/hadith/2/1/203/7",
          "Arabic Text": "7ـ عَنْهُ رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) لِرَجُلٍ اجْعَلْ قَلْبَكَ قَرِيناً بَرّاً أَوْ وَلَداً وَاصِلاً وَاجْعَلْ عَمَلَكَ وَالِداً تَتَّبِعُهُ وَاجْعَلْ نَفْسَكَ عَدُوّاً تُجَاهِدُهَا وَاجْعَلْ مَالَكَ عَارِيَّةً تَرُدُّهَا.",
          "English Text": "7. It is narrated from him (narrator of the Hadith above) in a marfu’ manner from Abu ‘Abdillah  who has said the following to a man: “Make your heart a virtuous companion for yourself or like a child who does not fail to maintain good relations with parents. Consider your deeds as your father whom you follow, consider your soul as your enemy against whom you strive and consider your properties as borrowed for the safe return of which you are responsible.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/362)"
          }
        },
        "Hadith #8": {
          "Title": "Al-Kafi - Volume 2: Evaluation of Deeds",
          "Link": "https://thaqalayn.net/hadith/2/1/203/8",
          "Arabic Text": "8ـ وَعَنْهُ رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) اقْصُرْ نَفْسَكَ عَمَّا يَضُرُّهَا مِنْ قَبْلِ أَنْ تُفَارِقَكَ وَاسْعَ فِي فَكَاكِهَا كَمَا تَسْعَى فِي طَلَبِ مَعِيشَتِكَ فَإِنَّ نَفْسَكَ رَهِينَةٌ بِعَمَلِكَ.",
          "English Text": "8. It is narrated from him (narrator of the Hadith above) in a marfu’ manner from Abu ‘Abdillah  who has said the following: “Hold back your soul from that which harms it before it departs you, strive to set it free just as you strive to make a living; your soul’s well being depends upon your good deeds.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/363)"
          }
        },
        "Hadith #9": {
          "Title": "Al-Kafi - Volume 2: Evaluation of Deeds",
          "Link": "https://thaqalayn.net/hadith/2/1/203/9",
          "Arabic Text": "9ـ عَنْهُ عَنْ بَعْضِ أَصْحَابِهِ رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) كَمْ مِنْ طَالِبٍ لِلدُّنْيَا لَمْ يُدْرِكْهَا وَمُدْرِكٍ لَهَا قَدْ فَارَقَهَا فَلا يَشْغَلَنَّكَ طَلَبُهَا عَنْ عَمَلِكَ وَالْتَمِسْهَا مِنْ مُعْطِيهَا وَمَالِكِهَا فَكَمْ مِنْ حَرِيصٍ عَلَى الدُّنْيَا قَدْ صَرَعَتْهُ وَاشْتَغَلَ بِمَا أَدْرَكَ مِنْهَا عَنْ طَلَبِ آخِرَتِهِ حَتَّى فَنِيَ عُمُرُهُ وَأَدْرَكَهُ أَجَلُهُ. وَقَالَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) الْمَسْجُونُ مَنْ سَجَنَتْهُ دُنْيَاهُ عَنْ آخِرَتِهِ.",
          "English Text": "9. It is narrated from him (narrator of the Hadith above) from certain individuals of his people in a marfu’ manner from Abu ‘Abdillah  who has said the following: “How many are those who seek worldly gains but can not achieve them and how many are those who had achieved worldly gains but have already departed them! Do not allow your seeking worldly gains prevent you from good deeds. You must request worldly gains from the One Who grants them and is the owner of the same. How many were those who were greedy of the worldly gains that were destroyed and whose preoccupation in them prevented them from seeking the gains of the next life until their lives finished and the appointed time approached them! “Abu ‘Abd Allah  has said, ‘A prisoner is one whose worldly affairs imprison him so he cannot do anything for his next life.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/363)"
          }
        },
        "Hadith #10": {
          "Title": "Al-Kafi - Volume 2: Evaluation of Deeds",
          "Link": "https://thaqalayn.net/hadith/2/1/203/10",
          "Arabic Text": "10ـ وَعَنْهُ رَفَعَهُ عَنْ أَبِي جَعْفَرٍ (عَلَيهِ السَّلام) قَالَ قَالَ إِذَا أَتَتْ عَلَى الرَّجُلِ أَرْبَعُونَ سَنَةً قِيلَ لَهُ خُذْ حِذْرَكَ فَإِنَّكَ غَيْرُ مَعْذُورٍ وَلَيْسَ ابْنُ الأرْبَعِينَ بِأَحَقَّ بِالْحِذْرِ مِنِ ابْنِ الْعِشْرِينَ فَإِنَّ الَّذِي يَطْلُبُهُمَا وَاحِدٌ وَلَيْسَ بِرَاقِدٍ فَاعْمَلْ لِمَا أَمَامَكَ مِنَ الْهَوْلِ وَدَعْ عَنْكَ فُضُولَ الْقَوْلِ.",
          "English Text": "10. It is narrated from him (narrator of the Hadith above) in a marfu’ manner from abu Ja’far  who has said the following: “When a man reaches the age of forty it is said to him, ‘Beware, you have no excuses!’ In fact, a person at the age of forty is not obliged to exercise caution against sins more than the person at the age of twenty. What is after both of them is the same (that is death) and it is not sleeping. Perform good deeds for what lies ahead of frightening conditions and stop the unnecessary words.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/364)"
          }
        }
      },
      "Chapter #208": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 2: Nation ’s Exemption From Certain Issues",
          "Link": "https://thaqalayn.net/hadith/2/1/208/2",
          "Arabic Text": "2ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ النَّهْدِيِّ رَفَعَهُ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) وُضِعَ عَنْ أُمَّتِي تِسْعُ خِصَالٍ الْخَطَأُ وَالنِّسْيَانِ وَمَا لا يَعْلَمُونَ وَمَا لا يُطِيقُونَ وَمَا اضْطُرُّوا إِلَيْهِ وَمَا اسْتُكْرِهُوا عَلَيْهِ وَالطِّيَرَةُ وَالْوَسْوَسَةُ فِي التَّفَكُّرِ فِي الْخَلْقِ وَالْحَسَدُ مَا لَمْ يُظْهِرْ بِلِسَانٍ أَوْ يَدٍ. ",
          "English Text": "2. Al-Husayn ibn has narrated from Ahmad ibn Muhammad al-Hindi in a marfu’ manner from Abu ‘Abdillah  who has said the following: “The Messenger of Allah has said, ‘My followers are exempt from responsibilities in nine kinds of acts and conditions: 1. Acting by mistake, 2. Out of forgetfulness, 3. Things they have no knowledge of, 4. Things they are not able to do, 5. Things they needed badly, 6. Things they are compelled to do, 7. Omens, 8. Temptations in thinking about creatures, 9. Feeling envy as long as it is not expressed by their tongues or hands.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/391)"
          }
        }
      },
      "Chapter #209": {
        "Hadith #6": {
          "Title": "Al-Kafi - Volume 2: Belief is not affected by Evil Deeds and Disbelief Does not Benefit from Good Deeds",
          "Link": "https://thaqalayn.net/hadith/2/1/209/6",
          "Arabic Text": "6ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ الرَّيَّانِ بْنِ الصَّلْتِ رَفَعَهُ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ كَانَ أَمِيرُ الْمُؤْمِنِينَ (عَلَيهِ السَّلام) كَثِيراً مَا يَقُولُ فِي خُطْبَتِهِ يَا أَيُّهَا النَّاسُ دِينَكُمْ دِينَكُمْ فَإِنَّ السَّيِّئَةَ فِيهِ خَيْرٌ مِنَ الْحَسَنَةِ فِي غَيْرِهِ وَالسَّيِّئَةُ فِيهِ تُغْفَرُ وَالْحَسَنَةُ فِي غَيْرِهِ لا تُقْبَلُ.",
          "English Text": "6. Ali ibn Ibrahim has narrated from his father from Muhammad ibn al-Rayyan ibn al-Salt in a marfu’ manner from Abu ‘Abdillah  who has said the following: “Amir al-Mu’minin, Ali ibn abu Talib  would very often say about sin, ‘O people, pay attention to your religion, pay attention to your religion. An evil deed in it (your religion) is better than a good deed in something else. An evil deed in your religion can be forgiven (by means of repenting) but a good deed in something else will not be accepted.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/398)"
          }
        }
      }
    },
    "Book #2": {
      "Chapter #3": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 2: Prayer Diverts Misfortune and Allah ’s Decision",
          "Link": "https://thaqalayn.net/hadith/2/2/3/1",
          "Arabic Text": "1ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ قَالَ سَمِعْتُهُ يَقُولُ إِنَّ الدُّعَاءَ يَرُدُّ الْقَضَاءَ يَنْقُضُهُ كَمَا يُنْقَضُ السِّلْكُ وَقَدْ أُبْرِمَ إِبْرَاماً.",
          "English Text": "1. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from Hammad ibn ‘Uthman who has said the following: “I heard Abu ‘Abdillah  saying, ‘Prayer and pleading before Allah for help repeals al- Qada, what is already determined, and severs it as threads are incised, even though it (threads) may have been coiled and knotted extremely strong and solid.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " كالصحيح   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/12)"
          }
        },
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 2: Prayer Diverts Misfortune and Allah ’s Decision",
          "Link": "https://thaqalayn.net/hadith/2/2/3/2",
          "Arabic Text": "2ـ عَنْهُ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ عُمَرَ بْنِ يَزِيدَ قَالَ سَمِعْتُ أَبَا الْحَسَنِ (عَلَيهِ السَّلام) يَقُولُ إِنَّ الدُّعَاءَ يَرُدُّ مَا قَدْ قُدِّرَ وَمَا لَمْ يُقَدَّرْ قُلْتُ وَمَا قَدْ قُدِّرَ عَرَفْتُهُ فَمَا لَمْ يُقَدَّرْ قَالَ حَتَّى لا يَكُونَ.",
          "English Text": "2. It is narrated from him (narrator of the Hadith above) from his father from Ibn Abi ‘Umayr from Hisham ibn Salim from ‘Umar ibn Yazid who has said the following: “I heard abu al-Hassan  saying, ‘Prayer, and pleading before Allah for help, repeals Quddira, what is already measured, and the unmeasured.’ I (the narrator) then asked the Imam, ‘I know the meaning of what is ‘Measured’, but what is the meaning of the ‘Unmeasured’?’ The Imam said, ‘So that it (a measure, of misfortune) will not come into being.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " كالصحيح   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/13)"
          }
        }
      },
      "Chapter #8": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 2: Certainty in (the Effectiveness of) Prayer",
          "Link": "https://thaqalayn.net/hadith/2/2/8/1",
          "Arabic Text": "1ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ سُلَيْمٍ الْفَرَّاءِ عَمَّنْ حَدَّثَهُ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ إِذَا دَعَوْتَ فَظُنَّ أَنَّ حَاجَتَكَ بِالْبَابِ.",
          "English Text": "1. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from Sulaym al-Farra’ from those whom he has mentioned (in his book) from Abu ‘Abdillah  who has said the following: “Abu ‘Abd Allah  has said, ‘Whenever you pray and plead before Allah for help, consider that what you have asked for has arrived at the door.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل وقد يعد حسن ا  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/23)"
          }
        }
      },
      "Chapter #11": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 2: Describing One’s Needs",
          "Link": "https://thaqalayn.net/hadith/2/2/11/1",
          "Arabic Text": "1ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي عَبْدِ الله الْفَرَّاءِ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ إِنَّ الله تَبَارَكَ وَتَعَالَى يَعْلَمُ مَا يُرِيدُ الْعَبْدُ إِذَا دَعَاهُ وَلَكِنَّهُ يُحِبُّ أَنْ تُبَثَّ إِلَيْهِ الْحَوَائِجُ فَإِذَا دَعَوْتَ فَسَمِّ حَاجَتَكَ. وَفِي حَدِيثٍ آخَرَ قَالَ قَالَ إِنَّ الله عَزَّ وَج��لَّ يَعْلَمُ حَاجَتَكَ وَمَا تُرِيدُ وَلَكِنْ يُحِبُّ أَنْ تُبَثَّ إِلَيْهِ الْحَوَائِجُ.",
          "English Text": "1. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from abu ‘Abd Allah al-Farra’ from Abu ‘Abdillah  who has said the following: “Allah, the Most Blessed, the Most High, knows what a servant wants when he prays and pleads before Him for help, but He loves that one’s needs are brought before Him in detail. Whenever you pray, name your request. ’ In another Hadith it is said, ‘Allah, the Most Blessed, the Most High, knows your needs and what you want, but He loves that you name (identify) in detail your needs before Him.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " حسن وقد يعد مجهول وآخره مرسل   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/32)"
          }
        }
      },
      "Chapter #12": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 2: Secrecy in Prayer",
          "Link": "https://thaqalayn.net/hadith/2/2/12/1",
          "Arabic Text": "1ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ أَبِي هَمَّامٍ إِسْمَاعِيلَ بْنِ هَمَّامٍ عَنْ أَبِي الْحَسَنِ الرِّضَا (عَلَيهِ السَّلام) قَالَ دَعْوَةُ الْعَبْدِ سِرّاً دَعْوَةً وَاحِدَةً تَعْدِلُ سَبْعِينَ دَعْوَةً عَلانِيَةً. وَفِي رِوَايَةٍ أُخْرَى دَعْوَةٌ تُخْفِيهَا أَفْضَلُ عِنْدَ الله مِنْ سَبْعِينَ دَعْوَةً تُظْهِرُهَا.",
          "English Text": "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from abu Hammam Isma’Il ibn Hammam from abu al-Hassan al-Rida  who has said the following: “A servant’s praying and pleading before Allah for help, privately once, is equal to seventy such prayers in public.’ In another Hadith it is said: ‘A prayer that you (hide from people) is better before Allah than seventy prayers made in public.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " صحيح وآخره مرسل   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/33)"
          }
        }
      },
      "Chapter #13": {
        "Hadith #10": {
          "Title": "Al-Kafi - Volume 2: The Times and Conditions in which there is Hope for Acceptance",
          "Link": "https://thaqalayn.net/hadith/2/2/13/10",
          "Arabic Text": "10ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيهِ السَّلام) يَقُولُ إِنَّ فِي اللَّيْلِ لَسَاعَةً مَا يُوَافِقُهَا عَبْدٌ مُسْلِمٌ ثُمَّ يُصَلِّي وَيَدْعُو الله عَزَّ وَجَلَّ فِيهَا إِلا اسْتَجَابَ لَهُ فِي كُلِّ لَيْلَةٍ قُلْتُ أَصْلَحَكَ الله وَأَيُّ سَاعَةِ هِيَ مِنَ اللَّيْلِ قَالَ إِذَا مَضَى نِصْفُ اللَّيْلِ وَهِيَ السُّدُسُ الأوَّلُ مِنْ أَوَّلِ النِّصْفِ. ",
          "English Text": "10. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from ‘Umar ibn ‘Udhaynah who has said the following: “I heard Abu ‘Abdillah  saying, ‘In a night there is an hour during which if a Muslim servant (of Allah) has the opportunity to perform a formal prayer and then plead before Allah, the Most Majestic, the Most Holy, for help, he will receive an answer every night.’ I (the narrator) then asked, ‘May Allah grant you well being, which hour of night is that?’ The Imam said, ‘It is the first one-sixth of the second half of the night.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " سكت عنه   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/40)"
          }
        }
      },
      "Chapter #19": {
        "Hadith #7": {
          "Title": "Al-Kafi - Volume 2: Delay in the Acceptance of Prayer",
          "Link": "https://thaqalayn.net/hadith/2/2/19/7",
          "Arabic Text": "7ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الله بْنِ الْمُغِيرَةِ عَنْ غَيْرِ وَاحِدٍ مِنْ أَصْحَابِنَا قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) إِنَّ الْعَبْدَ الْوَلِيَّ لله يَدْعُو الله عَزَّ وَجَلَّ فِي الأمْرِ يَنُوبُهُ فَيَقُولُ لِلْمَلَكِ الْمُوَكَّلِ بِهِ اقْضِ لِعَبْدِي حَاجَتَهُ وَلا تُعَجِّلْهَا فَإِنِّي أَشْتَهِي أَنْ أَسْمَعَ نِدَاءَهُ وَصَوْتَهُ وَإِنَّ الْعَبْدَ الْعَدُوَّ لله لَيَدْعُو الله عَزَّ وَجَلَّ فِي الأمْرِ يَنُوبُهُ فَيُقَالُ لِلْمَلَكِ الْمُوَكَّلِ بِهِ اقْضِ لِعَبْدِي حَاجَتَهُ وَعَجِّلْهَا فَإِنِّي أَكْرَهُ أَنْ أَسْمَعَ نِدَاءَهُ وَصَوْتَهُ قَالَ فَيَقُولُ النَّاسُ مَا أُعْطِيَ هَذَا إِلا لِكَرَامَتِهِ وَلا مُنِعَ هَذَا إِلا لِهَوَانِهِ.",
          "English Text": "7. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from ‘Abd Allah ibn al-Mughirah from more than one individual of our people who has said the following: “Abu ‘Abd Allah  has said, ‘A servant who is a friend of Allah may pray to Allah, the Most Majestic, the Most Holy, for a matter in his intention and Allah says to the angel guarding him, “Provide help to My servant but keep it on hold and do not hurry; I desire to hear his call and voice.” On the other hand a servant who is not a friend of Allah may pray to Allah, the Most Majestic, the Most Holy, for a matter in his intention and Allah says to the angel guarding him, ‘Provide him help quickly; I dislike his call and voice.’ “The Imam said, ‘People will say, “This person received help due to his merit and honor and he was denied due to his worthlessness.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالحسن   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/84)"
          }
        }
      },
      "Chapter #25": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 2: Speaking of Allah, the Majestic, the Glorious, Secretly",
          "Link": "https://thaqalayn.net/hadith/2/2/25/3",
          "Arabic Text": "3ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنِ ابْنِ فَضَّالٍ رَفَعَهُ قَالَ قَالَ الله عَزَّ وَجَلَّ لِعِيسَى (عَلَيهِ السَّلام) يَا عِيسَى اذْكُرْنِي فِي نَفْسِكَ أَذْكُرْكَ فِي نَفْسِي وَاذْكُرْنِي فِي مَلَئِكَ أَذْكُرْكَ فِي مَلأ خَيْرٍ مِنْ مَلأ الآدَمِيِّينَ يَا عِيسَى أَلِنْ لِي قَلْبَكَ وَأَكْثِرْ ذِكْرِي فِي الْخَلَوَاتِ وَاعْلَمْ أَنَّ سُرُورِي أَنْ تُبَصْبِصَ إِلَيَّ وَكُنْ فِي ذَلِكَ حَيّاً وَلا تَكُنْ مَيِّتاً.",
          "English Text": "3. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from ibn Faddal in a marfu ’ manner from The Imam  who has said the following: “Allah, the Most Majestic, the Most Holy, said to Jesus, peace be upon him, ‘O Jesus, speak of Me to yourself; I speak of you to Myself, speak of Me in public; I speak of you in public, which is better than man’s public. O Jesus, soften your heart for Me, speak of Me very often privately and note that My happiness is in your expressing humility before Me and that you must act as a living one in such condition, and not as a dead person. ’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/139)"
          }
        }
      },
      "Chapter #27": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 2: Praise and Glorification",
          "Link": "https://thaqalayn.net/hadith/2/2/27/1",
          "Arabic Text": "1ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ أَبِي سَعِيدٍ الْقَمَّاطِ عَنِ الْمُفَضَّلِ قَالَ قُلْتُ لأبِي عَبْدِ الله (عَلَيهِ السَّلام) جُعِلْتُ فِدَاكَ عَلِّمْنِي دُعَاءً جَامِعاً فَقَالَ لِيَ احْمَدِ الله فَإِنَّهُ لا يَبْقَى أَحَدٌ يُصَلِّي إِلا دَعَا لَكَ يَقُولُ سَمِعَ الله لِمَنْ حَمِدَهُ.",
          "English Text": "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from abu Sa’Id al-Qammat from al-Mufaddal who has said the following: “Once I said to Abu ‘Abdillah  ‘May Allah keep my soul in service for your cause, teach me a comperehensive prayer.’ The Imam said to me, ‘Praise Allah; everyone who performs prayer prays for you saying, “Allah listens to (answers the prayers of) those who praise Him” (a reference to the meaning of the phrase said after Ruku ’ in a prayer).’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مختلف فيه   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/144)"
          }
        }
      },
      "Chapter #28": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 2: Plea for Forgiveness",
          "Link": "https://thaqalayn.net/hadith/2/2/28/3",
          "Arabic Text": "3ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ يَاسِرٍ عَنِ الرِّضَا (عَلَيهِ السَّلام) قَالَ مَثَلُ الإسْتِغْفَارِ مَثَلُ وَرَقٍ عَلَى شَجَرَةٍ تُحَرَّكُ فَيَتَنَاثَرُ وَالْمُسْتَغْفِرُ مِنْ ذَنْبٍ وَيَفْعَلُهُ كَالْمُسْتَهْزِئِ بِرَبِّهِ.",
          "English Text": "3. Ali ibn Ibrahim has narrated from his father from Yasir from al-Rida  who has said the following: “A plea for forgiveness is like shaking a tree from which leaves fall off. One who pleas forgiveness and commits sins is like one who derides his Lord.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول على المشهور حسن عند ي  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/153)"
          }
        }
      },
      "Chapter #29": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 2: Al-Tasbih, saying, ‘Glory belongs to Allah,’ Al-Tahlil, saying, ‘No one deserves to be worshipped except Allah,’ Al-Takbir, saying, ‘Allah is greater than can be described’",
          "Link": "https://thaqalayn.net/hadith/2/2/29/2",
          "Arabic Text": "2ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ حَمَّادٍ عَنْ رِبْعِيٍّ عَنْ فُضَيْلٍ عَنْ أَحَدِهِمَا (عَلَيهِما السَّلام) قَالَ سَمِعْتُهُ يَقُولُ أَكْثِرُوا مِنَ التَّهْلِيلِ وَالتَّكْبِيرِ فَإِنَّهُ لَيْسَ شَيْ‏ءٌ أَحَبَّ إِلَى الله عَزَّ وَجَلَّ مِنَ التَّهْلِيلِ وَالتَّكْبِيرِ.",
          "English Text": "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Sinan from Hammad from Rib’ I from Fudayl who has said the following: “I heard one of the two Imam  (abu Ja’far or abu ‘Abd Allah) saying, ‘Increase al- Tahlil and al-Takbir, there is nothing more beloved to Allah, the Most Majestic, the Most Holy, than al-Tahlil and al-Takbir , ’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف على المشهور صحيح عند ي   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/161)"
          }
        }
      },
      "Chapter #30": {
        "Hadith #7": {
          "Title": "Al-Kafi - Volume 2: Praying for Brothers (in Belief) in Their Absence",
          "Link": "https://thaqalayn.net/hadith/2/2/30/7",
          "Arabic Text": "7ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَعَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ أَبِي عُبَيْدَةَ عَنْ ثُوَيْرٍ قَالَ سَمِعْتُ عَلِيَّ بْنَ الْحُسَيْنِ (عَلَيهِما السَّلام) يَقُولُ إِنَّ الْمَلائِكَةَ إِذَا سَمِعُوا الْمُؤْمِنَ يَدْعُو لأخِيهِ الْمُؤْمِنِ بِظَهْرِ الْغَيْبِ أَوْ يَذْكُرُهُ بِخَيْرٍ قَالُوا نِعْمَ الأخُ أَنْتَ لأخِيكَ تَدْعُو لَهُ بِالْخَيْرِ وَهُوَ غَائِبٌ عَنْكَ وَتَذْكُرُهُ بِخَيْرٍ قَدْ أَعْطَاكَ الله عَزَّ وَجَلَّ مِثْلَيْ مَا سَأَلْتَ لَهُ وَأَثْنَى عَلَيْكَ مِثْلَيْ مَا أَثْنَيْتَ عَلَيْهِ وَلَكَ الْفَضْلُ عَلَيْهِ وَإِذَا سَمِعُوهُ يَذْكُرُ أَخَاهُ بِسُوءٍ وَيَدْعُو عَلَيْهِ قَالُوا لَهُ بِئْسَ الأخُ أَنْتَ لأخِيكَ كُفَّ أَيُّهَا الْمُسَتَّرُ عَلَى ذُنُوبِهِ وَعَوْرَتِهِ وَارْبَعْ عَلَى نَفْسِكَ وَاحْمَدِ الله الَّذِي سَتَرَ عَلَيْكَ وَاعْلَمْ أَنَّ الله عَزَّ وَجَلَّ أَعْلَمُ بِعَبْدِهِ مِنْكَ. ",
          "English Text": "7. A number of our people have narrated from Sahl ibn Ziyad and Ali ibn Ibrahim has narrated from his father all from ibn Mahbub from ibn Ri’ab from abu ‘Ubaydah from Thuwayr who has said the following: “I heard Ali ibn al-Husayn  saying, ‘When the angels hear the believing person praying for his brother (in belief) in his absence or speak of him good, they say, “You are a good brother (in belief). You pray for him in his absence and speak good of him. Allah, the Most Majestic, the Most Holy, has granted you double of what you asked for him and He has praised you double of your praising him and you have excellence over him, but if they (angels) hear him speak evil of his brother (in belief), and pray against him, they will say, ‘You are a bad brother for him! Stop, O you whose sins and privacy are covered, reduce your burden. Praise and thank Allah, Who has covered you, and notice that Allah, the Most Majestic, the Most Holy, knows more about His servant than you do.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول ويمكن أن يعد حسنا    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/169)"
          }
        }
      },
      "Chapter #37": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 2: One’s Saying: No One Deserves to be Worshipped Except Allah, Allah is Greater than Every ones Description",
          "Link": "https://thaqalayn.net/hadith/2/2/37/1",
          "Arabic Text": "1ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى رَفَعَهُ عَنْ حَرِيزٍ عَنْ يَعْقُوبَ الْقُمِّيِّ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ ثَمَنُ الْجَنَّةِ لا إِلَهَ إِلا الله وَالله أَكْبَرُ.",
          "English Text": "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa in a marfu ’ manner from Hariz from Ya’qub al-Qummi from Abu ‘Abdillah  who has said the following: “The cost of paradise is (sincerely) saying: ‘No one deserves to be worshipped except Allah and Allah is greater than everyones’ description.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/200)"
          }
        }
      },
      "Chapter #48": {
        "Hadith #12": {
          "Title": "Al-Kafi - Volume 2: The Word in the Morning and Evening",
          "Link": "https://thaqalayn.net/hadith/2/2/48/12",
          "Arabic Text": "12ـ عَنْهُ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ رَفَعَهُ إِلَى أَمِيرِ الْمُؤْمِنِينَ (عَلَيهِ السَّلام) أَنَّهُ كَانَ يَقُولُ اللهمَّ إِنِّي وَهَذَا النَّهَارَ خَلْقَانِ مِنْ خَلْقِكَ اللهمَّ لا تَبْتَلِنِي بِهِ وَلا تَبْتَلِهِ بِي اللهمَّ وَلا تُرِهِ مِنِّي جُرْأَةً عَلَى مَعَاصِيكَ وَلا رُكُوباً لِمَحَارِمِكَ اللهمَّ اصْرِفْ عَنِّيَ الأزْلَ وَاللأوَاءَ وَالْبَلْوَى وَسُوءَ الْقَضَاءِ وَشَمَاتَةَ الأعْدَاءِ وَمَنْظَرَ السَّوْءِ فِي نَفْسِي وَمَالِي قَالَ وَمَا مِنْ عَبْدٍ يَقُولُ حِينَ يُمْسِي وَيُصْبِحُ رَضِيتُ بِالله رَبّاً وَبِالإسْلامِ دِيناً وَبِمُحَمَّدٍ (صَلَّى اللهُ عَلَيْهِ وآلِه) نَبِيّاً وَبِالْقُرْآنِ بَلاغاً وَبِعَلِيٍّ إِمَاماً ثَلاثاً إِلا كَانَ حَقّاً عَلَى الله الْعَزِيزِ الْجَبَّارِ أَنْ يُرْضِيَهُ يَوْمَ الْقِيَامَةِ قَالَ وَكَانَ يَقُولُ (عَلَيهِ السَّلام) إِذَا أَمْسَى أَصْبَحْنَا لله شَاكِرِينَ وَأَمْسَيْنَا لله حَامِدِينَ فَلَكَ الْحَمْدُ كَمَا أَمْسَيْنَا لَكَ مُسْلِمِينَ سَالِمِينَ قَالَ وَإِذَا أَصْبَحَ قَالَ أَمْسَيْنَا لله شَاكِرِينَ وَأَصْبَحْنَا لله حَامِدِينَ وَالْحَمْدُ لله كَمَا أَصْبَحْنَا لَكَ مُسْلِمِينَ سَالِمِينَ.",
          "English Text": "12. It is narrated from him (narrator of the Hadith above) from Muhammad ibn Ali in a marfu’ manner from Amir al-Mu’minin, Ali ibn abu Talib  who has said the following: “O Lord, I and this day are two creatures of Your creatures. O Lord, do not make me suffer from it and do not make it suffer from me. O Lord, do not allow it see me bold in disobeying You or committing unlawful things. O Lord, remove from me constraint and poverty, affliction and evil determination, and expression of joy from the enemy for bad things in me, and from being placed on an evil position, my property or myself. “The Imam has said, ‘Any servant (of Allah) who says in the morning or evening three times, “I accept that Allah is my Lord, Islam is my religion, Muhammad  is the Prophet, the Holy Quran is the text of Divine message and Ali  is my Imam,” three times, it will be a right upon Allah, the Majestic, the Compeller to make him happy on the Day of Judgment. ’ “The Imam has said that he (Ali ) would say in the evening, ‘We live in the morning thankful to Allah and we live in the evening praising Allah. All praise belongs to You as we live in the evening submitted to Y our will and in peace. ‘‘The Imam said, ‘He (Amir al-Mu’minin, Ali ibn abu Talib ) in the morning would say, “We live in the evening thankful to Allah and we live in the morning praising Allah, all praise belongs to Allah. We live in the morning submitted to Your will and in peace.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/236)"
          }
        },
        "Hadith #15": {
          "Title": "Al-Kafi - Volume 2: The Word in the Morning and Evening",
          "Link": "https://thaqalayn.net/hadith/2/2/48/15",
          "Arabic Text": "15ـ حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ مِنْ أَصْحَابِهِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ عِيسَى بْنِ عَبْدِ الله عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ إِذَا أَصْبَحْتَ فَقُلْ اللهمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا خَلَقْتَ وَذَرَأْتَ وَبَرَأْتَ فِي بِلادِكَ وَعِبَادِكَ اللهمَّ إِنِّي أَسْأَلُكَ بِجَلالِكَ وَجَمَالِكَ وَحِلْمِكَ وَكَرَمِكَ كَذَا وَكَذَا.",
          "English Text": "15. Humayd ibn Ziyad has narrated from al-Hassan ibn Muhammad ibn Sama’a from more than one person of his people from Aban ibn ‘Uthman from ‘Isa ibn ‘Abd Allah from Abu ‘Abdillah  who has said the following: “In the morning say, ‘O Lord, I seek protection from the evil of what You have created, spread and released in Your land and in Your servants. O Lord, I plead before You through Your glory, beauty, forbearance and honor for such and such favors . . . and mention your wishes.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالموثق  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/251)"
          }
        }
      },
      "Chapter #49": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 2: Prayer Before Sleeping and After Waking Up",
          "Link": "https://thaqalayn.net/hadith/2/2/49/2",
          "Arabic Text": "2ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ رَفَعَهُ إِلَى أَبِي عَبْدِ ال له (عَلَيهِ السَّلام) قَالَ إِذَا أَوَى أَحَدُكُمْ إِلَى فِرَاشِهِ فَلْيَقُلِ اللهمَّ إِنِّي احْتَبَسْتُ نَفْسِي عِنْدَكَ فَاحْتَبِسْهَا فِي مَحَلِّ رِضْوَانِكَ وَمَغْفِرَتِكَ وَإِنْ رَدَدْتَهَا إِلَى بَدَنِي فَارْدُدْهَا مُؤْمِنَةً عَارِفَةً بِحَقِّ أَوْلِيَائِكَ حَتَّى تَتَوَفَّاهَا عَلَى ذَلِكَ.",
          "English Text": "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad in a marfu’ manner from Abu ‘Abdillah  who has said the following: “When any of you is about to go to your bed you should say, ‘O Lord, I have placed my soul in Your custody, keep it secure in a place that You like, and forgive, and if You return it to my body, return it with belief, and with knowledge of the rights of Your friends until it will die upon such belief.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/292)"
          }
        },
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 2: Prayer Before Sleeping and After Waking Up",
          "Link": "https://thaqalayn.net/hadith/2/2/49/3",
          "Arabic Text": "3ـ حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحُسَيْنِ بْنِ مُحَمَّدٍ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ يَحْيَى بْنِ أَبِي الْعَلاءِ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) أَنَّهُ كَانَ يَقُولُ عِنْدَ مَنَامِهِ آمَنْتُ بِالله وَكَفَرْتُ بِالطَّاغُوتِ اللهمَّ احْفَظْنِي فِي مَنَامِي وَفِي يَقَظَتِي.",
          "English Text": "3. Humayd ibn Ziyad has narrated from al-Husayn ibn Muhammad from more than one person from Aban ibn ‘Uthman from Yahya ibn al-‘Ala’ from Abu ‘Abdillah  who has said the following: “At bedtime he (abu ‘Abd Allah ) would say, ‘I believe in Allah and reject the devil. O Lord, protect me in my sleep and when I am awake.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالموثق    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/294)"
          }
        },
        "Hadith #16": {
          "Title": "Al-Kafi - Volume 2: Prayer Before Sleeping and After Waking Up",
          "Link": "https://thaqalayn.net/hadith/2/2/49/16",
          "Arabic Text": "16ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَأَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ الأشْعَرِيِّ عَنِ ابْنِ الْقَدَّاحِ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ كَانَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) إِذَا أَوَى إِلَى فِرَاشِهِ قَالَ اللهمَّ بِاسْمِكَ أَحْيَا وَبِاسْمِكَ أَمُوتُ فَإِذَا قَامَ مِنْ نَوْمِهِ قَالَ الْحَمْدُ لله الَّذِي أَحْيَانِي بَعْدَ مَا أَمَاتَنِي وَإِلَيْهِ النُّشُورُ وَقَالَ قَالَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) مَنْ قَرَأَ عِنْدَ مَنَامِهِ آيَةَ الْكُرْسِيِّ ثَلاثَ مَرَّاتٍ وَالآيَةَ الَّتِي فِي آلِ عِمْرَانَ شَهِدَ الله أَنَّهُ لا إِلهَ إِلا هُوَ وَالْمَلائِكَةُ وَآيَةَ السُّخْرَةِ وَآيَةَ السَّجْدَةِ وُكِّلَ بِهِ شَيْطَانَانِ يَحْفَظَانِهِ مِنْ مَرَدَةِ الشَّيَاطِينِ شَاءُوا أَوْ أَبَوْا وَمَعَهُمَا مِنَ الله ثَلاثُونَ مَلَكاً يَحْمَدُونَ الله عَزَّ وَجَلَّ وَيُسَبِّحُونَهُ وَيُهَلِّلُونَهُ وَيُكَبِّرُونَهُ وَيَسْتَغْفِرُونَ لَهُ إِلَى أَنْ يَنْتَبِهَ ذَلِكَ الْعَبْدُ مِنْ نَوْمِهِ وَثَوَابُ ذَلِكَ لَهُ.",
          "English Text": "16. A number of our people have narrated from Sahl ibn Ziyad and Ahmad ibn Muhammad all from Ja’far ibn Muhammad al-Ash’ari from ibn al-Qaddah from Abu ‘Abdillah  who has said the following: “When the Messenger of Allah were about to go to his bed he would say, ‘O Lord, in Your name I live and in Your name I will die,’ and when he would wake up he would say, ‘All praise belongs to Allah, Who has given me life after causing me to die and before Him is the resurrection.’ Abu ‘Abd Allah  has said, ‘Whoever recites verse 255 of Chapter two before going to sleep three times, verses 18,19 of Chapter three, verse 54 of Chapter 7 and verses 53-54 of Chapter 41 two devils will be assigned to protect him against the rebellious devils whether they like or dislike it, and with them from Allah there will be thirty angels who praise Allah, the Most Majestic, the Most Holy, glorify Him, testify that no one deserves to be worshipped except Allah, say that Allah is greater than can be described, plead before Allah for forgiveness for him until that servant (of Allah) wakes up and he will receive all the reward for it (whatever the angels have said).”’ ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول وقيل ضعيف    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/315)"
          }
        }
      },
      "Chapter #50": {
        "Hadith #7": {
          "Title": "Al-Kafi - Volume 2: Prayer When Leaving One ’s Home",
          "Link": "https://thaqalayn.net/hadith/2/2/50/7",
          "Arabic Text": "7ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ الرِّضَا (عَلَيهِ السَّلام) قَالَ كَانَ أَبِي (عَلَيهِ السَّلام) إِذَا خَرَجَ مِنْ مَنْزِلِهِ قَالَ بِسْمِ الله الرَّحْمَنِ الرَّحِيمِ خَرَجْتُ بِحَوْلِ الله وَقُوَّتِهِ لا بِحَوْلٍ مِنِّي وَلا قُوَّتِي بَلْ بِحَوْلِكَ وَقُوَّتِكَ يَا رَبِّ مُتَعَرِّضاً لِرِزْقِكَ فَأْتِنِي بِهِ فِي عَافِيَةٍ.",
          "English Text": "7. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Sinan from al-Rida  who has said the following: “My father when coming out of his house would say, ‘(I begin) in the name of Allah, the Beneficent, the Merciful. I have come out by means and power of Allah and not by my own means and power, but, O Lord, by Your power and means, in search for sustenance from You, so grant me sustenance in good health.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف على المشهور صحيح عند ي  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/326)"
          }
        },
        "Hadith #10": {
          "Title": "Al-Kafi - Volume 2: Prayer When Leaving One ’s Home",
          "Link": "https://thaqalayn.net/hadith/2/2/50/10",
          "Arabic Text": "10ـ حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانٍ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي جَعْفَرٍ (عَلَيهِ السَّلام) أَنَّهُ كَانَ إِذَا خَرَجَ مِنَ الْبَيْتِ قَالَ بِسْمِ الله خَرَجْتُ وَعَلَى الله تَوَكَّلْتُ لا حَوْلَ وَلا قُوَّةَ إِلا بِالله.",
          "English Text": "10. Al-Humayd ibn Ziyad has narrated from al-Hassan ibn Muhammad from more than one person from Aban from abu Hamza who has said the following: “Abu Ja’far  when coming out of the house would say, ‘In the name of Allah, I have come out, in Allah I have place my trust, and there are no means and no power without Allah.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرسل كالموثق   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/329)"
          }
        }
      },
      "Chapter #52": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 2: Supplications After the Prayer (Daily Prayers)",
          "Link": "https://thaqalayn.net/hadith/2/2/52/3",
          "Arabic Text": "3ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ رَفَعَهُ قَالَ يَقُولُ بَعْدَ الْعِشَاءَيْنِ اللهمَّ بِيَدِكَ مَقَادِيرُ اللَّيْلِ وَالنَّهَارِ وَمَقَادِيرُ الدُّنْيَا وَالآخِرَةِ وَمَقَادِيرُ الْمَوْتِ وَالْحَيَاةِ وَمَقَادِيرُ الشَّمْسِ وَالْقَمَرِ وَمَقَادِيرُ النَّصْرِ وَالْخِذْلانِ وَمَقَادِيرُ الْغِنَى وَالْفَقْرِ اللهمَّ بَارِكْ لِي فِي دِينِي وَدُنْيَايَ وَفِي جَسَدِي وَأَهْلِي وَوُلْدِي اللهمَّ ادْرَأْ عَنِّي شَرَّ فَسَقَةِ الْعَرَبِ وَالْعَجَمِ وَالْجِنِّ وَالإنْسِ وَاجْعَلْ مُنْقَلَبِي إِلَى خَيْرٍ دَائِمٍ وَنَعِيمٍ لا يَزُولُ.",
          "English Text": "3. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from his father in a marfu’ manner has said the following: “The Imam  after ‘Isha ’ prayer would say, ‘O Lord, in Your hand are the measures of the night and day, the measures of this and the next world, the measures of death and life, the measures of the sun and moon, support and betrayal, and the measures of wealth and poverty. O Lord, grant me blessings in the matters of my religion, worldly life, my body, my family and children. O Lord, keep away from me the evil of Arabs, non-Arabs, Jinns and human beings. Make my return to everlasting good and permanent bounties.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع مضم ر  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/337)"
          }
        },
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 2: Supplications After the Prayer (Daily Prayers)",
          "Link": "https://thaqalayn.net/hadith/2/2/52/4",
          "Arabic Text": "4ـ عَنْهُ عَنْ بَعْضِ أَصْحَابِهِ رَفَعَهُ قَالَ مَنْ قَالَ بَعْدَ كُلِّ صَلاةٍ وَهُوَ آخِذٌ بِلِحْيَتِهِ بِيَدِهِ الْيُمْنَى يَا ذَا الْجَلالِ وَالإكْرَامِ ارْحَمْنِي مِنَ النَّارِ ثَلاثَ مَرَّاتٍ وَيَدُهُ الْيُسْرَى مَرْفُوعَةٌ وَبَطْنُهَا إِلَى مَا يَلِي السَّمَاءَ ثُمَّ يَقُولُ أَجِرْنِي مِنَ الْعَذَابِ الألِيمِ ثَلاثَ مَرَّاتٍ ثُمَّ يُؤَخِّرُ يَدَهُ عَنْ لِحْيَتِهِ ثُمَّ يَرْفَعُ يَدَهُ وَيَجْعَلُ بَطْنَهَا مِمَّا يَلِي السَّمَاءَ ثُمَّ يَقُولُ يَا عَزِيزُ يَا كَرِيمُ يَا رَحْمَانُ يَا رَحِيمُ وَيَقْلِبُ يَدَيْهِ وَيَجْعَلُ بُطُونَهُمَا مِمَّا يَلِي السَّمَاءَ ثُمَّ يَقُولُ أَجِرْنِي مِنَ الْعَذَابِ الألِيمِ ثَلاثَ مَرَّاتٍ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَالْمَلائِكَةِ وَالرُّوحِ غُفِرَ لَهُ وَرُضِيَ عَنْهُ وَوُصِلَ بِالإسْتِغْفَارِ لَهُ حَتَّى يَمُوتَ جَمِيعُ الْخَلائِقِ إِلا الثَّقَلَيْنِ الْجِنَّ وَالإنْسَ وَقَالَ إِذَا فَرَغْتَ مِنْ تَشَهُّدِكَ فَارْفَعْ يَدَيْكَ وَقُلِ اللهمَّ اغْفِرْ لِي مَغْفِرَةً عَزْماً جَزْماً لا تُغَادِرُ ذَنْباً وَلا أَرْتَكِبُ بَعْدَهَا مُحَرَّماً أَبَداً وَعَافِنِي مُعَافَاةً لا بَلْوَى بَعْدَهَا أَبَداً وَاهْدِنِي هُدًى لا أَضِلُّ بَعْدَهُ أَبَداً وَانْفَعْنِي يَا رَبِّ بِمَا عَلَّمْتَنِي وَاجْعَلْهُ لِي وَلا تَجْعَلْهُ عَلَيَّ وَارْزُقْنِي كَفَافاً وَرَضِّنِي بِهِ يَا رَبَّاهْ وَتُبْ عَلَيَّ يَا الله يَا الله يَا الله يَا رَحْمَانُ يَا رَحْمَانُ يَا رَحْمَانُ يَا رَحِيمُ يَا رَحِيمُ يَا رَحِيمُ ارْحَمْنِي مِنَ النَّارِ ذَاتِ السَّعِيرِ وَابْسُطْ عَلَيَّ مِنْ سَعَةِ رِزْقِكَ وَاهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنَ الْحَقِّ بِإِذْنِكَ وَاعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيمِ وَأَبْلِغْ مُحَمَّداً صَلَّى الله عَلَيْهِ وَآلِهِ عَنِّي تَحِيَّةً كَثِيرَةً وَسَلاماً وَاهْدِنِي بِهُدَاكَ وَأَغْنِنِي بِغِنَاكَ وَاجْعَلْنِي مِنْ أَوْلِيَائِكَ الْمُخْلَصِينَ وَصَلَّى الله عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ آمِينَ قَالَ مَنْ قَالَ هَذَا بَعْدَ كُلِّ صَلاةٍ رَدَّ الله عَلَيْهِ رُوحَهُ فِي قَبْرِهِ وَكَانَ حَيّاً مَرْزُوقاً نَاعِماً مَسْرُوراً إِلَى يَوْمِ الْقِيَامَةِ.",
          "English Text": "4. It is narrated from him (narrator of the Hadith above) from certain individuals of his people from in a marfu ’ manner from the Imam  who has said the following: “Whoever after every prayer, holds his beard in his right hand and says, ‘O the Owner of glory and magnanimity, have mercy upon me against fire,’ three times, with the left hand raised and the palms up to the sky and says, ‘Grant me safety from the painful torment,’ three times, then removes his hand from his beard and raises it with palms up to the sky and says, ‘O Majestic, O Magnanimous, O Beneficent, O Merciful,’ then changes the position of his hands and turns his palms up to the sky and says, ‘Grant me safety against painful torment,’ three times, ‘Grant al-Salat (favors) upon Muhammad and his family, the angels and the spirit,’ his sins are covered for him, is pleased with, plea for forgiveness for him is continued up to the time of his death, by all the creatures except the two heavy populations of Jinn and humankind. He after completing the testimonies of belief ( tashahhud) raising his hands says, ‘O Lord, grant me forgiveness, a decisive and ascertained forgiveness that does not leave any of sins that I have committed and that I will never commit any unlawful act thereafter. Grant me good health so that thereafter I will never face any suffering, grant me guidance so that thereafter I will never stray, benefit me O Lord by what You have instructed me with, turn it in my favor and not against me, grant me enough for sustenance and help me to remain content with it. O Lord, accept my repentance, O Allah, O Allah, O Allah, O Beneficent, O Beneficent, O Beneficent, O Merciful, O Merciful, O Merciful, grant me mercy against the roaring fire, extend for me sustenance from Your vast provisions, grant me guidance in disputed matters, in the matters of the truth by Your permission, protect me against Satan, the condemned to stoning, convey to Muhammad and the family of Muhammad  a great deal of my greetings of peace, guide me with Your guidance, grant me wealth from Your wealth, allow me to be one of Your sincere friends and grant al-Salat (favors) upon Muhammad and his family, Amin.’ “The Imam said, ‘Whoever says this after each prayer Allah will return his spirit to him in his grave and he will be alive receiving sustenance, pampered and happy to the Day of Judgment.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع مضمر    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/339)"
          }
        },
        "Hadith #5": {
          "Title": "Al-Kafi - Volume 2: Supplications After the Prayer (Daily Prayers)",
          "Link": "https://thaqalayn.net/hadith/2/2/52/5",
          "Arabic Text": "5ـ عَنْهُ عَنْ بَعْضِ أَصْحَابِهِ رَفَعَهُ قَالَ تَقُولُ بَعْدَ الْفَجْرِ اللهمَّ لَكَ الْحَمْدُ حَمْداً خَالِداً مَعَ خُلُودِكَ وَلَكَ الْحَمْدُ حَمْداً لا مُنْتَهَى لَهُ دُونَ رِضَاكَ وَلَكَ الْحَمْدُ حَمْداً لا أَمَدَ لَهُ دُونَ مَشِيَّتِكَ وَلَكَ الْحَمْدُ حَمْداً لا جَزَاءَ لِقَائِلِهِ إِلا رِضَاكَ اللهمَّ لَكَ الْحَمْدُ وَإِلَيْكَ الْمُشْتَكَى وَأَنْتَ الْمُسْتَعَانُ اللهمَّ لَكَ الْحَمْدُ كَمَا أَنْتَ أَهْلُهُ الْحَمْدُ لله بِمَحَامِدِهِ كُلِّهَا عَلَى نَعْمَائِهِ كُلِّهَا حَتَّى يَنْتَهِيَ الْحَمْدُ إِلَى حَيْثُ مَا يُحِبُّ رَبِّي وَيَرْضَى وَتَقُولُ بَعْدَ الْفَجْرِ قَبْلَ أَنْ تَتَكَلَّمَ الْحَمْدُ لله مِلْ‏ءَ الْمِيزَانِ وَمُنْتَهَى الرِّضَا وَزِنَةَ الْعَرْشِ وَسُبْحَانَ الله مِلْ‏ءَ الْمِيزَانِ وَمُنْتَهَى الرِّضَا وَزِنَةَ الْعَرْشِ وَالله أَكْبَرُ مِلْ‏ءَ الْمِيزَانِ وَمُنْتَهَى الرِّضَا وَزِنَةَ الْعَرْشِ وَلا إِلَهَ إِلا الله مِلْ‏ءَ الْمِيزَانِ وَمُنْتَهَى الرِّضَا وَزِنَةَ الْعَرْشِ تُعِيدُ ذَلِكَ أَرْبَعَ مَرَّاتٍ ثُمَّ تَقُولُ اللهمَّ أَسْأَلُكَ مَسْأَلَةَ الْعَبْدِ الذَّلِيلِ أَنْ تُصَلِّيَ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَأَنْ تَغْفِرَ لَنَا ذُنُوبَنَا وَتَقْضِيَ لَنَا حَوَائِجَنَا فِي الدُّنْيَا وَالآخِرَةِ فِي يُسْرٍ مِنْكَ وَعَافِيَةٍ.",
          "English Text": "5. It is narrated from him (narrator of the Hadith above) from certain individuals of his people from in a marfu ’ manner from the Imam  who has said the following: “Say after the morning prayer, ‘O Lord, to You belongs all praise, the eternal praise, with Your eternity, to You belongs all praise, the praise that does end before Your consent, to You belongs all praise, the timeless praise except as Your wish, to You belongs all praise, a praise whose speaker’s reward could be no other thing but Your approval, O Lord, to You belongs all praise, to You is the complaint and You are the supporter, O Lord, to You belongs all praise, as You deserve it, all praise belongs to Allah with all of His praiseworthy attributes for all of His bounties until praising reaches such a degree that my Lord loves and is pleased with. ’ After the morning prayer and before speaking to anyone say, ‘All praise belongs to Allah, to the fill of the balance, to the limits of consent, to the weight of the Throne, may I glorfy Allah, Who is free of all defects, to the fill of the balance, to the limits of assent and the weight of the Throne,’ four times, then say, ‘O Lord, I plead before You like a lowly servant to grant al-Salat (favors) upon Muhammad and his family, forgive our sins, grant our wishes in this world and in the hereafter with ease and good health.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/343)"
          }
        },
        "Hadith #11": {
          "Title": "Al-Kafi - Volume 2: Supplications After the Prayer (Daily Prayers)",
          "Link": "https://thaqalayn.net/hadith/2/2/52/11",
          "Arabic Text": "11ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُحَمَّدٍ الْجُعْفِيِّ عَنْ أَبِيهِ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ كُنْتُ كَثِيراً مَا أَشْتَكِي عَيْنِي فَشَكَوْتُ ذَلِكَ إِلَى أَبِي عَبْدِ الله (عَلَيهِ السَّلام) فَقَالَ أَ لا أُعَلِّمُكَ دُعَاءً لِدُنْيَاكَ وَآخِرَتِكَ وَبَلاغاً لِوَجَعِ عَيْنَيْكَ قُلْتُ بَلَى قَالَ تَقُولُ فِي دُبُرِ الْفَجْرِ وَدُبُرِ الْمَغْرِبِ اللهمَّ إِنِّي أَسْأَلُكَ بِحَقِّ مُحَمَّدٍ وَآلِ مُحَمَّدٍ عَلَيْكَ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاجْعَلِ النُّورَ فِي بَصَرِي وَالْبَصِيرَةَ فِي دِينِي وَالْيَقِينَ فِي قَلْبِي وَالإخْلاصَ فِي عَمَلِي وَالسَّلامَةَ فِي نَفْسِي وَالسَّعَةَ فِي رِزْقِي وَالشُّكْرَ لَكَ أَبَداً مَا أَبْقَيْتَنِي.",
          "English Text": "11. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from Muhammad al-Ju’Fi from his father who has said the following: “I often complained about my eyes and once I mentioned it to Abu ‘Abdillah  and he said, ‘Should I teach you a supplication that will be for the good of your worldly life and hereafter and a cure for your eye?’ I said, ‘Yes, please do so.’ The Imam said after Maghrib (sunset) prayer say, ‘O Lord, I plead before You through the rights of Muhammad and the family of Muhammad  with You to give light to my eyes, understanding in my religion, certainty in my heart, sincerity in my deeds, safety to my soul, increase in my sustenance and gratefulness to You as long as You will keep me (living).”’ ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول ويمكن أن يعد حسنا   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/378)"
          }
        },
        "Hadith #12": {
          "Title": "Al-Kafi - Volume 2: Supplications After the Prayer (Daily Prayers)",
          "Link": "https://thaqalayn.net/hadith/2/2/52/12",
          "Arabic Text": "12ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ قَالَ حَدَّثَنِي أَبُو جَعْفَرٍ الشَّامِيُّ قَالَ حَدَّثَنِي رَجُلٌ بِالشَّامِ يُقَالُ لَهُ هِلْقَامُ بْنُ أَبِي هِلْقَامٍ قَالَ أَتَيْتُ أَبَا إِبْرَاهِيمَ (عَلَيهِ السَّلام) فَقُلْتُ لَهُ جُعِلْتُ فِدَاكَ عَلِّمْنِي دُعَاءً جَامِعاً لِلدُّنْيَا وَالآخِرَةِ وَأَوْجِزْ فَقَالَ قُلْ فِي دُبُرِ الْفَجْرِ إِلَى أَنْ تَطْلُعَ الشَّمْسُ سُبْحَانَ الله الْعَظِيمِ وَبِحَمْدِهِ أَسْتَغْفِرُ الله وَأَسْأَلُهُ مِنْ فَضْلِهِ قَالَ هِلْقَامُ لَقَدْ كُنْتُ مِنْ أَسْوَإِ أَهْلِ بَيْتِي حَالاً فَمَا عَلِمْتُ حَتَّى أَتَانِي مِيرَاثٌ مِنْ قِبَلِ رَجُلٍ مَا ظَنَنْتُ أَنَّ بَيْنِي وَبَيْنَهُ قَرَابَةً وَإِنِّي الْيَوْمَ لَمِنْ أَيْسَرِ أَهْلِ بَيْتِي وَمَا ذَلِكَ إِلا بِمَا عَلَّمَنِي مَوْلايَ الْعَبْدُ الصَّالِحُ (عَلَيهِ السَّلام). ",
          "English Text": "12. Ali ibn Ibrahim has narrated from his father from m Mahziyar who has that narrated to h Imams abu la’ far al-Shami saying that narrated to him a man in al- Sham (Damascus) called Hilqamu ibn abu Hilqamu who said the following: “Once I went in the presence of abu Ibrahim . I said, ‘May Allah keep my soul in service for your cause, instruct me with a supplication of universal form for this world and hereafter but very short one.’ The Imam said, ‘After the morning-prayer until sunrise say, “Glory belongs to Allah, the Great and I praise Him. I plead before Allah for forgiveness and I beg of His generosity. ’ “Hilqamu has said, ‘I (financially) was the worst off person in my family. I received an inheritance from a man whom I did not think was related to me and I had no knowledge, but today I am the most comfortable person among my people and this is only because of what my master, the virtuous servant (of Allah) instructed me with.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مجهول ويمكن أن يعد حسن ا  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/380)"
          }
        }
      },
      "Chapter #55": {
        "Hadith #8": {
          "Title": "Al-Kafi - Volume 2: Supplication for Pain, Worries, Sadness and Fear",
          "Link": "https://thaqalayn.net/hadith/2/2/55/8",
          "Arabic Text": "8ـ عَنْهُ عَنْ عِدَّةٍ مِنْ أَصْحَابِنَا رَفَعُوهُ إِلَى أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ كَانَ مِنْ دُعَاءِ أَبِي (عَلَيهِ السَّلام) فِي الأمْرِ يَحْدُثُ اللهمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَاغْفِرْ لِي وَارْحَمْنِي وَزَكِّ عَمَلِي وَيَسِّرْ مُنْقَلَبِي وَاهْدِ قَلْبِي وَآمِنْ خَوْفِي وَعَافِنِي فِي عُمُرِي كُلِّهِ وَثَبِّتْ حُجَّتِي وَاغْفِرْ خَطَايَايَ وَبَيِّضْ وَجْهِي وَاعْصِمْنِي فِي دِينِي وَسَهِّلْ مَطْلَبِي وَوَسِّعْ عَلَيَّ فِي رِزْقِي فَإِنِّي ضَعِيفٌ وَتَجَاوَزْ عَنْ سَيِّئِ مَا عِنْدِي بِحُسْنِ مَا عِنْدَكَ وَلا تَفْجَعْنِي بِنَفْسِي وَلا تَفْجَعْ لِي حَمِيماً وَهَبْ لِي يَا إِلَهِي لَحْظَةً مِنْ لَحَظَاتِكَ تَكْشِفْ بِهَا عَنِّي جَمِيعَ مَا بِهِ ابْتَلَيْتَنِي وَتَرُدَّ بِهَا عَلَيَّ مَا هُوَ أَحْسَنُ عَادَاتِكَ عِنْدِي فَقَدْ ضَعُفَتْ قُوَّتِي وَقَلَّتْ حِيلَتِي وَانْقَطَعَ مِنْ خَلْقِكَ رَجَائِي وَلَمْ يَبْقَ إِلا رَجَاؤُكَ وَتَوَكُّلِي عَلَيْكَ وَقُدْرَتُكَ عَلَيَّ يَا رَبِّ أَنْ تَرْحَمَنِي وَتُعَافِيَنِي كَقُدْرَتِكَ عَلَيَّ أَنْ تُعَذِّبَنِي وَتَبْتَلِيَنِي إِلَهِي ذِكْرُ عَوَائِدِكَ يُؤْنِسُنِي وَالرَّجَاءُ لِإِنْعَامِكَ يُقَوِّينِي وَلَمْ أَخْلُ مِنْ نِعَمِكَ مُنْذُ خَلَقْتَنِي وَأَنْتَ رَبِّي وَسَيِّدِي وَمَفْزَعِي وَمَلْجَئِي وَالْحَافِظُ لِي وَالذَّابُّ عَنِّي وَالرَّحِيمُ بِي وَالْمُتَكَفِّلُ بِرِزْقِي وَفِي قَضَائِكَ وَقُدْرَتِكَ كُلُّ مَا أَنَا فِيهِ فَلْيَكُنْ يَا سَيِّدِي وَمَوْلايَ فِيمَا قَضَيْتَ وَقَدَّرْتَ وَحَتَمْتَ تَعْجِيلُ خَلاصِي مِمَّا أَنَا فِيهِ جَمِيعِهِ وَالْعَافِيَةُ لِي فَإِنِّي لا أَجِدُ لِدَفْعِ ذَلِكَ أَحَداً غَيْرَكَ وَلا أَعْتَمِدُ فِيهِ إِلا عَلَيْكَ فَكُنْ يَا ذَا الْجَلالِ وَالإكْرَامِ عِنْدَ أَحْسَنِ ظَنِّي بِكَ وَرَجَائِي لَكَ وَارْحَمْ تَضَرُّعِي وَاسْتِكَانَتِي وَضَعْفَ رُكْنِي وَامْنُنْ بِذَلِكَ عَلَيَّ وَعَلَى كُلِّ دَاعٍ دَعَاكَ يَا أَرْحَمَ الرَّاحِمِينَ وَصَلَّى الله عَلَى مُحَمَّدٍ وَآلِهِ.",
          "English Text": "8. It is narrated from him (narrator of the Hadith above) from A number of our people have narrated in a marfu’ manner from Abu ‘Abdillah  who has said the following: “Of the supplications of my father  in an event was this: ‘O Lord, grant al-Salat (favors) upon Muhammad and his family, forgive me, have mercy upon me, purify my deeds, make my return easy, guide my heart, bestow upon me security against my fear, good health during all of my life, establish firmly basic proofs of my belief, forgive my sins, whiten my face, safeguard me in my religion, accept with ease my request, expand my sustenance; I am weak, overlook my evil deeds with the virtue before You, do not cause me pain in myself, or my good friends, grant me an opportunity of Your opportunities with which You will take away all such matters with which You have placed me in trial and in return for it (trials) confer upon me with the best of Your habits with me. My power has become weak, my patience is thinning out, my hope in Your creatures is lost, no hope is left except You and 1 have placed my trust before You. Your power over me, O Lord, to have mercy upon me and bestow upon me good health is just like Your power over me to punish and afflict me with misfortunes. O Lord, speaking of Your kindness comforts me; the hope in Your reward strengthens me. I have never been without Your bounties from the time You created me. You are my Lord, my master, my source of help, my refuge, my protector, my defender, my benevolent, and the undertaker of my sustenance. In Your determinations and decisions whatever is about me, O my Lord, my master, in whatever way You are to determine or decide or finalize make it to be a quick relief for me from all of my sufferings, and good health for me; I do not find anyone to remove it from me except You and no one to rely on except You. O Possessor of glory and magnanimity be with the best of my hopes in You and my wishes, have mercy upon me as I plead, upon my desperation, upon the weakness of my foundation (body), and oblige me with such kindness and all supplicants to You, O the Most Beneficent of the benefactors, and bestow al-Salat (favors) upon Muhammad and his family.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/421)"
          }
        },
        "Hadith #21": {
          "Title": "Al-Kafi - Volume 2: Supplication for Pain, Worries, Sadness and Fear",
          "Link": "https://thaqalayn.net/hadith/2/2/55/21",
          "Arabic Text": "21ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ إِبْرَاهِيمَ بْنِ حَنَانٍ عَنْ عَلِيِّ بْنِ سَوْرَةَ عَنْ سَمَاعَةَ قَالَ قَالَ لِي أَبُو الْحَسَنِ (عَلَيهِ السَّلام) إِذَا كَانَ لَكَ يَا سَمَاعَةُ إِلَى الله عَزَّ وَجَلَّ حَاجَةٌ فَقُلِ اللهمَّ إِنِّي أَسْأَلُكَ بِحَقِّ مُحَمَّدٍ وَعَلِيٍّ فَإِنَّ لَهُمَا عِنْدَكَ شَأْناً مِنَ الشَّأْنِ وَقَدْراً مِنَ الْقَدْرِ فَبِحَقِّ ذَلِكَ الشَّأْنِ وَبِحَقِّ ذَلِكَ الْقَدْرِ أَنْ تُصَلِّيَ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَأَنْ تَفْعَلَ بِي كَذَا وَكَذَا فَإِنَّهُ إِذَا كَانَ يَوْمُ الْقِيَامَةِ لَمْ يَبْقَ مَلَكٌ مُقَرَّبٌ وَلا نَبِيٌّ مُرْسَلٌ وَلا مُؤْمِنٌ مُمْتَحَنٌ إِلا وَهُوَ يَحْتَاجُ إِلَيْهِمَا فِي ذَلِكَ الْيَوْمِ.",
          "English Text": "21. A number of our people have narrated from Ahmad ibn Muhammad from certain individuals of his people from Ibrahim ibn Hanan from Ali ibn Surah from Sama’a who has said the following: “O Sama’a, whenever you have a request before Allah, the Most Majestic, the Most Holy, say this: ‘O Lord, I plead before You through, Muhammad and Ali, recipients of divine supreme covenant, due to their special position and respect before You, for that position and respect, bestow al-Salat (favors) upon Muhammad and his family, and make my such and such wish come true.’ On the Day of Judgment, all of the angels of special position before Allah, the messenger prophets, and the believing people who had gone through the test of their faith will stand needy before these two people, Muhammad and Ali, recipients of divine supreme covenant, on that Day.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " صحيح وفيه شوب إرسال  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/427)"
          }
        }
      },
      "Chapter #57": {
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 2: (Supplication for) Fortification and Protection",
          "Link": "https://thaqalayn.net/hadith/2/2/57/2",
          "Arabic Text": "2ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ مُحَسِّنِ بْنِ أَحْمَدَ عَنْ يُونُسَ بْنِ يَعْقُوبَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ قُلْ أَعُوذُ بِعِزَّةِ الله وَأَعُوذُ بِقُدْرَةِ الله وَأَعُوذُ بِجَلالِ الله وَأَعُوذُ بِعَظَمَةِ الله وَأَعُوذُ بِعَفْوِ الله وَأَعُوذُ بِمَغْفِرَةِ الله وَأَعُوذُ بِرَحْمَةِ الله وَأَعُوذُ بِسُلْطَانِ الله الَّذِي هُوَ عَلَى كُلِّ شَيْ‏ءٍ قَدِيرٌ وَأَعُوذُ بِكَرَمِ الله وَأَعُوذُ بِجَمْعِ الله مِنْ شَرِّ كُلِّ جَبَّارٍ عَنِيدٍ وَكُلِّ شَيْطَانٍ مَرِيدٍ وَشَرِّ كُلِّ قَرِيبٍ أَوْ بَعِيدٍ أَوْ ضَعِيفٍ أَوْ شَدِيدٍ وَمِنْ شَرِّ السَّامَّةِ وَالْهَامَّةِ وَالْعَامَّةِ وَمِنْ شَرِّ كُلِّ دَابَّةٍ صَغِيرَةٍ أَوْ كَبِيرَةٍ بِلَيْلٍ أَوْ نَهَارٍ وَمِنْ شَرِّ فُسَّاقِ الْعَرَبِ وَالْعَجَمِ وَمِنْ شَرِّ فَسَقَةِ الْجِنِّ وَالإنْسِ.",
          "English Text": "2. Ali ibn Ibrahim has narrated from his father from Muhsin ibn Ahmad from Yunus ibn Ya’qub from abu Basir from Abu ‘Abdillah  who has said the following: “For protection say, ‘I seek protection with the majesty of Allah, I seek protection with the power of Allah, I seek protection with glory of Allah, I seek protection with the greatness of Allah, I seek protection with the pardoning of Allah, I seek protection with the forgiveness of Allah, I seek protection with the mercy of Allah, I seek protection with the authority of Allah, Who has power over all things, I seek protection with the generosity of Allah, I seek protection with the community of Allah against the evil of all tyrants and hatemongers and all the condemned devils, all near and far, weak and strong, all poisonous beasts, fear, plague, the evil of all small and large animals, during the night or day, the evil of sinful Arabs and non-Arabs and the evil of the sinful Jinn and man.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " سكت عنه  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/436)"
          }
        },
        "Hadith #13": {
          "Title": "Al-Kafi - Volume 2: (Supplication for) Fortification and Protection",
          "Link": "https://thaqalayn.net/hadith/2/2/57/13",
          "Arabic Text": "13ـ عَنْهُ رَفَعَهُ قَالَ مَنْ بَاتَ فِي دَارٍ وَبَيْتٍ وَحْدَهُ فَلْيَقْرَأْ آيَةَ الْكُرْسِيِّ وَلْيَقُلِ اللهمَّ آنِسْ وَحْشَتِي وَآمِنْ رَوْعَتِي وَأَعِنِّي عَلَى وَحْدَتِي.",
          "English Text": "13. It is narrated from him (narrator of the Hadith above) in a marfu ’ manner from the Imam  who has said the following: “If one sleeps alone in a house he should read verse 255 of Chapter 2 of the Holy Quran and say, ‘O Lord, calm down my anxiety, change my concern into peace and assist me in my loneliness.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/442)"
          }
        }
      }
    },
    "Book #3": {
      "Chapter #1": {
        "Hadith #5": {
          "Title": "Al-Kafi - Volume 2: No name",
          "Link": "https://thaqalayn.net/hadith/2/3/1/5",
          "Arabic Text": "5ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ بْنِ يَحْيَى عَنْ طَلْحَةَ بْنِ زَيْدٍ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ إِنَّ هَذَا الْقُرْآنَ فِيهِ مَنَارُ الْهُدَى وَمَصَابِيحُ الدُّجَى فَلْيَجْلُ جَالٍ بَصَرَهُ وَيَفْتَحُ لِلضِّيَاءِ نَظَرَهُ فَإِنَّ التَّفَكُّرَ حَيَاةُ قَلْبِ الْبَصِيرِ كَمَا يَمْشِي الْمُسْتَنِيرُ فِي الظُّلُمَاتِ بِالنُّورِ.",
          "English Text": "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn Yahya from Talhah ibn Zayd from Abu ‘Abdillah  who has said the following: “In this Quran is the lighthouse of guidance and torches for dankness. One must brighten his eyes and open them in such light; thinking is life for the seeing eyes just as light helps one walking in the dark.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " ضعيف كالموثق   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/480)"
          }
        }
      },
      "Chapter #6": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 2: The Houses Wherein the Holy Quran is Read",
          "Link": "https://thaqalayn.net/hadith/2/3/6/1",
          "Arabic Text": "1ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْفُضَيْلِ بْنِ عُثْمَانَ عَنْ لَيْثِ بْنِ أَبِي سُلَيْمٍ رَفَعَهُ قَالَ قَالَ النَّبِيُّ (صَلَّى اللهُ عَلَيْهِ وآلِه) نَوِّرُوا بُيُوتَكُمْ بِتِلاوَةِ الْقُرْآنِ وَلا تَتَّخِذُوهَا قُبُوراً كَمَا فَعَلَتِ الْيَهُودُ وَالنَّصَارَى صَلَّوْا فِي الْكَنَائِسِ وَالْبِيَعِ وَعَطَّلُوا بُيُوتَهُمْ فَإِنَّ الْبَيْتَ إِذَا كَثُرَ فِيهِ تِلاوَةُ الْقُرْآنِ كَثُرَ خَيْرُهُ وَاتَّسَعَ أَهْلُهُ وَأَضَاءَ لأهْلِ السَّمَاءِ كَمَا تُضِي‏ءُ نُجُومُ السَّمَاءِ لأهْلِ الدُّنْيَا.",
          "English Text": "1. A number of our people have narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from al-Fudayl ibn ‘Uthman from Layth ibn abu Sulaym in a marfu’ manner from the Holy Prophet who has said the following: “Light up your homes by means of reading the Holy Quran and do not turn them into graves as the Jews and Christians had done. They pray in churches and synagogues and leave their homes of no use. If reading of the Holy Quran is more often in a house, goodness increases therein, its inhabitants receive expanded sustenance and it will shine to the inhabitants of the heaven just as stars shine for the people of this world (earth).’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/493)"
          }
        },
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 2: The Houses Wherein the Holy Quran is Read",
          "Link": "https://thaqalayn.net/hadith/2/3/6/2",
          "Arabic Text": "2ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ خَالِدٍ وَالْحُسَيْنِ بْنِ سَعِيدٍ جَمِيعاً عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى بْنِ عِمْرَانَ الْحَلَبِيِّ عَنْ عَبْدِ الأعْلَى مَوْلَى آلِ سَامٍ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ إِنَّ الْبَيْتَ إِذَا كَانَ فِيهِ الْمَرْءُ الْمُسْلِمُ يَتْلُو الْقُرْآنَ يَتَرَاءَاهُ أَهْلُ السَّمَاءِ كَمَا يَتَرَاءَى أَهْلُ الدُّنْيَا الْكَوْكَبَ الدُّرِّيَّ فِي السَّمَاءِ.",
          "English Text": "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Khalid and al-Husayn ibn Sa’id all from al-Nadr ibn Suwayd from Yahya ibn ‘Imran al-Halabi from ‘Abd al-‘Ala’ Mawla ‘Ale (family) S’am from Abu ‘Abdillah  who has said the following: “A house wherein a Muslim reads the Holy Quran is looked upon by the inhabitants of heavens, just as the inhabitants of earth like to look at a shining star in the skies.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " حسن أو مجهول  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/494)"
          }
        }
      },
      "Chapter #8": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 2: Reading the Holy Quran from a Copy",
          "Link": "https://thaqalayn.net/hadith/2/3/8/1",
          "Arabic Text": "1ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ يَعْقُوبَ بْنِ يَزِيدَ رَفَعَهُ إِلَى أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ مَنْ قَرَأَ الْقُرْآنَ فِي الْمُصْحَفِ مُتِّعَ بِبَصَرِهِ وَخُفِّفَ عَنْ وَالِدَيْهِ وَإِنْ كَانَا كَافِرَيْنِ.",
          "English Text": "1. A number of our people have narrated from Ahmad ibn Muhammad from Ya’qub ibn Yazid in a marfu’ manner from abu ‘Abd Allah   who has said the following: “If one reads the Holy Quran from a copy, he benefits from his eyesight, and his parents receive relief even if they are unbelievers.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/498)"
          }
        }
      },
      "Chapter #13": {
        "Hadith #15": {
          "Title": "Al-Kafi - Volume 2: The Excellence of the Holy Quran",
          "Link": "https://thaqalayn.net/hadith/2/3/13/15",
          "Arabic Text": "15ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ عَبْدِ الله بْنِ الْفَضْلِ النَّوْفَلِيِّ رَفَعَهُ قَالَ مَا قُرِئَتِ الْحَمْدُ عَلَى وَجَعٍ سَبْعِينَ مَرَّةً إِلا سَكَنَ.",
          "English Text": "15. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Isma’il ibn Bazi’ from ‘Abd Allah ibn al-Fald al-Nawfali in a marfu’ manner from an Imam  who has said the following: “Whenever I read al-Hamd (Chapter One of the Holy Quran) for pain, seventy times, it was relieved.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/511)"
          }
        }
      }
    },
    "Book #4": {
      "Chapter #3": {
        "Hadith #5": {
          "Title": "Al-Kafi - Volume 2: People Whose Friendship and Association is Necessary",
          "Link": "https://thaqalayn.net/hadith/2/4/3/5",
          "Arabic Text": "5ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ رَفَعَهُ إِلَى أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ أَحَبُّ إِخْوَانِي إِلَيَّ مَنْ أَهْدَى إِلَيَّ عُيُوبِي.",
          "English Text": "5. A number of our people have narrated from Ahmad ibn Muhammad in a marfu’ manner from Abu ‘Abdillah  who has said the following: “To me, the most beloved of my brethren (friends) is the one who most points out my defects to me.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/532)"
          }
        }
      },
      "Chapter #4": {
        "Hadith #10": {
          "Title": "Al-Kafi - Volume 2: Those Whose Association and Friendship Is Undesirable",
          "Link": "https://thaqalayn.net/hadith/2/4/4/10",
          "Arabic Text": "10ـ أَبُو عَلِيٍّ الأشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ عُمَرَ بْنِ يَزِيدَ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) أَنَّهُ قَالَ لا تَصْحَبُوا أَهْلَ الْبِدَعِ وَلا تُجَالِسُوهُمْ فَتَصِيرُوا عِنْدَ النَّاسِ كَوَاحِدٍ مِنْهُمْ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) الْمَرْءُ عَلَى دِينِ خَلِيلِهِ وَقَرِينِهِ.",
          "English Text": "10. Abu Ali al-Ash’ari has narrated from Muhammad ibn ‘Abd al-Jabbar from ibn abu Najran from ‘Umar ibn Yazid from Abu ‘Abdillah  who has said the following: “Do not befriend blasphemers and do not associate with them; people may consider you as one of them. The Messenger of Allah has said, ‘A man follows the religion of his friend and associates.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " سكت عنه   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/536)"
          }
        },
        "Hadith #11": {
          "Title": "Al-Kafi - Volume 2: Those Whose Association and Friendship Is Undesirable",
          "Link": "https://thaqalayn.net/hadith/2/4/4/11",
          "Arabic Text": "11ـ أَبُو عَلِيٍّ الأشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ الْحَجَّالِ عَنْ عَلِيِّ بْنِ يَعْقُوبَ الْهَاشِمِيِّ عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ عُبَيْدِ بْنِ زُرَارَةَ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيهِ السَّلام) إِيَّاكَ وَمُصَادَقَةَ الأحْمَقِ فَإِنَّكَ أَسَرَّ مَا تَكُونُ مِنْ نَاحِيَتِهِ أَقْرَبُ مَا يَكُونُ إِلَى مَسَاءَتِكَ. ",
          "English Text": "11. Abu Ali al-Ash’ari has narrated from Muhammad ibn ‘Abd al-Jabbar from al- Hajjal from Ali ibn Ya’qub al-Hashimi from Harun ibn Muslim from ‘Ubayd ibn Zurara who has said the following: “Abu ‘Abd Allah  has said, ‘Never befriend an idiotic person; the more delightful you may become from his side the closer it will get to your misfortune.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " سكت عنه   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/536)"
          }
        }
      },
      "Chapter #5": {
        "Hadith #7": {
          "Title": "Al-Kafi - Volume 2: Finding Love and Affection among People",
          "Link": "https://thaqalayn.net/hadith/2/4/5/7",
          "Arabic Text": "7ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ صَالِحِ بْنِ عُقْبَةَ عَنْ سُلَيْمَانَ بْنِ زِيَادٍ التَّمِيمِيِّ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ قَالَ الْحَسَنُ بْنُ عَلِيٍّ (عَلَيهِما السَّلام) الْقَرِيبُ مَنْ قَرَّبَتْهُ الْمَوَدَّةُ وَإِنْ بَعُدَ نَسَبُهُ وَالْبَعِيدُ مَنْ بَعَّدَتْهُ الْمَوَدَّةُ وَإِنْ قَرُبَ نَسَبُهُ لا شَيْ‏ءَ أَقْرَبُ إِلَى شَيْ‏ءٍ مِنْ يَدٍ إِلَى جَسَدٍ وَإِنَّ الْيَدَ تَغُلُّ فَتُقْطَعُ وَتُقْطَعُ فَتُحْسَمُ. ",
          "English Text": "7. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from certain individuals of his people from Salih ibn ‘Aqabah from Sulayman ibn Ziyad al-Tamimi from Abu ‘Abdillah  who has said the following: “Al-Hassan ibn Ali  has said, ‘A person close to another person is one whom love has brought so close even though his lineage is far remote. A person far away is one whom love has distanced a part even though his lineage is near and close. There is nothing so close to another thing than the hands to the body, but when it becomes disloyal it is cut off and when it is cut off the body’s blood is held back from flowing out.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " سكت عنه    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/538)"
          }
        }
      },
      "Chapter #7": {
        "Hadith #9": {
          "Title": "Al-Kafi - Volume 2: Offering the Greeting of Peace",
          "Link": "https://thaqalayn.net/hadith/2/4/7/9",
          "Arabic Text": "9ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبَانٍ عَنِ الْحَسَنِ بْنِ الْمُنْذِرِ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيهِ السَّلام) يَقُولُ مَنْ قَالَ السَّلامُ عَلَيْكُمْ فَهِيَ عَشْرُ حَسَنَاتٍ وَمَنْ قَالَ السَّلامُ عَلَيْكُمْ وَرَحْمَةُ الله فَهِيَ عِشْرُونَ حَسَنَةً وَمَنْ قَالَ السَّلامُ عَلَيْكُمْ وَرَحْمَةُ الله وَبَرَكَاتُهُ فَهِيَ ثَلاثُونَ حَسَنَةً.",
          "English Text": "9. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from Ali ibn al-Hakam from Aban from al-Hassan ibn al-Mundhir who has said the following: “I heard Abu ‘Abdillah  saying, ‘If one offering the greeting of peace says, “(I offer) you to be in peace,” it is equal to ten good deeds. Saying, ‘(I offer) you to be in peace, and May Allah grant you favors,’ is equal to twenty good deeds. Saying, ‘(I offer) you to be in peace, and May Allah grant you favors and blessings,’ is equal to thirty good deeds.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/541)"
          }
        },
        "Hadith #14": {
          "Title": "Al-Kafi - Volume 2: Offering the Greeting of Peace",
          "Link": "https://thaqalayn.net/hadith/2/4/7/14",
          "Arabic Text": "14ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ إِنَّ مِنْ تَمَامِ التَّحِيَّةِ لِلْمُقِيمِ الْمُصَافَحَةَ وَتَمَامِ التَّسْلِيمِ عَلَى الْمُسَافِرِ الْمُعَانَقَةَ.",
          "English Text": "14. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from Ali ibn Ri’ab from Abu ‘Abdillah  who has said the following: “The completion of greetings of peace for one at home is to shake hands and for one on a journey it is to hold him in one’s arms.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " سكت عنه  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/542)"
          }
        },
        "Hadith #15": {
          "Title": "Al-Kafi - Volume 2: Offering the Greeting of Peace",
          "Link": "https://thaqalayn.net/hadith/2/4/7/15",
          "Arabic Text": "15ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ (عَلَيهِ السَّلام) يُكْرَهُ لِلرَّجُلِ أَنْ يَقُولَ حَيَّاكَ الله ثُمَّ يَسْكُتَ حَتَّى يَتْبَعَهَا بِالسَّلامِ.  ",
          "English Text": "15. Ali ibn Ibrahim has narrated from his father from al-Nawfali from al-Sakuni from Abu ‘Abdillah  who has said the following: “Amir al-Mu’minin, Ali ibn abu Talib  has said, ‘It is undesirable for a man to say, “May Allah keep you living,” then remain silent without offering the greeting of peace thereafter.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " سكت عنه    ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/542)"
          }
        }
      },
      "Chapter #16": {
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 2: The Necessity to Honor an Old Muslim",
          "Link": "https://thaqalayn.net/hadith/2/4/16/4",
          "Arabic Text": "4ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ سَمِعْتُ أَبَا الْخَطَّابِ يُحَدِّثُ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ ثَلاثَةٌ لا يَجْهَلُ حَقَّهُمْ إِلا مُنَافِقٌ مَعْرُوفٌ بِالنِّفَاقِ ذُو الشَّيْبَةِ فِي الإسْلامِ وَحَامِلُ الْقُرْآنِ وَالإمَامُ الْعَادِلُ.",
          "English Text": "4. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from Muhammad ibn Ali from Muhammad ibn al-Fudayl from Ishaq ibn ‘Ammar who has said that he heard abu al-Khattab narrate from Abu ‘Abdillah  the following: “There are three kinds of people whose rights are not ignored, except by a hypocrite, well-known in hypocrisy: of such people is an old person in Islam, the carrier of the Holy Quran and the Imam who possesses the noble merit of justice.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " سكت عنه   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/560)"
          }
        },
        "Hadith #5": {
          "Title": "Al-Kafi - Volume 2: The Necessity to Honor an Old Muslim",
          "Link": "https://thaqalayn.net/hadith/2/4/16/5",
          "Arabic Text": "5ـ عَنْهُ عَنْ أَبِيهِ عَنْ أَبِي نَهْشَلٍ عَنْ عَبْدِ الله بْنِ سِنَانٍ قَالَ قَالَ لِي أَبُو عَبْدِ الله (عَلَيهِ السَّلام) مِنْ إِجْلالِ الله عَزَّ وَجَلَّ إِجْلالُ الْمُؤْمِنِ ذِي الشَّيْبَةِ وَمَنْ أَكْرَمَ مُؤْمِناً فَبِكَرَامَةِ الله بَدَأَ وَمَنِ اسْتَخَفَّ بِمُؤْمِنٍ ذِي شَيْبَةٍ أَرْسَلَ الله إِلَيْهِ مَنْ يَسْتَخِفُّ بِهِ قَبْلَ مَوْتِهِ.",
          "English Text": "5. It is narrated from him (narrator of the Hadith above) from abu Nahshal from ‘Abd Allah ibn Sinan who has said the following: “Once Abu ‘Abdillah  said to me, ‘It is respecting Allah, the Most Majestic, the Most Holy, to respect an old believing person. Whoever honors an old believing person has begun (with) honoring Allah. Whoever disrespects an old believing person, Allah will send to him someone who will disrespect him before his death.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " سكت عنه  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/560)"
          }
        },
        "Hadith #6": {
          "Title": "Al-Kafi - Volume 2: The Necessity to Honor an Old Muslim",
          "Link": "https://thaqalayn.net/hadith/2/4/16/6",
          "Arabic Text": "6ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ إِسْحَاقَ عَنْ سَعْدَانَ بْنِ مُسْلِمٍ عَنْ أَبِي بَصِيرٍ وَغَيْرِهِ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ قَالَ مِنْ إِجْلالِ الله عَزَّ وَجَلَّ إِجْلالُ ذِي الشَّيْبَةِ الْمُسْلِمِ. ",
          "English Text": "6. Al-Husayn ibn Muhammad has narrated from Ahmad ibn Ishaq from Sa’dan ibn Muslim from abu Basir and others from Abu ‘Abdillah  who has said the following: “It is honoring Allah, the Most Majestic, the Most Holy, to honor an old Muslim.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " سكت عنه  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/560)"
          }
        }
      },
      "Chapter #17": {
        "Hadith #1": {
          "Title": "Al-Kafi - Volume 2: Honoring the Honorable",
          "Link": "https://thaqalayn.net/hadith/2/4/17/1",
          "Arabic Text": "1ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ الأشْعَرِيِّ عَنْ عَبْدِ الله بْنِ الْقَدَّاحِ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ دَخَلَ رَجُلانِ عَلَى أَمِيرِ الْمُؤْمِنِينَ (عَلَيهِ السَّلام) فَأَلْقَى لِكُلِّ وَاحِدٍ مِنْهُمَا وِسَادَةً فَقَعَدَ عَلَيْهَا أَحَدُهُمَا وَأَبَى الآخَرُ فَقَالَ أَمِيرُ الْمُؤْمِنِينَ (عَلَيهِ السَّلام) اقْعُدْ عَلَيْهَا فَإِنَّهُ لا يَأْبَى الْكَرَامَةَ إِلا حِمَارٌ ثُمَّ قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) إِذَا أَتَاكُمْ كَرِيمُ قَوْمٍ فَأَكْرِمُوهُ.",
          "English Text": "1. A number of our people have narrated from Sahl ibn Ziyad from Ja’far ibn Muhammad al-Ash’ari from ‘Abd Allah ibn al-Qaddah from Abu ‘Abdillah  who has said the following: “Once two men came to Amir al-Mu’minin, Ali ibn abu Talib  he prepared one seat for each one. One of them sat on the seat but the other refused. Amir al-Mu’minin, Ali ibn abu Talib  said to him, ‘Take your seat; no one refuses to appreciate being honored except a donkey.’ The Imam then said, ‘The Messenger of Allah has said, “When the honorable person of a people comes to you, you must treat him with honor.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " سكت عنه   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/561)"
          }
        },
        "Hadith #2": {
          "Title": "Al-Kafi - Volume 2: Honoring the Honorable",
          "Link": "https://thaqalayn.net/hadith/2/4/17/2",
          "Arabic Text": "2ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) إِذَا أَتَاكُمْ كَرِيمُ قَوْمٍ فَأَكْرِمُوهُ.",
          "English Text": "2. Ali ibn Ibrahim has narrated from his father from al-Nawfali from al-Sakuni from Abu ‘Abdillah  who has said the following: “The Messenger of Allah has said, ‘When a noble and honorable person of a people comes to you, you must treat him with honor.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " سكت عنه  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/561)"
          }
        },
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 2: Honoring the Honorable",
          "Link": "https://thaqalayn.net/hadith/2/4/17/3",
          "Arabic Text": "3ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ الله عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ عَبْدِ الله الْعَلَوِيِّ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ (عَلَيهِ السَّلام) لَمَّا قَدِمَ عَدِيُّ بْنُ حَاتِمٍ إِلَى النَّبِيِّ (صَلَّى اللهُ عَلَيْهِ وآلِه) أَدْخَلَهُ النَّبِيُّ (صَلَّى اللهُ عَلَيْهِ وآلِه) بَيْتَهُ وَلَمْ يَكُنْ فِي الْبَيْتِ غَيْرُ خَصَفَةٍ وَوِسَادَةٍ مِنْ أَدَمٍ فَطَرَحَهَا رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) لِعَدِيِّ بْنِ حَاتِمٍ. ",
          "English Text": "3. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from Muhammad ibn ‘Isa from ‘Abd Allah al-‘Alawi from his father from his grandfather who has said the following: “Amir al-Mu’minin, Ali ibn abu Talib  has said, ‘When ‘Adi ibn Hatim came to the Holy Prophet, he brought him (‘Adi) to his house. In his house there was nothing to use as a seat except a sack (storage for dates) and a pillow made of animal skin. With such items the Messenger of Allah prepared a seat for ‘Adi ibn Hatim.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " سكت عنه   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/561)"
          }
        }
      },
      "Chapter #21": {
        "Hadith #7": {
          "Title": "Al-Kafi - Volume 2: Manner of Sitting",
          "Link": "https://thaqalayn.net/hadith/2/4/21/7",
          "Arabic Text": "7ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ طَلْحَةَ بْنِ زَيْدٍ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ (عَلَيهِ السَّلام) سُوقُ الْمُسْلِمِينَ كَمَسْجِدِهِمْ فَمَنْ سَبَقَ إِلَى مَكَانٍ فَهُوَ أَحَقُّ بِهِ إِلَى اللَّيْلِ قَالَ وَكَانَ لا يَأْخُذُ عَلَى بُيُوتِ السُّوقِ كِرَاءً.",
          "English Text": "7. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Yahya from Talhah ibn Zayd from Abu ‘Abdillah  who has said the following: “Amir al-Mu’minin, Ali ibn abu Talib  would say, ‘The market place of the Muslims is like their Mosque, the one who first takes a place stays there until night. ’ The narrator has said that he (the Imam) would not charge any rent for the shops.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " كالموثق   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (12/564)"
          }
        }
      },
      "Chapter #23": {
        "Hadith #14": {
          "Title": "Al-Kafi - Volume 2: Funny Stories and Laughing",
          "Link": "https://thaqalayn.net/hadith/2/4/23/14",
          "Arabic Text": "14ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَجَّالِ عَنْ دَاوُدَ بْنِ فَرْقَدٍ وَعَلِيِّ بْنِ عُقْبَةَ وَثَعْلَبَةَ رَفَعُوهُ إِلَى أَبِي عَبْدِ الله وَأَبِي جَعْفَرٍ أَوْ أَحَدِهِمَا (عَلَيهِما السَّلام) قَالَ كَثْرَةُ الْمِزَاحِ تَذْهَبُ بِمَاءِ الْوَجْهِ وَكَثْرَةُ الضَّحِكِ تَمُجُّ الإيمَانَ مَجّاً.",
          "English Text": "14. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Hajjal from Dawud ibn Farqad and Ali ibn ‘Aqabah and Tha’Labah in a marfu’ manner from Abu ‘Abdillah  and abu Ja’far  or one of them who has said the following: “Much joking eliminates the dignity of one’s face and much laughing hurls belief far away.” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " مرفوع  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/569)"
          }
        }
      },
      "Chapter #26": {
        "Hadith #4": {
          "Title": "Al-Kafi - Volume 2: Good Companionship and the Rights of a Travel Mate",
          "Link": "https://thaqalayn.net/hadith/2/4/26/4",
          "Arabic Text": "4ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ الله عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنْ عِدَّةٍ مِنْ أَصْحَابِنَا عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وآلِه) حَقُّ الْمُسَافِرِ أَنْ يُقِيمَ عَلَيْهِ أَصْحَابُهُ إِذَا مَرِضَ ثَلاثاً.",
          "English Text": "4. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from Ya’qub ibn Yazid from A number of our people have narrated from Abu ‘Abdillah  who has said the following: “The Messenger of Allah has said, ‘It is of the rights of a traveler on his companions to look after him for three days if he falls ill.”’ ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " سكت عنه  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/576)"
          }
        },
        "Hadith #5": {
          "Title": "Al-Kafi - Volume 2: Good Companionship and the Rights of a Travel Mate",
          "Link": "https://thaqalayn.net/hadith/2/4/26/5",
          "Arabic Text": "5ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ مَسْعَدَةَ بْنِ صَدَقَةَ عَنْ أَبِي عَبْدِ الله عَنْ آبَائِهِ (عَلَيهِم السَّلام) أَنَّ أَمِيرَ الْمُؤْمِنِينَ (عَلَيهِ السَّلام) صَاحَبَ رَجُلاً ذِمِّيّاً فَقَالَ لَهُ الذِّمِّيُّ أَيْنَ تُرِيدُ يَا عَبْدَ الله فَقَالَ أُرِيدُ الْكُوفَةَ فَلَمَّا عَدَلَ الطَّرِيقُ بِالذِّمِّيِّ عَدَلَ مَعَهُ أَمِيرُ الْمُؤْمِنِينَ (عَلَيهِ السَّلام) فَقَالَ لَهُ الذِّمِّيُّ أَ لَسْتَ زَعَمْتَ أَنَّكَ تُرِيدُ الْكُوفَةَ فَقَالَ لَهُ بَلَى فَقَالَ لَهُ الذِّمِّيُّ فَقَدْ تَرَكْتَ الطَّرِيقَ فَقَالَ لَهُ قَدْ عَلِمْتُ قَالَ فَلِمَ عَدَلْتَ مَعِي وَقَدْ عَلِمْتَ ذَلِكَ فَقَالَ لَهُ أَمِيرُ الْمُؤْمِنِينَ (عَلَيهِ السَّلام) هَذَا مِنْ تَمَامِ حُسْنِ الصُّحْبَةِ أَنْ يُشَيِّعَ الرَّجُلُ صَاحِبَهُ هُنَيْئَةً إِذَا فَارَقَهُ وَكَذَلِكَ أَمَرَنَا نَبِيُّنَا (صَلَّى اللهُ عَلَيْهِ وآلِه) فَقَالَ لَهُ الذِّمِّيُّ هَكَذَا قَالَ قَالَ نَعَمْ قَالَ الذِّمِّيُّ لا جَرَمَ أَنَّمَا تَبِعَهُ مَنْ تَبِعَهُ لأفْعَالِهِ الْكَرِيمَةِ فَأَنَا أُشْهِدُكَ أَنِّي عَلَى دِينِكَ وَرَجَعَ الذِّمِّيُّ مَعَ أَمِيرِ الْمُؤْمِنِينَ (عَلَيهِ السَّلام) فَلَمَّا عَرَفَهُ أَسْلَمَ. ",
          "English Text": "5. Ali ibn Ibrahim has narrated from his father from Harun ibn Muslim from Mas’adah ibn Sadaqah from Abu ‘Abdillah  who has said the following: “Once, Amir al-Mu’minin, Ali ibn abu Talib  accompanied a taxpaying non- Muslim. The taxpaying non-Muslim asked, ‘Where you want to go, O servant of Allah?’ Amir al-Mu’Minin  said, ‘I want to go to al-Kufah.’ The taxpayer’s road changed. Amir al-Mu’Minin  kept walking along with him. He asked, ‘Did you not say that you wanted to go to al-Kufah? He said, ‘Yes, that is true.’ The non-Muslim taxpayer said, ‘You have missed the road to al-Kufah.’ The Imam said, ‘Yes, I know that.’ The non-Muslim asked, ‘Why are you then coming with me when you know the road?’ Amir al-Mu’Minin  said, ‘This is to observe a part of the companionship rights, that is, escorting one gently on their departing each other. This is what our Holy Prophet has instructed us with.’ The non-Muslim asked, ‘Has he said that?’ The Imam said, ‘Yes, that is what he has said.’ The non-Muslim said, ‘It is true that whoever followed him did so because of his noble deeds. I testify that I have accepted your religion. The non-Muslim came back along with Amir al-Mu’Minin  and when he recognized him, he became a Muslim.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " سكت عنه   ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/576)"
          }
        }
      },
      "Chapter #29": {
        "Hadith #3": {
          "Title": "Al-Kafi - Volume 2: No name",
          "Link": "https://thaqalayn.net/hadith/2/4/29/3",
          "Arabic Text": "3ـ عَنْهُ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْحَسَنِ بْنِ السَّرِيِّ عَنْ أَبِي عَبْدِ الله (عَلَيهِ السَّلام) قَالَ قَالَ لا تَكْتُبْ بِسْمِ الله الرَّحْمنِ الرَّحِيمِ لِفُلانٍ وَلا بَأْسَ أَنْ تَكْتُبَ عَلَى ظَهْرِ الْكِتَابِ لِفُلانٍ.",
          "English Text": "3. It is narrated from him (narrator of the Hadith above) from Ali ibn al-Hakam from al-Hassan ibn al-Sari from Abu ‘Abdillah  who has said the following: “Do not write, ‘(I begin) in the name of Allah, the Beneficent, the Merciful,’ ‘for so and so’ (in a letter), but it is not an offense to write at the back of the letter, ‘for so and so’.’” ",
          "Grading": {
            "English Grade": "Acceptable",
            "Arabic Grade": " كالصحيح  ",
            "Scholar": "Allamah Baqir al-Majlisi",
            "Book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/581)"
          }
        }
      }
    }
  }
}