[
    {
        "1": {
            "3": {
                "hadithNumber": "Hadith #10",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Merit of Knowledge and the Scholar and the Obligation of Knowledge",
                "arabicText": "[-/10] الخصال: في حديث الأربعمائة: قال أمير المؤمنين عليه السلام: علموا صبيانكم ما ينفعهم به، لا يغلب عليهم المرجئة برأيها",
                "englishText": "10. [10/-] al-Khisal: In the ‘Four Hundred’ Narration: the commander of the faithful عليه السلام said: teach your children that which will benefit them – the Murjia should not overpower them with their speculative opinions.",
                "href": "https://thaqalayn.net/hadith/9/1/3/10",
                "gradings": {}
            }
        }
    },
    {
        "1": {
            "6": {
                "hadithNumber": "Hadith #2",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Asking the Scholar and Discussing with Him",
                "arabicText": "[-/2] الكافي: محمد بن يحيى، عن أحمد بن محمد بن عيسى، عن حماد بن عيسى، عن حريز عن زرارة ومحمد بن مسلم وبريد العجلي قالوا: قال أبوعبدالله عليه السلام لحمران بن أعين في شئ سأله: إنما يهلك الناس لانهم لا يسألون",
                "englishText": "2. [2/-] al-Kafi: Muhammad b. Yahya from Ahmad b. Muhammad b. Isa from Hammad b. Isa from Hariz from Zurara and Muhammad b. Muslim and Burayd al-Ijli they said: Abu Abdillah عليه السلام said to Humran b. A’yan in regards a matter he had asked him about: the people are destroyed because they do not ask questions.",
                "href": "https://thaqalayn.net/hadith/9/1/6/2",
                "gradings": {}
            }
        }
    },
    {
        "1": {
            "8": {
                "hadithNumber": "Hadith #2",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Accountability of the Scholar and its Severity",
                "arabicText": "[-/2] الخصال: عن أبيه، قال عن الحميري، عن هارون، عن ابن زياد، عن جعفر بن محمد، عن أبيه، عن آبائه عليهم السلام أن عليا عليه السلام قال: إن في جهنم رحى تطحن أفلا تسألون ما طحنها؟ فقيل له: فما طحنها يا أمير المؤمنين؟ قال: العلماء الفجرة، والقراء الفسقة، والجبابرة الظلمة، والوزراء الخونة، والعرفاء الكذبة وإن في النار لمدينة يقال لها: الحصينة أفلا تسألوني ما فيها؟ فقيل: وما فيها يا أمير المؤمنين؟ فقال: فيها أيدي الناكثين",
                "englishText": "2. [2/-] al-Khisal: From my father from al-Himyari from Harun from Ibn Ziyad from Ja’far b. Muhammad from his father from his forefathers عليهم السلام that Ali عليه السلام said: there is in hell a mill-stone which grinds – will you not ask what it grinds? It was said to him: and what does it grind O commander of the faithful? He said: corrupt scholars, and sinful reciters (of the Qur’an), and unjust tyrants, and treacherous ministers, and lying officials.1 And there is in hell a city called ‘the fortified’ – will you not ask me what is in it? it was said: what is in it O commander of the faithful? he said: in it are the hands of the oath-breakers.",
                "href": "https://thaqalayn.net/hadith/9/1/8/2",
                "gradings": {}
            }
        }
    },
    {
        "1": {
            "14": {
                "hadithNumber": "Hadith #1",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Prohibition on Debate and Argumentation",
                "arabicText": "[-/1] امالى الصدوق:عن ابيه، عن الحميري، عن احمد بن محمد ابن عيسي، عن أبيه، عن ابن أبي عمير، عن محمد بن حمران، عن الحذاء قال: قال أبو جعفر عليه السلام يا زياد إياك والخصومات فإنها تورث الشك، وتحبط العمل، وتردي صاحبها، وعسى أن يتكلم الرجل بالشئ لا يغفر له …",
                "englishText": "1. [1/-] Amali al-Saduq: From his father from al-Himyari from Ahmad b. Muhammad b. Isa from his father from Ibn Abi Umayr from Muhammad b. Humran from al-Hadhha who said: Abu Ja’far عليه السلام said: O Ziyad – beware of argumentation because it creates doubt, nullifies deeds and degrades its initiator, it may also happen that a man speaks something for which he is never forgiven …",
                "href": "https://thaqalayn.net/hadith/9/1/14/1",
                "gradings": {}
            }
        }
    },
    {
        "1": {
            "14": {
                "hadithNumber": "Hadith #8",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Prohibition on Debate and Argumentation",
                "arabicText": "[-/8] رجال الكشي: حمدويه، عن ابن يزيد، عن ابن أبي عمير، عن محمد بن حكيم قال: ذكر لأبي الحسن عليه السلام أصحاب الكلام فقال: أما ابن حكيم فدعوه",
                "englishText": "8. [8/-] Rijal al-Kashshi: Hamduwayh from Ibn Yazid from Ibn Abi Umayr from Muhammad b. Hukaym who said: the names of those who engaged in Kalam (speculative theology) were mentioned to Abi al-Hasan عليه السلام – so he said: as for Ibn Hukaym then leave him be.",
                "href": "https://thaqalayn.net/hadith/9/1/14/8",
                "gradings": {}
            }
        }
    },
    {
        "1": {
            "17": {
                "hadithNumber": "Hadith #1",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: No Excuse for the Ignorant One who Falls Short",
                "arabicText": "[-/1] امالي الطوسي: المفيد عن ابن قولويه عن محمد الحميرى عن ابيه عن هارون عن ابن زياد قال: سمعت جعفر بن محمد علهما السلام وقد سئل عن قوله تعالى “قل فلله الحجة البالغة” فقال: ان الله تعالى يقول للعبد يوم القيامة: عبدى أكنت عالما؟ فان قال: نعم قال له: أفلا علمت بما علمت؟ وان قال: كنت جاهلا قال: أفلا تعلمت حتى تعمل؟ فيخصمه فتلك الحجة البالغة",
                "englishText": "1. [1/-] Amali of al-Tusi: al-Mufid from Ibn Qulawayh from Muhammad al-Himyari from his father from Harun from Ibn Ziyad who said: I heard Ja’far b. Muhammad علهما السلام – and he was asked about His words the Exalted: “to Allāh belongs the conclusive argument!” (6:149) – say: Allāh the Exalted will say to a slave on the day of judgment: My slave did you possess knowledge? So if he says: yes, He will say to him: why did you not act by what you knew? And if he says: I was ignorant, He will say to him: why did you not seek knowledge so you could act? Thus he will be vanquished – and that is the “conclusive argument”. ",
                "href": "https://thaqalayn.net/hadith/9/1/17/1",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "1": {
                "hadithNumber": "Hadith #1",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Prohibition of Giving Fatwa without Knowledge and Evidence",
                "arabicText": "[-/1] الكافي: محمد بن يحيى، عن أحمد بن محمد بن عيسى، عن الحسن بن محبوب، عن علي ابن رئاب، عن أبي عبيدة الحذاء، عن أبي جعفر عليه السلام قال: من أفتى الناس بغير علم ولا هدى لعنته ملائكة الرحمة وملائكة العذاب، ولحقه وزر من عمل بفتياه",
                "englishText": "1. [1/-] al-Kafi: Muhammad b. Yahya from Ahmad b. Muhammad b. Isa from al-Hasan b. Mahbub from Ali b. Riab from Abi Ubayda al-Hadhdha from Abi Ja’far عليه السلام who said: whoever gives Fatwa to the people without knowledge or true guidance the angels of mercy do curse him and so do too the angels of punishment and the burden of the one who acts by his Fatwa attaches itself to him.",
                "href": "https://thaqalayn.net/hadith/9/2/1/1",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "1": {
                "hadithNumber": "Hadith #2",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Prohibition of Giving Fatwa without Knowledge and Evidence",
                "arabicText": "[-/2] الكافي: علي، عن أبيه، عن ابن أبي عمير، عن عبدالرحمن بن الحجاج قال: كان أبوعبدالله عليه السلام قاعدا في حلقة ربيعة الرأي، فجاء أعرابي فسأل ربيعة الرأي عن مسألة فأجابه فلما سكت قال له الاعرابي: أهو في عنقك؟ فسكت عنه ربيعة ولم يرد عليه شيئا فأعاد عليه المسألة فأجابه بمثل ذلك، فقال له الاعرابي: أهو في عنقك؟ فسكت ربيعة فقال له أبوعبدالله عليه السلام: هو في عنقه، قال أو لم يقل، وكل مفت ضامن",
                "englishText": "2. [2/-] al-Kafi: Ali b. Ibrahim from his father from Ibn Abi Umayr from Abd al-Rahman b. al-Hajjaj who said: Abu Abdillah عليه السلام was seated in a study-circle of Rabia al-Rayy when a bedouin came and asked Rabia al-Rayy about a matter and he (Rabia) proceeded to answer him, so when he was done (answering) the bedouin asked: is it upon your neck (do you accept responsibility for me following your answer)? Rabia remained silent and did not say anything, so he (the bedouin) repeated the question again and he (Rabia) answered in the same way, so the bedouin said to him again: is it upon your neck? but Rabia remained silent, then Abu Abdillah عليه السلام said to him: it is upon his neck whether he declares it to be so or not, and every giver of Fatwa is liable.",
                "href": "https://thaqalayn.net/hadith/9/2/1/2",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "1": {
                "hadithNumber": "Hadith #3",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Prohibition of Giving Fatwa without Knowledge and Evidence",
                "arabicText": "[-/3] الكافي: عدة من اصحابنا، عن أحمد بن محمد بن خالد، عن الحسن بن علي الوشاء، عن أبان الاحمر، عن زياد بن أبي رجاء، عن أبي جعفر عليه السلام قال: ما علمتم فقولوا، و ما لم تعلموا فقولوا: الله أعلم، إن الرجل لينتزع الآية من القرآن يخر فيها أبعد ما بين السماء والارض",
                "englishText": "3. [3/-] al-Kafi: A number of our companions from Ahmad b. Muhammad b. Khalid from al-Hasan b. Ali al-Washsha from Aban al-Ahmar from Ziyad b. Abi Raja from Abi Ja’far عليه السلام who said: say what you know and if you do not know then say: “Allāh is more knowing”, a man selectively picks out a verse from the Qur’an and falls in it (misinterpreting it) a farther distance than what is between the earth and the sky.",
                "href": "https://thaqalayn.net/hadith/9/2/1/3",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "1": {
                "hadithNumber": "Hadith #4",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Prohibition of Giving Fatwa without Knowledge and Evidence",
                "arabicText": "[-/4] الكافي: علي، عن ابيه، عن ابن أبي عمير، عن هشام بن سالم قال: قلت لابي عبدالله عليه السلام: ما حق الله على خلقه؟ فقال: أن يقولوا ما يعلمون، ويكفوا عما لا يعلمون، فإذا فعلوا ذلك فقد أدوا إلى الله حقه",
                "englishText": "4. [4/-] al-Kafi: Ali from his father from Ibn Abi Umayr from Hisham b. Salim who said: I said to Abi Abdillah عليه السلام: what is the right of Allāh over his creation? he said: that they should only say that which they know and should remain silent over that which they do not know – so if they were to do that then they have fulfilled the right of Allāh.",
                "href": "https://thaqalayn.net/hadith/9/2/1/4",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "2": {
                "hadithNumber": "Hadith #1",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Everything has a Ruling in the Book and the Sunna",
                "arabicText": "[-/1] الكافي: علي، عن محمد بن عيسى، عن يونس، عن حماد، عن أبي عبدالله عليه السلام قال: سمعته يقول: ما من شئ إلا وفيه كتاب أو سنة",
                "englishText": "1. [1/-] al-Kafi: Ali from Muhammad b. Isa from Yunus from Hammad from Abi Abdillah عليه السلام, he (Hammad) said: I heard him saying: there is nothing except there is about it [a ruling in the] Book or Sunna.",
                "href": "https://thaqalayn.net/hadith/9/2/2/1",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "2": {
                "hadithNumber": "Hadith #2",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Everything has a Ruling in the Book and the Sunna",
                "arabicText": "[-/2] الكافي: عدة من أصحابنا، عن أحمد بن محمد بن خالد، عن إسماعيل بن مهران، عن سيف بن عميرة، عن أبي المغرا، عن سماعة، عن أبي الحسن موسى عليه السلام قال: قلت له: أكل شئ في كتاب الله وسنة نبيه صلى اليه عليه وآله؟ أو تقولون فيه؟ قال: بل كل شئ في كتاب الله وسنة نبيه صلى الله عليه وآله",
                "englishText": "2. [2/-] al-Kafi: A number of our companions from Ahmad b. Muhammad b. Khalid from Ismail b. Mihran from Sayf b. ‘Amira from Abi al-Maghra from Sama’a from Abi al-Hasan Musa عليه السلام, he said: I said to him: is everything in the book of Allāh and the Sunna of his prophet صلى الله عليه وآله or do you have a say in it? he said: rather everything is in the book of Allāh and the Sunna of the prophet صلى الله عليه وآله",
                "href": "https://thaqalayn.net/hadith/9/2/2/2",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "3": {
                "hadithNumber": "Hadith #1",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Permanence of the Halal and the Haram unto the Day of Judgment",
                "arabicText": "[-/1] الكافي: علي بن إبراهيم، عن محمد بن عيسى بن عبيد، عن يونس، عن حريز عن زرارة قال: سألت أبا عبدالله عليه السلام عن الحلال والحرام فقال: حلال محمد حلال أبدا إلى يوم القيامة، وحرامه حرام أبدا إلى يوم القيامة، لا يكون غيره ولا يجيئ غيره، وقال: قال علي عليه السلام: ما أحد ابتدع بدعة إلا ترك بها سنة",
                "englishText": "1. [1/-] al-Kafi: Ali b. Ibrahim from Muhammad b. Isa b. Ubayd from Yunus from Hariz from Zurara who said: I asked Aba Abdillah عليه السلام about the Halal and the Haram so he said: the Halal of Muhammad is Halal forever unto the day of judgment and his Haram is Haram forever unto the day of judgment, there will be nothing other than it and nothing apart from it will come, and he said: Ali عليه السلام said: no one has innovated a Bid’a except that he has abandoned a Sunna (by doing so).",
                "href": "https://thaqalayn.net/hadith/9/2/3/1",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "4": {
                "hadithNumber": "Hadith #5",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: What Can be Used to Infer some General Principles",
                "arabicText": "[-/5] الكافي: علي بن ابراهيم عن أبيه ومحمد بن اسماعيل عن الفضل ابن شاذان جميعا عن حماد بن عيسى عن حريز عن زرارة قال قلت: لابي جعفر عليه السلام الا تخبرني من أين علمت وقلت إن المسح ببعض الرأس وبعض الرجلين؟ فضحك ثم قال … ثم قال: مَا يُرِيدُ اللَّهُ لِيَجْعَلَ عَلَيْكُم (في الدين) مِّنْ حَرَجٍ والحرج الضيق",
                "englishText": "5. [5/-] al-Kafi: Ali b. Ibrahim from his father AND Muhammad b. Ismail from al-Fadhl b. Shadhan all together from Hammad b. Isa from Hariz from Zurara who said: I said to Abi Ja’far عليه السلام: will you not inform me how you knew and ruled that the wiping should only be limited to a part of the head and a part of the feet, so he laughed and then said: … then he said: “Allāh does not intend to place upon you [in the religion] any difficulty” (5:6) – and “difficulty” is “discomfort”. ",
                "href": "https://thaqalayn.net/hadith/9/2/4/5",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "4": {
                "hadithNumber": "Hadith #6",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: What Can be Used to Infer some General Principles",
                "arabicText": "[-/6] التهذيب: المفيد عن أحمد بن محمد عن أبيه عن الحسين بن الحسن بن أبان عن الحسين بن سعيد عن ابن أبي عمير عن ابن اذينة عن الفضيل قال سئل أبوعبدالله عليه السلام عن الجنب يغتسل فينتضح من الارض في الاناء فقال: لا بأس هذا مما قال الله تعالى: مَا جَعَلَ عَلَيْكُمْ فِي الدِّينِ مِنْ حَرَجٍ",
                "englishText": "6. [6/-] al-Tahdhib: al-Mufid from Ahmad b. Muhammad from his father from al-Husayn b. al-Hasan b. Aban from al-Husayn b. Said from Ibn Abi Umayr from Ibn Udhayna from al-Fudhayl who said: Abu Abdillah عليه السلام was asked about the one in the state of Janaba who is bathing so [some of the used water] sprays off the ground and into the utensil, he said: there is no harm – this is covered by what Allāh the Exalted said: “He has not placed upon you in the religion any difficulty” (22:78).",
                "href": "https://thaqalayn.net/hadith/9/2/4/6",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "4": {
                "hadithNumber": "Hadith #8",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: What Can be Used to Infer some General Principles",
                "arabicText": "[-/8] التهذيب: عن محمد بن علي بن محبوب، عن ابن عيسى، عن البزنطي قال: سألته عن الرجل يأتي السوق فيشتري جبة فراء لا يدري أذكية هي أم غير ذكية أيصلي فيها؟ فقال: نعم ليس عليكم المسألة إن أبا جعفر عليه السلام كان يقول: إن الخوارج ضيقوا على أنفسهم بجهالتهم. إن الدين أوسع من ذلك",
                "englishText": "8. [8/-] al-Tahdhib: Muhammad b. Ali b. Mahbub from Ibn Isa from al-Bazanti who said: I asked him about a man who comes to the market and buys a cloak of fur but he is not sure whether it is pure or not pure – can he pray in it? he said: yes, you do not have to inquire about it, Aba Ja’far عليه السلام used to say: the Khawarij straitened things for themselves because of their ignorance, the religion is more expansive than that.",
                "href": "https://thaqalayn.net/hadith/9/2/4/8",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "4": {
                "hadithNumber": "Hadith #9",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: What Can be Used to Infer some General Principles",
                "arabicText": "[-/9] الكافي: علي بن إبراهيم، عن أبيه، عن محمد بن أبي عمير، عن ابن اذينة، عن بريد العجلي قال: قلت لابي جعفر عليه السلام: … قال: … ولم يجعل الله تبارك وتعالى في الدين من ذيق فالحرج أشد من الضيق …",
                "englishText": "9. [9/-] al-Kafi: Ali b. Ibrahim from his father from Muhammad b. Abi Umayr from Ibn Udhayna from Burayd al-Ijli who said: I said to Abi Ja’far عليه السلام: … he said: … and Allāh Blessed and Exalted did not place in the religion any discomfort for “difficulty” is more extreme than “discomfort”.",
                "href": "https://thaqalayn.net/hadith/9/2/4/9",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "5": {
                "hadithNumber": "Hadith #4",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Authoritativeness of the Book and the Sunna",
                "arabicText": "[-/4] الكافي: علي، عن محمد بن عيسى، عن يونس، عن قتيبة قال: سأل رجل أبا عبدالله عليه السلام عن مسألة فأجابه فيها، فقال الرجل: أرأيت إن كان كذا وكذا ما يكون القول فيها؟ فقال له: مه ما أجبتك فيه من شئ فهو عن رسول الله صلى الله عليه وآله لسنا من: ” أرأيت” في شئ",
                "englishText": "4. [4/-] al-Kafi: Ali from Muhammad b. Isa from Yunus from Qutayba who said: a man asked Aba Abdillah عليه السلام about an issue and he answered him in it – so the man said: suppose if it were so and so – what would the answer be in it then? So he said to him: keep silent, whatever I have answered regarding it – then it is on the authority of the messenger of Allah صلى الله عليه وآله, we have nothing to do with ‘suppose’ whatsoever.",
                "href": "https://thaqalayn.net/hadith/9/2/5/4",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "5": {
                "hadithNumber": "Hadith #5",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Authoritativeness of the Book and the Sunna",
                "arabicText": "[-/5] الرسالة المؤلفة في احوال احاديث اصحابنا واثبات صحتها لسعد بن هبة الله الراوندي: عنه، عن أبيه، عن سعد بن عبدالله، عن يعقوب بن يزيد، عن محمد بن أبي عمير، عن جميل بن دراج، عن أبي عبدالله عليه السلام قال: الوقوف عند الشبهة خير من الاقتحام في الهلكة، إن على كل حق حقيقة، وعلى كل صواب نورا، فما وافق كتاب الله فخذوه، وما خالف كتاب الله فدعوه",
                "englishText": "5. [5/-] The Treatise on the ‘Status of the Narrations of our Companions and Establishing their Authenticity’ authored by Sa’d b. Hibat Allah al-Rawandi: And from him (al-Saduq) from his father from Sa’d b. Abdallah from Ya’qub b. Yazid from Muhammad b. Abi Umayr from Jamil b. Darraj from Abi Abdillah عليه السلام who said: stopping in the face of doubt is better then rushing headlong into destruction, there is upon every truth a [self-evident] certainty, and upon every correct thing a light [proof], so whatever agrees with the Book of Allah then take it, and whatever opposes the Book of Allah then leave it.",
                "href": "https://thaqalayn.net/hadith/9/2/5/5",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "5": {
                "hadithNumber": "Hadith #6",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Authoritativeness of the Book and the Sunna",
                "arabicText": "[-/6] الكافي: عدة من أصحابنا، عن أحمد بن محمد بن خالد، عن أبيه، عن النضر بن سويد، عن يحيى الحلبي، عن أيوب بن الحر قال: سمعت أبا عبدالله عليه السلام يقول: كل شئ مردود إلى الكتاب والسنة، وكل حديث لا يوافق كتاب الله فهو زخرف",
                "englishText": "6. [6/-] al-Kafi: A number of our companions from Ahmad b. Muhammad b. Khalid from his father from al-Nadhr b. Suwayd from Yahya al-Halabi from Ayyub b. al-Hur who said: I heard Aba Abdillah عليه السلام saying: everything is referred back to the Book and the Sunna, and every Hadith that does not agree with the Book of Allah then it is a worthless embellishment.",
                "href": "https://thaqalayn.net/hadith/9/2/5/6",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "5": {
                "hadithNumber": "Hadith #7",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Authoritativeness of the Book and the Sunna",
                "arabicText": "[-/7] رجال الكشي: محمد بن قولويه، والحسين بن الحسن بن بندار معا، عن سعد، عن اليقطيني، عن يونس بن عبد الرحمن … قال: حدثني هشام بن الحكم أنه سمع أبا عبد الله عليه السلام يقول: لا تقبلوا علينا حديثا إلا ما وافق القرآن والسنة …",
                "englishText": "7. [7/-] Rijal al-Kashshi: Muhammad b. Qulawayh and al-Husayn b. al-Hasan b. Bundar together from Sa’d from al-Yaqtini from Yunus b. Abd al-Rahman … he said: Hisham b. al-Hakam narrated to me that he heard Aba Abdillah عليه السلام saying: do not accept a narration on our authority except that which is in agreement with the Qur’an and the Sunna … ",
                "href": "https://thaqalayn.net/hadith/9/2/5/7",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "5": {
                "hadithNumber": "Hadith #8",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Authoritativeness of the Book and the Sunna",
                "arabicText": "[-/8] التوحيد والعيون والأمالي: ابن المتوكل، عن علي، عن أبيه، عن الريان بن الصلت، عن علي بن موسى الرضا، عن آبائه، عن أمير المؤمنين عليهم السلام قال: قال رسول الله صلى الله عليه واله قال الله جل جلاله: ما آمن بي من فسر برأيه كلامي …",
                "englishText": "8. [8/-] al-Tawhid and al-Uyun and al-Amali: Ibn al-Mutawakkil from Ali from his father from al-Rayyan b. al-Salt from Ali b. Musa al-Ridha from his forefathers from the commander of the faithful عليهم السلام who said: the messenger of Allah صلى الله عليه واله said: Allah Majestic is His Majesty said: he has not believed in Me the one who interprets My words based on his opinion …",
                "href": "https://thaqalayn.net/hadith/9/2/5/8",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "5": {
                "hadithNumber": "Hadith #9",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Authoritativeness of the Book and the Sunna",
                "arabicText": "[-/9] تفسير العياشي: عن صفوان قال: سألت أبا الحسن الرضا عليه السلام عن قول الله: فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ وَامْسَحُوا بِرُءُوسِكُمْ وَأَرْجُلَكُمْ إِلَى الْكَعْبَيْنِ فقال: قد سأل رجل أبا الحسن عليه السلام عن ذلك فقال: سيكفيك أو كفتك سورة المائدة يعني المسح على الرأس والرجلين …",
                "englishText": "9. [9/-] Tafsir Al-Ayyashi: From Safwan who said: I asked Aba al-Hasan al-Rida عليه السلام about the words of Allah: “so wash your faces and your hands with the elbows and wipe part of your head and feet to the ankles” (5:6) – he said: a man asked Aba al-Hasan (al-Kadhim) عليه السلام about this so he said: Surat al-Maida is enough for you – meaning – wiping the head and the two feet … ",
                "href": "https://thaqalayn.net/hadith/9/2/5/9",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "5": {
                "hadithNumber": "Hadith #10",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Authoritativeness of the Book and the Sunna",
                "arabicText": "[-/10] الكافي: علي بن ابراهيم عن أبيه ومحمد بن اسماعيل عن الفضل ابن شاذان جميعا عن حماد بن عيسى عن حريز عن زرارة قال قلت: لابي جعفر عليه السلام الا تخبرني من أين علمت وقلت إن المسح ببعض الرأس وبعض الرجلين؟ فضحك ثم قال: يا زرارة قاله رسول الله صلى الله عليه وآله ونزل به الكتاب من الله لأن الله عزوجل يقول: فَاغْسِلُوا وُجُوهَكُمْ فعرفنا أن الوجه كله … فقال: فعرفنا حين قال بِرُءُوسِكُمْ أن المسح ببعض الرأس لمكان الباء …",
                "englishText": "10. [10/-] al-Kafi: Ali b. Ibrahim from his father AND Muhammad b. Ismail from al-Fadhl b. Shadhan all together from Hammad b. Isa from Hariz from Zurara who said: I said to Abi Ja’far عليه السلام: will you not inform me how you knew and ruled that the wiping should only be limited to a part of the head and a part of the feet, so he laughed and then said: O Zurara – the messenger of Allah ruled it to be so and the Book from Allah descended with it – because Allah Mighty and Majestic says: “wash your faces” so we understood that the whole face … then he said: “and wipe part of your head” so we understood when He said بِرُءُوسِكُمْ that the wiping is limited to part of the head because of the (letter) ‘ب’ (Ba) …",
                "href": "https://thaqalayn.net/hadith/9/2/5/10",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "5": {
                "hadithNumber": "Hadith #11",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Authoritativeness of the Book and the Sunna",
                "arabicText": "[-/11] الكافي: أحمد بن إدريس، عن محمد بن عبد الجبار، عن صفوان بن يحيى قال: سألني أبو قرة المحدث أن أدخله إلي أبى الحسن الرضا عليه السلام … فقال أبو الحسن عليه السلام: … إذا كانت الروايات مخالفه للقرآن كذبت بها، وما أجمع المسلمون عليه أنه لا يحيط به علم ولا تدركه الابصار وليس كمثله شئ",
                "englishText": "11. [11/-] al-Kafi: Ahmad b. Idris from Muhammad b. Abd al-Jabbar from Safwan b. Yahya who said: Abu Qurra the Hadith scholar asked me to facilitate his entrance into the presence of Abi al-Hasan al-Ridha عليه السلام … so Abu al-Hasan عليه السلام said: … if the narrations contradict the Qur’an then I reject them, and what the Muslims have all unanimously agreed upon is that He cannot be fully comprehended by knowledge, and the eye-sight cannot overtake Him, and there is nothing like Him. ",
                "href": "https://thaqalayn.net/hadith/9/2/5/11",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "5": {
                "hadithNumber": "Hadith #12",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Authoritativeness of the Book and the Sunna",
                "arabicText": "[-/12] ارشاد المفيد: قال رسول الله صلى الله عليه وآله: إني تارك فيكم الثقلين ما إن تمسكتم بهما لن تضلوا بعدي: كتاب الله وعترتي …",
                "englishText": "12. [12/-] Irshad of al-Mufid: The messenger of Allah صلى الله عليه وآله said: I leave behind in your midst the two weighty things, as long you hold on to them you will not go astray after me: the Book of Allah and my descendants … ",
                "href": "https://thaqalayn.net/hadith/9/2/5/12",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "5": {
                "hadithNumber": "Hadith #13",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Authoritativeness of the Book and the Sunna",
                "arabicText": "[-/13] معاني الأخبار: ابن الوليد، عن الصفار، عن الخشاب، عن ابن كلوب، عن إسحاق بن عمار، عن جعفر، عن آبائه عليهم السلام قال: قال رسول الله صلى الله عليه وآله: ما وجدتم في كتاب الله عزوجل فالعمل لكم به لا عذر لكم في تركه …",
                "englishText": "13. [13/-] Ma’ani al-Akhbar: Ibn al-Walid from al-Saffar from al-Khashab from Ibn Kalub from Ishaq b. Ammar from Ja’far from his forefathers عليهم السلام: the messenger of Allah صلى الله عليه وآله said: whatever you find in the Book of Allah Mighty and Majestic then acting is to be based upon it and you have no excuse to abandon it …",
                "href": "https://thaqalayn.net/hadith/9/2/5/13",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "6": {
                "hadithNumber": "Hadith #1",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Principle of Precaution",
                "arabicText": "[-/1] التهذيب: عن الحسن بن محمد بن سماعة عن سليمان بن داود عن عبدالله بن وضاح قال: كتبت إلى العبد الصالح عليه السلام … فكتب إلي أرى لك أن تنتظر حتى تذهب الحمرة وتأخذ بالحايطة لدينك",
                "englishText": "1. [1/-] al-Tahdhib: From al-Hasan b. Muhammad b. Sama’a from Sulayman b. Dawud from Abdallah b. Wadhah who said: I wrote to the Righteous Servant (al-Kadhim) عليه السلام … so he wrote to me (saying): I deem for you that you delay [praying] until the reddish hue disappears and that you act prudently in your religion.",
                "href": "https://thaqalayn.net/hadith/9/2/6/1",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "6": {
                "hadithNumber": "Hadith #2",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Principle of Precaution",
                "arabicText": "[-/2] الكافي: علي، عن أبيه، ومحمد بن إسماعيل، عن الفضل بن شاذان جميعا، عن ابن أبي عمير وصفوان بن يحيى جميعا، عن عبدالرحمن بن الحجاج قال: سألت أبا الحسن عليه السلام عن رجلين أصابا صيدا وهما محرمان الجزاء بينهما أو على كل واحد منهما جزاء؟ فقال: لابل عليهما أن يجزي كل واحد منهما الصيد، قلت: إن بعض أصحابنا سألني عن ذلك فلم أدر ما عليه، فقال: إذا أصبتم مثل هذا فلم تدروا فعليكم بالاحتياط حتى تسألوا عنه فتعلموا",
                "englishText": "2. [2/-] al-Kafi: Ali from his father AND Muhammad b. Ismail from al-Fadhl b. Shadhan all together from Ibn Abi Umayr and Safwan b. Yahya all together from Abd al-Rahman b. al-Hajjaj who said: I asked Aba al-Hasan عليه السلام about two men who kill game [together] while they are in Ihram – will the atonement be shared between them or will it be incumbent on each one of them individually? He said: Rather it will be on each one of them to atone individually for the hunted animal, I said: one of our fellows asked me about that but I did not know what would be upon him, so he said: if you encounter the like of this [such scenarios] and do not know what to do then upon you is acting by precaution until when you ask about it and know [the exact answer]. ",
                "href": "https://thaqalayn.net/hadith/9/2/6/2",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "6": {
                "hadithNumber": "Hadith #3",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Principle of Precaution",
                "arabicText": "[-/3] التهذيب: باسناده عن محمد بن احمد بن يحيى عن هارون بن مسلم عن مسعدة بن زياد عن جعفر عن آبائه عليهم السلام ان النبي صلى الله عليه وآله قال: لا تجامعوا في النكاح على الشبهة يقول: إذا بلغك انك قد رضعت من لبنها وانها لك محرم وما اشبه ذلك فان الوقوف عند الشبهة خير من الاقتحام في الهلكة",
                "englishText": "3. [3/-] al-Tahdhib: Via his chain from Muhammad b. Ahmad b. Yahya from Harun b. Muslim from Mas’ada b. Ziyad from Ja’far from his forefathers عليهم السلام that the prophet صلى الله عليه وآله said: do not unite in marriage upon doubt – He meant to say: if it reaches you [information that] that you have suckled of her milk [from the same source – she is your foster sister] and that she is a Mahram to you, or something similar to this then halting in the face of doubt is better than rushing headlong into destruction. ",
                "href": "https://thaqalayn.net/hadith/9/2/6/3",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "7": {
                "hadithNumber": "Hadith #1",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Authoritativeness of the Solitary Report of a Truthful Narrator",
                "arabicText": "[-/1] الكافي: عن محمد بن عبدالله ومحمد بن يحيى جميعا، عن عبدالله بن جعفر الحميري قال: اجتمعت أنا والشيخ أبوعمرو رحمه الله عند أحمد بن إسحاق فغمزني أحمد بن إسحاق أن أسأله عن الخلف فقلت له: … وقد أخبرني أبوعلي أحمد بن إسحاق عن أبي الحسن عليه السلام قال: سألته وقلت: من اعامل أو عمن آخذ وقول من أقبل؟ فقال له: العمري ثقتي فما ادى إليك عني فعني يؤدي وما قال لك عني فعني يقول، فاسمع له وأطع، فإنه الثقة المأمون، وأخبرني أبوعلي أنه سأل ابا محمد عليه السلام عن مثل ذلك فقال له: العمري وابنه ثقتان، فما أديا إليك عني فعني يؤديان وما قالا لك فعني يقولان، فاسمع لهما وأطعمها فإنهما الثقتان المأمونان …",
                "englishText": "1. [1/-] al-Kafi: From Muhammad b. Abdallah and Muhammad b. Yahya both from Abdallah b. Ja’far al-Himyari who said: we gathered – me and the Shaykh Abu Amr (al-Amri) – may Allah have mercy on him – at Ahmad bin Ishaq’s, then Ahmad b. Ishaq signaled me to ask him (al-Amri) about the Remnant (al-Mahdi), so I said to him: … and Abu Ali Ahmad b. Ishaq has relayed to me on the authority of Abi al-Hasan (al-Naqi) عليه السلام – saying: I asked him and said: whom do I emulate or from whom do I take? and whose words do I accept? so he said to him: al-Amri is my Thiqa (trustee), so what he gives you on my behalf then his giving is truly on my behalf, and what he says to you on my behalf then his saying is truly on my behalf, so listen to him and obey him, for he is both Thiqa (trustworthy) and reliable, and Abu Ali also informed me that he had asked Aba Muhammad (al-Askari) عليه السلام about the same matter, so he said to him: al-Amri and his son are both Thiqa (trustees), so what they give to you on my behalf then their giving is truly on my behalf, and what they say to you on my behalf then their saying is truly on my behalf, so listen to them and obey them, for they are both Thiqa (trustworthy) and reliable … ",
                "href": "https://thaqalayn.net/hadith/9/2/7/1",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "7": {
                "hadithNumber": "Hadith #2",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Authoritativeness of the Solitary Report of a Truthful Narrator",
                "arabicText": "[-/2] رجال الكشي: محمد بن قولويه عن سعد بن عبد الله، عن أحمد بن محمد بن عيسى، عن عبد الله بن محمد الحجال، عن يونس بن يعقوب قال: كنا عند أبي عبد الله عليه السلام فقال أما لكم من مفزع أما لكم من مستراح تستريحون إليه ما يمنعكم من الحارث بن المغيرة النصري",
                "englishText": "2. [2/-] Rijal al-Kashshi: Muhammad b. Qulawayh from Sa’d b. Abdallah from Ahmad b. Muhammad b. Isa from Abdallah b. Muhammad al-Hajjal from Yunus b. Ya’qub who said: we were at Aba Abdillah’s عليه السلام place when he said: do you not have a secure shelter? do you not have a comforter whom you can seek comfort in? what prevents you from [referring to] al-Harith bin al-Mughira al-Nasri. ",
                "href": "https://thaqalayn.net/hadith/9/2/7/2",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "7": {
                "hadithNumber": "Hadith #3",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Authoritativeness of the Solitary Report of a Truthful Narrator",
                "arabicText": "[-/3] رجال الكشي: محمد بن مسعود، عن محمد بن نصير، عن محمد بن عيسى، عن عبد العزيز ابن المهتدي قال: قلت لأبي الحسن الرضا عليه السلام: جعلت فداك لا أكاد أصل إليك لأسألك عن كل ما أحتاج إليه من معالم ديني، أفيونس بن عبد الرحمن ثقة آخذ عنه ما أحتاج إليه من معالم ديني فقال: نعم",
                "englishText": "3. [3/-] Rijal al-Kashshi: Muhammad b. Mas’ud from Muhammad b. Nusayr from Muhammad b. Isa from Abd al-Aziz b. al-Muhtadi who said: I said to Abi al-Hasan al-Ridha عليه السلام: may I be made your ransom, I cannot always reach you to ask you all that which I need from the teachings of my religion, is Yunus b. Abd al-Rahman Thiqa (trustworthy) and can I take from him what I need from the teachings of my religion? he said: yes. ",
                "href": "https://thaqalayn.net/hadith/9/2/7/3",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "7": {
                "hadithNumber": "Hadith #4",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Authoritativeness of the Solitary Report of a Truthful Narrator",
                "arabicText": "[-/4] رجال النجاشي: عن شيخنا المفيد في كتابه مصابيح النور: أخبرني ابن قولويه، عن علي بن الحسين بن بابويه، عن عبد الله بن جعفر، عن داود بن القاسم الجعفري قال: عرضت على أبي محمد صاحب العسكر عليه السلام كتاب يوم وليلة ليونس، فقال لي: تصنيف من هذا ؟ فقلت: تصنيف يونس مولى آل يقطين، فقال: أعطاه الله بكل حرف نورا يوم القيامة",
                "englishText": "4. [4/-] Rijal al-Najashi: From our Shaykh al-Mufid in his book “Masabih al-Nur”: reported to us Ibn Qulawayh from Ali b. al-Husayn b. Babawayh from Abdallah b. Ja’far from Dawud b. al-Qasim al-Ja’fari who said: I presented the book “Yawm wa Layla” of Yunus to Abi Muhammad al-Askari عليه السلام, so he said to me: who authored this? I said: it has been authored by Yunus the client of the family of Yaqtin, he said: may Allah give him for every letter a light on the day of judgment. ",
                "href": "https://thaqalayn.net/hadith/9/2/7/4",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "7": {
                "hadithNumber": "Hadith #5",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Authoritativeness of the Solitary Report of a Truthful Narrator",
                "arabicText": "[-/5] الكافي: عدة من أصحابنا، عن أحمد بن عيسى، عن أحمد بن محمد بن أبي نصر عن أبان بن عثمان، عن ابن أبي يعفور، عن أبي عبدالله عليه السلام أن رسول الله صلى الله عليه وآله خطب الناس في مسجد الخيف فقال: نضر الله عبدا سمع مقالتي فوعاها وحفظها وبلغها من لم يسمعها، فرب حامل فقه غير فقيه ورب حامل فقه إلى من هو أفقه منه …",
                "englishText": "5. [5/-] al-Kafi: A number of our companions from Ahmad b. Muhammad b. Isa from Ahmad b. Muhammad b. Abi Nasr from Aban b. Uthman from Ibn Abi Ya’fur from Abi Abdillah عليه السلام who said: the messenger of Allah صلى الله عليه وآله gave a speech to the people in the Masjid of al-Khif and said: may Allah make radiant [the face of] a slave who hears my words and understands them and memorizes them and relays them to the one who did not hear them, for it may happen that a bearer of Fiqh is not a Faqih and it may happen that a bearer of Fiqh relays them to one who is more of a Faqih than him … ",
                "href": "https://thaqalayn.net/hadith/9/2/7/5",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "7": {
                "hadithNumber": "Hadith #6",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Authoritativeness of the Solitary Report of a Truthful Narrator",
                "arabicText": "[-/6] رجال الكشي: حمدويه بن نصير، عن يعقوب بن يزيد و محمد بن الحسين بن أبي الخطاب، عن محمد بن أبي عمير، عن إبراهيم بن عبد الحميد و غيره قالوا: قال أبو عبد الله عليه السلام رحم الله زرارة بن أعين لو لا زرارة و نظراؤه لاندرست أحاديث أبي عليه السلام",
                "englishText": "6. [6/-] Rijal al-Kashshi: Hamduwayh b. Nusayr from Ya’qub b. Yazid and Muhammad b. al-Husayn b. Abi al-Khattab from Muhammad b. Abi Umayr from Ibrahim b. Abd al-Hamid and others apart from him – they all said: Abu Abdillah عليه السلام said: may Allah have mercy on Zurara bin A’yan, if it was not for Zurara b. A’yan and his peers the narrations of my father would have perished. ",
                "href": "https://thaqalayn.net/hadith/9/2/7/6",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "7": {
                "hadithNumber": "Hadith #7",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Authoritativeness of the Solitary Report of a Truthful Narrator",
                "arabicText": "[-/7] عن رسول الله صلى الله عليه واله: من حفظ احاديثنا أربعين حديثا بعثه الله يوم القيامة عالما فقيها",
                "englishText": "7. [7/-] From the messenger of Allah صلى الله عليه واله who said: whoever preserves forty of our narrations Allah will raise him on the day of judgment as a scholar possessing understanding. ",
                "href": "https://thaqalayn.net/hadith/9/2/7/7",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "7": {
                "hadithNumber": "Hadith #8",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Authoritativeness of the Solitary Report of a Truthful Narrator",
                "arabicText": "[-/8] الكافي: علي بن إبراهيم، عن أبيه، عن ابن أبي عمير، عن عمر بن أذينة، عن إسماعيل بن الفضل الهاشمي، قال: سألت أبا عبد الله عليه السلام عن المتعة، فقال: إلق عبد الملك بن جريح فسله عنها فإن عنده منها علما، فلقيته فأملى علي منها شيئا كثيرا في استحلالها، فكان فيما روى لي ابن جريح، قال: ليس فيها وقت ولا عدد إنما هي بمنزلة الإماء يتزوج منهن كم شاء، وصاحب الأربع نسوة يتزوج منهن ما شاء بغير ولي ولا شهود، فإذا انقضى الاجل بانت منه بغير طلاق ويعطيها الشئ اليسير، وعدتها حيضتان، وإن كانت لا تحيض فخمسة وأربعون يوما، فأتيت بالكتاب أبا عبد الله عليه السلام فعرضت عليه، فقال: صدق وأقر به",
                "englishText": "8. [8/-] al-Kafi: Ali b. Ibrahim from his father from Ibn Abi Umayr from Umar b. Udhayna from Ismail b. al-Fadhl al-Hashimi who said: I asked Aba Abdillah عليه السلام about Mut’a so he said: go and see Abd al-Malik b. Jurayj and ask him about it for he has some knowledge about it, so I met him and he (Ibn Jurayj) dictated a lot of material in regards its permissibility to me, so from among that which Ibn Jurayj transmitted to me included: it (Mut’ah) has no fixed duration nor limit in number [of partners with whom you can contract], it has the same status as [union with] slave girls, a man marries with them as he likes, even someone who already has four wives can marry as many as he wishes, without [permission from] guardian required nor witnesses, so when the period terminates she departs from him without divorce, and he gives her some small thing [as her Mahr], and her Idda is two menstrual cycles, and if she does not menstruate then forty five days, so I came with the book to Aba Abdillah عليه السلام and presented its contents to him, so he said: he is truthful, and he agreed with it. ",
                "href": "https://thaqalayn.net/hadith/9/2/7/8",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "7": {
                "hadithNumber": "Hadith #9",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Authoritativeness of the Solitary Report of a Truthful Narrator",
                "arabicText": "[-/9] رجال الكشي: حمدويه، عن ابن يزيد، عن ابن أبي عمير، عن شعيب العقرقوفي قال: قلت لأبي عبد الله عليه السلام: ربما احتجنا أن نسأل عن الشئ فمن نسأل؟ قال: عليك بالأسدي – يعني أبا بصير",
                "englishText": "9. [9/-] Rijal al-Kashshi: Hamduwayh who said: narrated to us Ibn Yazid from Ibn Abi Umayr from Shuayb al-Aqraqufi who said: I said to Abi Abdillah عليه السلام: it may happen that we require to ask about something – so whom should we ask? he said: upon you is al-Asadi – meaning by it – Aba Basir.",
                "href": "https://thaqalayn.net/hadith/9/2/7/9",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "7": {
                "hadithNumber": "Hadith #10",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Authoritativeness of the Solitary Report of a Truthful Narrator",
                "arabicText": "[-/10] الكافي: عدة من أصحابنا، عن أحمد بن محمد، عن الحسن بن علي، عن وهيب بن حفص قال: كنا مع أبي بصير فأتاه عمرو بن إلياس فقال له: ياأبا محمد إن أخي بحلب بعث إلي بمال من الزكاة اقسمه بالكوفة فقطع عليه الطريق فهل عندك فيه رواية؟ فقال: نعم. سألت أبا جعفر عليه السلام عن هذه المسألة ولم أظن أن أحدا يسألني عنها أبدا فقلت لابي جعفر عليه السلام: جعلت فداك الرجل يبعث بزكاته من أرض إلى أرض فيقطع عليه الطريق فقال: قد أجزأت عنه ولو كنت أنا لاعدتها",
                "englishText": "10. [10/-] al-Kafi: A number of our companions from Ahmad b. Muhammad from al-Hasan b. Ali from Wuhayb b. Hafs who said: we were with Abi Basir when Amr b. Ilyas came and said to him: O Aba Muhammad (i.e. Abi Basir) my brother is in Halab (Aleppo), he sent me some wealth as Zakat so that I can distribute it in Kufa, but the road was cut-off on him [brigands stole it] – do you have a narration about this? he said: yes, I asked Aba Ja’far عليه السلام this question and I don’t think anyone else has asked me about it before, I said to Abi Ja’far عليه السلام: may I be made your ransom, a man sends his Zakat from one land to another but it is intercepted on the road, he said: he is excused but if it were me I would have repeated again [giving Zakat a second time]. ",
                "href": "https://thaqalayn.net/hadith/9/2/7/10",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "7": {
                "hadithNumber": "Hadith #11",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Authoritativeness of the Solitary Report of a Truthful Narrator",
                "arabicText": "[-/11] الفقيه: بإسناده عن ابراهيم بن هاشم ان محمد بن ابي عمير كان رجلا بزازا فذهب ماله وافتقره وكان له على رجل عشرة آلاف درهم فباع دارا له كان يسكنها بعشرة آلاف درهم وحمل المال إلى بابه فخرج اليه محمد بن ابي عمير فقال: ما هذا؟ فقال: هذا مالك الذي لك علي قال: ورثته؟ قال: لا قال: وهب لك؟ قال: لا قال: فهل هو ثمن ضيعة بعتها؟ قال: لا قال: فما هو؟ قال: بعت داري التي اسكنها لاقضي ديني فقال محمد بن ابي عمير: حدثني ذريح المحاربي عن ابي عبدالله (ع) انه قال: لا يخرج الرجل عن مسقط رأسه بالدين، ارفعها فلا حاجة لي فيها والله اني لمحتاج في وقتي هذا إلى درهم واحد وما يدخل ملكي منها درهم واحد",
                "englishText": "11. [11/-] al-Faqih: Via his chain from Ibrahim b. Hashim that: Muhammad b. Abi Umayr was a cloth merchant whose wealth perished and he fell into poverty, however he had loaned out ten thousand silver coins to someone, so the one he owed sold his house which he used to live in at a price of ten thousand silver coins and carried the whole sum to his (Ibn Abi Umayr’s) door, so Muhammad b. Abi Umayr came out to him and said: what is this? he said: this is your money which was due upon me, he said: you have inherited it? he said: no, he said: it has been gifted to you? he said: no, he said: is it the price of a land you have sold? He said: no, he said: then what is it? he said: I sold my house in which I live in so that I can repay my debt, so Muhammad b. Abi Umayr said: Dharih al-Muharibi narrated to me from Abi Abdillah that he said: a man is not driven out of his place of residence (his home) because of debt, take it away for I have no need of it, by Allah even though I do have a need of even a single silver coin at this time – I will not take a single one of them into my possession. ",
                "href": "https://thaqalayn.net/hadith/9/2/7/11",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "7": {
                "hadithNumber": "Hadith #12",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Authoritativeness of the Solitary Report of a Truthful Narrator",
                "arabicText": "[-/12] رجال الكشي: محمد بن قولويه، عن سعد، عن أحمد بن محمد بن عيسى، عن عبد الله الحجال، عن العلاء، عن ابن أبي يعفور قال: قلت لأبي عبد الله عليه السلام إنه ليس كل ساعة ألقاك و لا يمكن القدوم، و يجي‏ء الرجل من أصحابنا فيسألني و ليس عندي كلما يسألني عنه، قال فما يمنعك من محمد بن مسلم الثقفي فإنه قد سمع من أبي و كان عنده وجيها",
                "englishText": "12. [12/-] Rijal al-Kashshi: Muhammad b. Qulawayh from Sa’d from Ahmad b. Muhammad b. Isa from Abdallah al-Hajjal from al-Ala from Ibn Abi Abi Ya’fur who said: I said to Abi Abdillah عليه السلام – I am not with you at all times, and it is sometimes impossible to travel (i.e. to come to you from Kufah), and a man from among our companions comes and asks me – but I do not have everything regarding what he asks me about, he عليه السلام said: what prevents you from (going to) Muhammad bin Muslim al-Thaqafi – for he had heard from my father and had a most favorable position with him. ",
                "href": "https://thaqalayn.net/hadith/9/2/7/12",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "7": {
                "hadithNumber": "Hadith #13",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Authoritativeness of the Solitary Report of a Truthful Narrator",
                "arabicText": "[-/13] الكافي: حميد بن زياد عن ابن سماعة عن ابن رباط عن عيص بن القاسم عن ابى عبدالله عليه السلام قال: سألته عن رجل خير امرأته فاختارت نفسها بانت منه؟ قال: لا انما هذا شئ كان لرسول الله صلى الله عليه وآله خاصة امر بذلك ففعل، ولو اخترن انفسهن لطلقن وهو قول الله عزوجل: قُلْ لأزْوَاجِكَ إِنْ كُنْتُنَّ تُرِدْنَ الحَيَاةَ الدُّنْيَا وَزِينَتَهَا فَتَعَالَيْنَ أُمَتِّعْكُنَّ وَأُسَرِّحْكُنَّ سَرَاحًا جَمِيلا قال الحسن بن سماعة وبهذا الحديث نأخذ في الخيار",
                "englishText": "13. [13/-] al-Kafi: Humayd b. Ziyad from Ibn Sama’a from Ibn Ribat from Iys b. al-Qasim from Abi Abdillah عليه السلام, he (Iys) said: I asked him about a man who derogates to his wife the option to choose – so she chooses herself, will this mean that the divorce is final? he said: No, this (i.e. Takhyir) is a thing which was only for the messenger of Allah specifically, he was ordered to do that so he did it, and if they had chosen themselves then he would have divorced them – and it is the words of Allah Mighty and Majestic “Say to your wives: if you prefer the life of this world and its adornment then come forth so that I provide you a provision and set you free in a goodly manner” (33:28). al-Hasan b. Sama’a said: by this Hadith do we take [rule] in the matter of Khiyar [giving an ultimatum to the wife to decide her future]. ",
                "href": "https://thaqalayn.net/hadith/9/2/7/13",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "7": {
                "hadithNumber": "Hadith #14",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Authoritativeness of the Solitary Report of a Truthful Narrator",
                "arabicText": "[-/14] الكافي: علي بن إبراهيم، عن أبيه، عن ابن أبي عمير، عن جميل بن دراج قال: لا يجبر الرجل إلا على نفقة الابوين والولد، قال ابن أبي عمير: قلت لجميل: والمرأة؟ قال: قد روى عن عنبسة، عن أبي عبدالله عليه السلام قال: إذا كساها مايواري عورتها ويطعمها مايقيم صلبها أقامت معه وإلا طلقها",
                "englishText": "14. [14/-] al-Kafi: Ali b. Ibrahim from his father from Ibn Abi Umayr from Jamil b. Darraj who said: a man is not obliged to provide food except for the two parents and the children, Ibn Abi Umayr said: I said to Jamil: what about the wife? He said: it has been narrated from Anbasa from Abi Abdillah عليه السلام that he said: if he (the husband) clothes her with what covers her Awra [what should be covered] and if he feeds her what keeps her back straight then she remains with him otherwise he divorces her. ",
                "href": "https://thaqalayn.net/hadith/9/2/7/14",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "8": {
                "hadithNumber": "Hadith #2",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Principle of “Whomsoever it reaches …”",
                "arabicText": "[-/2] محاسن البرقي: و عنه عن علي بن الحكم عن هشام بن سالم عن أبي عبد الله عليه السلام قال من بلغه عن النبي صلى الله عليه وآله شيء من الثواب فعمله كان أجر ذلك له و إن كان رسول الله صلى الله عليه وآله لم يقله",
                "englishText": "2. [2/-] Mahasin of al-Barqi: And from him (Muhammad b. Khalid al-Barqi) from Ali b. al-Hakam from Hisham b. Salim from Abi Abdillah عليه السلام who said: whomsoever it reaches something about the Thawab – attributed to the prophet صلى الله عليه وآله – and he acts upon it, he will have the rewards of that, even if the messenger of Allah صلى الله عليه وآله had not said it. ",
                "href": "https://thaqalayn.net/hadith/9/2/8/2",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "9": {
                "hadithNumber": "Hadith #1",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Necessity of Comparing the Hadith with the Qur’an",
                "arabicText": "[-/1] الكافي: عدة من أصحابنا، عن أحمد بن محمد بن خالد، عن أبيه، عن النضر بن سويد، عن يحيى الحلبي، عن أيوب بن الحر قال: سمعت أبا عبدالله عليه السلام يقول: كل شئ مردود إلى الكتاب والسنة، وكل حديث لا يوافق كتاب الله فهو زخرف",
                "englishText": "1. [1/-] al-Kafi: A number of our companions from Ahmad b. Muhammad b. Khalid from his father from al-Nadhr b. Suwayd from Yahya al-Halabi from Ayyub b. al-Hur who said: I heard Aba Abdillah عليه السلام saying: everything is referred back to the Book and the Sunna, and every Hadith that does not agree with the Book of Allah then it is a worthless embellishment.",
                "href": "https://thaqalayn.net/hadith/9/2/9/1",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "9": {
                "hadithNumber": "Hadith #2",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Necessity of Comparing the Hadith with the Qur’an",
                "arabicText": "[-/2] الكافي: محمد بن إسماعيل، عن الفضل بن شاذان، عن ابن أبي عمير، عن هشام بن الحكم وغيره، عن أبي عبدالله عليه السلام قال: خطب النبي صلى الله عليه وآله بمنى فقال: أيها الناس ما جاء كم عني يوافق كتاب الله فأنا قلته وما جاء كم يخالف كتاب الله فلم أقله",
                "englishText": "2. [2/-] al-Kafi: Muhammad b. Ismail from al-Fadhl b. Shadhan from Ibn Abi Umayr from Hisham b. al-Hakam and other than him from Abi Abdillah عليه السلام who said: the Prophet صلى الله عليه وآله addressed the people in Mina and said: O people, whatever comes to you attributed to me which agrees with the Book of Allah then I have indeed said it, and whatever comes to you opposing the book of Allah then I never said it.",
                "href": "https://thaqalayn.net/hadith/9/2/9/2",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "9": {
                "hadithNumber": "Hadith #4",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Necessity of Comparing the Hadith with the Qur’an",
                "arabicText": "[-/4] الرسالة المؤلفة في احوال احاديث اصحابنا واثبات صحتها لسعد بن هبة الله الراوندي: عن محمد وعلي ابني علي بن عبد الصمد، عن أبيهما، عن أبي البركات علي بن الحسين، عن الصدوق، عن أبيه، عن سعد بن عبدالله، عن يعقوب بن يزيد، عن محمد بن أبي عمير، عن جميل بن دراج، عن أبي عبدالله عليه السلام قال: الوقوف عند الشبهة خير من الاقتحام في الهلكة، إن على كل حق حقيقة، وعلى كل صواب نورا، فما وافق كتاب الله فخذوه، وما خالف كتاب الله فدعوه",
                "englishText": "4. [4/-] The Treatise on the ‘Status of the Narrations of our Companions and Establishing their Authenticity’ authored by Sa’d b. Hibat Allah al-Rawandi: From Muhammad and Ali the two sons of Ali b. Abd al-Samad from their father from Abi al-Barakat Ali b. al-Husayn from al-Saduq from his father from Sa’d b. Abdallah from Ya’qub b. Yazid from Muhammad b. Abi Umayr from Jamil b. Darraj from Abi Abdillah عليه السلام who said: halting in the face of doubt is better then rushing headlong into destruction, there is upon every truth a reality, and upon every correct thing a light, so whatever agrees with the Book of Allah then take it, and whatever opposes the Book of Allah then leave it. ",
                "href": "https://thaqalayn.net/hadith/9/2/9/4",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "10": {
                "hadithNumber": "Hadith #1",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Judging Conflict between Narrations",
                "arabicText": "[-/1] الكافي: علي بن إبراهيم، عن أبيه، عن عثمان بن عيسى والحسن بن محبوب جميعا، عن سماعة، عن أبي عبد الله عليه السلام قال: سألته عن رجل اختلف عليه رجلان من أهل دينه في أمر كلاهما يرويه: أحدهما يأمر بأخذه والآخر ينهاه عنه، كيف يصنع؟ فقال: يرجئه حتى يلقي من يخبره، فهو في سعة حتي يلقاه، وفي رواية اخرى بأيهما أخذت من باب التسليم وسعك",
                "englishText": "1. [1/-] al-Kafi: Ali b. Ibrahim from his father from Uthman b. Isa and al-Hasan b. Mahbub all together from Sama’a from Abi Abdillah عليه السلام, he (Sama’a) said: I asked him about a man who is answered oppositely by two of his co-religionists (i.e. Shi’as) in regards to a matter – both transmitting it [their answers – on your authority], one of them obligates it while the other forbids it – what should he do? he said: he withholds [doing anything] until he accesses one who will inform him (of the true position), and he is respited until such a time as he meets him. [And in another narration [the Imam said]: whichever of them you act by – suffices you – if done in subservience (with the intention of obeying)]. ",
                "href": "https://thaqalayn.net/hadith/9/2/10/1",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "10": {
                "hadithNumber": "Hadith #2",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Judging Conflict between Narrations",
                "arabicText": "[-/2] الرسالة المؤلفة في احوال احاديث اصحابنا واثبات صحتها لسعد بن هبة الله الراوندي: الصدوق، عن أبيه، عن سعد بن عبدالله، عن أيوب بن نوح، عن محمد ابن أبي عمير، عن عبد الرحمن بن أبي عبدالله قال: قال الصادق عليه السلام: إذا ورد عليكم حديثان مختلفان فاعرضوهما على كتاب الله، فما وافق كتاب الله فخذوه، وما خالف كتاب الله فردوه، فان لم تجدوهما في كتاب الله فاعرضوهما على أخبار العامة، فما وافق أخبارهم فذروه، وما خالف أخبارهم فخذوه",
                "englishText": "2. [2/-] The Treatise on the ‘Status of the Narrations of our Companions and Establishing their Authenticity’ authored by Sa’d b. Hibat Allah al-Rawandi: al-Saduq from his father from Sa’d b. Abdallah from Ayyub b. Nuh from Muhammad b. Abi Umayr from Abd al-Rahman b. Abi Abdillah who said: al-Sadiq عليه السلام said: if there comes to you two divergent Hadith then compare them with the book of Allah, then take the one which agrees with the book of Allah and reject the one that opposes the book of Allah, so if you do not find anything to do with them in the book of Allah then compare both to the reports of the Amma, so the one that agrees with their reports then leave it, and the one that opposes their reports then take it. ",
                "href": "https://thaqalayn.net/hadith/9/2/10/2",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "10": {
                "hadithNumber": "Hadith #3",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Judging Conflict between Narrations",
                "arabicText": "[-/3] التهذيب: باسناده عن احمد بن محمد عن العباس بن معروف عن علي بن مهزيار قال: قرأت في كتاب لعبد الله بن محمد إلى ابى الحسن عليه السلام إختلف أصحابنا في رواياتهم عن ابي عبدالله عليه السلام في ركعتي الفجر في السفر فروى بعضهم ان صلهما في المحمل، وروى بعضهم ان لا تصلهما إلا على الارض فاعلمني كيف تصنع انت لا قتدي بك في ذلك؟ فوقع عليه السلام: موسع عليك بأية عملت",
                "englishText": "3. [3/-] al-Tahdhib: Via his chain from Ahmad b. Muhammad from al-Abbas b. Ma’ruf from Ali b. Mahziyar who said: I read in a letter of Abdallah b. Muhammad to Abi al-Hasan عليه السلام [the following]: our fellows have differed in their narration from Abi Abdillah عليه السلام in regards the two units of Fajr whilst travelling, some of them narrated ‘pray them in your litter’ while others narrated ‘do not pray them except stationary on the ground’ so inform me what you personally do so that I can follow you in it? he wrote: it is accommodating for you whichever of them you act by. ",
                "href": "https://thaqalayn.net/hadith/9/2/10/3",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "11": {
                "hadithNumber": "Hadith #1",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Reasons for Differences between Narrations",
                "arabicText": "[-/1] الكافي: علي، عن أبيه، عن ابن أبي نجران، عن ابن حميد، عن ابن حازم، قال: قلت لأبي عبد الله عليه السلام: ما بالي أسألك عن المسألة فتجيبني فيها بالجواب ثم يجيئك غيري فتجيبه فيها بجواب آخر؟ فقال: إنا نجيب الناس على الزيادة والنقصان. قال: قلت: فأخبرني عن أصحاب رسول الله صلى الله عليه واله صدقوا على محمد صلى الله عليه واله أم كذبوا ؟ قال: بل صدقوا قلت: فما بالهم اختلفوا فقال: أما تعلم أن الرجل كان يأتي رسول الله صلى الله عليه واله فيسأله عن المسألة فيجيبه فيها بالجواب، ثم يجيبه بعد ذلك بما ينسخ ذلك الجواب فنسخت الأحاديث بعضها بعضا",
                "englishText": "1. [1/-] Ali from his father from Ibn Abi Najran from Asim b. Humayd from Mansur b. Hazim who said: I said to Abi Abdillah عليه السلام: what is my condition – I ask you about a matter so you answer me in it with a certain answer, then someone other than me comes to you and you answer him with a different answer? He said: we answer the people with deletion [in-short] and [at other times] with addition [in-depth]. I said: so inform me about the companions of the messenger of Allah صلى الله عليه واله – were they truthful about Muhammad or did they lie? He said: they were truthful, I said: so what was the matter with them that they differed? He said: don’t you know that a man used to come to the messenger of Allah صلى الله عليه واله and ask him about a thing so he answers him in it with an answer, then he answers after that with that which abrogates the former answer, so the narrations abrogated one another. ",
                "href": "https://thaqalayn.net/hadith/9/2/11/1",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "11": {
                "hadithNumber": "Hadith #2",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Reasons for Differences between Narrations",
                "arabicText": "[-/2] الكافي: أحمد بن إدريس، عن محمد بن عبدالجبار، عن الحسن بن علي، عن ثعلبة بن ميمون، عن زرارة بن أعين، عن أبي جعفر عليه السلام قال: سألته عن مسألة فأجابني ثم جاءه رجل فسأله عنها فأجابه بخلاف ما أجابني، ثم جاء رجل آخر …",
                "englishText": "2. [2/-] Ahmad b. Idris from Muhammad b. Abd al-Jabbar from al-Hasan b. Ali from Tha’laba b. Maymun from Zurara b. A’yan from Abi Ja’far عليه السلام, he (Zurara) said: I asked him about a matter so he answered me, then a man came to him and asked him about it so he answered him with a different answer to mine, then another man came … ",
                "href": "https://thaqalayn.net/hadith/9/2/11/2",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "11": {
                "hadithNumber": "Hadith #3",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Reasons for Differences between Narrations",
                "arabicText": "[-/3] التهذيب: باسناده عن الحسين بن سعيد عن محمد بن أبي عمير عن معاوية بن عمار قال: قلت لابي عبدالله عليه السلام أقضي صلاة النهار بالليل في السفر؟ فقال: نعم، فقال له اسماعيل بن جابر أقضي صلاة النهار بالليل في السفر؟ فقال: لا، فقال: إنك قلت نعم: فقال: إن ذاك يطيق وأنت لا تطيق",
                "englishText": "3. [3/-] al-Tahdhib: Via his chain from al-Husayn b. Sai’d from Muhammad b. Abi Umayr from Muawiya b. Ammar who said: I said to Abi Abdillah عليه السلام – do I repay the Salat of the day in the night whilst travelling? he said: yes, then Ismail b. Jabir said to him: do I repay the Salat of the day in the night whilst travelling? he said: no, so he said: you just said yes, he said: that one has the strength for it while you are not capable. ",
                "href": "https://thaqalayn.net/hadith/9/2/11/3",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "11": {
                "hadithNumber": "Hadith #4",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Reasons for Differences between Narrations",
                "arabicText": "[-/4] التهذيب: سعد بن عبدالله عن أحمد بن محمد عن الحسين بن سعيد عن حماد بن عيسى عن عمر بن اذينة عن زرارة قال: كنت قاعدا عند ابي جعفر عليه السلام وليس عنده غير ابنه جعفر فقال: يا زرارة ان ابا ذر رضي الله عنه وعثمان تنازعا على عهد رسول الله صلى الله وآله فقال عثمان: كل مال من ذهب أو فضة يدار به ويعمل به ويتجر به ففيه الزكاة إذا حال عليه الحول، فقال ابوذر رضي الله عنه: أما ما إتجر به أو دير وعمل به فليس فيه زكاة، إنما الزكاة فيه إذا كان ركازا أو كنزا موضوعا فاذا حال عليه الحول ففيه الزكاة، فاختصما في ذلك إلى رسول الله صلى الله عليه وآله قال فقال: القول ما قال ابوذر، فقال ابوعبدالله عليه السلام لابيه: ما تريد إلى أن تخرج مثل هذا فكيف الناس أن يعطوا فقراء هم ومساكينهم؟! فقال ابوه عليه السلام: إليك عني لا أجد منها بدا",
                "englishText": "4. [4/-] al-Tahdhib: Sa’d b. Abdallah from Ahmad b. Muhammad from al-Husayn b. Sa’id from Hammad b. Isa from Umar b. Udhayna from Zurara who said: I was seated at Abi Ja’far’s عليه السلام place and there was no one with him except his son Ja’far, so he (Abu Ja’far) said: O Zurara, Abu Dhar رضي الله عنه and Uthman argued in the life-time of the prophet, so Uthman said: every kind wealth whether it be gold or silver which circulates [is active i.e. having in-flow and out-flow], is worked with [as a capital], and is used for business – then there is Zakat on it if a year elapses, so Abu Dhar رضي الله عنه said: as for that which is used for business, is active, and is worked with – then there is no Zakat on it, rather Zakat is on that which is buried treasure (found fortuitously) and also on stored-up (saved) wealth, so if a year elapses on it then on it is Zakat, so they argued and referred it back to the messenger of Allah صلى الله عليه وآله, so he said: the true position is what was said by Abu Dhar, so Abu Abdillah عليه السلام said to his father: you do not want anything else but that such a one [narration] comes out [and is spread among the people] so that the people stop giving their poor and needy (anything of Zakat)?! So his father said: keep to yourself [don’t interfere], I do not find any option other than it (to narrate what happened and speak the truth). ",
                "href": "https://thaqalayn.net/hadith/9/2/11/4",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "11": {
                "hadithNumber": "Hadith #5",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Reasons for Differences between Narrations",
                "arabicText": "[-/5] الكافي: علي بن إبراهيم، عن أبيه، عن ابن أبي عمير، عن عبدالرحمن بن الحجاج، عن سليمان بن خالد قال: سمعت أبا عبدالله عليه السلام يقول: إن أصحاب أبي أتوه فسألوه عما يأخذ السلطان فرق لهم وإنه ليعلم أن الزكاة لا تحل إلا لاهلها فأمرهم أن يحتسبوا به فجال فكري والله لهم، فقلت له: يا أبة إنهم إن سمعوا إذا لم يزك أحد فقال: يابني حق أحب الله أن يظهره",
                "englishText": "5. [5/-] Al-Kafi: Ali b. Ibrahim from his father from Ibn Abi Umayr from Abd al-Rahman b. al-Hajjaj from Sulayman b. Khalid who said: I heard Aba Abdillah عليه السلام saying: the companions of my father came to him and asked him about that which is taken by the temporal ruler [as Kharaj – deeming it Zakat – is it sufficient], so he pitied them, while he knew that Zakat is not legitimate except for its people [only the true Imam can divide it to its rightful claimants], so he ordered them to count it [as Zakat], so my thoughts ran wild by Allah about them so I said: O father, if they have heard this then no one of them is ever going to give Zakat [in its right way]! so he said: O my son, it is a truth which Allah wanted to make apparent. ",
                "href": "https://thaqalayn.net/hadith/9/2/11/5",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "12": {
                "hadithNumber": "Hadith #1",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Invalidation of Analogical Reasoning",
                "arabicText": "[-/1] الكافي: علي بن إبراهيم، عن محمد بن عيسى بن عبيد، عن يونس بن عبدالرحمن، عن سماعة بن مهران، عن أبي الحسن موسى عليه السلام قال: … ومالكم وللقياس؟ إنما هلك من هلك من قبلكم بالقياس، ثم قال: إذا جاء كم ما تعلمون، فقولوا به وإن جائكم ما لا تعلمون فها – وأهوى بيده إلى فيه …",
                "englishText": "1. [1/-] al-Kafi: Ali b. Ibrahim from Muhammad b. Isa b. Ubayd from Yunus b. Abd al-Rahman from Sama’a b. Mihran from Abi al-Hasan Musa عليه السلام … he said: and what do you have to do with analogical reasoning? Verily they were destroyed who were destroyed before you because of analogical reasoning, then he said: if it comes to you that which you have knowledge of then say it, and if it comes to you that which you do not know then – he pointed with his hand to his mouth …",
                "href": "https://thaqalayn.net/hadith/9/2/12/1",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "12": {
                "hadithNumber": "Hadith #2",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Invalidation of Analogical Reasoning",
                "arabicText": "[-/2] الكافي: علي بن إبراهيم، عن أبيه، عن ابن أبي عمير، عن محمد بن حكيم قال: قلت لابي الحسن موسى عليه السلام: جعلت فداك فقهنا في الدين وأغنانا الله بكم عن الناس حتى أن الجماعة منا لتكون في المجلس ما يسأل رجل صاحبه تحضره المسألة و يحضره جوابها فيما من الله علينا بكم فربما ورد علينا الشئ لم يأتنا فيه عنك ولا عن آبائك شئ فنظرنا إلى أحسن ما يحضرنا وأوفق الاشياء لما جاء نا عنكم فنأخذ به؟ فقال هيهات هيهات، في ذلك والله هلك من هلك يا ابن حكيم، قال: ثم قال: لعن الله أبا حنيفة كان يقول: قال علي وقلت، قال محمد بن حكيم لهشام بن الحكم: والله ما أردت إلا أن يرخص لي في القياس",
                "englishText": "2. [2/-] al-Kafi: Ali b. Ibrahim from his father from Ibn Abi Umayr from Muhammad b. Hukaym who said: I said to Abi al-Hasan Musa عليه السلام – may I be made your ransom, we have gained understanding of the religion and Allah has made us self-sufficient from needing the people, so much so that a group of us may be in a meeting – not a man asks his fellow a question which comes to his mind except that he receives an answer for it, this is from the mercy of Allah on us through you, however it may happen that something is referred to us about which we have received nothing on your authority or that of your forefathers, can we look for the best-match in what we have and the closest to that which has come down to us from you and take it [as the answer]? So he said: not at all, not at all, in doing that – by Allah – were destroyed those who were destroyed O Ibn Hukaym, then he said: may Allah curse Aba Hanifa he used to say “Ali said but I say …”, Muhammad b. Hukaym then reported to Hisham b. al-Hakam that: by Allah I did not want anything [in asking this] except that he permit Qiyas (analogical reasoning) for me.",
                "href": "https://thaqalayn.net/hadith/9/2/12/2",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "12": {
                "hadithNumber": "Hadith #3",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Invalidation of Analogical Reasoning",
                "arabicText": "[-/3] معاني الاخبار والامالي: حدثنا محمد بن علي ماجليويه عن عمه محمد بن أبي القاسم، عن أخيه، عن أحمد بن محمد بن خالد، عن أبيه، عن محمد بن يحيى، عن غياث بن إبراهيم، عن الصادق جعفر بن محمد، عن أبيه، عن آبائه عليهم السلام قال: قال أمير المؤمنين عليه السلام: … إن المؤمن أخذ دينه من ربه ولم يأخذه عن رأيه …",
                "englishText": "3. [3/-] Ma’ani al-Akhbar and al-Amali: Muhammad b. Ali Majalwayh from his uncle Muhammad b. Abi al-Qasim from his brother from Ahmad b. Muhammad b. Khalid from his father from Muhammad b. Yahya from Ghiyath b. Ibrahim from al-Sadiq Ja’far b. Muhammad from his father from his forefathers عليهم السلام who said: the commander of the faithful عليه السلام said: … the believer takes his religion from his Lord and not from his opinion …",
                "href": "https://thaqalayn.net/hadith/9/2/12/3",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "12": {
                "hadithNumber": "Hadith #4",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Invalidation of Analogical Reasoning",
                "arabicText": "[-/4] التوحيد والعيون والأمالي: ابن المتوكل، عن علي، عن أبيه، عن الريان بن الصلت، عن علي بن موسى الرضا، عن آبائه، عن أمير المؤمنين عليهم السلام قال: قال رسول الله صلى الله عليه واله قال الله جل جلاله: ما آمن بي من فسر برأيه كلامي …",
                "englishText": "4. [4/-] al-Tawhid and al-Uyun and al-Amali: Ibn al-Mutawakkil from Ali from his father from al-Rayyan b. al-Salt from Ali b. Musa al-Ridha from his forefathers from the commander of the faithful عليهم السلام who said: the messenger of Allah صلى الله عليه واله said: Allah Majestic is His Majesty said: he has not believed in Me the one who interprets My words based on his opinion …",
                "href": "https://thaqalayn.net/hadith/9/2/12/4",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "12": {
                "hadithNumber": "Hadith #5",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Invalidation of Analogical Reasoning",
                "arabicText": "[-/5] الكافي: محمد بن يحيى، عن أحمد بن محمد، عن الوشاء، عن مثنى الحناط، عن أبي بصير قال: قلت لابي عبدالله عليه السلام: ترد علينا أشياء ليس نعرفها في كتاب الله ولا سنة فننظر فيها؟ فقال: لا، أما إنك إن أصبت لم تؤجر، وإن أخطأت كذبت على الله عز وجل",
                "englishText": "5. [5/-] al-Kafi: Muhammad b. Yahya from Ahmad b. Muhammad from al-Washsha from Muthanna al-Hannat from Abi Basir who said: I said to Abi Abdillah عليه السلام: things are referred to us which we do not know of in the Book of Allah nor the Sunna – should we exercise reason in them? He said: no, for even if you were to get it right you will not be rewarded for it, and if you were to err in it then you have lied upon Allah Mighty and Majestic.",
                "href": "https://thaqalayn.net/hadith/9/2/12/5",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "13": {
                "hadithNumber": "Hadith #1",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Primary Doubts",
                "arabicText": "[-/1] توحيد الصدوق: عن احمد بن محمد بن يحيى العطار، عن سعد بن عبدالله، عن يعقوب بن يزيد، عن حماد بن عيسى، عن حريز بن عبدالله، عن أبي عبد الله عليه السلام قال: قال رسول الله صلى الله عليه واله: رفع عن امتي تسعة: الخطاء، والنسيان، وما أكرهوا عليه، وما لا يطيقون، وما لا يعلمون، وما اضطروا إليه، والحسد، والطيرة، والتفكر في الوسوسة في الخلق ما لم ينطق بشفة",
                "englishText": "1. [1/-] Tawhid al-Saduq: From Ahmad b. Muhammad b. Yahya al-Attar from Sa’d b. Abdallah from Ya’qub b. Yazid from Hammad b. Isa from Hariz b. Abdallah from Abi Abdillah عليه السلام who said: the messenger of Allah صلى الله عليه واله said: my Umma are exempted from nine things: error, forgetfulness, what they are coerced to do, what they do not have the strength for, what they do not know, what they have to do out of necessity, jealousy, bad omen, and thinking about the whispered (Shaytan-inspired) prompts (doubts cast) in regards the creation – so long as it is not voiced aloud. ",
                "href": "https://thaqalayn.net/hadith/9/2/13/1",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "15": {
                "hadithNumber": "Hadith #10",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Legal Injunctions are Predicated on Pubescence",
                "arabicText": "[-/10] الكافي: علي بن إبراهيم، عن أبيه، عن ابن أبي عمير، عن منصور بن يونس، عن منصور بن حازم، عن أبي عبدالله عليه السلام قال: قال رسول الله صلى الله عليه وآله: لارضاع بعد فطام ولا وصال في صيام ولا يتم بعد احتلام ولا صمت يوما إلى الليل ولا تعرب بعد الهجرة ولا هجرة بعد الفتح ولا طلاق قبل نكاح ، ولا عتق قبل ملك ، ولا يمين للولد مع والده ولا للمملوك مع مولاه ولا للمرأة مع زوجها ولا نذر في معصية ولا يمين في قطيعة فمعنى قوله: لا رضاع بعد فطام ان الولد إذا شرب لبن المرأة بعد ما تفطمه لا يحرم ذلك الرضاع التناكح",
                "englishText": "10. [10/-] al-Kafi: Ali b. Ibrahim from his father from Ibn Abi Umayr from Mansur b. Yunus from Mansur b. Hazim from Abi Abdillah عليه السلام who said: the messenger of Allah صلى الله عليه وآله said: there is no suckling after weaning, there is no joining [two consecutive days] in fasting, there is no orphanhood after nocturnal emission, there is no vow of silence from morning to night, there is no return to the nomadic ways after migration [to the urban center of faith], there is no Hijra after the conquest [of Makka], there is no divorce before marriage, there is no setting free [of a slave] before ownership, there can be no oath from a child without the consent of his father, nor from a slave without the consent of his master, nor for a woman without the consent of her husband, there can be no promise to do an evil, nor an oath to break blood-ties. The meaning of his words: there is no suckling after weaning is that – a child if he drinks the milk of a woman after he has been weaned off milk [two years] then that suckling does not prevent marriage [she does not become his Mahram/foster mother]. ",
                "href": "https://thaqalayn.net/hadith/9/2/15/10",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "17": {
                "hadithNumber": "Hadith #1",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Ijtihad",
                "arabicText": "[-/1] الكافي: أحمد بن محمد العاصمي، عن علي بن الحسن الميثمي، عن علي بن أسباط، عن عمه يعقوب بن سالم، عن أبي عبدالله عليه السلام قال: كانت امرأة بالمدينة تؤتى فبلغ ذلك عمر فبعث إليها فروعها وأمر أن يجاء بها إليه ففزعت المرأة فأخذها الطلق فانطلقت إلى بعض الدور فولدت غلاما فاستهل الغلام ثم مات فدخل عليه من روعة المرأة ومن موت الغلام ما شاء الله فقال له بعض جلسائه: يا أميرالمؤمنين ما عليك من هذا شئ وقال بعضهم: وما هذا؟ قال: سلوا أبا الحسن فقال لهم أبوالحسن عليه السلام: لئن كنتم اجتهدتم ما أصبتم ولئن كنتم قلتم برأيكم لقد أخطأتم، ثم قال: عليك دية الصبي",
                "englishText": "1. [1/-] al-Kafi: Ahmad b. Muhammad al-Asimi from Ali b. al-Hasan al-Maythami from Ali b. Asbat from his paternal uncle Ya`qub b. Salim from Abi Abdillah عليه السلام who said: there was a woman in Madina who used to be approached by men [she was a prostitute], this news reached Umar so he sent for her and frightened her and ordered that she be brought to him, so the woman became terrified and started getting contractions, she fled to one of the houses and gave premature birth to a boy, the boy cried out loud and then died, so it entered in his (Umar’s) heart what Allah wished to enter because of his frightening of the woman and the death of the boy, some of his sitting companions said to him: O commander of the faithful you don’t have to do anything because of this, while others said: what is this? [belittling it – as if to say it is nothing], he said: ask Aba al-Hasan, so Abu al-Hasan عليه السلام said to them: if you have done Ijtihad then you have not got it right, and if you have said it based on your personal opinion then you have made a mistake, then he said: upon you is to give the blood-money of the child. ",
                "href": "https://thaqalayn.net/hadith/9/2/17/1",
                "gradings": {}
            }
        }
    },
    {
        "3": {
            "3": {
                "hadithNumber": "Hadith #1",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Ibrahim b. Abda",
                "arabicText": "[-/1] رجال الكشي: حكى بعض الثقات بنيسابور: أنه خرج لإسحاق بن إسماعيل من أبي محمد عليه السلام توقيع: يا إسحاق بن إسماعيل … و على إبراهيم بن عبدة سلام الله و رحمته … و كل من قرأ كتابنا هذا من موالي من أهل بلدك … فليؤد حقوقنا إلى إبراهيم بن عبدة، و ليحمل ذلك إبراهيم بن عبدة إلى الرازي رضي الله عنه، أو إلى من يسمى له الرازي، فإن ذلك عن أمري و رأيي إن شاء الله …",
                "englishText": "1. [1/-] Rijal al-Kashshi: One of the Thiqat in Naysabur relayed to us that: there came out a signed rescript from Abi Muhammad عليه السلام to Ishaq b. Ismail saying: O Ishaq b. Ismail … and upon Ibrahim b. Abda be peace from Allah and His mercy … and whoever reads this letter of ours from among our followers who are the denizens of your town … they should hand over our dues to Ibrahim b. Abda, and Ibrahim b. Abda should carry that to al-Razi may Allah be pleased with him, or to the one al-Razi names for him, for that is by my command and my choice – if Allah wills … ",
                "href": "https://thaqalayn.net/hadith/9/3/3/1",
                "gradings": {}
            }
        }
    },
    {
        "3": {
            "6": {
                "hadithNumber": "Hadith #1",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Usama b. Zayd",
                "arabicText": "[-/1] التهذيب: عن المفيد، عن أبي القاسم جعفر بن محمد، عن أبيه، عن سعد بن عبد الله، عن أحمد بن محمد بن عيسى، عن محمد بن إسماعيل بن بزيع، عن علي بن النعمان، عن أبي مريم الانصاري قال: سمعت أبا جعفر عليه السلام يقول: … إن الحسن بن علي عليهما السلام كفن اسامة بن زيد في برد حبرة …",
                "englishText": "1. [1/-] al-Tahdhib: From al-Mufid from Abi al-Qasim Ja`far b. Muhammad from his father from Sa`d b. Abdallah from Ahmad b. Muhammad b. Isa from Muhammad b. Ismail b. Bazi` from Ali b. al-Nu`man from Abi Maryam al-Ansari who said: I heard Aba Ja`far عليه السلام saying: … al-Hasan b. Ali عليهما السلام enshrouded Usama b. Zayd in a Hibara cloak … ",
                "href": "https://thaqalayn.net/hadith/9/3/6/1",
                "gradings": {}
            }
        }
    },
    {
        "3": {
            "18": {
                "hadithNumber": "Hadith #1",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Hasan al-Muthalath",
                "arabicText": "[-/1] رجال الكشي: حمدويه، عن محمد بن عيسى، عن يونس، عن ابن مسكان، عن سليمان بن خالد قال: لقيت الحسن بن الحسن فقال: أما لنا حق؟ أما لنا حرمة؟ إذ اخترتم منا رجلا واحدا كفاكم! فلم يكن له عندي جواب، فلقيت أبا عبد الله عليه السلام فأخبرته بما كان من قوله لي، فقال لي: القه فقل له: أتيناكم فقلنا هل عندكم ما ليس عند غيركم؟ فقلتم: لا، فصدقناكم و كنتم أهل ذلك، و آتينا بني عمكم فقلنا: هل عندكم ما ليس عند الناس؟ فقالوا: نعم، فصدقناهم و كانوا أهل ذلك، قال: فلقيته فقلت له ما قال لي، فقال لي الحسن: فإن عندنا ما ليس عند الناس، فلم يكن عندي شي‏ء، فأتيت أبا عبد الله عليه السلام فأخبرته، فقال لي القه و قل: إن الله عز وجل يقول في كتابه ائْتُونِي بِكِتابٍ مِنْ قَبْلِ هذا أَوْ أَثارَةٍ مِنْ عِلْمٍ إِنْ كُنْتُمْ صادِقِينَ، فاقعدوا لنا حتى نسألكم قال: فلقيته فحاججته بذلك، فقال لي: أفما عندكم شي‏ء ألا تعيبونا، إن كان فلان تفرغ و شغلنا فذاك الذي يذهب بحقنا",
                "englishText": "1. [1/-] Rijal al-Kashshi: Hamduwayh from Muhammad b. Isa from Yunus from Ibn Muskan from Sulayman b. Khalid who said: I met al-Hasan b. al-Hasan – he said: do we not have a right? do we not have a sanctity? if you were to select from among us [the Ahlulbayt as a whole] a single man he would have been sufficient for you [as an Imam]! I (Sulayman) did not have an answer for him, so I met Aba Abdillah عليه السلام and informed him of his words to me, he [the Imam] said to me: meet him and say to him – we came to you and said: do you have what the rest of the people do not have [do you have anything exclusive over the rest]? so you said: no, we considered you truthful [in your answer] and you became deserving of that [i.e. of nothing], then we came to the sons of your uncle [the descendants of al-Husayn] and said: do you have what the rest of the people do not have? so they said: yes, we considered them truthful and they became deserving of that [the Imama], he (Sulayman) said: so I met him and said to him what he (al-Sadiq) had said to me [to say to him], al-Hasan said to me: but we do have what the people do not have, I did not have anything [to reply to him], so I came to Abi Abdillah عليه السلام and reported to him [what had happened] – he said: meet him and say: Allah – the Mighty and Majestic – says in his book: “provide me with a book (scripture) before this one – or traces of knowledge – if you be truthful” (46:4), so sit down for us [become accessible to us] so that we can ask you [all the questions we have], he (Sulayman) said: I met him and argued against him using that – so he said to me: do you not have anything [to do] other than to humiliate us?!, if so and so [meaning Ja`far] chose to be free [unoccupied by Jihad – and devoted to scholarship] while we are engaged [in revolt – and therefore inept at scholarship] – then that is what takes away our right! ",
                "href": "https://thaqalayn.net/hadith/9/3/18/1",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "2": {
                "hadithNumber": "Hadith #2",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: God’s Timelesness and Spacelessness",
                "arabicText": "[-/2] علل الشرائع: الهمداني والمكتب والوراق جميعا، عن علي، عن أبيه، عن الفضل بن يونس قال: كان ابن أبي العوجاء من تلامذة الحسن البصري فانحرف عن التوحيد فقيل له: تركت مذهب صاحبك ودخلت فيما لا أصل له ولا حقيقة، قال: إن صاحبي كان مخلطا يقول طورا بالقدر وطورا بالجبر فما أعلمه اعتقد مذهبا دام عليه، فقدم مكة تمردا وإنكارا على من يحج، وكان يكره العلماء مجالسته ومساءلته لخبث لسانه وفساد ضميره، فأتى أبا عبد الله عليه السلام فجلس إليه في جماعة من نظرائه فقال: يا أبا عبد الله إن المجالس بالامانات، ولابد لكل من به سعال أن يسعل أفتأذن لي في الكلام؟ فقال الصادق عليه السلام: تكلم بما شئت ... فقال ابن أبي العوجاء: ذكرت الله فأحلت على غائب. فقال أبو عبد الله عليه السلام: ويلك كيف يكون غائبا من هو مع خلقه شاهد، وإليه أقرب من حبل الوريد، يسمع كلامهم ويرى أشخاصهم، ويعلم أسرارهم. فقال ابن أبي العوجاء: فهو في كل مكان أليس إذا كان في السماء كيف يكون في الارض؟ وإذا كان في الارض كيف يكون في السماء؟ فقال أبو عبد الله عليه السلام: إنما وصفت المخلوق الذي إذا انتقل من مكان اشتغل به مكان وخلا منه مكان، فلا يدري في المكان الذي صار إليه ما حدث في المكان الذي كان فيه، فأما الله العظيم الشأن الملك الديان فلا يخلو منه مكان ولا يشتغل به مكان ولا يكون إلى مكان أقرب منه إلى مكان",
                "englishText": "2. [2/-] Ilal al-Sharai: al-Hamdani, al-Mukatib and al-Warraq all together from Ali from his father from al-Fadhl b. Yunus who said: Ibn Abil Awja was among the students of al-Hasan al-Basri but then deviated from Tawhid. It was said to him: You have left the Madhhab of your fellow (Hasan al-Basri) and entered into that (belief) which has no authentic origin nor any reality. He said: My fellow was confused. Sometimes he would assert belief in free-will and sometimes predestination. I have not known him to hold on to a position and stick to it. He traveled to Makka and began showing arrogance and opposition to those making the pilgrimage. The scholars would dislike sitting and debating with him because of the vulgarity of his tongue and his corrupt heart (intentions). He came to Aba Abdillah عليه السلام and sat in his presence (circle) together with a number of his peers. He said: O Aba Abdillah, discussions are conducted with guarantee of protection (against persecution for what is said) and it is incumbent for every one who has a question to ask. Do you allow me to speak? Al-Sadiq عليه السلام said: Speak whatever you wish (freely) … Ibn Abil Awja said: You spoke of Allah and thus settled (put your hand) upon one who is Hidden. Abu Abdillah عليه السلام said: Woe be upon you! How can He be hidden one who is witnessed (evident) through His creatures, and is closer to him (his creature) than the jugular vein. He hears their speech, observes their forms and knows their secrets. Ibn Abil Awja said: That would mean He is everywhere. Is it not the case that if He were in heaven how can He also be on earth? And if He is on earth how can He be in heaven (at the same time)? Abu Abdillah عليه السلام said: You have described a created thing which if it departs from a place then one place is occupied by him and another place becomes empty of him, and he cannot know what is happening in the place he used to be in from the place he has moved to. As for Allah The Great in Stature, the King and Judge, then no space is empty of Him, nor does He occupy space, nor is He closer to one point with respect to another.                ",
                "href": "https://thaqalayn.net/hadith/9/4/2/2",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "4": {
                "hadithNumber": "Hadith #9",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Negation of Corporeality or Likeness for God",
                "arabicText": "[-/9] امالي الصدوق: محمد بن محمد بن عصام، عن الكليني، عن علان، عن محمد بن الفرج الرخجي قال: كتبت إلى أبي الحسن علي بن محمد عليهما السلام أسأله عما قال هشام بن الحكم في الجسم، وهشام بن سالم في الصورة. فكتب عليه السلام: دع عنك حيرة الحيران واستعذ بالله من الشيطان، ليس القول ما قال الهشامان ",
                "englishText": "9. [9/-] Amali of al-Saduq: Muhammad b. Muhammad b. Assam from al-Kulayni from Allan from Muhammad b. al-Faraj al-Rukhaji who said: I wrote to Abi al-Hasan Ali b. Muhammad عليهما السلام asking him about the position of Hisham b. al-Hakam regarding ‘the body’ and the position of Hisham b. Salim regarding ‘the human form’. He wrote: Leave the confusion of the confused, seek refuge in Allah from the Shaytan, the (true) position is not what was said by the two Hishams. ",
                "href": "https://thaqalayn.net/hadith/9/4/4/9",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "5": {
                "hadithNumber": "Hadith #9",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: God’s Knowledge and Power",
                "arabicText": "[-/9] بصائر الدرجات: عبد الله بن جعفر، عن محمد بن عيسى، عن ابن أبي عمير، عن ربعي، عن الفضيل، عن أبي عبد الله عليه السلام قال: إن لله علما يعلمه ملائكته وأنبياؤه ورسله ألا ونحن نعلمه، ولله علم لا يعلمه ملائكته وأنبياؤه ورسله",
                "englishText": "9. [9/-] Basair al-Darajat: Abdallah b. Ja’far from Muhammad b. Isa from Ibn Abi Umayr from Rib’i from al-Fudhayl from Abi Abdillah عليه السلام who said: Allah has a knowledge which is known by His angels, prophets and messengers. Behold! We too do know it. Allah also has a knowledge which His angels, prophets and messengers do not know about. ",
                "href": "https://thaqalayn.net/hadith/9/4/5/9",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "8": {
                "hadithNumber": "Hadith #8",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Prohibition against Speculating and Speaking about God’s Nature",
                "arabicText": "[-/8] الكافي: محمد بن يحيى، عن أحمد بن محمد، عن الحسين بن سعيد، عن النضر بن سويد عن عاصم بن حميد (رفعه) (قال:) قال: سئل علي بن الحسين عليه السلام عن التوحيد فقال: إن الله عزوجل علم أنه يكون في آخر الزمان أقوام متعمقون فأنزل الله تعالى قُلْ هُوَ اللَّهُ أَحَدٌ والآيات من سورة الحديد إلى قوله: وَهُوَ عَلِيمٌ بِذَاتِ الصُّدُورِ فمن رام وراء ذلك فقد هلك",
                "englishText": "8. [8/-] al-Kafi: Muhammad b. Yahya from Ahmad b. Muhammad from al-Husayn b. Sai’d from al-Nadhr b. Suwayd from A’sim b. Humayd who raised it - he said: Ali b. al-Husayn عليه السلام was asked about Tawhid (Unity of God) so he said: Allah Mighty and Majestic knew that there would in the last age peoples who delve deep (wanting to know) so Allah the Elevated brought down “Say: He is Allah One” (chapter 112) and the verses in Surat al-Hadid until His words “and He is Knowing of that within the hearts” (57:6) so whoever looks (desires) beyond that then he has perished.      ",
                "href": "https://thaqalayn.net/hadith/9/4/8/8",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "9": {
                "hadithNumber": "Hadith #4",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Innate Knowledge and the World of Particles",
                "arabicText": "[-/4] الكافي: على بن إبراهيم، عن أبيه، عن أحمد بن محمد بن أبي نصر، عن أبان بن عثمان، عن إسماعيل الجعفي، عن أبى جعفر عليه السلام قال: كانت شريعة نوح عليه السلام أن يعبد الله بالتوحيد والإخلاص وخلع الأنداد وهي الفطرة التي فطر الناس عليها ...",
                "englishText": "4. [4/-] al-Kafi: Ali b. Ibrahim from his father from Ahmad b. Muhammad b. Abi Nasr from Aban b. Uthman from Ismail al-Ju’fi from Abi Ja’far عليه السلام who said: The Sharia (Law-code) of Nuhعليه السلام  was that Allah be worshipped by Tawhid and Ikhlas (sincerity) and to shun the idols - and it is the Fitra which He created the people upon … ",
                "href": "https://thaqalayn.net/hadith/9/4/9/4",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "9": {
                "hadithNumber": "Hadith #9",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Innate Knowledge and the World of Particles",
                "arabicText": "[-/9] علل الشرائع: أبي، عن سعد، عن محمد بن عيسى، عن الحسن بن فضال، عن ابن بكير، عن زرارة قال: سألت أبا جعفر عليه السلام عن قول الله عزوجل: وَإِذْ أَخَذَ رَبُّكَ مِنْ بَنِي آدَمَ مِنْ ظُهُورِهِمْ ذُرِّيَّتَهُمْ وَأَشْهَدَهُمْ عَلَى أَنْفُسِهِمْ أَلَسْتُ بِرَبِّكُمْ قَالُوا بَلَى قال: ثبتت المعرفة ونسوا الوقت وسيذكرونه يوما، ولولا ذلك لم يدر أحد من خالقه ولا من رازقه",
                "englishText": "9. [9/-] Ilal al-Sharai: My father from Sa’d from Muhammad b. Isa from al-Hasan b. Fadhal from Ibn Bukayr from Zurara who said: I asked Aba Ja’far عليه السلام about the words of Allah Mighty and Majestic: “When your Lord took from the Children of Adam from their backs their descendants and made them bear witness against their own selves - am I not your Lord? They said: Indeed” (7:172). He said: The Ma’rifa (Recognition) was confirmed but they forgot the time (when this episode occurred) and they will come to remember it one day. If it were not for that no one would know who his Creator is nor who his Sustainer is.   ",
                "href": "https://thaqalayn.net/hadith/9/4/9/9",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "10": {
                "hadithNumber": "Hadith #2",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: God’s Limitlessness",
                "arabicText": "[-/2] الكافي: محمد بن اسماعيل، عن الفضل بن شاذان، عن حماد بن عيسى، عن ربعي ابن عبدالله، عن الفضيل بن يسار قال: سمعت أبا عبدالله عليه السلام يقول: إن الله لا يوصف، وكيف يوصف وقد قال في كتابه: وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ فلا يوصف بقدر إلا كان أعظم من ذلك",
                "englishText": "2. [2/-] al-Kafi: Muhammad b. Ismail from al-Fadhl b. Shadhan from Hammad b. Isa from Rib’i b. Abdallah from al-Fudhayl b. Yasar who said: I heard Aba Abdillah عليه السلام saying: Allah Mighty and Majestic cannot be described (as He truly is). And how can He be described when He says in His book: “they have not estimated Allah His true estimate” (39:67)? Thus He is not described with an estimate except that He is greater than that.  ",
                "href": "https://thaqalayn.net/hadith/9/4/10/2",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "11": {
                "hadithNumber": "Hadith #4",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: God’s Names",
                "arabicText": "[-/4] التوحيد: الهمداني، عن علي، عن أبيه، عن الهروي، عن علي بن موسى الرضا، عن أبيه، عن آبائه، عن علي عليهم السلام قال: قال رسول الله صلى الله عليه واله: إن لله عزوجل تسعة و تسعين اسما، من دعا الله بها استجاب له، ومن أحصاها دخل الجنة",
                "englishText": "4. [4/-] al-Tawhid: al-Hamdani from Ali from his father from al-Harawi from Ali b. Musa al-Ridha from his father from his forefathers from Ali عليهم السلام who said: The Messenger of Allahصلى الله عليه واله said: Allah Mighty and Majestic has ninety-nine names. Whoever asks Allah through them is answered. Whoever enumerates them enters paradise.",
                "href": "https://thaqalayn.net/hadith/9/4/11/4",
                "gradings": {}
            }
        }
    },
    {
        "5": {
            "4": {
                "hadithNumber": "Hadith #2",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: The Inviolables of Allah and the Reward of Reciting and Learning It",
                "arabicText": "[-/2] الكافي: عدة من أصحابنا، عن أحمد بن محمد وسهل بن زياد، جميعا، عن ابن محبوب عن جميل بن صالح، عن الفضيل بن يسار، عن أبي عبدالله عليه السلام قال: قال رسول الله صلى الله عليه وآله: تعلموا القرآن فإنه يأتي يوم القيامة صاحبه في صورة شاب جميل شاحب اللون فيقول له القرآن: أنا الذي كنت أسهرت ليلك وأظمأت هواجرك وأجففت ريقك وأسلت دمعتك أؤول معك حيثما الت وكل تاجر من وراء تجارته وأنا اليوم لك من وراء تجارة كل تاجر وسيأتيك كرامة [من] الله عزوجل فأبشر، فيؤتى بتاج فيوضع على رأسه ويعطى الامان بيمينه والخلد في الجنان بيساره ويكسى حلتين ثم يقال له: اقرء وارقه فكلما قرء آية صعد درجة ويكسى أبواه حلتين إن كانا مؤمنين ثم يقال لهما: هذا لما علمتماه القرآن",
                "englishText": "[2/-] al-Kafi: A number of our companions from Ahmad b. Muhammad and Sahl b. Ziyad all together from Ibn Mahbub from Jamil b. Salih from al-Fudhayl b. Yasar from Abi Abdillahعليه السلام who said: Learn the Qur’an, for it (i.e. the Qur’an) will come to its Companion (i.e. the one who learnt it) on the Day of Judgment in the form of a handsome youth, pale in colour - and will say to him: ‘I am the Qur’an who used to keep awake your nights, make thirsty your mid-days, dry up your saliva, and cause your tears to over-flow. I will turn with you wherever you turn (i.e. accompany you constantly), for every merchant is behind (after) his merchandise (i.e. seeking profit for and from it), and I will be for you today the way every merchant is behind (after) his merchandise. There will come to you an Honour from Allah Mighty and Majestic so receive glad-tidings’.  Then a crown will be brought and placed on his head (i.e. the Companion of the Qur’an), and he will be given the Writ of Security in his right hand, and the Writ to Eternity in the Gardens in his left hand, and he will be attired with two robes.  Then it will be said to him (i.e. the Companion of the Qur’an): ‘Recite and ascend!’, so every time he recites a verse he ascends a level.  And his two parents will also be attired with two robes if they are believers, then it will be said to them both: ‘This is because you (pl.) taught him the Qur’an’",
                "href": "https://thaqalayn.net/hadith/9/5/4/2",
                "gradings": {}
            }
        }
    },
    {
        "5": {
            "5": {
                "hadithNumber": "Hadith #4",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Reciting the Qur’an Everday and its Reward; The Status of the Umm al-Kitab ‘Mother of the Book’, Three Verses, Surat al-Tawhid; The Different Categories of Reciters; Reciting Verses By Night",
                "arabicText": "[-/4] الكافي: محمد بن يحيى، عن محمد بن الحسين، عن علي بن النعمان، عن يعقوب بن شعيب، عن حسين بن خالد، عن أبي عبدالله عليه السلام قال: قلت له: في كم أقرأ القرآن؟ فقال: اقرءه أخماسا، اقرءه، أسباعا، أما إن عندي مصحفا مجزى أربعة عشر حزءا",
                "englishText": "[4/-] al-Kafi: Muhammad b. Yahya from Muhammad b. al-Husayn from Ali b. al-Nu’man from Ya’qub b. Shuayb from Husayn b. Khalid from Abi Abdillah عليه السلام. He (Husayn) said: I said to him: In how many (days) should I recite the (whole) Qur’an? He (i.e. the Imam) said: Recite it in fifths, recite it in sevenths, as for me then I have a codex divided into fourteen parts",
                "href": "https://thaqalayn.net/hadith/9/5/5/4",
                "gradings": {}
            }
        }
    },
    {
        "5": {
            "9": {
                "hadithNumber": "Hadith #4",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Examples of the Qira’a of the Ahl al-Bayt",
                "arabicText": "[-/3] تفسير القمي: وحدثني ابي عن حماد عن حريز عن ابي عبدالله عليه السلام انه قرأ اهْدِنَا الصِّرَاطَ الْمُسْتَقِيم صِرَاطَ من أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَغير الضَّالِّينَ قال: المغضوب عليهم النصاب والضالين اليهود والنصارى",
                "englishText": "[3/-] Tafsir al-Qummi: My father from Hammad from Hariz from Abi Abdillah عليه السلام that he (i.e. the Imam) recited: “Ihdina l-Sirata l-Mustaqim Sirata Man An’amta Alayhim Ghayri l-Maghdhub Alayhim wa Ghayr al-Dhalin”. He (the Imam) said: The Maghdhub Alayhim (those angered upon) are the Nussab (i.e. haters of the Ahl al-Bayt) while the Dhalin (those astray) are the Jews and Christians",
                "href": "https://thaqalayn.net/hadith/9/5/9/4",
                "gradings": {}
            }
        }
    },
    {
        "5": {
            "9": {
                "hadithNumber": "Hadith #5",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: Examples of the Qira’a of the Ahl al-Bayt",
                "arabicText": "[-/4] تفسير القمي: وعنه عن ابن ابي عمير عن ابن اذينه عن ابي عبدالله عليه السلام في قوله غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَغير الضَّالِّينَ قال: المغضوب عليهم النصاب والضالين الشكاك الذين لا يعرفون الامام",
                "englishText": "[4/-] Tafsir al-Qummi: From him (i.e. Ibrahim b. Hashim) from Ibn Abi Umayr from Ibn Udhayna from Abi Abdillah عليه السلام concerning His words “Ghayri l-Maghdhub Alayhim wa Ghayr al-Dhalin”: The Maghdhub Alayhim (those angered upon) are the Nussab (i.e. haters of the Ahl al-Bayt) while the Dhalin (those astray) are the Shakkak (doubters) who do not know the Imam",
                "href": "https://thaqalayn.net/hadith/9/5/9/5",
                "gradings": {}
            }
        }
    },
    {
        "5": {
            "14": {
                "hadithNumber": "Hadith #1",
                "title": "Muʿjam al-Ahadith al-Muʿtabara: The Recitation of Certain Chapters at Certain Times",
                "arabicText": "[-/1] الخصال: في الحديث الأربعمائة عن علي عليه السلام: من قرأ «قُلْ هُوَ اللَّهُ أَحَدٌ» من قبل ان تطلع الشمس احد عشر مرة و مثلها «إِنَّا أَنْزَلْناهُ» و مثلها آية الكرسي، منع ماله مما يخاف و من قرأ «قُلْ هُوَ اللَّهُ أَحَدٌ» و «إِنَّا أَنْزَلْنا» قبل ان تطلع الشمس لم يصبه في ذلك اليوم ذنب",
                "englishText": "[1/-] al-Khisal: In the ‘Four Hundred’ report from Ali عليه السلام: The one who recites Qul Huwa l-Llāhu Aḥad eleven times before the sun rises, and similar to it is Inna Anzalnahu, and similar to it is Ayat al-Kursi - has protected his wealth from that which he fears. The one who recites Qul Huwa l-Llāhu Aḥad and Inna Anzalnahu before the sun rises - sin will not befall him on that day",
                "href": "https://thaqalayn.net/hadith/9/5/14/1",
                "gradings": {}
            }
        }
    }
]