[
    {
        "2": {
            "3": {
                "hadithNumber": "Hadith #4",
                "title": "Al-Kafi - Volume 1: Chapter on Kinds of People",
                "arabicText": " 4ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ جَمِيلٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ سَمِعْتُهُ يَقُولُ يَغْدُو النَّاسُ عَلَى ثَلاثَةِ أَصْنَافٍ عَالِمٍ وَمُتَعَلِّمٍ وَغُثَاءٍ فَنَحْنُ الْعُلَمَاءُ وَشِيعَتُنَا الْمُتَعَلِّمُونَ وَسَائِرُ النَّاسِ غُثَاءٌ.",
                "englishText": " 4. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from Jamil who has said the following. “I heard Imam abu ‘Abdallah  saying, ‘People become of three groups: Scholars, those who learn and garbled ones. We are the scholars. Our followers are the ones who learn. The rest of the people are garbled ones.’”",
                "href": "https://thaqalayn.net/hadith/1/2/3/4",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "4": {
                "hadithNumber": "Hadith #1",
                "title": "Al-Kafi - Volume 1: Chapter on the reward for the scholars and those who seek knowledge",
                "arabicText": " 1ـ مُحَمَّدُ بْنُ الْحَسَنِ وَعَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ وَمُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ الاشْعَرِيِّ عَنْ عَبْدِ الله بْنِ مَيْمُونٍ الْقَدَّاحِ وَعَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنِ الْقَدَّاحِ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) مَنْ سَلَكَ طَرِيقاً يَطْلُبُ فِيهِ عِلْماً سَلَكَ الله بِهِ طَرِيقاً إِلَى الْجَنَّةِ وَإِنَّ الْمَلائِكَةَ لَتَضَعُ أَجْنِحَتَهَا لِطَالِبِ الْعِلْمِ رِضًا بِهِ وَإِنَّهُ يَسْتَغْفِرُ لِطَالِبِ الْعِلْمِ مَنْ فِي السَّمَاءِ وَمَنْ فِي الارْضِ حَتَّى الْحُوتِ فِي الْبَحْرِ وَفَضْلُ الْعَالِمِ عَلَى الْعَابِدِ كَفَضْلِ الْقَمَرِ عَلَى سَائِرِ النُّجُومِ لَيْلَةَ الْبَدْرِ وَإِنَّ الْعُلَمَاءَ وَرَثَةُ الانْبِيَاءِ إِنَّ الانْبِيَاءَ لَمْ يُوَرِّثُوا دِينَاراً وَلا دِرْهَماً وَلَكِنْ وَرَّثُوا الْعِلْمَ فَمَنْ أَخَذَ مِنْهُ أَخَذَ بِحَظٍّ وَافِرٍ.",
                "englishText": " 1. Muhammad ibn al-Hassan and Ali ibn Muhammad has narrated from Sahl ibn Ziyad and Muhammad ibn Yahya from Ahmad ibn Muhammad, all from Ja’far ibn Muhammad al-Ash’ari from ’Abdullah ibn Maymun al-Qaddah and Ali ibn Ibrahim from his father from Hammad ibn ‘Isa from al-Qaddah from abu ‘Abdallah  who has said the following. “The holy Prophet has said, ‘If one sets out on a journey to seek knowledge Allah will lead him to the way that would take him to paradise. The angels will stretch their wings for the pleasure of the seeker of knowledge and all that is in the heavens and earth even the whales in the oceans will ask forgiveness for him (from Allah). The excellence of the scholar over other people is like that of the moon over other stars during a full-moon night. The scholars are the heirs of the prophets. The prophets did not leave any Dirham or Dinar (wealth) as their legacy but they did leave knowledge as their legacy. Whoever acquires a share from such legacy has gained a very large share.’”",
                "href": "https://thaqalayn.net/hadith/1/2/4/1",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "9": {
                "hadithNumber": "Hadith #3",
                "title": "Al-Kafi - Volume 1: Chapter on Asking the Scholar and Discussing with him",
                "arabicText": "3ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ الاشْعَرِيِّ عَنْ عَبْدِ الله بْنِ مَيْمُونٍ الْقَدَّاحِ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ قَالَ إِنَّ هَذَا الْعِلْمَ عَلَيْهِ قُفْلٌ وَمِفْتَاحُهُ الْمَسْأَلَةُ.  عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) مِثْلَهُ.",
                "englishText": " 3. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Ja’far ibn Muhammad al-Ash‘ari from ’Abdallah ibn Maymun al-Qaddah from abu ‘Abdallah  who has said the following. “This knowledge (the knowledge of the holy Prophet and Ahlul Bayt) is under a lock and the key to it is asking” Ali ibn Ibrahim, from his father from al-Nawfali, from al-Sakuni from Imam abu ‘Abdallah has narrated the same Hadith.",
                "href": "https://thaqalayn.net/hadith/1/2/9/3",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "19": {
                "hadithNumber": "Hadith #22",
                "title": "Al-Kafi - Volume 1: Chapter on Innovations, Personal Opinions and Analogies",
                "arabicText": " 22ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ مُرْسَلاً قَالَ قَالَ أَبُو جَعْفَرٍ (عَلَيْهِ السَّلام) لا تَتَّخِذُوا مِنْ دُونِ الله وَلِيجَةً فَلا تَكُونُوا مُؤْمِنِينَ فَإِنَّ كُلَّ سَبَبٍ وَنَسَبٍ وَقَرَابَةٍ وَوَلِيجَةٍ وَبِدْعَةٍ وَشُبْهَةٍ مُنْقَطِعٌ إِلا مَا أَثْبَتَهُ الْقُرْآنُ.",
                "englishText": " 22. A number of our people has narrated from Ahmad ibn Muhammad ibn Khalid from his father in mursal manner (Mursalan) from abu Ja‘far  who has said the following. “Do not take anyone closely and intimately between your selves and Allah lest you will not be believers. Every means, ancestral and relative relations and intimacy, innovations and doubts will be cut off except for what is established in the holy Quran.”",
                "href": "https://thaqalayn.net/hadith/1/2/19/22",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "20": {
                "hadithNumber": "Hadith #10",
                "title": "Al-Kafi - Volume 1: Chapter on the need to refer to the book and Sunnah",
                "arabicText": " 10ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ أَبِي الْمَغْرَاءِ عَنْ سَمَاعَةَ عَنْ أَبِي الْحَسَنِ مُوسَى (عَلَيْهِ السَّلام) قَالَ قُلْتُ لَهُ أَ كُلُّ شَيْ‏ءٍ فِي كِتَابِ الله وَسُنَّةِ نَبِيِّهِ (صَلَّى اللهُ عَلَيْهِ وَآلِه) أَوْ تَقُولُونَ فِيهِ قَالَ بَلْ كُلُّ شَيْ‏ءٍ فِي كِتَابِ الله وَسُنَّةِ نَبِيِّهِ (صَلَّى اللهُ عَلَيْهِ وَآلِه )",
                "englishText": " 10. A number of our people has narrated from Ahmad ibn Muhammad ibn Khalid from ‘Isma’il ibn Mihran from Sayf ibn ‘Umayra from abu al-Maghra from Sama‘a from abu al-Hassan Musa  who has said the following. “I asked the Imam, ‘Is everything in the book of Allah and the Sunnah of His messenger or you have a say in it?’ The Imam replied, “As a matter of fact, everything is in the book of Allah and the Sunnah of His messenger (s.a.)’”",
                "href": "https://thaqalayn.net/hadith/1/2/20/10",
                "gradings": {}
            }
        }
    },
    {
        "2": {
            "21": {
                "hadithNumber": "Hadith #4",
                "title": "Al-Kafi - Volume 1: Chapter on the Differences in al-Hadith",
                "arabicText": " 4ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ أَبِي عُبَيْدَةَ عَنْ ابي جعفر (عَلَيْهِ السَّلام) قَالَ قَالَ لِي يَا زِيَادُ مَا تَقُولُ لَوْ أَفْتَيْنَا رَجُلاً مِمَّنْ يَتَوَلانَا بِشَيْ‏ءٍ مِنَ التَّقِيَّةِ قَالَ قُلْتُ لَهُ أَنْتَ أَعْلَمُ جُعِلْتُ فِدَاكَ قَالَ إِنْ أَخَذَ بِهِ فَهُوَ خَيْرٌ لَهُ وَأَعْظَمُ أَجْراً وَفِي رِوَايَةٍ أُخْرَى إِنْ أَخَذَ بِهِ أُوجِرَ وَإِنْ تَرَكَهُ وَالله أَثِمَ.",
                "englishText": " 4. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from ibn Mahbub from Ali ibn Ri’ab from abu ‘Ubayda who has said the following. “Abu Ja‘far  has said, ‘O Ziyad, What would you say if we give a Fatwa to one of our followers under pressure (and concealed the truth)?” I said, “You know better, may Allah take my soul in your service.’” The Imam said, “If would follow such Fatwa it would be better for him and of a greater rewarding.” In another Hadith it says, “If follows it, he will be rewarded and if he disregarded it he has sinned.”",
                "href": "https://thaqalayn.net/hadith/1/2/21/4",
                "gradings": {}
            }
        }
    },
    {
        "3": {
            "1": {
                "hadithNumber": "Hadith #3",
                "title": "Al-Kafi - Volume 1: Chapter on Contingency of the Universe and Proof of the Existence of its Creator",
                "arabicText": " 3ـ حَدَّثَنِي مُحَمَّدُ بْنُ جَعْفَرٍ الاسَدِيُّ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ الْبَرْمَكِيِّ الرَّازِيِّ عَنِ الْحُسَيْنِ بْنِ الْحَسَنِ بْنِ بُرْدٍ الدِّينَوَرِيِّ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الله الْخُرَاسَانِيِّ خَادِمِ الرِّضَا (عَلَيْهِ السَّلام) قَالَ دَخَلَ رَجُلٌ مِنَ الزَّنَادِقَةِ عَلَى أَبِي الْحَسَنِ (عَلَيْهِ السَّلام) وَعِنْدَهُ جَمَاعَةٌ فَقَالَ أَبُو الْحَسَنِ (عَلَيْهِ السَّلام) أَيُّهَا الرَّجُلُ أَ رَأَيْتَ إِنْ كَانَ الْقَوْلُ قَوْلَكُمْ وَلَيْسَ هُوَ كَمَا تَقُولُونَ أَ لَسْنَا وَإِيَّاكُمْ شَرَعاً سَوَاءً لا يَضُرُّنَا مَا صَلَّيْنَا وَصُمْنَا وَزَكَّيْنَا وَأَقْرَرْنَا فَسَكَتَ الرَّجُلُ ثُمَّ قَالَ أَبُو الْحَسَنِ (عَلَيْهِ السَّلام) وَإِنْ كَانَ الْقَوْلُ قَوْلَنَا وَهُوَ قَوْلُنَا أَ لَسْتُمْ قَدْ هَلَكْتُمْ وَنَجَوْنَا فَقَالَ رَحِمَكَ الله أَوْجِدْنِي كَيْفَ هُوَ وَأَيْنَ هُوَ فَقَالَ وَيْلَكَ إِنَّ الَّذِي ذَهَبْتَ إِلَيْهِ غَلَطٌ هُوَ أَيَّنَ الايْنَ بِلا أَيْنٍ وَكَيَّفَ الْكَيْفَ بِلا كَيْفٍ فَلا يُعْرَفُ بِالْكَيْفُوفِيَّةِ وَلا بِأَيْنُونِيَّةٍ وَلا يُدْرَكُ بِحَاسَّةٍ وَلا يُقَاسُ بِشَيْ‏ءٍ فَقَالَ الرَّجُلُ فَإِذاً إِنَّهُ لا شَيْ‏ءَ إِذَا لَمْ يُدْرَكْ بِحَاسَّةٍ مِنَ الْحَوَاسِّ فَقَالَ أَبُو الْحَسَنِ (عَلَيْهِ السَّلام) وَيْلَكَ لَمَّا عَجَزَتْ حَوَاسُّكَ عَنْ إِدْرَاكِهِ أَنْكَرْتَ رُبُوبِيَّتَهُ وَنَحْنُ إِذَا عَجَزَتْ حَوَاسُّنَا عَنْ إِدْرَاكِهِ أَيْقَنَّا أَنَّهُ رَبُّنَا بِخِلافِ شَيْ‏ءٍ مِنَ الاشْيَاءِ قَالَ الرَّجُلُ فَأَخْبِرْنِي مَتَى كَانَ قَالَ أَبُو الْحَسَنِ (عَلَيْهِ السَّلام) أَخْبِرْنِي مَتَى لَمْ يَكُنْ فَأُخْبِرَكَ مَتَى كَانَ قَالَ الرَّجُلُ فَمَا الدَّلِيلُ عَلَيْهِ فَقَالَ أَبُو الْحَسَنِ (عَلَيْهِ السَّلام) إِنِّي لَمَّا نَظَرْتُ إِلَى جَسَدِي وَلَمْ يُمْكِنِّي فِيهِ زِيَادَةٌ وَلا نُقْصَانٌ فِي الْعَرْضِ وَالطُّولِ وَدَفْعِ الْمَكَارِهِ عَنْهُ وَجَرِّ الْمَنْفَعَةِ إِلَيْهِ عَلِمْتُ أَنَّ لِهَذَا الْبُنْيَانِ بَانِياً فَأَقْرَرْتُ بِهِ مَعَ مَا أَرَى مِنْ دَوَرَانِ الْفَلَكِ بِقُدْرَتِهِ وَإِنْشَاءِ السَّحَابِ وَتَصْرِيفِ الرِّيَاحَ وَمَجْرَى الشَّمْسِ وَالْقَمَرِ وَالنُّجُومِ وَغَيْرِ ذَلِكَ مِنَ الايَاتِ الْعَجِيبَاتِ الْمُبَيِّنَاتِ عَلِمْتُ أَنَّ لِهَذَا مُقَدِّراً وَمُنْشِئاً.",
                "englishText": " 3. Muhammad ibn Ja‘far al-Asadi has narrated from Muhammad ibn Esma‘il al-Barmaki al-Razi from al-Husayn ibn al-Hassan ibn Bard al-Daynuri from Muhammad ibn Ali from Muhammad ibn ‘Abdallah al-Khurasani the an employee of Imam al-Rida  who has said the following. “An atheist man came to Imam abu al-Hassan  while group of people was present there. The Imam  said to him, “Consider, if what you say would be true which is not true, in such case, we all will be equal. Our fasting, prayers, giving charity and belief will not harm us.” The man remained quite. The Imam then said, “If what we say would be true, which, in fact, is true then you will be the one facing your destruction and we will be saved.” The man then said, “Please help me learn where is He and how is He?” The Imam then said, “What is the matter with you? What you say is not right. He is the ‘where’ of ‘where’ but without ‘where’. He is the ‘how’ of ‘how’ without ‘how’. He can not be defined with ‘how’ and ‘where’ and can not be comprehended with the senses or compared with anything.” The man then asked, “Tell me then when was He?” The Imam replied, “You tell me, when He was not there so that I would tell when He was there?” The man then asked, “What is the proof for His existence?” The Imam said, “When I look at my body I find that I can not do any addition or alteration to it such as width and breadth or remove its sufferings and attract all its interests. I then come to understand that for this establishment there must be a founder and then I acknowledge His existence. Besides, I see all the orbiting planets and stars, the creation of the clouds and driving of the winds, the paths of the sun, the moon, the stars and other things of the marvelous clear signs I come to believe that there is One who has designed and created all such wonderful things”",
                "href": "https://thaqalayn.net/hadith/1/3/1/3",
                "gradings": {}
            }
        }
    },
    {
        "3": {
            "2": {
                "hadithNumber": "Hadith #6",
                "title": "Al-Kafi - Volume 1: Chapter on Can Allah (God) be Considered a Thing?",
                "arabicText": " 6ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْعَبَّاسِ بْنِ عَمْرٍو الْفُقَيْمِيِّ عَنْ هِشَامِ بْنِ الْحَكَمِ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) أَنَّهُ قَالَ لِلزِّنْدِيقِ حِينَ سَأَلَهُ مَا هُوَ قَالَ هُوَ شَيْ‏ءٌ بِخِلافِ الاشْيَاءِ ارْجِعْ بِقَوْلِي إِلَى إِثْبَاتِ مَعْنًى وَأَنَّهُ شَيْ‏ءٌ بِحَقِيقَةِ الشَّيْئِيَّةِ غَيْرَ أَنَّهُ لا جِسْمٌ وَلا صُورَةٌ وَلا يُحَسُّ وَلا يُجَسُّ وَلا يُدْرَكُ بِالْحَوَاسِّ الْخَمْسِ لا تُدْرِكُهُ الاوْهَامُ وَلا تَنْقُصُهُ الدُّهُورُ وَلا تُغَيِّرُهُ الازْمَانُ فَقَالَ لَهُ السَّائِلُ فَتَقُولُ إِنَّهُ سَمِيعٌ بَصِيرٌ قَالَ هُوَ سَمِيعٌ بَصِيرٌ سَمِيعٌ بِغَيْرِ جَارِحَةٍ وَبَصِيرٌ بِغَيْرِ آلَةٍ بَلْ يَسْمَعُ بِنَفْسِهِ وَيُبْصِرُ بِنَفْسِهِ لَيْسَ قَوْلِي إِنَّهُ سَمِيعٌ يَسْمَعُ بِنَفْسِهِ وَبَصِيرٌ يُبْصِرُ بِنَفْسِهِ أَنَّهُ شَيْ‏ءٌ وَالنَّفْسُ شَيْ‏ءٌ آخَرُ وَلَكِنْ أَرَدْتُ عِبَارَةً عَنْ نَفْسِي إِذْ كُنْتُ مَسْئُولاً وَإِفْهَاماً لَكَ إِذْ كُنْتَ سَائِلاً فَأَقُولُ إِنَّهُ سَمِيعٌ بِكُلِّهِ لا أَنَّ الْكُلَّ مِنْهُ لَهُ بَعْضٌ وَلَكِنِّي أَرَدْتُ إِفْهَامَكَ وَالتَّعْبِيرُ عَنْ نَفْسِي وَلَيْسَ مَرْجِعِي فِي ذَلِكَ إِلا إِلَى أَنَّهُ السَّمِيعُ الْبَصِيرُ الْعَالِمُ الْخَبِيرُ بِلا اخْتِلافِ الذَّاتِ وَلا اخْتِلافِ الْمَعْنَى قَالَ لَهُ السَّائِلُ فَمَا هُوَ قَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) هُوَ الرَّبُّ وَهُوَ الْمَعْبُودُ وَهُوَ الله وَلَيْسَ قَوْلِي الله إِثْبَاتَ هَذِهِ الْحُرُوفِ أَلِفٍ وَلامٍ وَهَاءٍ وَلا رَاءٍ وَلا بَاءٍ وَلَكِنِ ارْجِعْ إِلَى مَعْنًى وَشَيْ‏ءٍ خَالِقِ الاشْيَاءِ وَصَانِعِهَا وَنَعْتِ هَذِهِ الْحُرُوفِ وَهُوَ الْمَعْنَى سُمِّيَ بِهِ الله وَالرَّحْمَنُ وَالرَّحِيمُ وَالْعَزِيزُ وَأَشْبَاهُ ذَلِكَ مِنْ أَسْمَائِهِ وَهُوَ الْمَعْبُودُ جَلَّ وَعَزَّ قَالَ لَهُ السَّائِلُ فَإِنَّا لَمْ نَجِدْ مَوْهُوماً إِلا مَخْلُوقاً قَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) لَوْ كَانَ ذَلِكَ كَمَا تَقُولُ لَكَانَ التَّوْحِيدُ عَنَّا مُرْتَفِعاً لانَّا لَمْ نُكَلَّفْ غَيْرَ مَوْهُومٍ وَلَكِنَّا نَقُولُ كُلُّ مَوْهُومٍ بِالْحَوَاسِّ مُدْرَكٍ بِهِ تَحُدُّهُ الْحَوَاسُّ وَتُمَثِّلُهُ فَهُوَ مَخْلُوقٌ إِذْ كَانَ النَّفْيُ هُوَ الابْطَالَ وَالْعَدَمَ وَالْجِهَةُ الثَّانِيَةُ التَّشْبِيهُ إِذْ كَانَ التَّشْبِيهُ هُوَ صِفَةَ الْمَخْلُوقِ الظَّاهِرِ التَّرْكِيبِ وَالتَّأْلِيفِ فَلَمْ يَكُنْ بُدٌّ مِنْ إِثْبَاتِ الصَّانِعِ لِوُجُودِ الْمَصْنُوعِينَ وَالاضْطِرَارِ إِلَيْهِمْ أَنَّهُمْ مَصْنُوعُونَ وَأَنَّ صَانِعَهُمْ غَيْرُهُمْ وَلَيْسَ مِثْلَهُمْ إِذْ كَانَ مِثْلُهُمْ شَبِيهاً بِهِمْ فِي ظَاهِرِ التَّرْكِيبِ وَالتَّأْلِيفِ وَفِيمَا يَجْرِي عَلَيْهِمْ مِنْ حُدُوثِهِمْ بَعْدَ إِذْ لَمْ يَكُونُوا وَتَنَقُّلِهِمْ مِنَ صِغَرٍ إِلَى كِبَرٍ وَسَوَادٍ إِلَى بَيَاضٍ وَقُوَّةٍ إِلَى ضَعْفٍ وَأَحْوَالٍ مَوْجُودَةٍ لا حَاجَةَ بِنَا إِلَى تَفْسِيرِهَا لِبَيَانِهَا وَوُجُودِهَا قَالَ لَهُ السَّائِلُ فَقَدْ حَدَدْتَهُ إِذْ أَثْبَتَّ وُجُودَهُ قَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) لَمْ أَحُدَّهُ وَلَكِنِّي أَثْبَتُّهُ إِذْ لَمْ يَكُنْ بَيْنَ النَّفْيِ وَالاثْبَاتِ مَنْزِلَةٌ قَالَ لَهُ السَّائِلُ فَلَهُ إِنِّيَّةٌ وَمَائِيَّةٌ قَالَ نَعَمْ لا يُثْبَتُ الشَّيْ‏ءُ إِلا بِإِنِّيَّةٍ وَمَائِيَّةٍ قَالَ لَهُ السَّائِلُ فَلَهُ كَيْفِيَّةٌ قَالَ لا لانَّ الْكَيْفِيَّةَ جِهَةُ الصِّفَةِ وَالاحَاطَةِ وَلَكِنْ لا بُدَّ مِنَ الْخُرُوجِ مِنْ جِهَةِ التَّعْطِيلِ وَالتَّشْبِيهِ لانَّ مَنْ نَفَاهُ فَقَدْ أَنْكَرَهُ وَدَفَعَ رُبُوبِيَّتَهُ وَأَبْطَلَهُ وَمَنْ شَبَّهَهُ بِغَيْرِهِ فَقَدْ أَثْبَتَهُ بِصِفَةِ الْمَخْلُوقِينَ الْمَصْنُوعِينَ الَّذِينَ لا يَسْتَحِقُّونَ الرُّبُوبِيَّةَ وَلَكِنْ لا بُدَّ مِنْ إِثْبَاتِ أَنَّ لَهُ كَيْفِيَّةً لا يَسْتَحِقُّهَا غَيْرُهُ وَلا يُشَارِكُ فِيهَا وَلا يُحَاطُ بِهَا وَلا يَعْلَمُهَا غَيْرُهُ قَالَ السَّائِلُ فَيُعَانِي الاشْيَاءَ بِنَفْسِهِ قَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) هُوَ أَجَلُّ مِنْ أَنْ يُعَانِيَ الاشْيَاءَ بِمُبَاشَرَةٍ وَمُعَالَجَةٍ لانَّ ذَلِكَ صِفَةُ الْمَخْلُوقِ الَّذِي لا تَجِي‏ءُ الاشْيَاءُ لَهُ إِلا بِالْمُبَاشَرَةِ وَالْمُعَالَجَةِ وَهُوَ مُتَعَالٍ نَافِذُ الارَادَةِ وَالْمَشِيئَةِ فَعَّالٌ لِمَا يَشَاءُ.",
                "englishText": " 6. It is narrated from Imam abu “Abdallah , who said this to an atheist on being asked a question. “He (Allah) is a thing but different from all other things. I repeat my statement that speaks about Him as a thing. He is a thing in the sense of the reality of things except that He does not have a body and form. He does not have a feeling (like our sense of feeling) or touching and He does not comprehend with the five senses (as we do). Imaginations can not comprehend Him and the timeless (Dahr) times does not reduce Him and the times do not change Him.” The man asking questions then said, “Do you say that He hears and sees?” The Imam said, “He does hear and see: He hears without a hearing organ and sees without a means. He Himself hears and He Himself sees. My saying “He hears without a hearing organ and sees without a means. He Himself hears and He Himself sees” does not mean that He is a thing and His-self is another thing but that I only meant to express my self thereby as I was questioned and explained to you as you had asked a question. Thus, I can say that He hears with the whole of His-self but not in the sense that His whole self has parts but that I intended to explain it to you and to express my self. All I meant thereby is that He does hear, see and He is all-knowing and is the expert in knowing without any multiplicity in His-self or meaning. The man asking questions then said, “What then is He?” The Imam said, “He is the Lord. He is the One Who is worshipped and He is Allah. When I say Allah, it does not mean establishing the proof for these letters (of alphabet) like Alif, Lam, Ha’, al-Ra’ or al-Ba’ but I intend thereby the meaning of a thing and a thing that is the Creator of all things and the Designer of all things. These letters only refer to the meaning that is called Allah, al-Rahman (the Beneficent), al-Rahim (the Merciful), al-‘Aziz (the Majestic) etc., of the other such names and He is the One Who is worshipped, the Majestic, the Glorious One.” The man asking questions then said, “Given the above, whatever we can think of is but a creature.” The Imam then said, “Were it to the way you said we would not have had any responsibility to believe in the Oneness of the Creator because we will not have any responsibility towards something of whose existence we can not even think of. In fact we say that whatever is thought of in our senses is comprehended thereby by means of drawing limits around it and is analogized, thus, such a thing is a creature. (It then becomes necessary for us to find proof for the existence of the Creator of things.(We must find that is) clear of the two invalid and confusing aspects) if the meaning of negation would be nullification and nothingness or as is the case of the second aspect, the similarity and analogy which is of the attributes of the creatures that under go manifest composition and assemblage. It becomes necessary to prove the existence of the Creator. It is because of the existence of the creatures and their evident dependency on Him as His creatures and that their Creator is something other than them and that He is not similar to them because something similar to them would resemble them in manifest composition and assemblage. It would be as such also in the matters such as coming into existence from nothing and their changing from a smaller size to a full grown size, from blackness to whiteness from strength to weakness and other existing conditions that we do not need to explain their existence.” The man asking questions then said, “You have already defined and limited Him in your proving His existence.” The Imam  then said, “I did not limit Him. I only proved His existence if (as you think) there is no difference between proving and disproving.” The man asking questions then said, “Can His existence be proved through a reasoning from the effect to the cause or the cause to the effect?” The Imam said, “Yes, there is nothing whose existence can be proved without adopting either of the two above process of reasoning.” The man then asked, “Does the question how apply to Him?” The Imam said, “No, this question does not apply to Him because it is the aspect of qualities and limitations. However, it is necessary to avoid abandoning and analogizing Him because negating Him is denying His existence and refusing to accept Him as the Lord and abandoning Him altogether. Whoever would analogize Him with other things from His creatures he has proved the qualities of the creature in Him, the creatures that do not deserve being called the Lord. It, however, is necessary to believe that the question how applies to Him only in a way that would not apply to things other than Him and things other than Him would not deserve and share Him in it. The how question can not apply to Him if it would limit Him or make Him the subject of knowing for others.” The man then asked, “Do things make Him tired?” The Imam then said, “He is far Exalted and above experiencing such conditions. Such conditions are due to coming into physical association or dealing with the creatures. They are of the qualities of the creatures who can only associate with others through physical contact but He is the Most High and His will and demand are effective and He does whatever He wants.”",
                "href": "https://thaqalayn.net/hadith/1/3/2/6",
                "gradings": {}
            }
        }
    },
    {
        "3": {
            "5": {
                "hadithNumber": "Hadith #3",
                "title": "Al-Kafi - Volume 1: Chapter on Who is Worshipped",
                "arabicText": " 3ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنِ الْعَبَّاسِ بْنِ مَعْرُوفٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي نَجْرَانَ قَالَ كَتَبْتُ إِلَى ابي جعفر (عَلَيْهِ السَّلام) أَوْ قُلْتُ لَهُ جَعَلَنِي الله فِدَاكَ نَعْبُدُ الرَّحْمَنَ الرَّحِيمَ الْوَاحِدَ الاحَدَ الصَّمَدَ قَالَ فَقَالَ إِنَّ مَنْ عَبَدَ الاسْمَ دُونَ الْمُسَمَّى بِالاسْمَاءِ أَشْرَكَ وَكَفَرَ وَجَحَدَ وَلَمْ يَعْبُدْ شَيْئاً بَلِ اعْبُدِ الله الْوَاحِدَ الاحَدَ الصَّمَدَ الْمُسَمَّى بِهَذِهِ الاسْمَاءِ دُونَ الاسْمَاءِ إِنَّ الاسْمَاءَ صِفَاتٌ وَصَفَ بِهَا نَفْسَهُ.",
                "englishText": " 3. Ali ibn Ibrahim has narrated from ‘Abbass al-Ma‘ruf from ‘Abd al-Rahman ibn abu Najran who has the following. I wrote or said to Imam abu Ja‘far ’Abdallah , “May Allah take my soul in your service. Do we worship the Beneficent, the Merciful, the One who is One only and Self-sufficient?” The Imam then said, “Whoever worships the names without the meaning for which they stand he has become a polytheist and has denied the existence of Allah and has worshipped nothing. You must worship Allah who is the One and only One, the Self-sufficient, Who is the meaning for these names but not these names. The names are attributes that He has said are of His attributes.”",
                "href": "https://thaqalayn.net/hadith/1/3/5/3",
                "gradings": {}
            }
        }
    },
    {
        "3": {
            "7": {
                "hadithNumber": "Hadith #4",
                "title": "Al-Kafi - Volume 1: Chapter On The relationships (Nisbah) Of Allah",
                "arabicText": " 4ـ مُحَمَّدُ بْنُ أَبِي عَبْدِ الله رَفَعَهُ عَنْ عَبْدِ الْعَزِيزِ بْنِ الْمُهْتَدِي قَالَ سَأَلْتُ الرِّضَا (عَلَيْهِ السَّلام) عَنِ التَّوْحِيدِ فَقَالَ كُلُّ مَنْ قَرَأَ قُلْ هُوَ الله أَحَدٌ وَآمَنَ بِهَا فَقَدْ عَرَفَ التَّوْحِيدَ قُلْتُ كَيْفَ يَقْرَأُهَا قَالَ كَمَا يَقْرَأُهَا النَّاسُ وَزَادَ فِيهِ كَذَلِكَ الله رَبِّي كَذَلِكَ الله رَبِّي.",
                "englishText": " 4. Muhammad ibn abu ‘Abdallah in a marfu‘ manner has narrated from ’Abd al-‘Aziz ibn al-Muhtadi who has said the following. “I asked Imam Ali al-Rida  about the Oneness of Allah.” He replied, “Whoever recites Chapter 112 of the holy Quran: In the Name of Allah, the Beneficent, the Merciful (Muhammad), say, “He is the only God (112:1). God is Absolute (112:2). He neither begets nor was He begotten (112:3). There is no one equal to Him (112:4). and also believes in it, he has really acknowledged the Oneness of Allah.” I asked, “How should I recite it (the chapter 112)?” The Imam replied, “Recite it as the people do.” And then the Imam added, “Such is Allah, my Lord. Such is Allah, my Lord.”",
                "href": "https://thaqalayn.net/hadith/1/3/7/4",
                "gradings": {}
            }
        }
    },
    {
        "3": {
            "8": {
                "hadithNumber": "Hadith #3",
                "title": "Al-Kafi - Volume 1: Chapter On Prohibition on Saying How is Allah (al-Kayfiyyah)",
                "arabicText": " 3ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي أَيُّوبَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) يَا مُحَمَّدُ إِنَّ النَّاسَ لا يَزَالُ بِهِمُ الْمَنْطِقُ حَتَّى يَتَكَلَّمُوا فِي الله فَإِذَا سَمِعْتُمْ ذَلِكَ فَقُولُوا لا إِلَهَ إِلا الله الْوَاحِدُ الَّذِي لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ.",
                "englishText": " 3. Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from abu Ayyub from Muhammad ibn Muslim from Imam abu ‘Abdallah  who has said the following. “O Muhammad, people rationalize everything. They even speak about Allah’s self. When you hear such discources, say to them ‘There is no god but Allah, the One and no one is similar to Him.’”",
                "href": "https://thaqalayn.net/hadith/1/3/8/3",
                "gradings": {}
            }
        }
    },
    {
        "3": {
            "9": {
                "hadithNumber": "Hadith #4",
                "title": "Al-Kafi - Volume 1: Chapter On The Invalidity of the Belief to see God (Ru’yah of Allah)",
                "arabicText": " 4ـ وَعَنْهُ عَنْ أَحْمَدَ بْنِ إِسْحَاقَ قَالَ كَتَبْتُ إِلَى أَبِي الْحَسَنِ الثَّالِثِ (عَلَيْهِ السَّلام) أَسْأَلُهُ عَنِ الرُّؤْيَةِ وَمَا اخْتَلَفَ فِيهِ النَّاسُ فَكَتَبَ لا تَجُوزُ الرُّؤْيَةُ مَا لَمْ يَكُنْ بَيْنَ الرَّائِي وَالْمَرْئِيِّ هَوَاءٌ لَمْ يَنْفُذْهُ الْبَصَرُ فَإِذَا انْقَطَعَ الْهَوَاءُ عَنِ الرَّائِي وَالْمَرْئِيِّ لَمْ تَصِحَّ الرُّؤْيَةُ وَكَانَ فِي ذَلِكَ الاشْتِبَاهُ لانَّ الرَّائِيَ مَتَى سَاوَى الْمَرْئِيَّ فِي السَّبَبِ الْمُوجِبِ بَيْنَهُمَا فِي الرُّؤْيَةِ وَجَبَ الاشْتِبَاهُ وَكَانَ ذَلِكَ التَّشْبِيهُ لانَّ الاسْبَابَ لا بُدَّ مِنِ اتِّصَالِهَا بِالْمُسَبَّبَاتِ.",
                "englishText": " 4. It is narrated from the same narrator (Ahmad ibn Idris) from Ahmad ibn Ishaq who has said the following. “I wrote to Imam abul Hassan the 3rd and asked him about eye-witnessing Allah’s self and the differences among people about this issue. The Imam  answered in writing.” “Eye-witnessing Allah’s self is not possible until there is air (light-carrier medium) that would let the light reach the eye. If air is remove from (space between) the viewer and the object, no eye-witnessing will take place. In this is ground for similarity. When the viewer and the object in view would have the same medium that make eye-witnessing possible a similarity must exist therein. (When applying this to the case of Allah) it is an analogy and similarity. The means must have a connection with the source.”",
                "href": "https://thaqalayn.net/hadith/1/3/9/4",
                "gradings": {}
            }
        }
    },
    {
        "3": {
            "10": {
                "hadithNumber": "Hadith #2",
                "title": "Al-Kafi - Volume 1: Chapter On Prohibition on Attributing to Allah What He Himself has not Done so",
                "arabicText": " 2ـ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ عَنْ أَبِي حَمْزَةَ قَالَ قَالَ لِي عَلِيُّ بن الحسين (عَلَيْهما السَّلام) يَا أَبَا حَمْزَةَ إِنَّ الله لا يُوصَفُ بِمَحْدُودِيَّةٍ عَظُمَ رَبُّنَا عَنِ الصِّفَةِ فَكَيْفَ يُوصَفُ بِمَحْدُودِيَّةٍ مَنْ لا يُحَدُّ وَلا تُدْرِكُهُ الابْصَارُ وَهُوَ يُدْرِكُ الابْصَارَ وَهُوَ اللَّطِيفُ الْخَبِيرُ.",
                "englishText": " 2. Muhammad ibn Isma‘il has narrated from al-Fadl ibn Shadhan from Ibn Abi ‘Umayr from Ibrahim ibn ‘Abd al-Hamid from abu Hamzah who has said that Imam Ali ibn al-Husayn said to me, “O abu Hamzah, Allah cannot be defined by the created things. Our Lord is far above being described through the attributes. How can the infinite be defined by the finite? ‘ No mortal eyes can see Him, but He can see all eyes. He is All-kind and All-aware.’” (6:103)",
                "href": "https://thaqalayn.net/hadith/1/3/10/2",
                "gradings": {}
            }
        }
    },
    {
        "3": {
            "11": {
                "hadithNumber": "Hadith #3",
                "title": "Al-Kafi - Volume 1: Chapter On Prohibition on Considering Allah as having Body (JISM) and Form (SURAH)",
                "arabicText": " 3ـ مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ عَنْ مُحَمَّدِ بْنِ زَيْدٍ قَالَ جِئْتُ إِلَى الرِّضَا (عَلَيْهِ السَّلام) أَسْأَلُهُ عَنِ التَّوْحِيدِ فَأَمْلَى عَلَيَّ الْحَمْدُ لله فَاطِرِ الاشْيَاءِ إِنْشَاءً وَمُبْتَدِعِهَا ابْتِدَاعاً بِقُدْرَتِهِ وَحِكْمَتِهِ لا مِنْ شَيْ‏ءٍ فَيَبْطُلَ الاخْتِرَاعُ وَلا لِعِلَّةٍ فَلا يَصِحَّ الابْتِدَاعُ خَلَقَ مَا شَاءَ كَيْفَ شَاءَ مُتَوَحِّداً بِذَلِكَ لاظْهَارِ حِكْمَتِهِ وَحَقِيقَةِ رُبُوبِيَّتِهِ لا تَضْبِطُهُ الْعُقُولُ وَلا تَبْلُغُهُ الاوْهَامُ وَلا تُدْرِكُهُ الابْصَارُ وَلا يُحِيطُ بِهِ مِقْدَارٌ عَجَزَتْ دُونَهُ الْعِبَارَةُ وَكَلَّتْ دُونَهُ الابْصَارُ وَضَلَّ فِيهِ تَصَارِيفُ الصِّفَاتِ احْتَجَبَ بِغَيْرِ حِجَابٍ مَحْجُوبٍ وَاسْتَتَرَ بِغَيْرِ سِتْرٍ مَسْتُورٍ عُرِفَ بِغَيْرِ رُؤْيَةٍ وَوُصِفَ بِغَيْرِ صُورَةٍ وَنُعِتَ بِغَيْرِ جِسْمٍ لا إِلَهَ إِلا الله الْكَبِيرُ الْمُتَعَالِ.",
                "englishText": " 3. Muhammad ibn al-Hassan has narrated from Sahl ibn Ziyad from Muhammad ibn Isma‘il ibn Bazi‘ from Muhammad ibn Zayd who has said the following. “I went to Imam al-Rida  to ask about the Oneness of Allah (God). The Imam dictated to me thus, ‘All praise belongs to Allah, Who is the originator of all things. He is the inventor of all things, an invention that came from His power and wisdom but not from a thing so it would invalidate the invention and not from a cause so it would invalidate the novelty. He created whatever He wanted and howsoever He liked. He alone did all this to manifest His Wisdom and the truth of His Providence. Intelligence cannot comprehend Him, (Awham) imagination cannot reach Him, eyes cannot see Him and measurements cannot confine Him. The power of expression is unable to express Him in words. All sights are exhausted from reaching Him and the power of describing and defining have gone astray in its description and definition of His-self. He is hidden without any veil and is concealed without any covering. He is known without being seen; described without any form, and praised without any body. There is no god, except Allah, the Great, the Most High.’”",
                "href": "https://thaqalayn.net/hadith/1/3/11/3",
                "gradings": {}
            }
        }
    },
    {
        "3": {
            "11": {
                "hadithNumber": "Hadith #5",
                "title": "Al-Kafi - Volume 1: Chapter On Prohibition on Considering Allah as having Body (JISM) and Form (SURAH)",
                "arabicText": " 5ـ عَلِيُّ بْنُ مُحَمَّدٍ رَفَعَهُ عَنْ مُحَمَّدِ بْنِ الْفَرَجِ الرُّخَّجِيِّ قَالَ كَتَبْتُ إِلَى أَبِي الْحَسَنِ (عَلَيْهِ السَّلام) أَسْأَلُهُ عَمَّا قَالَ هِشَامُ بْنُ الْحَكَمِ فِي الْجِسْمِ وَهِشَامُ بْنُ سَالِمٍ فِي الصُّورَةِ فَكَتَبَ دَعْ عَنْكَ حَيْرَةَ الْحَيْرَانِ وَاسْتَعِذْ بِالله مِنَ الشَّيْطَانِ لَيْسَ الْقَوْلُ مَا قَالَ الْهِشَامَانِ.",
                "englishText": " 5. Ali ibn Muhammad, in a marfu‘ manner, has narrated from Muhammad ibn al-Faraj al-Rukhkhaji who has said the following. “I wrote to Imam abu al-Hassan , about the words of Hisham ibn al-Hakam, about the body and the words of Hisham ibn Salim about the form (of Allah). He wrote in reply, ‘Remove from thyself the confusion of the confounded people and seek refuge from Allah against Shaytan (Satan). What the two Hishams have said is not correct.’”",
                "href": "https://thaqalayn.net/hadith/1/3/11/5",
                "gradings": {}
            }
        }
    },
    {
        "3": {
            "16": {
                "hadithNumber": "Hadith #12",
                "title": "Al-Kafi - Volume 1: Chapter On The Meanings of the Names of Allah and their Derivatives",
                "arabicText": " 12ـ عَلِيُّ بْنُ مُحَمَّدٍ وَمُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ وَمُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى جَمِيعاً عَنْ أَبِي هَاشِمٍ الْجَعْفَرِيِّ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ الثَّانِيَ (عَلَيْهِ السَّلام) مَا مَعْنَى الْوَاحِدِ فَقَالَ إِجْمَاعُ الالْسُنِ عَلَيْهِ بِالْوَحْدَانِيَّةِ كَقَوْلِهِ تَعَالَى وَلَئِنْ سَأَلْتَهُمْ مَنْ خَلَقَهُمْ لَيَقُولُنَّ الله.",
                "englishText": " 12. Ali ibn Muhammad and Muhammad ibn al-Hassan has narrated from Sahl ibn Ziyad and Muhammad ibn Yahya from Ahmad ibn Muhammad ibn ‘Isa all of them from abu Hashim al-Ja‘fari who has said the following. “I asked abu Ja‘far al-Thani, the 2nd , “What is the meaning of the One?” The Imam replied, “It means the unanimity of all tongues in speaking of Allah’s Oneness. If you ask them as to who has created them, they all say it is Allah, Who has created them.”",
                "href": "https://thaqalayn.net/hadith/1/3/16/12",
                "gradings": {}
            }
        }
    },
    {
        "3": {
            "19": {
                "hadithNumber": "Hadith #4",
                "title": "Al-Kafi - Volume 1: Chapter on Motion and Change",
                "arabicText": "4ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عِيسَى قَالَ كَتَبْتُ إِلَى أَبِي الْحَسَنِ عَلِيِّ بْنِ مُحَمَّدٍ (عَلَيْهما السَّلام) جَعَلَنِيَ الله فِدَاكَ يَا سَيِّدِي قَدْ رُوِيَ لَنَا أَنَّ الله فِي مَوْضِعٍ دُونَ مَوْضِعٍ عَلَى الْعَرْشِ اسْتَوَى وَأَنَّهُ يَنْزِلُ كُلَّ لَيْلَةٍ فِي النِّصْفِ الاخِيرِ مِنَ اللَّيْلِ إِلَى السَّمَاءِ الدُّنْيَا وَرُوِيَ أَنَّهُ يَنْزِلُ عَشِيَّةَ عَرَفَةَ ثُمَّ يَرْجِعُ إِلَى مَوْضِعِهِ فَقَالَ بَعْضُ مَوَالِيكَ فِي ذَلِكَ إِذَا كَانَ فِي مَوْضِعٍ دُونَ مَوْضِعٍ فَقَدْ يُلاقِيهِ الْهَوَاءُ وَيَتَكَنَّفُ عَلَيْهِ وَالْهَوَاءُ جِسْمٌ رَقِيقٌ يَتَكَنَّفُ عَلَى كُلِّ شَيْ‏ءٍ بِقَدْرِهِ فَكَيْفَ يَتَكَنَّفُ عَلَيْهِ جَلَّ ثَنَاؤُهُ عَلَى هَذَا الْمِثَالِ فَوَقَّعَ (عَلَيْهِ السَّلام) عِلْمُ ذَلِكَ عِنْدَهُ وَهُوَ الْمُقَدِّرُ لَهُ بِمَا هُوَ أَحْسَنُ تَقْدِيراً وَاعْلَمْ أَنَّهُ إِذَا كَانَ فِي السَّمَاءِ الدُّنْيَا فَهُوَ كَمَا هُوَ عَلَى الْعَرْشِ وَالاشْيَاءُ كُلُّهَا لَهُ سَوَاءٌ عِلْماً وَقُدْرَةً وَمُلْكاً وَإِحَاطَةً.  وَعَنْهُ عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ الْكُوفِيِّ عَنْ مُحَمَّدِ بْنِ عِيسَى مِثْلَهُ.  فِي قَوْلِهِ تَعَالَى ما يَكُونُ مِنْ نَجْوى‏ ثَلاثَةٍ إِلا هُوَ رابِعُهُمْ.",
                "englishText": " 4. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Muhammad ibn ‘Isa who has said the following. “I wrote to Imam abu al-Hassan, Ali ibn Muhammad  to clarify a question. May Allah take my soul in your service, O my master, it is narrated to us that Allah is in one place and not in another place on ‘Arsh, (the Throne) resting. He comes down to the sky above the earth every night during the last half of the night. It is narrated that He comes down at the ninth evening of the month of Dhul Hajj and then He returns back to His place. Certain individuals among your friends have said that if He would be found in certain places and not in other places the air must have come in contact with Him and would surround Him because air is a thin form of body that surrounds everything proportionate to its size. How then the air would surround Allah, the Most Holy and the Most High, According to this assumption? The Imam replied in writing, “He has the knowledge of this. He is the best One in having the true measurements of all things. You must, However, note that His being in the sky over the earth is just as He on the Throne. All things to Him are the same in the matters of His knowledge and power, domination and control.” Muhammad ibn Ja‘far al-Kufi has narrated from Muhammad ibn ’Isa a similar Hadith About the words of Allah “There is not a single place wherein any secret counsel can take place between any three people without God being the fourth, . .” (58:7).",
                "href": "https://thaqalayn.net/hadith/1/3/19/4",
                "gradings": {}
            }
        }
    },
    {
        "3": {
            "22": {
                "hadithNumber": "Hadith #1",
                "title": "Al-Kafi - Volume 1: Chapter on Comprehensive (Ahadith) about the Oneness of Allah",
                "arabicText": " 1ـ مُحَمَّدُ بْنُ أَبِي عَبْدِ الله وَمُحَمَّدُ بْنُ يَحْيَى جَمِيعاً رَفَعَاهُ إِلَى أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) أَنَّ أَمِيرَ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) اسْتَنْهَضَ النَّاسَ فِي حَرْبِ مُعَاوِيَةَ فِي الْمَرَّةِ الثَّانِيَةِ فَلَمَّا حَشَدَ النَّاسُ قَامَ خَطِيباً فَقَالَ الْحَمْدُ لله الْوَاحِدِ الاحَدِ الصَّمَدِ الْمُتَفَرِّدِ الَّذِي لا مِنْ شَيْ‏ءٍ كَانَ وَلا مِنْ شَيْ‏ءٍ خَلَقَ مَا كَانَ قُدْرَةٌ بَانَ بِهَا مِنَ الاشْيَاءِ وَبَانَتِ الاشْيَاءُ مِنْهُ فَلَيْسَتْ لَهُ صِفَةٌ تُنَالُ وَلا حَدٌّ تُضْرَبُ لَهُ فِيهِ الامْثَالُ كَلَّ دُونَ صِفَاتِهِ تَحْبِيرُ اللُّغَاتِ وَضَلَّ هُنَاكَ تَصَارِيفُ الصِّفَاتِ وَحَارَ فِي مَلَكُوتِهِ عَمِيقَاتُ مَذَاهِبِ التَّفْكِيرِ وَانْقَطَعَ دُونَ الرُّسُوخِ فِي عِلْمِهِ جَوَامِعُ التَّفْسِيرِ وَحَالَ دُونَ غَيْبِهِ الْمَكْنُونِ حُجُبٌ مِنَ الْغُيُوبِ تَاهَتْ فِي أَدْنَى أَدَانِيهَا طَامِحَاتُ الْعُقُولِ فِي لَطِيفَاتِ الامُورِ فَتَبَارَكَ الله الَّذِي لا يَبْلُغُهُ بُعْدُ الْهِمَمِ وَلا يَنَالُهُ غَوْصُ الْفِطَنِ وَتَعَالَى الَّذِي لَيْسَ لَهُ وَقْتٌ مَعْدُودٌ وَلا أَجَلٌ مَمْدُودٌ وَلا نَعْتٌ مَحْدُودٌ سُبْحَانَ الَّذِي لَيْسَ لَهُ أَوَّلٌ مُبْتَدَأٌ وَلا غَايَةٌ مُنْتَهًى وَلا آخِرٌ يَفْنَى سُبْحَانَهُ هُوَ كَمَا وَصَفَ نَفْسَهُ وَالْوَاصِفُونَ لا يَبْلُغُونَ نَعْتَهُ وَحَدَّ الاشْيَاءَ كُلَّهَا عِنْدَ خَلْقِهِ إِبَانَةً لَهَا مِنْ شِبْهِهِ وَإِبَانَةً لَهُ مِنْ شِبْهِهَا لَمْ يَحْلُلْ فِيهَا فَيُقَالَ هُوَ فِيهَا كَائِنٌ وَلَمْ يَنْأَ عَنْهَا فَيُقَالَ هُوَ مِنْهَا بَائِنٌ وَلَمْ يَخْلُ مِنْهَا فَيُقَالَ لَهُ أَيْنَ لَكِنَّهُ سُبْحَانَهُ أَحَاطَ بِهَا عِلْمُهُ وَأَتْقَنَهَا صُنْعُهُ وَأَحْصَاهَا حِفْظُهُ لَمْ يَعْزُبْ عَنْهُ خَفِيَّاتُ غُيُوبِ الْهَوَاءِ وَلا غَوَامِضُ مَكْنُونِ ظُلَمِ الدُّجَى وَلا مَا فِي السَّمَاوَاتِ الْعُلَى إِلَى الارَضِينَ السُّفْلَى لِكُلِّ شَيْ‏ءٍ مِنْهَا حَافِظٌ وَرَقِيبٌ وَكُلُّ شَيْ‏ءٍ مِنْهَا بِشَيْ‏ءٍ مُحِيطٌ وَالْمُحِيطُ بِمَا أَحَاطَ مِنْهَا الْوَاحِدُ الاحَدُ الصَّمَدُ الَّذِي لا يُغَيِّرُهُ صُرُوفُ الازْمَانِ وَلا يَتَكَأَّدُهُ صُنْعُ شَيْ‏ءٍ كَانَ إِنَّمَا قَالَ لِمَا شَاءَ كُنْ فَكَانَ ابْتَدَعَ مَا خَلَقَ بِلا مِثَالٍ سَبَقَ وَلا تَعَبٍ وَلا نَصَبٍ وَكُلُّ صَانِعِ شَيْ‏ءٍ فَمِنْ شَيْ‏ءٍ صَنَعَ وَالله لا مِنْ شَيْ‏ءٍ صَنَعَ مَا خَلَقَ وَكُلُّ عَالِمٍ فَمِنْ بَعْدِ جَهْلٍ تَعَلَّمَ وَالله لَمْ يَجْهَلْ وَلَمْ يَتَعَلَّمْ أَحَاطَ بِالاشْيَاءِ عِلْماً قَبْلَ كَوْنِهَا فَلَمْ يَزْدَدَ بِكَوْنِهَا عِلْماً عِلْمُهُ بِهَا قَبْلَ أَنْ يُكَوِّنَهَا كَعِلْمِهِ بَعْدَ تَكْوِينِهَا لَمْ يُكَوِّنْهَا لِتَشْدِيدِ سُلْطَانٍ وَلا خَوْفٍ مِنْ زَوَالٍ وَلا نُقْصَانٍ وَلا اسْتِعَانَةٍ عَلَى ضِدٍّ مُنَاوٍ وَلا نِدٍّ مُكَاثِرٍ وَلا شَرِيكٍ مُكَابِرٍ لَكِنْ خَلائِقُ مَرْبُوبُونَ وَعِبَادٌ دَاخِرُونَ فَسُبْحَانَ الَّذِي لا يَئُودُهُ خَلْقُ مَا ابْتَدَأَ وَلا تَدْبِيرُ مَا بَرَأَ وَلا مِنْ عَجْزٍ وَلا مِنْ فَتْرَةٍ بِمَا خَلَقَ اكْتَفَى عَلِمَ مَا خَلَقَ وَخَلَقَ مَا عَلِمَ لا بِالتَّفْكِيرِ فِي عِلْمٍ حَادِثٍ أَصَابَ مَا خَلَقَ وَلا شُبْهَةٍ دَخَلَتْ عَلَيْهِ فِيمَا لَمْ يَخْلُقْ لَكِنْ قَضَاءٌ مُبْرَمٌ وَعِلْمٌ مُحْكَمٌ وَأَمْرٌ مُتْقَنٌ تَوَحَّدَ بِالرُّبُوبِيَّةِ وَخَصَّ نَفْسَهُ بِالْوَحْدَانِيَّةِ وَاسْتَخْلَصَ بِالْمَجْدِ وَالثَّنَاءِ وَتَفَرَّدَ بِالتَّوْحِيدِ وَالْمَجْدِ وَالسَّنَاءِ وَتَوَحَّدَ بِالتَّحْمِيدِ وَتَمَجَّدَ بِالتَّمْجِيدِ وَعَلا عَنِ اتِّخَاذِ الابْنَاءِ وَتَطَهَّرَ وَتَقَدَّسَ عَنْ مُلامَسَةِ النِّسَاءِ وَعَزَّ وَجَلَّ عَنْ مُجَاوَرَةِ الشُّرَكَاءِ فَلَيْسَ لَهُ فِيمَا خَلَقَ ضِدٌّ وَلا لَهُ فِيمَا مَلَكَ نِدٌّ وَلَمْ يَشْرَكْهُ فِي مُلْكِهِ أَحَدٌ الْوَاحِدُ الاحَدُ الصَّمَدُ الْمُبِيدُ لِلابَدِ وَالْوَارِثُ لِلامَدِ الَّذِي لَمْ يَزَلْ وَلا يَزَالُ وَحْدَانِيّاً أَزَلِيّاً قَبْلَ بَدْءِ الدُّهُورِ وَبَعْدَ صُرُوفِ الامُورِ الَّذِي لا يَبِيدُ وَلا يَنْفَدُ بِذَلِكَ أَصِفُ رَبِّي فَلا إِلَهَ إِلا الله مِنْ عَظِيمٍ مَا أَعْظَمَهُ وَمِنْ جَلِيلٍ مَا أَجَلَّهُ وَمِنْ عَزِيزٍ مَا أَعَزَّهُ وَتَعَالَى عَمَّا يَقُولُ الظَّالِمُونَ عُلُوّاً كَبِيراً.",
                "englishText": " 1. Muhammad ibn abu ‘Abdallah and Muhammad ibn Yahya - both in a marfu‘ manner- have narrated from Imam abu ‘Abdallah  who has said the following. “Imam Amirul Mu’minin mobilized people against Mu’awiya for the second time and when people came in multitudes he stood up to give a speeCh ‘All praise is due to Allah, the One, only One, the Self-sufficient, the Single one Who did not cone into being from anything and was not created from something that had come into being before. He is the power. With His power He is distinct from others and the other things became manifest through His power. There is no attribute that would reach Him and He has no limit for a definition or an analogy. All the linguistic beauty and expressions fall far short to express His attributes. In speaking of Him all attributes prove to be misleading. The depth of the schools of thoughts are perplexed and confused about the wonders of His kingdom. All the comprehensive interpretations have remained far short of establishing any footing in His knowledge. The barriers of the unseen have curtained His treasured secrets. The high flying ambitious intelligence with the ability to reach the depth of very subtle matters lose their way at the very beginning of their journey to Him. Most Holy is Allah. To Him not even the far-reaching ambitions are able to reaCh No deep diving intelligence is able to comprehend Him. Most High is He Who is not subject to the effects of any calculated time or extended period or limited attributes. Glorious is He Who has no beginning for His start, a destination to approach or an end to diminish. Glorious is He Who is just the way He Himself has introduced. All those who speak of His praise can never praise fully and duly. He designed a limit for everything at the time He created them. It is because that there is no similarity between them and He and that because He is not similar to any thing else. He is not absolved in anything so that it could be said He is within anything and He is far from anything so that it could be said He has nothing to do with them (the creatures). He has not distanced Himself from them so that it can be said where is He? He is far Glorious (and above such associations). He has encompassed all things through His knowledge. He has made their design firm and has enumerated them for safe preservation. Even the unseen and hidden things in the air, is not unnoticed to Him. Nor things deeply hidden in the darkness of black nights, all things high above in heavens and down to the lowest earth are not unnoticed to Him. For everything there is a protector and a guard and everything therein has limits within something and a limit for that limit. He is the One, the only One, the self sufficient, Who is not subject to the changes due to times. The creation of things never over burdens Him. He only, when willing, commands it to exist (and it comes into existence). He invented whatever He has created without any examples to follow and without feeling of over burdened or exhaustion. All manufacturers manufacture things from something. Allah has not created whatever He has created from anything. Every knowledgeable one learns after being ignorant. He has not being ignorant and has not learned from any one. He has encompassed all things through His knowledge before their coming into existence and their existence has not increased any thing to His knowledge. He knew them before their coming into existence just as He knows them after their coming into existence. He did not bring them into existence to strengthen His authority or for fear of banishment or reduction. He did not bring them into existence as helpers against a competing opponent, and a peer who would be of more (power) or a partner who would show greatness. He created them as creatures that required preservation and protection as subdued servants. Glorious is He, Who does not become tired in the creation of what He has created or the preservation of all that He has formed into beings. He does not undergo in this work any weakness or exhaustion. Whatever He has created has deemed it sufficient. He knows what He has created and created what He knew. It did not happen as a result of new thinking that He found to be a correct one not because of some doubts that He may have found in whatever that He had not yet created. It is due His unchangeable decree, His firm knowledge and resolute command. He is the One only Lord and is very special in His Oneness. He is pure in His Glory and praise. He is the only one in Oneness, the Glory, in Highness, in Oneness in praiseworthiness and in Glory and Gloriousness. He is Far High above having children. He is far Holy and clean above involvement in touching women and by far Majestic and Glorious above the association of the partners. In whatever He has created there is nothing to oppose Him nor there is any thing in what He created to stand parallel to Him and no one shares Him His kingdom. He the One and only the Self-sufficient, Who brings the timeless time to an end, is the owner of the extended duration of time. He is the one Who is eternal with eternal Oneness before the beginning of the times and after all the changes in the creation. He is the one who never banishes or diminishes. Thus, I speak of my Lord. There is no lord besides Allah. He is the Great and of un-matching greatness. He is the Most Majestic and of unmatched Majesty. He is the Most Glorious and of unmatched Glory. He is far above what the unjust think of Him to be.”",
                "href": "https://thaqalayn.net/hadith/1/3/22/1",
                "gradings": {}
            }
        }
    },
    {
        "3": {
            "22": {
                "hadithNumber": "Hadith #3",
                "title": "Al-Kafi - Volume 1: Chapter on Comprehensive (Ahadith) about the Oneness of Allah",
                "arabicText": " 3ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنِ الْمُخْتَارِ بْنِ مُحَمَّدِ بْنِ الْمُخْتَارِ وَمُحَمَّدُ بْنُ الْحَسَنِ عَنْ عَبْدِ الله بْنِ الْحَسَنِ الْعَلَوِيِّ جَمِيعاً عَنِ الْفَتْحِ بْنِ يَزِيدَ الْجُرْجَانِيِّ قَالَ ضَمَّنِي وَأَبَا الْحَسَنِ (عَلَيْهِ السَّلام) الطَّرِيقُ فِي مُنْصَرَفِي مِنْ مَكَّةَ إِلَى خُرَاسَانَ وَهُوَ سَائِرٌ إِلَى الْعِرَاقِ فَسَمِعْتُهُ يَقُولُ مَنِ اتَّقَى الله يُتَّقَى وَمَنْ أَطَاعَ الله يُطَاعُ فَتَلَطَّفْتُ فِي الْوُصُولِ إِلَيْهِ فَوَصَلْتُ فَسَلَّمْتُ عَلَيْهِ فَرَدَّ عَلَيَّ السَّلامَ ثُمَّ قَالَ يَا فَتْحُ مَنْ أَرْضَى الْخَالِقَ لَمْ يُبَالِ بِسَخَطِ الْمَخْلُوقِ وَمَنْ أَسْخَطَ الْخَالِقَ فَقَمَنٌ أَنْ يُسَلِّطَ الله عَلَيْهِ سَخَطَ الْمَخْلُوقِ وَإِنَّ الْخَالِقَ لا يُوصَفُ إِلا بِمَا وَصَفَ بِهِ نَفْسَهُ وَأَنَّى يُوصَفُ الَّذِي تَعْجِزُ الْحَوَاسُّ أَنْ تُدْرِكَهُ وَالاوْهَامُ أَنْ تَنَالَهُ وَالْخَطَرَاتُ أَنْ تَحُدَّهُ وَالابْصَارُ عَنِ الاحَاطَةِ بِهِ جَلَّ عَمَّا وَصَفَهُ الْوَاصِفُونَ وَتَعَالَى عَمَّا يَنْعَتُهُ النَّاعِتُونَ نَأَى فِي قُرْبِهِ وَقَرُبَ فِي نَأْيِهِ فَهُوَ فِي نَأْيِهِ قَرِيبٌ وَفِي قُرْبِهِ بَعِيدٌ كَيَّفَ الْكَيْفَ فَلا يُقَالُ كَيْفَ وَأَيَّنَ الايْنَ فَلا يُقَالُ أَيْنَ إِذْ هُوَ مُنْقَطِعُ الْكَيْفُوفِيَّةِ وَالايْنُونِيَّةِ.",
                "englishText": " 3. Ali ibn Ibrahim has narrated from al-Mukhtar ibn Muhammad ibn al-Mukhtar and Muhammad ibn al-Hassan from ‘Abdallah ibn al-Hassan al-‘Alawi all from al-Fath ibn Yazid al-Jurjani who has said the following. “A road on my way back from Makkah to Khuransan joined me with Imam abu al-Hassan  the 2nd who was going to Iraq and I heard him saying, “Whoever observes piety before Allah he is protected and whoever obeys Allah he is obeyed.” I calmly walked to him and on reaching him I offered my salutation and he responded likewise and said, “O fath whoever pleases Allah is not worried about the anger of people. Whoever causes the Creator to become angry with him he deserves that Allah would cause to subject him to the anger of the people. One can only speak of the attributes of the Creator the way he Himself has spoken about Himself. How can a person speak of One from Whose perceiving all the senses are frustrated and even the imagination is not able to comprehend Him or ones sharp feelings would reach Him in any way or manner or the eyes would limit Him in any manner. He is far above the description of those who speak of His attributes and the praise of those who speak of His praise. He is far in His nearness and is near in His being far. He in His far-ness is near and is far in His nearness. He is the condition of the conditions and no one can say that He is in a condition or is somewhere. No one can about Him where because He is far above the conditions and places.”",
                "href": "https://thaqalayn.net/hadith/1/3/22/3",
                "gradings": {}
            }
        }
    },
    {
        "3": {
            "32": {
                "hadithNumber": "Hadith #1",
                "title": "Al-Kafi - Volume 1: Declaration, Definition and the Need for Solid Proof",
                "arabicText": "مُحَمَّدُ بْنُ يَحْيَى وَغَيْرُهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنِ ابْنِ الطَّيَّارِ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ إِنَّ الله احْتَجَّ عَلَى النَّاسِ بِمَا آتَاهُمْ وَعَرَّفَهُمْ.\r\n\r\nمُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ مِثْلَهُ.",
                "englishText": "Muhammad ibn Yahya and others have narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Husayn ibn Sa‘id from Ibn Abi ‘Umayr from Jamayl ibn Durraj from ibn al-Tayyar from abu ‘Abd Allah who said the following:\r\n“Allah has justified His holding people accountable with what He has made known and sent to them.” solid\r\nMuhammad ibn Isma’Il has narrated from al-Fadl ibn Shadhan from Ibn Abi ‘Umayr from Jamyl ibn Durraj a similar Hadith.",
                "href": "https://thaqalayn.net/hadith/1/3/32/1",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "2": {
                "hadithNumber": "Hadith #4",
                "title": "Al-Kafi - Volume 1: The Categories of the Prophets, the Messengers and the Imams (a.s.)",
                "arabicText": " 4ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ إِسْحَاقَ بْنِ عَبْدِ الْعَزِيزِ أَبِي السَّفَاتِجِ عَنْ جَابِرٍ عَنْ ابي جعفر (عَلَيْهِ السَّلام) قَالَ سَمِعْتُهُ يَقُولُ إِنَّ الله اتَّخَذَ إِبْرَاهِيمَ عَبْداً قَبْلَ أَنْ يَتَّخِذَهُ نَبِيّاً وَاتَّخَذَهُ نَبِيّاً قَبْلَ أَنْ يَتَّخِذَهُ رَسُولاً وَاتَّخَذَهُ رَسُولاً قَبْلَ أَنْ يَتَّخِذَهُ خَلِيلاً وَاتَّخَذَهُ خَلِيلاً قَبْلَ أَنْ يَتَّخِذَهُ إِمَاماً فَلَمَّا جَمَعَ لَهُ هَذِهِ الاشْيَاءَ وَقَبَضَ يَدَهُ قَالَ لَهُ يَا إِبْرَاهِيمُ إِنِّي جاعِلُكَ لِلنَّاسِ إِماماً فَمِنْ عِظَمِهَا فِي عَيْنِ إِبْرَاهِيمَ (عَلَيْهِ السَّلام) قَالَ يَا رَبِّ وَمِنْ ذُرِّيَّتِي قالَ لا يَنالُ عَهْدِي الظَّالِمِينَ.",
                "englishText": " 4. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Muhammad ibn al-Hassan from Ishaq ibn ‘Abd al-‘Aziz from abu al-Saffah from Jabir from abu Ja‘far  has said the following. “I heard the Imam saying, ‘Allah chose Abraham as a servant before He chose him as a prophet. He chose him as a prophet before He chose him as a messenger. He chose him as a messenger before He chose him as a friend of His. He chose him as a friend of His before He chose him as an Imam. When all of these things gathered in him (the Imam holding his hands said, “Allah said, ‘O Ibrahim I have appointed you as the Imam (leader) of the people.” Because of the greatness of the position Abraham them asked, “O Lord, can it be in my descendants also?” The Lord said, ‘My covenant does not go to the unjust ones.”",
                "href": "https://thaqalayn.net/hadith/1/4/2/4",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "9": {
                "hadithNumber": "Hadith #3",
                "title": "Al-Kafi - Volume 1: The Imams (a.s.) are witness for Allah, the Most Holy, the Most High, over His creature",
                "arabicText": " 3ـ وَبِهَذَا الاسْنَادِ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ أَحْمَدَ بْنِ عُمَرَ الْحَلالِ قَالَ سَأَلْتُ أَبَا الْحَسَنِ (عَلَيْهِ السَّلام) عَنْ قَوْلِ الله عَزَّ وَجَلَّ أَ فَمَنْ كانَ عَلى‏ بَيِّنَةٍ مِنْ رَبِّهِ وَيَتْلُوهُ شاهِدٌ مِنْهُ فَقَالَ أَمِيرُ الْمُؤْمِنِينَ صَلَوَاتُ الله عَلَيْهِ الشَّاهِدُ عَلَى رَسُولِ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) وَرَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) عَلَى بَيِّنَةٍ مِنْ رَبِّهِ.",
                "englishText": " 3. Through the same chain of narrators it is narrated from Mu‘allah ibn Muhammad from al-Hassan ibn Ali from Ahmad ibn ‘Umar al-Hallal who has said that he asked Imam abu al-Hassan  about the meaning of the following verse of the holy Quran: “Should they be compared with those whose Lord has given them a guidance which is testified by a witness from among their own people . .” (11:17) The Imam  said, “Amir al-Mu’minin Ali  testified to support the holy Prophet (s.a.) and the holy Prophet received supporting evidence from his Lord.”",
                "href": "https://thaqalayn.net/hadith/1/4/9/3",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "13": {
                "hadithNumber": "Hadith #5",
                "title": "Al-Kafi - Volume 1: The Imams (a.s.) are the light of Allah, the Most Holy, the Most High",
                "arabicText": "5ـ عَلِيُّ بْنُ مُحَمَّدٍ وَمُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ شَمُّونٍ عَنْ عَبْدِ الله بْنِ عَبْدِ الرَّحْمَنِ الاصَمِّ عَنْ عَبْدِ الله بْنِ الْقَاسِمِ عَنْ صَالِحِ بْنِ سَهْلٍ الْهَمْدَانِيِّ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) فِي قَوْلِ الله تَعَالَى الله نُورُ السَّماواتِ وَالارْضِ مَثَلُ نُورِهِ كَمِشْكاةٍ فَاطِمَةُ (عليها السلام) فِيها مِصْباحٌ الْحَسَنُ الْمِصْباحُ فِي زُجاجَةٍ الْحُسَيْنُ الزُّجاجَةُ كَأَنَّها كَوْكَبٌ دُرِّيٌّ فَاطِمَةُ كَوْكَبٌ دُرِّيٌّ بَيْنَ نِسَاءِ أَهْلِ الدُّنْيَا يُوقَدُ مِنْ شَجَرَةٍ مُبارَكَةٍ إِبْرَاهِيمُ (عَلَيْهِ السَّلام) زَيْتُونَةٍ لا شَرْقِيَّةٍ وَلا غَرْبِيَّةٍ لا يَهُودِيَّةٍ وَلا نَصْرَانِيَّةٍ يَكادُ زَيْتُها يُضِي‏ءُ يَكَادُ الْعِلْمُ يَنْفَجِرُ بِهَا وَلَوْ لَمْ تَمْسَسْهُ نارٌ نُورٌ عَلى‏ نُورٍ إِمَامٌ مِنْهَا بَعْدَ إِمَامٍ يَهْدِي الله لِنُورِهِ مَنْ يَشاءُ يَهْدِي الله لِلائِمَّةِ مَنْ يَشَاءُ وَيَضْرِبُ الله الامْثالَ لِلنَّاسِ قُلْتُ أَوْ كَظُلُماتٍ قَالَ الاوَّلُ وَصَاحِبُهُ يَغْشاهُ مَوْجٌ الثَّالِثُ مِنْ فَوْقِهِ مَوْجٌ ظُلُمَاتٌ الثَّانِي بَعْضُها فَوْقَ بَعْضٍ مُعَاوِيَةُ وَفِتَنُ بَنِي أُمَيَّةَ إِذا أَخْرَجَ يَدَهُ الْمُؤْمِنُ فِي ظُلْمَةِ فِتْنَتِهِمْ لَمْ يَكَدْ يَراها وَمَنْ لَمْ يَجْعَلِ الله لَهُ نُوراً إِمَاماً مِنْ وُلْدِ فَاطِمَةَ (عليها السلام) فَما لَهُ مِنْ نُورٍ إِمَامٍ يَوْمَ الْقِيَامَةِ وَقَالَ فِي قَوْلِهِ يَسْعى‏ نُورُهُمْ بَيْنَ أَيْدِيهِمْ وَبِأَيْمانِهِمْ أَئِمَّةُ الْمُؤْمِنِينَ يَوْمَ الْقِيَامَةِ تَسْعَى بَيْنَ يَدَيِ الْمُؤْمِنِينَ وَبِأَيْمَانِهِمْ حَتَّى يُنْزِلُوهُمْ مَنَازِلَ أَهْلِ الْجَنَّةِ.  عَلِيُّ بْنُ مُحَمَّدٍ وَمُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُوسَى بْنِ الْقَاسِمِ الْبَجَلِيِّ وَمُحَمَّدُ بْنُ يَحْيَى عَنِ الْعَمْرَكِيِّ بْنِ عَلِيٍّ جَمِيعاً عَنْ عَلِيِّ بْنِ جَعْفَرٍ عَنْ أَخِيهِ مُوسَى (عَلَيْهِ السَّلام) مِثْلَهُ.",
                "englishText": " 5. Ali ibn Muhammad and Muhammad ibn al-Hassan have narrated from Sahl ibn Ziyad from Muhammad ibn al-Hassan ibn sham?? From ‘Abdallah ibn ‘Abd al-Rahmanal-Asamm from ‘Abdallah ibn al-Qasim from salih ibn Sahl al-Hamadani who has said that abu ‘Abdallah  has said the following about the verse of the Holy Quran below. “God is the light of the heavens and the earth. A metaphor for His light is a lantern in which there is a lamp placed in a glass. The glass is like a shining star which is lit from a blessed olive tree that is neither eastern nor western. Its oil almost lights up even though it has not been touched by the fire. It is light upon light. God guides to His light whomever He wants. God uses various metaphors. He has the knowledge of all things.” (24:35) The Imam  said that the lantern metaphorically stands for the Holy lady, Fatima , the lamp stands for Imam al-Hassan  and the glass stands for Imam al-Husayn . The shining star stands for the Holy lady Fatima  who shines among the ladies of the world. The blessed olive tree stands for Prophet Abraham. Neither eastern nor western means not Jewish nor Christian. ‘Its oil almost lights up’ means that it almost bursts up with knowledge. ‘Light up on light’ means that there will one Imam after the other Imam  ‘God guides to His light who ever He wants’ means that Allah guides through the Imams whomever He wants.” About ‘God uses various metaphors’ I said, “Or it (the deeds of the unbelievers) are like the darkness of a deep, stormy sea with layers of giant waves, covered by dark clouds. It is darkness upon darkness whereby even if one stretches out his hands he can not see them. One can have no light unless God gives him light. (24:40) The Imam  said, “ ‘darkness’ refers to the first and his friend, ‘with layers of giant waves’ refers to the third, ‘covered with darkness’ refers to the second. ‘it is darkness up on darkness’ refers to Mu‘awiya and the disasters caused by the Amavides. ‘even if one stretches out his hands’ means that even if a true believer would stretch his hands in such disastrous condition ‘he can not see them’. ‘One can have no light unless God gives him light, means the light from the children of the Holy Lady, Fatima  ‘Can have no light’ means an Imam on the Day of Judgment.” The Imam  said that, “On the Day of Judgment you will see the believers with their light shining in front of them and to their right. They will be told, “Paradise wherein streams flow is the glad news for you today. You will live therein forever. This is the greatest triumph.” (57:12), the shining light in front . .’ is a reference to the Imams  whom would walk in front and on the right of the true believers until they all enter paradise.” Ali ibn Muhammad and Muhammad ibn al-Hassan have narrated from Sahl ibn Ziyad from Musa ibn al-Qasim al-Bajali and Muhammad ibn yahya from al-‘Amrakiy ibn Ali altogether from Ali ibn Ja‘far  from his brother a similar Hadith.",
                "href": "https://thaqalayn.net/hadith/1/4/13/5",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "20": {
                "hadithNumber": "Hadith #3",
                "title": "Al-Kafi - Volume 1: The people of Dhikr (memory and knowledge) that Allah has commanded the creatures to ask for their questions are the Imams (a.s.)",
                "arabicText": " 3ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ قَالَ سَأَلْتُ الرِّضَا (عَلَيْهِ السَّلام) فَقُلْتُ لَهُ جُعِلْتُ فِدَاكَ فَسْئَلُوا أَهْلَ الذِّكْرِ إِنْ كُنْتُمْ لا تَعْلَمُونَ فَقَالَ نَحْنُ أَهْلُ الذِّكْرِ وَنَحْنُ الْمَسْئُولُونَ قُلْتُ فَأَنْتُمُ الْمَسْئُولُونَ وَنَحْنُ السَّائِلُونَ قَالَ نَعَمْ قُلْتُ حَقّاً عَلَيْنَا أَنْ نَسْأَلَكُمْ قَالَ نَعَمْ قُلْتُ حَقّاً عَلَيْكُمْ أَنْ تُجِيبُونَا قَالَ لا ذَاكَ إِلَيْنَا إِنْ شِئْنَا فَعَلْنَا وَإِنْ شِئْنَا لَمْ نَفْعَلْ أَ مَا تَسْمَعُ قَوْلَ الله تَبَارَكَ وَتَعَالَى هذا عَطاؤُنا فَامْنُنْ أَوْ أَمْسِكْ بِغَيْرِ حِسابٍ.",
                "englishText": " 3. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from al-Washsha’ who has said that said to Imam al-Rida , “May Allah take my soul in service for your cause, what is the meaning of the words of Allah, “Ask the people of Dhikr if you do not know.”? (16:43, 21: 7 Holy Quran) The Imams  said, “ ‘Dhikr’ is Prophet Muhammad (s.a.) and we are his family (people) about whom questions will be asked.” I further asked about, “Are you the ones to be questioned and we will be the one to question?” The Imams  said yes, that is true.” I then asked, “Will it a right on us to ask you?” The Imams  said, “Yes, it is so.” I then asked, “Will it be a right on you to answer us?” The Imams  said, “No, will decide. We may or may not answer. Have you not heard the words of Allah, the Most Holy, the Most High, that say, “This is a gift from us. You may (give to others and) oblige or keep without being held accountable.”(38:39)",
                "href": "https://thaqalayn.net/hadith/1/4/20/3",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "27": {
                "hadithNumber": "Hadith #4",
                "title": "Al-Kafi - Volume 1: The Bounty and Blessings that Allah, the Most Holy, the Most High has mentioned in His book, the Holy Quran are the Imams (a.s.)",
                "arabicText": " 4ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ أُورَمَةَ عَنْ عَلِيِّ بْنِ حَسَّانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَثِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) عَنْ قَوْلِ الله عَزَّ وَجَلَّ أَ لَمْ تَرَ إِلَى الَّذِينَ بَدَّلُوا نِعْمَتَ الله كُفْراً الايَةَ قَالَ عَنَى بِهَا قُرَيْشاً قَاطِبَةً الَّذِينَ عَادَوْا رَسُولَ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) وَنَصَبُوا لَهُ الْحَرْبَ وَجَحَدُوا وَصِيَّةَ وَصِيِّهِ.",
                "englishText": " 4. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Muhammad ibn ’Uwarma from Ali ibn Hassa’n from ‘Abd al-Rahman ibn Kathir who has said that he asked abu ‘Abdallah  about the meaning of the following verse. “Have you not seen (considered) those who changed the blessings (Word) of God through disbelief and led their people to destruction?” (14:28) The Imam  said it is a reference to all of Quraysh who exercised animosity towards the Holy Prophet (s.a.), created wars against him and rejected his will about his successor.”",
                "href": "https://thaqalayn.net/hadith/1/4/27/4",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "28": {
                "hadithNumber": "Hadith #4",
                "title": "Al-Kafi - Volume 1: The People whom Allah, the Most Holy, the Most High, has called Mutawassimin (distinguished) in His book are the Imams (a.s.) who are also the straight path",
                "arabicText": " 4ـ مُحَمَّدُ بْنُ يَحْيَى عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ عَنْ عُبَيْسِ بْنِ هِشَامٍ عَنْ عَبْدِ الله بْنِ سُلَيْمَانَ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) فِي قَوْلِ الله عَزَّ وَجَلَّ إِنَّ فِي ذلِكَ لاياتٍ لِلْمُتَوَسِّمِينَ فَقَالَ هُمُ الائِمَّةُ (عَلَيْهم السَّلام) وَإِنَّها لَبِسَبِيلٍ مُقِيمٍ قَالَ لا يَخْرُجُ مِنَّا أَبَداً.",
                "englishText": " 4. Muhammad ibn Yahya has narrated from al-Hasan ibn Ali al-Kufi from ‘Ubays ibn Hisham from ‘Adallah ibn Sulayman from abu ‘Abdallah  who has said the following about the words of Allah, the Most Holy, the Most High. “In this there is evidence (of the Truth) for the distinguished ones.” (15:75) The Imams  said, “These people are the Imams  and the evidence will never depart us.”",
                "href": "https://thaqalayn.net/hadith/1/4/28/4",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "43": {
                "hadithNumber": "Hadith #1",
                "title": "Al-Kafi - Volume 1: Would the Imams (a.s.) not receive new knowledge their previous know would be Exhausted",
                "arabicText": "1ـ عَلِيُّ بْنُ مُحَمَّدٍ وَمُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ صَفْوَانَ بْنِ يَحْيَى قَالَ سَمِعْتُ أَبَا الْحَسَنِ (عَلَيْهِ السَّلام) يَقُولُ كَانَ جَعْفَرُ بْنُ مُحَمَّدٍ (عَلَيْهما السَّلام) يَقُولُ لَوْ لا أَنَّا نَزْدَادُ لانْفَدْنَا.\r\n مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنْ صَفْوَانَ عَنْ أَبِي الْحَسَنِ مِثْلَهُ.",
                "englishText": " 1. Ali ibn Muhammad and Muhammad ibn al-Hassan have narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad ibn abu Nasr from Safwan ibn Yahya who has said that he heard abu Ja‘far  say the following. “Would we not receive (new knowledge) we would diminish (in knowledge).” Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Khalid from Safwan from abu a1-Hassan  a similar Hadith.",
                "href": "https://thaqalayn.net/hadith/1/4/43/1",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "44": {
                "hadithNumber": "Hadith #1",
                "title": "Al-Kafi - Volume 1: The Imams know all the knowledge that has come to the angels, the prophets and the Messenger",
                "arabicText": "1ـ عَلِيُّ بْنُ مُحَمَّدٍ وَمُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ شَمُّونٍ عَنْ عَبْدِ الله بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ الله بْنِ الْقَاسِمِ عَنْ سَمَاعَةَ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ إِنَّ لله تَبَارَكَ وَتَعَالَى عِلْمَيْنِ عِلْماً أَظْهَرَ عَلَيْهِ مَلائِكَتَهُ وَأَنْبِيَاءَهُ وَرُسُلَهُ فَمَا أَظْهَرَ عَلَيْهِ مَلائِكَتَهُ وَرُسُلَهُ وَأَنْبِيَاءَهُ فَقَدْ عَلِمْنَاهُ وَعِلْماً اسْتَأْثَرَ بِهِ فَإِذَا بَدَا لله فِي شَيْ‏ءٍ مِنْهُ أَعْلَمَنَا ذَلِكَ وَعَرَضَ عَلَى الائِمَّةِ الَّذِينَ كَانُوا مِنْ قَبْلِنَا.\r\n عَلِيُّ بْنُ مُحَمَّدٍ وَمُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُوسَى بْنِ الْقَاسِمِ وَمُحَمَّدُ بْنُ يَحْيَى عَنِ الْعَمْرَكِيِّ بْنِ عَلِيٍّ جَمِيعاً عَنْ عَلِيِّ بْنِ جَعْفَرٍ عَنْ أَخِيهِ مُوسَى بْنِ جَعْفَرٍ (عَلَيْهما السَّلام) مِثْلَهُ.",
                "englishText": " 1. Ali ibn Muhammad and Muhammad ibn al-Hassan from Sahl ibn Ziyad from Muhammad ibn al-Hassan ibn Shammun from ‘Abdallah ibn ‘Abd al-Rahman from ‘Abdallah ibn al-Qasim from Sama‘a from abu ‘Abdallah  who has said the following. “Allah, the Most Holy, the Most High, has two kinds of knowledge. One kind is that which is revealed to the angels, the prophets the Messenger of Allah. Whatever is revealed to the angels, the Messenger of Allah and the prophets, is known to us also. The other is the kind which is exclusively for Allah. When Allah wants to make public anything from it is taught to us first and it is presented to the Imams before us also.” Ali ibn Muhammad and Muhammad ibn al-Hassan have narrated from Sahl ibn Ziyad from Musa ibn al-Qasim and Muhammad ibn Yahya from al-‘Amrakiy ibn Ali all of them from Ali ibn Ja‘far from his brother Musa ibn Ja‘far  a similar Hadith.",
                "href": "https://thaqalayn.net/hadith/1/4/44/1",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "52": {
                "hadithNumber": "Hadith #1",
                "title": "Al-Kafi - Volume 1: Giving Charge of the Religious matters to the Messenger of Allah (s.a.) and to the Imams (a.s.)",
                "arabicText": "1ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ أَبِي زَاهِرٍ عَنْ عَلِيِّ بْنِ إِسْمَاعِيلَ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ أَبِي إِسْحَاقَ النَّحْوِيِّ قَالَ دَخَلْتُ عَلَى أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) فَسَمِعْتُهُ يَقُولُ إِنَّ الله عَزَّ وَجَلَّ أَدَّبَ نَبِيَّهُ عَلَى مَحَبَّتِهِ فَقَالَ وَإِنَّكَ لَعَلى‏ خُلُقٍ عَظِيمٍ ثُمَّ فَوَّضَ إِلَيْهِ فَقَالَ عَزَّ وَجَلَّ وَما آتاكُمُ الرَّسُولُ فَخُذُوهُ وَما نَهاكُمْ عَنْهُ فَانْتَهُوا وَقَالَ عَزَّ وَجَلَّ مَنْ يُطِعِ الرَّسُولَ فَقَدْ أَطاعَ الله قَالَ ثُمَّ قَالَ وَإِنَّ نَبِيَّ الله فَوَّضَ إِلَى عَلِيٍّ وَائْتَمَنَهُ فَسَلَّمْتُمْ وَجَحَدَ النَّاسُ فَوَ الله لَنُحِبُّكُمْ أَنْ تَقُولُوا إِذَا قُلْنَا وَأَنْ تَصْمُتُوا إِذَا صَمَتْنَا وَنَحْنُ فِيمَا بَيْنَكُمْ وَبَيْنَ الله عَزَّ وَجَلَّ مَا جَعَلَ الله لاحَدٍ خَيْراً فِي خِلافِ أَمْرِنَا.\r\n عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ أَبِي إِسْحَاقَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ (عَلَيْهِ السَّلام) يَقُولُ ثُمَّ ذَكَرَ نَحْوَهُ.",
                "englishText": " 1. Muhammad ibn Yahya has narrated from Ahmad ibn abu Zahir from Ali ibn Isma‘il from Safwan ibn Yahya from ‘Asim ibn Humayd from abu Ishaq al-Nahwi who has said that he went see abu ‘Abdallah  and heard him say the following. “Allah, the Most Holy, the Most High, discipline and education His Messenger with His and said, “You certainly possess a great degree of moral discipline and education.” (64:4) He then let him be in charge as He, the Most Holy, the Most High, has said, “. .whatever the Messenger brings to you, you must take it (obey) and whatever he prohibits you, you must desist from. .” (59:7) Allah, the Most Holy, the Most High, has said, “. . whoever obeys the Messenger, he has obeyed Allah. .” (4:80)” The narrator has said that then the Imam  said, “The Prophet of Allah then let Ali and the Imams be the in charge (of the religious matters) and you then acknowledged it while others denied it. I swear by Allah, we love you to say when we say and remain silent when we remain silent. We are between you and Allah, the Most Holy, the Most High. Allah has not placed any goodness in the opposition to us.” A number of our people has narrated from Ahmad ibn Muhammad from abu Najran from ‘Asim ibn Humayd from abu Ishaq who has said that heard abu Ja‘far  say the following. He cited a hadith similar to the above one.",
                "href": "https://thaqalayn.net/hadith/1/4/52/1",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "57": {
                "hadithNumber": "Hadith #3",
                "title": "Al-Kafi - Volume 1: The Time When the Imam Learns the Knowledge of the Imam before him (a.s.)",
                "arabicText": " 3ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ قُلْتُ لَهُ الامَامُ مَتَى يَعْرِفُ إِمَامَتَهُ وَيَنْتَهِي الامْرُ إِلَيْهِ قَالَ فِي آخِرِ دَقِيقَةٍ مِنْ حَيَاةِ الاوَّلِ.",
                "englishText": " 3. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Ya’qub ibn Yazid from Ali ibn Asbat from certain persons of his people who has said that I asked abu ‘Abdallah  the following. “When does the Imam come to know that he has become the Imam and position is transferred to him?” The Imam  replied, “At the last minute of the life of the preceding Imam .”",
                "href": "https://thaqalayn.net/hadith/1/4/57/3",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "60": {
                "hadithNumber": "Hadith #2",
                "title": "Al-Kafi - Volume 1: The Imamat (Leadership with Divine Authority) is a Covenant from Allah, the Most Holy, the Most High, Delivered as such by the preceding Imam to the succeeding Imam (a.s.) one after the other",
                "arabicText": "2ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ عَمْرِو بْنِ الاشْعَثِ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) يَقُولُ أَ تَرَوْنَ الْمُوصِيَ مِنَّا يُوصِي إِلَى مَنْ يُرِيدُ لا وَالله وَلَكِنْ عَهْدٌ مِنَ الله وَرَسُولِهِ (صَلَّى اللهُ عَلَيْهِ وَآلِه) لِرَجُلٍ فَرَجُلٍ حَتَّى يَنْتَهِيَ الامْرُ إِلَى صَاحِبِهِ.\r\n الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ مِنْهَالٍ عَنْ عَمْرِو بْنِ الاشْعَثِ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) مِثْلَهُ.",
                "englishText": " 2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from Ibn Abi ‘Umayr from Hammad ibn ‘Uthman from ‘Amr ibn al-Ash‘ath who said: I heard Abu ‘Abdallah  say the following: “Do you think that a testator of us chooses whoever he wants as the executor of his will? No, I swear by Allah, it is not so. It is a covenant from Allah and His Messenger to a man and then to the next man until the matter is delivered to its rightful owner.” Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Muhammad ibn Jumhur from Hammad ibn ‘Isa from Minhal from ‘Amr ibn al-Ash‘ath from Abu ‘Abdallah  a similar hadith.",
                "href": "https://thaqalayn.net/hadith/1/4/60/2",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "61": {
                "hadithNumber": "Hadith #5",
                "title": "Al-Kafi - Volume 1: The Imams (a.s.) never did and would not do anything except because of the covenant of Allah, the Most Holy, the Most High, and a command from Him and they did not go beyond such limits",
                "arabicText": " 5ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ الله بْنِ عَبْدِ الرَّحْمَنِ الاصَمِّ عَنْ أَبِي عَبْدِ الله الْبَزَّازِ عَنْ حَرِيزٍ قَالَ قُلْتُ لابِي عَبْدِ الله (عَلَيْهِ السَّلام) جُعِلْتُ فِدَاكَ مَا أَقَلَّ بَقَاءَكُمْ أَهْلَ الْبَيْتِ وَأَقْرَبَ آجَالَكُمْ بَعْضَهَا مِنْ بَعْضٍ مَعَ حَاجَةِ النَّاسِ إِلَيْكُمْ فَقَالَ إِنَّ لِكُلِّ وَاحِدٍ مِنَّا صَحِيفَةً فِيهَا مَا يَحْتَاجُ إِلَيْهِ أَنْ يَعْمَلَ بِهِ فِي مُدَّتِهِ فَإِذَا انْقَضَى مَا فِيهَا مِمَّا أُمِرَ بِهِ عَرَفَ أَنَّ أَجَلَهُ قَدْ حَضَرَ فَأَتَاهُ النَّبِيُّ (صَلَّى اللهُ عَلَيْهِ وَآلِه) يَنْعَى إِلَيْهِ نَفْسَهُ وَأَخْبَرَهُ بِمَا لَهُ عِنْدَ الله وَأَنَّ الْحُسَيْنَ (عَلَيْهِ السَّلام) قَرَأَ صَحِيفَتَهُ الَّتِي أُعْطِيَهَا وَفُسِّرَ لَهُ مَا يَأْتِي بِنَعْيٍ وَبَقِيَ فِيهَا أَشْيَاءُ لَمْ تُقْضَ فَخَرَجَ لِلْقِتَالِ وَكَانَتْ تِلْكَ الامُورُ الَّتِي بَقِيَتْ أَنَّ الْمَلائِكَةَ سَأَلَتِ الله فِي نُصْرَتِهِ فَأَذِنَ لَهَا وَمَكَثَتْ تَسْتَعِدُّ لِلْقِتَالِ وَتَتَأَهَّبُ لِذَلِكَ حَتَّى قُتِلَ فَنَزَلَتْ وَقَدِ انْقَطَعَتْ مُدَّتُهُ وَقُتِلَ (عَلَيْهِ السَّلام) فَقَالَتِ الْمَلائِكَةُ يَا رَبِّ أَذِنْتَ لَنَا فِي الانْحِدَارِ وَأَذِنْتَ لَنَا فِي نُصْرَتِهِ فَانْحَدَرْنَا وَقَدْ قَبَضْتَهُ فَأَوْحَى الله إِلَيْهِمْ أَنِ الْزَمُوا قَبْرَهُ حَتَّى تَرَوْهُ وَقَدْ خَرَجَ فَانْصُرُوهُ وَابْكُوا عَلَيْهِ وَعَلَى مَا فَاتَكُمْ مِنْ نُصْرَتِهِ فَإِنَّكُمْ قَدْ خُصِّصْتُمْ بِنُصْرَتِهِ وَبِالْبُكَاءِ عَلَيْهِ فَبَكَتِ الْمَلائِكَةُ تَعَزِّياً وَحُزْناً عَلَى مَا فَاتَهُمْ مِنْ نُصْرَتِهِ فَإِذَا خَرَجَ يَكُونُونَ أَنْصَارَهُ.",
                "englishText": " 5. Ali in Ibrahim has narrated from his father from ‘Abdallah ibn ‘Abd al-Rahman al-’Assam from abu ‘Abdallah al-Bazzaz from Hariz who has said the following. “I said to abu ‘Abdallah , “May Allah take my soul in service for your cause, why is it that you members of the family of the Prophet (s.a) live such a short lives? Your deaths are so close and soon after the other Imam even though people need you so much?” The Imam  said, “For everyone of us there is a document that contains what he needs to do within his time. When his assignment according to the commandments therein is complete he learns that his time of death has arrived. The Prophet (s.a) comes to him to give the news of his death and informs him of all that is for him with Allah. Al-Husayn  read the document that was given to him and the news of his death was explained to him, however, certain things were not yet complete. He came out to face the enemy and of the matters that were not yet complete was that the angels had asked Allah to grant them permission to support al-Husayn  against his enemies which He granted them. They delayed to ready themselves and prepare to fight until he was murdered. They descended but his time was over and was killed already. The angels said, “Lord, You granted us permission to descend and to help him. We descended but You have already taken his soul away. Allah then sent them inspiration that said, “Remain on his grave until you see him come out then help him. Weep for him and for your loss of the opportunity to provide him help and support. You were certainly assigned for his support and help and to weep for him. The angels then wept in mourning and sadness for their loss of the opportunity to help and support to him. When he will come out they will be of his helpers.”",
                "href": "https://thaqalayn.net/hadith/1/4/61/5",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "63": {
                "hadithNumber": "Hadith #1",
                "title": "Al-Kafi - Volume 1: Proof that Imamat (leadership with Divine Authority) Continues in the Descendents of the Preceding Imam but not through his Brother or Paternal Uncle or other such Relatives",
                "arabicText": " 1ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنِ الْحُسَيْنِ بْنِ ثُوَيْرِ بْنِ أَبِي فَاخِتَةَ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ لا تَعُودُ الامَامَةُ فِي أَخَوَيْنِ بَعْدَ الْحَسَنِ وَالْحُسَيْنِ أَبَداً إِنَّمَا جَرَتْ مِنْ عَلِيِّ بْنِ الْحُسَيْنِ كَمَا قَالَ الله تَبَارَكَ وَتَعَالَى وَأُولُوا الارْحامِ بَعْضُهُمْ أَوْلى‏ بِبَعْضٍ فِي كِتابِ الله فَلا تَكُونُ بَعْدَ عَلِيِّ بن الحسين (عَلَيْهما السَّلام) إِلا فِي الاعْقَابِ وَأَعْقَابِ الاعْقَابِ.",
                "englishText": " 1. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from al-Husayn ibn Thuwayr ibn abu Fakhita from abu‘Abdallah  who has said the following. “Imamat (Leadership with Divine Authority) will never go to two brothers after al-Hassan and al-Husayn . It has continued from Ali ibn al-Husayn  as Allah, the Most Holy, the Most High has said, “The relatives are closer to each other, according to the Book of God, . .” (33:6) After Imam Ali ibn al-Husayn  will only be found in the descendents one after the other.”",
                "href": "https://thaqalayn.net/hadith/1/4/63/1",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "66": {
                "hadithNumber": "Hadith #6",
                "title": "Al-Kafi - Volume 1: Tacit and Explicit Testimony as proof of al-Hassan ibn Ali’s (a.s.) Divine Authority over the people after Amir al-Mu’minin Ali (a.s.)",
                "arabicText": " 6ـ الْحُسَيْنُ بْنُ الْحَسَنِ الْحَسَنِيُّ رَفَعَهُ وَمُحَمَّدُ بْنُ الْحَسَنِ عَنْ إِبْرَاهِيمَ بْنِ إِسْحَاقَ الاحْمَرِيِّ رَفَعَهُ قَالَ لَمَّا ضُرِبَ أَمِيرُ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) حَفَّ بِهِ الْعُوَّادُ وَقِيلَ لَهُ يَا أَمِيرَ الْمُؤْمِنِينَ أَوْصِ فَقَالَ اثْنُوا لِي وِسَادَةً ثُمَّ قَالَ الْحَمْدُ لله حَقَّ قَدْرِهِ مُتَّبِعِينَ أَمْرَهُ وَأَحْمَدُهُ كَمَا أَحَبَّ وَلا إِلَهَ إِلا الله الْوَاحِدُ الاحَدُ الصَّمَدُ كَمَا انْتَسَبَ أَيُّهَا النَّاسُ كُلُّ امْرِئٍ لاقٍ فِي فِرَارِهِ مَا مِنْهُ يَفِرُّ وَالاجَلُ مَسَاقُ النَّفْسِ إِلَيْهِ وَالْهَرَبَ مِنْهُ مُوَافَاتُهُ كَمْ أَطْرَدْتُ الايَّامَ أَبْحَثُهَا عَنْ مَكْنُونِ هَذَا الامْرِ فَأَبَى الله عَزَّ ذِكْرُهُ إِلا إِخْفَاءَهُ هَيْهَاتَ عِلْمٌ مَكْنُونٌ أَمَّا وَصِيَّتِي فَأَنْ لا تُشْرِكُوا بِالله جَلَّ ثَنَاؤُهُ شَيْئاً وَمُحَمَّداً (صَلَّى اللهُ عَلَيْهِ وَآلِه) فَلا تُضَيِّعُوا سُنَّتَهُ أَقِيمُوا هَذَيْنِ الْعَمُودَيْنِ وَأَوْقِدُوا هَذَيْنِ الْمِصْبَاحَيْنِ وَخَلاكُمْ ذَمٌّ مَا لَمْ تَشْرُدُوا حُمِّلَ كُلُّ امْرِئٍ مَجْهُودَهُ وَخُفِّفَ عَنِ الْجَهَلَةِ رَبٌّ رَحِيمٌ وَإِمَامٌ عَلِيمٌ وَدِينٌ قَوِيمٌ أَنَا بِالامْسِ صَاحِبُكُمْ وَأَنَا الْيَوْمَ عِبْرَةٌ لَكُمْ وَغَداً مُفَارِقُكُمْ إِنْ تَثْبُتِ الْوَطْأَةُ فِي هَذِهِ الْمَزَلَّةِ فَذَاكَ الْمُرَادُ وَإِنْ تَدْحَضِ الْقَدَمُ فَإِنَّا كُنَّا فِي أَفْيَاءِ أَغْصَانٍ وَذَرَى رِيَاحٍ وَتَحْتَ ظِلِّ غَمَامَةٍ اضْمَحَلَّ فِي الْجَوِّ مُتَلَفِّقُهَا وَعَفَا فِي الارْضِ مَحَطُّهَا وَإِنَّمَا كُنْتُ جَاراً جَاوَرَكُمْ بَدَنِي أَيَّاماً وَسَتُعْقَبُونَ مِنِّي جُثَّةً خَلاءً سَاكِنَةً بَعْدَ حَرَكَةٍ وَكَاظِمَةً بَعْدَ نُطْقٍ لِيَعِظَكُمْ هُدُوِّي وَخُفُوتُ إِطْرَاقِي وَسُكُونُ أَطْرَافِي فَإِنَّهُ أَوْعَظُ لَكُمْ مِنَ النَّاطِقِ الْبَلِيغِ وَدَّعْتُكُمْ وَدَاعَ مُرْصِدٍ لِلتَّلاقِي غَداً تَرَوْنَ أَيَّامِي وَيَكْشِفُ الله عَزَّ وَجَلَّ عَنْ سَرَائِرِي وَتَعْرِفُونِّي بَعْدَ خُلُوِّ مَكَانِي وَقِيَامِ غَيْرِي مَقَامِي إِنْ أَبْقَ فَأَنَا وَلِيُّ دَمِي وَإِنْ أَفْنَ فَالْفَنَاءُ مِيعَادِي وَإِنْ أَعْفُ فَالْعَفْوُ لِي قُرْبَةٌ وَلَكُمْ حَسَنَةٌ فَاعْفُوا وَاصْفَحُوا أَ لا تُحِبُّونَ أَنْ يَغْفِرَ الله لَكُمْ فَيَا لَهَا حَسْرَةً عَلَى كُلِّ ذِي غَفْلَةٍ أَنْ يَكُونَ عُمُرُهُ عَلَيْهِ حُجَّةً أَوْ تُؤَدِّيَهُ أَيَّامُهُ إِلَى شِقْوَةٍ جَعَلَنَا الله وَإِيَّاكُمْ مِمَّنْ لا يَقْصُرُ بِهِ عَنْ طَاعَةِ الله رَغْبَةٌ أَوْ تَحُلُّ بِهِ بَعْدَ الْمَوْتِ نَقِمَةٌ فَإِنَّمَا نَحْنُ لَهُ وَبِهِ ثُمَّ أَقْبَلَ عَلَى الْحَسَنِ (عَلَيْهِ السَّلام) فَقَالَ يَا بُنَيَّ ضَرْبَةً مَكَانَ ضَرْبَةٍ وَلا تَأْثَمْ.",
                "englishText": " 6. Al-Husayn ibn al-Hasan al-Hassani has narrated in a Marfu‘ manner, rafa‘ahu, and Muhammad ibn al-Hassan from Ibrahim ibn Ishaq al-Ahmari has narrated in a marfu‘ manner, (rafa‘ahu) the following: “When Amir al-Mu’minin Ali  was injured the visitors crowded around him saying, “O Amir al-Mu’minin Ali , (please, grant us) your directive will.' The Imam then said, 'You must fold the pillow for me (to help me sit so I can speak).' He then said, 'All praise belongs to Allah, as He is worthy of it. We follow (obey) His commands. I praise Him just as He has loved it. No one deserves to be worshipped and obeyed except Allah, Who is One, the only One. The Self-sufficient is His own description of His Ownself. O people, every man, in his running away, comes face to face with the very thing from which he runs away so badly (namely his death). The appointed time (to die) is the driver of the soul to such time. In other words, running away from death is rushing to find it. How many days have come and gone in which I searched for the secret in this matter, however, Allah, the Majestic, the Glorious, disdains to do anything else, but to keep it secret. It certainly is beyond comprehension; it is hidden knowledge. Of my directive will to you is that you must not consider anything similar to Allah, Great is Whose praise. You must not disregard the Sunnah (traditions) of Prophet Muhammad ﷺ. Keep these two pillars straight and light up these two beacons. You will not face any blame as long as you do not disperse (but remain united). Every man is held responsible for what he assiduously gains. Ignorant, (the lay) people's burden is held light and reduced. The Lord is Merciful, the Imam is knowledgeable and religion is a constructive system. Yesterday I was your companion, today (I am) a lesson (one's death is the best lesson) for you to learn and tomorrow I will depart from you. If one's feet can remain firm at this slippery position (despite the fragility of life) then that is the goal. However, if the feet wavered (and failed to hang on to life) it is because we live under the short-lived shadows of the branches, in the blowing winds, under the thin cover of dissipating clouds in the air and disappearing traces (shrinking resources) on the land. \"I was your neighbor that lived along with you with my body for a number of days. You will soon escort my dead body (to the grave). It will be a motionless body that once moved, and a silent one that once spoke (so sweetly). My silence, my closed eyes and my motionless limbs must be thought of as the best preachers. They are far better preachers to you than an eloquent orator is. I have said farewell to you as the one who expects reunion. Tomorrow you will see my days and Allah, the Most Holy, the Most High, will reveal my secrets. You will know me better when you find my place vacant and see others holding my position. If I survive I will be the authority for my own self but if I die then death is my destination. If I forgive (my assassin) then forgiveness is a means of getting closer (to Allah) and for you it is a good deed. You must forgive and ignore. Do you not like it that Allah will forgive you? How great is the sorrow for the neglectful one, whose life will be testimony for his own condemnation or his days lead him to misfortune. May Allah place you and us among those who do not fall short in life in matters of obedience to Allah due to their desire (to obey Him) or for fear of suffering after death. We are only for Him and with Him.' Then he turned to al-Hassan  and said, 'My son, one strike for one strike, you will not be in sin.'\"",
                "href": "https://thaqalayn.net/hadith/1/4/66/6",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "69": {
                "hadithNumber": "Hadith #0",
                "title": "Al-Kafi - Volume 1: Tacit and Explicit Testimony as proof of abu Ja‘far’s (a.s.) Divine Authority over the people after Ali ibn al-Husayn (a.s.)",
                "arabicText": " 1 ـ أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ أَبِي الْقَاسِمِ الْكُوفِيِّ عَنْ مُحَمَّدِ بْنِ سَهْلٍ عَنْ إِبْرَاهِيمَ بْنِ أَبِي الْبِلادِ عَنْ إِسْمَاعِيلَ بْنِ مُحَمَّدِ بْنِ عَبْدِ الله بْنِ عَلِيِّ بْنِ الْحُسَيْنِ عَنْ ابي جعفر (عَلَيْهِ السَّلام) قَالَ لَمَّا حَضَرَ عَلِيَّ بن الحسين (عَلَيْهما السَّلام) الْوَفَاةُ قَبْلَ ذَلِكَ أَخْرَجَ سَفَطاً أَوْ صُنْدُوقاً عِنْدَهُ فَقَالَ يَا مُحَمَّدُ احْمِلْ هَذَا الصُّنْدُوقَ قَالَ فَحَمَلَ بَيْنَ أَرْبَعَةٍ فَلَمَّا تُوُفِّيَ جَاءَ إِخْوَتُهُ يَدَّعُونَ مَا فِي الصُّنْدُوقِ فَقَالُوا أَعْطِنَا نَصِيبَنَا فِي الصُّنْدُوقِ فَقَالَ وَالله مَا لَكُمْ فِيهِ شَيْ‏ءٌ وَلَوْ كَانَ لَكُمْ فِيهِ شَيْ‏ءٌ مَا دَفَعَهُ إِلَيَّ وَكَانَ فِي الصُّنْدُوقِ سِلاحُ رَسُولِ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) وَكُتُبُهُ.",
                "englishText": "",
                "href": "https://thaqalayn.net/hadith/1/4/69/0",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "69": {
                "hadithNumber": "Hadith #4",
                "title": "Al-Kafi - Volume 1: Tacit and Explicit Testimony as proof of abu Ja‘far’s (a.s.) Divine Authority over the people after Ali ibn al-Husayn (a.s.)",
                "arabicText": " 4ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ عَبْدِ الْكَرِيمِ بْنِ عَمْرٍو عَنِ ابْنِ أَبِي يَعْفُورٍ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) يَقُولُ إِنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ كَتَبَ إِلَى ابْنِ حَزْمٍ ثُمَّ ذَكَرَ مِثْلَهُ إِلا أَنَّهُ قَالَ بَعَثَ ابْنُ حَزْمٍ إِلَى زَيْدِ بْنِ الْحَسَنِ وَكَانَ أَكْبَرَ مِنْ أَبِي (عَلَيْهِ السَّلام )",
                "englishText": " عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ مِثْلَهُ 4. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from al-Hassan ibn Ali al-Washsha’ from ‘Abd al-Karim ibn ‘Amr from ibn abu Ya‘fur who has said that he heard abu ‘Abdallah  say the following. “ ‘Umar ibn ‘Abd al-‘Aziz wrote ibn Hazm. He then have narrated a hadith similar to the above one except that he has said, “Ibn Hazm sent to Zayd ibn al-Hassan who was older than my father.” A number of our people has narrated from Ahmad ibn Muhammad from al-Washsha’ a similar hadith.",
                "href": "https://thaqalayn.net/hadith/1/4/69/4",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "72": {
                "hadithNumber": "Hadith #1",
                "title": "Al-Kafi - Volume 1: Tacit and Explicit Testimony as proof of abu al-Hassan al-Rida’s (a.s.) Divine Authority over the people after abu al-Hassan Musa (a.s.)",
                "arabicText": "1ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ الْحُسَيْنِ بْنِ نُعَيْمٍ الصَّحَّافِ قَالَ كُنْتُ أَنَا وَهِشَامُ بْنُ الْحَكَمِ وَعَلِيُّ بْنُ يَقْطِينٍ بِبَغْدَادَ فَقَالَ عَلِيُّ بْنُ يَقْطِينٍ كُنْتُ عِنْدَ الْعَبْدِ الصَّالِحِ جَالِساً فَدَخَلَ عَلَيْهِ ابْنُهُ عَلِيٌّ فَقَالَ لِي يَا عَلِيَّ بْنَ يَقْطِينٍ هَذَا عَلِيٌّ سَيِّدُ وُلْدِي أَمَا إِنِّي قَدْ نَحَلْتُهُ كُنْيَتِي فَضَرَبَ هِشَامُ بْنُ الْحَكَمِ بِرَاحَتِهِ جَبْهَتَهُ ثُمَّ قَالَ وَيْحَكَ كَيْفَ قُلْتَ فَقَالَ عَلِيُّ بْنُ يَقْطِينٍ سَمِعْتُ وَالله مِنْهُ كَمَا قُلْتُ فَقَالَ هِشَامٌ أَخْبَرَكَ أَنَّ الامْرَ فِيهِ مِنْ بَعْدِهِ.\r\n أَحْمَدُ بْنُ مِهْرَانَ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنِ الْحُسَيْنِ بْنِ نُعَيْمٍ الصَّحَّافِ قَالَ كُنْتُ عِنْدَ الْعَبْدِ الصَّالِحِ وَفِي نُسْخَةِ الصَّفْوَانِيِّ قَالَ كُنْتُ أَنَا ثُمَّ ذَكَرَ مِثْلَهُ.",
                "englishText": "1. Muhammad ibn Yabya has narrated from Ahmad ibn Muhammad from ibn Mahbub from al-Husayn ibn Nu‘aym al-Sahhaf who has said the following. “I, Hisham ibn al-Hakam and ali ibn Yaqtin were in Baghdad. Ali ibn Yaqtin said, ‘Iwas in the presence of the pious servant (of Allah) and his son Ali came. He then said to me, “O Ali ibn Yaqtin, this the sayyid (leader) of my children and have gifted him with my own Kunya. (the Arabic expression used to address people, ‘O father of so and so, etc.). Hisham tapped his forehead with his palm and said, “fie up on you how did you say that? Ali ibn Yaqtin said, “I heard, by Allah, from him just as I said.” Hisham then said, “I can tell you that the task (Leadership with Divine Authority) will be with him after him.”  Ahmad ibn Mihran has narrated from Muhammad ibn Ali from al-Husayn ibn Nu‘aym al-Sahhaf who has said the following. “Once I was in the presence of the pious servant (of Allah).In al-Safwani manuscript it says, “I was then he relates the rest of the above hadith.”",
                "href": "https://thaqalayn.net/hadith/1/4/72/1",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "87": {
                "hadithNumber": "Hadith #0",
                "title": "Al-Kafi - Volume 1: The Case of those who would Die without having an Imam from the Imams of Guidance",
                "arabicText": "",
                "englishText": " Part of Previous Chapter",
                "href": "https://thaqalayn.net/hadith/1/4/87/0",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "94": {
                "hadithNumber": "Hadith #3",
                "title": "Al-Kafi - Volume 1: The Creation of the bodies, spirits and the Hearts of the Imam (a.s.)",
                "arabicText": " 3ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ عَلِيِّ بْنِ حَسَّانَ وَمُحَمَّدُ بْنُ يَحْيَى عَنْ سَلَمَةَ بْنِ الْخَطَّابِ وَغَيْرِهِ عَنْ عَلِيِّ بْنِ حَسَّانَ عَنْ عَلِيِّ بْنِ عَطِيَّةَ عَنْ عَلِيِّ بْنِ رِئَابٍ رَفَعَهُ إِلَى أَمِيرِ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) إِنَّ لله نَهَراً دُونَ عَرْشِهِ وَدُونَ النَّهَرِ الَّذِي دُونَ عَرْشِهِ نُورٌ نَوَّرَهُ وَإِنَّ فِي حَافَتَيِ النَّهَرِ رُوحَيْنِ مَخْلُوقَيْنِ رُوحُ الْقُدُسِ وَرُوحٌ مِنْ أَمْرِهِ وَإِنَّ لله عَشْرَ طِينَاتٍ خَمْسَةً مِنَ الْجَنَّةِ وَخَمْسَةً مِنَ الارْضِ فَفَسَّرَ الْجِنَانَ وَفَسَّرَ الارْضَ ثُمَّ قَالَ مَا مِنْ نَبِيٍّ وَلا مَلَكٍ مِنْ بَعْدِهِ جَبَلَهُ إِلا نَفَخَ فِيهِ مِنْ إِحْدَى الرُّوحَيْنِ وَجَعَلَ النَّبِيَّ (صَلَّى اللهُ عَلَيْهِ وَآلِه) مِنْ إِحْدَى الطِّينَتَيْنِ قُلْتُ لابِي الْحَسَنِ الاوَّلِ (عَلَيْهِ السَّلام) مَا الْجَبْلُ فَقَالَ الْخَلْقُ غَيْرَنَا أَهْلَ الْبَيْتِ فَإِنَّ الله عَزَّ وَجَلَّ خَلَقَنَا مِنَ الْعَشْرِ طِينَاتٍ وَنَفَخَ فِينَا مِنَ الرُّوحَيْنِ جَمِيعاً فَأَطْيِبْ بِهَا طِيباً وَرَوَى غَيْرُهُ عَنْ أَبِي الصَّامِتِ قَالَ طِينُ الْجِنَانِ جَنَّةُ عَدْنٍ وَجَنَّةُ الْمَأْوَى وَجَنَّةُ النَّعِيمِ وَالْفِرْدَوْسُ وَالْخُلْدُ وَطِينُ الارْضِ مَكَّةُ وَالْمَدِينَةُ وَالْكُوفَةُ وَبَيْتُ الْمَقْدِسِ وَالْحَائِرُ.",
                "englishText": " 3. Ali ibn Ibrahim has narrated from Ali ibn Hassa’n and Muhammad ibn Yahya from Salma ibn al-Khattab and others from Ali ibn Hassa’n from Ali ibn ‘Atiyya from Ali ibn Ri’ab who has narrated it in a marfu‘ manner from Amir al-Mu’minin  who has said the following. “Allah has a canal below His Throne. Below the canal that is below His Throne is a light that has lighted it up. On both rims of the canal there are two created spirits. One is the holy Spirit and the other is the Spirit from His command. Allah has ten (kinds) of clay. Five from paradise and five from earth.” He then explained the earth and the Paradise. Then he said, “There is no prophet or angel that He has formed (Jabala) but that He has blown into them from one of those spirits. He has formed the Prophet (s.a) from one of those clays.” The narrator has said, “I asked abu al-Hassan the 1st , “What is Jabala?” He said, “It is the creatures exclusive of us Ahl al-Bayt (family of Prophet Muhammad). Allah, the Most Majestic, the Most gracious, has created us from ten clays and has into us from both the Spirits and has added fragrance to fragrance.”",
                "href": "https://thaqalayn.net/hadith/1/4/94/3",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "108": {
                "hadithNumber": "Hadith #24",
                "title": "Al-Kafi - Volume 1: Enlightening Points Deduced from the Holy Quran about Leadership with Divine Authority)",
                "arabicText": " 24ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنِ النَّضْرِ بْنِ شُعَيْبٍ عَنْ خَالِدِ بْنِ مَادٍّ عَنْ مُحَمَّدِ بْنِ الْفَضْلِ عَنِ الثُّمَالِيِّ عَنْ ابي جعفر (عَلَيْهِ السَّلام) قَالَ أَوْحَى الله إِلَى نَبِيِّهِ (صَلَّى اللهُ عَلَيْهِ وَآلِه) فَاسْتَمْسِكْ بِالَّذِي أُوحِيَ إِلَيْكَ إِنَّكَ عَلى‏ صِراطٍ مُسْتَقِيمٍ قَالَ إِنَّكَ عَلَى وَلايَةِ عَلِيٍّ وَعَلِيٌّ هُوَ الصِّرَاطُ الْمُسْتَقِيمُ.",
                "englishText": " 24. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Nadr ibn Shu‘ayb from Khalid ibn Ma’dd from Muhammad ibn al-Fudayl from al-Thumali from abu Ja‘far  who has said the following. “Allah sent revelation to His prophet (s.a) in which He has said, “Follow devotedly that which is revealed to you. You are certainly on the right path.” (43:43) The Imam  said, “It is just as saying, ‘You have acknowledged the Leadership with Divine Authority of Ali  and Ali is on the right path.”",
                "href": "https://thaqalayn.net/hadith/1/4/108/24",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "108": {
                "hadithNumber": "Hadith #75",
                "title": "Al-Kafi - Volume 1: Enlightening Points Deduced from the Holy Quran about Leadership with Divine Authority)",
                "arabicText": " 75ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْحَكَمِ بْنِ بُهْلُولٍ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) فِي قَوْلِهِ تَعَالَى وَلَقَدْ أُوحِيَ إِلَيْكَ وَإِلَى الَّذِينَ مِنْ قَبْلِكَ لَئِنْ أَشْرَكْتَ لَيَحْبَطَنَّ عَمَلُكَ قَالَ يَعْنِي إِنْ أَشْرَكْتَ فِي الْوَلايَةِ غَيْرَهُ بَلِ الله فَاعْبُدْ وَكُنْ مِنَ الشَّاكِرِينَ يَعْنِي بَلِ الله فَاعْبُدْ بِالطَّاعَةِ وَكُنْ مِنَ الشَّاكِرِينَ أَنْ عَضَدْتُكَ بِأَخِيكَ وَابْنِ عَمِّكَ.",
                "englishText": " 75. Ali ibn Ibrahim has narrated from his father from al-Hakam ibn al-Buhlul from a man frm abu ‘Abdallah  about the words of Allah, the Most High. ““It has been revealed to you and to those who lived before you that if you consider other things equal to God, your deeds will be made devoid of all virtue. .” (39:65). The Imam  said, “It means equal in Wilaya.” “(Muhammad), You must worship God alone and give Him thanks.” (39:66). The Imam  said, “It means worship Allah through obedience and be thankful if I provided you support through your brother, your cousin.”",
                "href": "https://thaqalayn.net/hadith/1/4/108/75",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "108": {
                "hadithNumber": "Hadith #78",
                "title": "Al-Kafi - Volume 1: Enlightening Points Deduced from the Holy Quran about Leadership with Divine Authority)",
                "arabicText": " 78ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ سَيْفٍ عَنْ أَبِيهِ عَنْ عَمْرِو بْنِ حُرَيْثٍ قَالَ سَأَلْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) عَنْ قَوْلِ الله كَشَجَرَةٍ طَيِّبَةٍ أَصْلُها ثابِتٌ وَفَرْعُها فِي السَّماءِ قَالَ فَقَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) أَصْلُهَا وَأَمِيرُ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) فَرْعُهَا وَالائِمَّةُ مِنْ ذُرِّيَّتِهِمَا أَغْصَانُهَا وَعِلْمُ الائِمَّةِ ثَمَرَتُهَا وَشِيعَتُهُمُ الْمُؤْمِنُونَ وَرَقُهَا هَلْ فِيهَا فَضْلٌ قَالَ قُلْتُ لا وَالله قَالَ وَالله إِنَّ الْمُؤْمِنَ لَيُولَدُ فَتُورَقُ وَرَقَةٌ فِيهَا وَإِنَّ الْمُؤْمِنَ لَيَمُوتُ فَتَسْقُطُ وَرَقَةٌ مِنْهَا.",
                "englishText": " 78. A number of our people has narrated from Ahmad ibn Muhammad from Ali ibn Sayf from his father from ‘Amr ibn Harith who has said the following. “I asked abu ‘Abdallah  about the words of Allah. “. . a blessed tree which has firm roots and branches rising up into the sky.” (14:24) The Imam  said that the The Holy Prophet (s.a) said, “The root is Amir al-Mu’minin Ali  and the branches are the Imams from their (Amir al-Mu’minin  and The Holy Prophet (s.a) descendants and the knowledge of Imams stand for the fruits. Their faithful followers represent the leaves of such tree.” The Imam  asked, “Is there anything else in the tree?” I said, “No, there is nothing else there. The Imam  then said, “By Allah, when a faithful is given a child a leave grows in the tree and when a faithful dies a leave falls off the tree.”",
                "href": "https://thaqalayn.net/hadith/1/4/108/78",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "108": {
                "hadithNumber": "Hadith #88",
                "title": "Al-Kafi - Volume 1: Enlightening Points Deduced from the Holy Quran about Leadership with Divine Authority)",
                "arabicText": "88ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنِ ابْنِ مَحْبُوبٍ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي الْحَسَنِ الْمَاضِي (عَلَيْهِ السَّلام) قَالَ سَأَلْتُهُ عَنْ قَوْلِ الله عَزَّ وَجَلَّ يُرِيدُونَ لِيُطْفِؤُا نُورَ الله بِأَفْواهِهِمْ قَالَ يُرِيدُونَ لِيُطْفِئُوا وَلايَةَ أَمِيرِ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) بِأَفْوَاهِهِمْ قُلْتُ وَالله مُتِمُّ نُورِهِ قَالَ وَالله مُتِمُّ الامَامَةِ لِقَوْلِهِ عَزَّ وَجَلَّ الَّذِينَ فَ‏آمِنُوا بِالله وَرَسُولِهِ وَالنُّورِ الَّذِي أَنْزَلْنا فَالنُّورُ هُوَ الامَامُ قُلْتُ هُوَ الَّذِي أَرْسَلَ رَسُولَهُ بِالْهُدى‏ وَدِينِ الْحَقِّ قَالَ هُوَ الَّذِي أَمَرَ رَسُولَهُ بِالْوَلايَةِ لِوَصِيِّهِ وَالْوَلايَةُ هِيَ دِينُ الْحَقِّ قُلْتُ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ قَالَ يُظْهِرُهُ عَلَى جَمِيعِ الادْيَانِ عِنْدَ قِيَامِ الْقَائِمِ قَالَ يَقُولُ الله وَالله مُتِمُّ نُورِهِ وَلايَةِ الْقَائِمِ وَلَوْ كَرِهَ الْكافِرُونَ بِوَلايَةِ عَلِيٍّ قُلْتُ هَذَا تَنْزِيلٌ قَالَ نَعَمْ أَمَّا هَذَا الْحَرْفُ فَتَنْزِيلٌ وَأَمَّا غَيْرُهُ فَتَأْوِيلٌ قُلْتُ ذلِكَ بِأَنَّهُمْ آمَنُوا ثُمَّ كَفَرُوا قَالَ إِنَّ الله تَبَارَكَ وَتَعَالَى سَمَّى مَنْ لَمْ يَتَّبِعْ رَسُولَهُ فِي وَلايَةِ وَصِيِّهِ مُنَافِقِينَ وَجَعَلَ مَنْ جَحَدَ وَصِيَّهُ إِمَامَتَهُ كَمَنْ جَحَدَ مُحَمَّداً وَأَنْزَلَ بِذَلِكَ قُرْآناً فَقَالَ يَا مُحَمَّدُ إِذا جاءَكَ الْمُنافِقُونَ بِوَلايَةِ وَصِيِّكَ قالُوا نَشْهَدُ إِنَّكَ لَرَسُولُ الله وَالله يَعْلَمُ إِنَّكَ لَرَسُولُهُ وَالله يَشْهَدُ إِنَّ الْمُنافِقِينَ بِوَلايَةِ عَلِيٍّ لَكاذِبُونَ. اتَّخَذُوا أَيْمانَهُمْ جُنَّةً فَصَدُّوا عَنْ سَبِيلِ الله وَالسَّبِيلُ هُوَ الْوَصِيُّ إِنَّهُمْ ساءَ ما كانُوا يَعْمَلُونَ ذلِكَ بِأَنَّهُمْ آمَنُوا بِرِسَالَتِكَ وَكَفَرُوا بِوَلايَةِ وَصِيِّكَ فَطُبِعَ الله عَلى‏ قُلُوبِهِمْ فَهُمْ لا يَفْقَهُونَ قُلْتُ مَا مَعْنَى لا يَفْقَهُونَ قَالَ يَقُولُ لا يَعْقِلُونَ بِنُبُوَّتِكَ قُلْتُ وَإِذا قِيلَ لَهُمْ تَعالَوْا يَسْتَغْفِرْ لَكُمْ رَسُولُ الله قَالَ وَإِذَا قِيلَ لَهُمُ ارْجِعُوا إِلَى وَلايَةِ عَلِيٍّ يَسْتَغْفِرْ لَكُمُ النَّبِيُّ مِنْ ذُنُوبِكُمْ لَوَّوْا رُؤُسَهُمْ قَالَ الله وَرَأَيْتَهُمْ يَصُدُّونَ عَنْ وَلايَةِ عَلِيٍّ وَهُمْ مُسْتَكْبِرُونَ عَلَيْهِ ثُمَّ عَطَفَ الْقَوْلَ مِنَ الله بِمَعْرِفَتِهِ بِهِمْ فَقَالَ سَواءٌ عَلَيْهِمْ أَسْتَغْفَرْتَ لَهُمْ أَمْ لَمْ تَسْتَغْفِرْ لَهُمْ لَنْ يَغْفِرَ الله لَهُمْ إِنَّ الله لا يَهْدِي الْقَوْمَ الْفاسِقِينَ يَقُولُ الظَّالِمِينَ لِوَصِيِّكَ قُلْتُ أَ فَمَنْ يَمْشِي مُكِبًّا عَلى‏ وَجْهِهِ أَهْدى‏ أَمَّنْ يَمْشِي سَوِيًّا عَلى‏ صِراطٍ مُسْتَقِيمٍ قَالَ إِنَّ الله ضَرَبَ مَثَلَ مَنْ حَادَ عَنْ وَلايَةِ عَلِيٍّ كَمَنْ يَمْشِي عَلَى وَجْهِهِ لا يَهْتَدِي لامْرِهِ وَجَعَلَ مَنْ تَبِعَهُ سَوِيّاً عَلَى صِرَاطٍ مُسْتَقِيمٍ وَالصِّرَاطُ الْمُسْتَقِيمُ أَمِيرُ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) قَالَ قُلْتُ قَوْلُهُ إِنَّهُ لَقَوْلُ رَسُولٍ كَرِيمٍ قَالَ يَعْنِي جَبْرَئِيلَ عَنِ الله فِي وَلايَةِ علي (عَلَيْهِ السَّلام) قَالَ قُلْتُ وَما هُوَ بِقَوْلِ شاعِرٍ قَلِيلاً ما تُؤْمِنُونَ قَالَ قَالُوا إِنَّ مُحَمَّداً كَذَّابٌ عَلَى رَبِّهِ وَمَا أَمَرَهُ الله بِهَذَا فِي عَلِيٍّ فَأَنْزَلَ الله بِذَلِكَ قُرْآناً فَقَالَ إِنَّ وَلايَةَ عَلِيٍّ تَنْزِيلٌ مِنْ رَبِّ الْعالَمِينَ. وَلَوْ تَقَوَّلَ عَلَيْنا مُحَمَّدٌ بَعْضَ الاقاوِيلِ. لاخَذْنا مِنْهُ بِالْيَمِينِ. ثُمَّ لَقَطَعْنا مِنْهُ الْوَتِينَ ثُمَّ عَطَفَ الْقَوْلَ فَقَالَ إِنَّ وَلايَةَ عَلِيٍّ لَتَذْكِرَةٌ لِلْمُتَّقِينَ لِلْعَالَمِينَ وَإِنَّا لَنَعْلَمُ أَنَّ مِنْكُمْ مُكَذِّبِينَ. وَإِنَّ عَلِيّاً لَحَسْرَةٌ عَلَى الْكافِرِينَ. وَإِنَّ وَلايَتَهُ لَحَقُّ الْيَقِينِ. فَسَبِّحْ يَا مُحَمَّدُ بِاسْمِ رَبِّكَ الْعَظِيمِ يَقُولُ اشْكُرْ رَبَّكَ الْعَظِيمَ الَّذِي أَعْطَاكَ هَذَا الْفَضْلَ قُلْتُ قَوْلُهُ لَمَّا سَمِعْنَا الْهُدى‏ آمَنَّا بِهِ قَالَ الْهُدَى الْوَلايَةُ آمَنَّا بِمَوْلانَا فَمَنْ آمَنَ بِوَلايَةِ مَوْلاهُ فَلا يَخافُ بَخْساً وَلا رَهَقاً قُلْتُ تَنْزِيلٌ قَالَ لا تَأْوِيلٌ قُلْتُ.  قَوْلُهُ لا أَمْلِكُ لَكُمْ ضَرًّا وَلا رَشَداً قَالَ إِنَّ رَسُولَ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) دَعَا النَّاسَ إِلَى وَلايَةِ عَلِيٍّ فَاجْتَمَعَتْ إِلَيْهِ قُرَيْشٌ فَقَالُوا يَا مُحَمَّدُ أَعْفِنَا مِنْ هَذَا فَقَالَ لَهُمْ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) هَذَا إِلَى الله لَيْسَ إِلَيَّ فَاتَّهَمُوهُ وَخَرَجُوا مِنْ عِنْدِهِ فَأَنْزَلَ الله قُلْ إِنِّي لا أَمْلِكُ لَكُمْ ضَرًّا وَلا رَشَداً. قُلْ إِنِّي لَنْ يُجِيرَنِي مِنَ الله إِنْ عَصَيْتُهُ أَحَدٌ وَلَنْ أَجِدَ مِنْ دُونِهِ مُلْتَحَداً إِلا بَلاغاً مِنَ الله وَرِسَالاتِهِ فِي عَلِيٍّ قُلْتُ هَذَا تَنْزِيلٌ قَالَ نَعَمْ ثُمَّ قَالَ تَوْكِيداً وَمَنْ يَعْصِ الله وَرَسُولَهُ فِي وَلايَةِ عَلِيٍّ فَإِنَّ لَهُ نارَ جَهَنَّمَ خالِدِينَ فِيها أَبَداً قُلْتُ حَتَّى إِذا رَأَوْا ما يُوعَدُونَ فَسَيَعْلَمُونَ مَنْ أَضْعَفُ ناصِراً وَأَقَلُّ عَدَداً يَعْنِي بِذَلِكَ الْقَائِمَ وَأَنْصَارَهُ قُلْتُ وَاصْبِرْ عَلى‏ ما يَقُولُونَ قَالَ يَقُولُونَ فِيكَ وَاهْجُرْهُمْ هَجْراً جَمِيلاً. وَذَرْنِي يَا مُحَمَّدُ وَالْمُكَذِّبِينَ بِوَصِيِّكَ أُولِي النَّعْمَةِ وَمَهِّلْهُمْ قَلِيلاً قُلْتُ إِنَّ هَذَا تَنْزِيلٌ قَالَ نَعَمْ قُلْتُ لِيَسْتَيْقِنَ الَّذِينَ أُوتُوا الْكِتابَ قَالَ يَسْتَيْقِنُونَ أَنَّ الله وَرَسُولَهُ وَوَصِيَّهُ حَقٌّ قُلْتُ وَيَزْدادَ الَّذِينَ آمَنُوا إِيماناً قَالَ وَيَزْدَادُونَ بِوَلايَةِ الْوَصِيِّ إِيمَاناً قُلْتُ وَلا يَرْتابَ الَّذِينَ أُوتُوا الْكِتابَ وَالْمُؤْمِنُونَ قَالَ بِوَلايَةِ علي (عَلَيْهِ السَّلام) قُلْتُ مَا هَذَا الارْتِيَابُ قَالَ يَعْنِي بِذَلِكَ أَهْلَ الْكِتَابِ وَالْمُؤْمِنِينَ الَّذِينَ ذَكَرَ الله فَقَالَ وَلا يَرْتَابُونَ فِي الْوَلايَةِ قُلْتُ وَما هِيَ إِلا ذِكْرى‏ لِلْبَشَرِ قَالَ نَعَمْ وَلايَةُ علي (عَلَيْهِ السَّلام) قُلْتُ إِنَّها لاحْدَى الْكُبَرِ قَالَ الْوَلايَةُ قُلْتُ لِمَنْ شاءَ مِنْكُمْ أَنْ يَتَقَدَّمَ أَوْ يَتَأَخَّرَ قَالَ مَنْ تَقَدَّمَ إِلَى وَلايَتِنَا أُخِّرَ عَنْ سَقَرَ وَمَنْ تَأَخَّرَ عَنَّا تَقَدَّمَ إِلَى سَقَرَ إِلا أَصْحابَ الْيَمِينِ قَالَ هُمْ وَالله شِيعَتُنَا قُلْتُ لَمْ نَكُ مِنَ الْمُصَلِّينَ قَالَ إِنَّا لَمْ نَتَوَلَّ وَصِيَّ مُحَمَّدٍ وَالاوْصِيَاءَ مِنْ بَعْدِهِ وَلا يُصَلُّونَ عَلَيْهِمْ قُلْتُ فَما لَهُمْ عَنِ التَّذْكِرَةِ مُعْرِضِينَ قَالَ عَنِ الْوَلايَةِ مُعْرِضِينَ قُلْتُ كَلا إِنَّها تَذْكِرَةٌ قَالَ الْوَلايَةُ قُلْتُ قَوْلُهُ يُوفُونَ بِالنَّذْرِ قَالَ يُوفُونَ لله بِالنَّذْرِ الَّذِي أَخَذَ عَلَيْهِمْ فِي الْمِيثَاقِ مِنْ وَلايَتِنَا قُلْتُ إِنَّا نَحْنُ نَزَّلْنا عَلَيْكَ الْقُرْآنَ تَنْزِيلاً قَالَ بِوَلايَةِ علي (عَلَيْهِ السَّلام) تَنْزِيلاً قُلْتُ هَذَا تَنْزِيلٌ قَالَ نَعَمْ ذَا تَأْوِيلٌ قُلْتُ إِنَّ هذِهِ تَذْكِرَةٌ قَالَ الْوَلايَةُ قُلْتُ يُدْخِلُ مَنْ يَشاءُ فِي رَحْمَتِهِ قَالَ فِي وَلايَتِنَا قَالَ وَالظَّالِمِينَ أَعَدَّ لَهُمْ عَذاباً أَلِيماً أَ لا تَرَى أَنَّ الله يَقُولُ وَما ظَلَمُونا وَلكِنْ كانُوا أَنْفُسَهُمْ يَظْلِمُونَ قَالَ إِنَّ الله أَعَزُّ وَأَمْنَعُ مِنْ أَنْ يَظْلِمَ أَوْ يَنْسُبَ نَفْسَهُ إِلَى ظُلْمٍ وَلَكِنَّ الله خَلَطَنَا بِنَفْسِهِ فَجَعَلَ ظُلْمَنَا ظُلْمَهُ وَوَلايَتَنَا وَلايَتَهُ ثُمَّ أَنْزَلَ بِذَلِكَ قُرْآناً عَلَى نَبِيِّهِ فَقَالَ وَما ظَلَمْناهُمْ وَلكِنْ كانُوا أَنْفُسَهُمْ يَظْلِمُونَ قُلْتُ هَذَا تَنْزِيلٌ قَالَ نَعَمْ قُلْتُ وَيْلٌ يَوْمَئِذٍ لِلْمُكَذِّبِينَ قَالَ يَقُولُ وَيْلٌ لِلْمُكَذِّبِينَ يَا مُحَمَّدُ بِمَا أَوْحَيْتُ إِلَيْكَ مِنْ وَلايَةِ عَلِيِّ بْنِ أَبِي طَالِبٍ (عَلَيْهِ السَّلام) أَ لَمْ نُهْلِكِ الاوَّلِينَ. ثُمَّ نُتْبِعُهُمُ الاخِرِينَ قَالَ الاوَّلِينَ الَّذِينَ كَذَّبُوا الرُّسُلَ فِي طَاعَةِ الاوْصِيَاءِ كَذلِكَ نَفْعَلُ بِالْمُجْرِمِينَ قَالَ مَنْ أَجْرَمَ إِلَى آلِ مُحَمَّدٍ وَرَكِبَ مِنْ وَصِيِّهِ مَا رَكِبَ قُلْتُ إِنَّ الْمُتَّقِينَ قَالَ نَحْنُ وَالله وَشِيعَتُنَا لَيْسَ عَلَى مِلَّةِ إِبْرَاهِيمَ غَيْرُنَا وَسَائِرُ النَّاسِ مِنْهَا بُرَآءُ قُلْتُ يَوْمَ يَقُومُ الرُّوحُ وَالْمَلائِكَةُ صَفًّا لا يَتَكَلَّمُونَ الايَةَ قَالَ نَحْنُ وَالله الْمَأْذُونُ لَهُمْ يَوْمَ الْقِيَامَةِ وَالْقَائِلُونَ صَوَاباً قُلْتُ مَا تَقُولُونَ إِذَا تَكَلَّمْتُمْ قَالَ نُمَجِّدُ رَبَّنَا وَنُصَلِّي عَلَى نَبِيِّنَا وَنَشْفَعُ لِشِيعَتِنَا فَلا يَرُدُّنَا رَبُّنَا قُلْتُ كَلا إِنَّ كِتابَ الفُجَّارِ لَفِي سِجِّينٍ قَالَ هُمُ الَّذِينَ فَجَرُوا فِي حَقِّ الائِمَّةِ وَاعْتَدَوْا عَلَيْهِمْ قُلْتُ ثُمَّ يُقَالُ هذَا الَّذِي كُنْتُمْ بِهِ تُكَذِّبُونَ قَالَ يَعْنِي أَمِيرَ الْمُؤْمِنِينَ قُلْتُ تَنْزِيلٌ قَالَ نَعَمْ.",
                "englishText": " 88. Ali ibn Muhammad has narrated from certain persons of our people from ibn Mahbub from Muhammad ibn al-Fudayl who has said the following. “I asked abu al-Hassan al-Madi  about the words of Allah, the Most Majestic, the Most gracious. “They want to put out the light of God with their mouths,. .” (61:8) (The Imam  siad, “They want to banish Wilaya of Ali  with their mouths) “. . but God will certainly make His light shine forever. .” (61:8) (The Imam  said, “Allah will complete Imamat (Leadership with Divine Authority) as He said in His words. “It is He who has sent His Messenger with guidance and the true religion,. .” (61:9) The Imam  said, “It is He Who sent His Messenger with Wilaya for the executor of his will and Wilaya is the true religion.” I then read from the Holy Quran. “. . make the true religion to stand supreme over all religions, . .” (61:9) The Imam  said, “He will it stand supreme at the time of (the rise of al-Mahdi with Divine Authority) as Allah has said, “. .He will make the true religion to stand supreme over all religions, (Wilaya of Al-Qa’im) even though the pagans may dislike it.” (61:9). “The unbelievers refer to unbelievers in the Wilaya of Ali ” said The Imam . I then asked, “Is it revelation?” He replied, “These words are revelation but the others are interpretation.” I then read from the Holy Quran. “This is because they accepted the faith and then rejected. .” (63:3) The Imam  said, “Allah, the Most Holy, the Most High, has called those who would not follow His Messenger in the matter of Wilaya hypocrites. He has considered those who reject Imamat just as those who would reject Muhammad (s.a) and to this effect He has revealed verses in the Holy Quran that read as herein below. “When the hypocrites (in the matter of Wilaya of the executor or your will, Ali  come to you, they say, “We testify that you are the Messenger of God.” God knows that you are His Messenger. God testifies that they hypocrites (in the matters of Wilaya of Ali  are liars ((63:1). They have chosen their oaths as a shield for them to obstruct others from the way of God (the way is the executor of the will). How terrible is what they do! ((63:2). This is because they accepted the faith (your message) and then rejected it (Wilaya of the executor of your will). God has sealed their hearts, thus, they do not have any understanding.” (63:3). The narrator has said that I then asked, “What is the meaning of ‘they do not have any understanding.” (63:3)?” The Imam  said, “Allah has said that they do not understand your prophesy.” I then asked about the meaning of Allah’s words. “When they are told, “Come and let the Prophet of God seek forgiveness for you,. .” (63:6) The Imam  said, “It means that when the are asked to come back to the Wilaya of Ali  so the The Holy Prophet (s.a) would ask Allah to forgive your sins, “. . they shake their heads (Allah says) and you can see them arrogantly turning away. . “ (63:6) (from the Wilaya of Ali  “. . arrogantly. .”. ((63:5). Allah then has reiterated His words about the fact that they know the Wilaya very well saying, “. . It is all the same whether you seek forgiveness for them or not; God will never forgive them. God does not guide the evil-doing people (63:6). The Imam  said, “It refers to the unjust ones against the executor of your will.” I then asked the Imam  about the meaning of the words of Allah. “Can one who walks with his head hanging down be better guided that one who walks with his head upright?” (67:22) The Imam  said, “Allah has compared the ones who would deviate from Wilaya of Ali  to those who walk with teir head bent down without knowing what is around them. He, on the other hand has compared to those who would acknowledge Wilaya of Ali  with those who would walk on the straight path. Amir al-Mu’minin Ali  is the straight path.” The narrator has said that I then asked The Imam  about the words of Allah. “. . the Quran is certainly the word of a reverent messenger.” (69:40) The Imam  said, “It is the words of Jibril from Allah about Wilaya of Ali .” I then asked about the words of Allah. “It is not the word of a poet but only a few of you have faith,” (69:41) The Imam  said, “They had said that Muhammad (s.a) is not truthful and Allah has not commanded him anything about Ali . Allah then revealed Quran (a reading) about it. “It (Wilaya of Ali  is a revelation from the Lord of the Universe (69:43). “Had Muhammad invented some words against Us, (69:44). We would have caught hold of him by his right hand (69:45) and cut-off his main artery.” (69:46). Then Allah has turned to Wilaya of Ali  saying, “The Quran (Wilaya of Ali  is certainly a reminder for the (worlds) pious ones (69:48). We certainly know that some of you have rejected it (69:49) and (on the Day of Judgment) this (Wilaya of Ali  will be a great source of regret for the unbelievers (69:50). This (Wilaya of Ali  is the Truth beyond any doubt (69:51). (Muhammad), glorify the name of your Lord, the Great One.” (69:52) Allah has said, “Thank your Lord, the Great, Who has granted you this distinction.” The narrator has said that I then asked The Imam  about the words of Allah. “Now that we have listened to the guidance, we believe in it.. .” (72:13) The Imam  said, “Guidance is Wilaya of Ali . We have established faith in our guardian and those who would do so ‘. . Whoever believes in his Lord does not need to fear loss or oppression.” (72:13) I then asked, “Is it of the revealed words of Allah?” He said, “No, it is interpretation.” I then asked him about the words of Allah. “Say, “I do not possess any power to harm or benefit you.” (72:21) The Imam  said, “the Messenger of Allah called people to acknowledge Wilaya of Ali . Quraysh came to him and said, “O Muhammad, “Absolve us from such acknowledgment.” The Messenger of Allah said, “It is not from me but it is up to Allah.” They accused him and left him. Allah then revealed this reading. ““Say, “I do not possess any power to harm or benefit you. (72:21) Say, “No one can protect me from God, (if I would disobey Him) nor can I find any place of refuge but with him (72:22). My only (means of protection) is to convey the message of God (about Ali .. .” (72:23) I then asked, “Is it the revealed words of Allah?” He said, “Yes, it is the revealed word of Allah.” Allah has said to place more emphasis, “. . Whoever disobeys God and His Messenger (in the matters of Wilaya of Ali  will go to hell, wherein he will live forever.” (72:23) I then read the words of Allah. “. . until the unbelievers witness that with which they have been threatened, they will then know whose helpers are weaker and fewer in number.” (72:24) It is a reference to the rise of al-Mahdi with Divine Authority and his supporters).” I then read the words of Allah. “ Bear patiently whatever they say,. .” (73:10) The Imam  said, “They say, ‘. . and leave them to distance from them in an honorable manner.” (73:10) “Leave (O Muhammad) the prosperous unbelievers (in Wilaya of Ali  to Me and give them respite for a little while;” (73:11) I then asked him, “Is it the revealed words of Allah?” He said, “Yes, it is.” I then read the words of Allah. “It gives more certainty to the people of the Book. .” (74:31) The Imam  said, “They become certain that Allah, Hid Messenger and the executor of his will are true.” I then read, ‘. . and strengthens the faith of the believers.. . “ (74:31) The Imam  said, “Wilaya of Ali  strengthens their faith.” I then read the words of Allah. “. . The people of the Book and the believers have no doubt about it.. .” (74:31) The Imam  said, “They have no doubts in the Wilaya of Ali .” I then asked, “What is this doubt?” He said, “people of the Book and the believers that Allah has mentioned are meant thereby. He said that they do not doubt the Wilaya of Ali .” I then read the words of Allah. “. . This parable is a reminder for mankind.” (74:31) The Imam  said, “Yes, it the Wilaya of Ali .” “. . it is certainly one of the two great things.” (74:35) The Imam  said. “It is the Wilaya of Ali .” I then read the words of Allah. “. whether one steps forward to embrace the faith or one turns away from it.” (74:37) The Imam  one who would step forwards to our Wilaya he would step away from Hell and one who would step away from our Wilaya he would step closer to Hell.” I then read the words of Allah. “. . except the people of the right hand.” (74:39) The Imam  said, “They, by Allah, are our Shi‘a (followers).” I then read the words of Allah. “. . We did not pray,” (74:43) The Imam  said, “It refers to their saying, “We did not believe in Wilaya of Ali  and the Imams after him and would offer the special greeting for them.” I then read the words of Allah. “. . Why do they run away from guidance,” (74:49) The Imam  said, “It means running away from our Wilaya.” I then read the words of Allah. “There is no doubt that it is a guide.” (74:54) The Imam  said, “It refers to Wilaya of Ali .” I then read the words of Allah. “The servants of God fulfill their vows. .” (76:7) The Imam  said, “They fulfill the vow and covenant that they had made to acknowledge our Wilaya.” I then read the words of Allah. “(Muhammad), We have revealed the Quran to you in gradual steps.” (76:23) The Imam  said, “It means, revealed with Wilaya of Ali .” I then asked, “Is it of the revealed words of Allah ?” He said, “Yes, with interpretation.” I then read the words of Allah. “This (chapter) is a reminder. . .”.(76:29) The Imam  said, “It is a reminder of Wilaya .” I then read the words of Allah. “He admits to His mercy whomever He wants.. .” (76:31) The Imam  said, “He admits in our Wilaya.” The Imam  said, “. . For the unjust He has prepared a painful punishment.” (76:31) Consider that Allah has said, “They (children of Israel) did not wrong Us but wronged themselves. (2:57) The Imam  said, “Allah is far glorious than to do injustice or ascribe injustice to His-self. However, Allah has confuse us with His-self, thus, He has called injustice to us as injustice to His-self and our Wilaya as His own Wilaya and guardianship. About this matter He revealed Quran (a reading) to His Prophet that reads. “We did not do any wrong to them but they wronged themselves. (16:118) I then asked, “Is it the revealed word of Allah ?” He said, “Yes, it is.” I then read the words of Allah. “On that day, woe will be to those who have rejected God’s revelations!” (77:15) (The Imam  said, “Allah has said, “O Muhammad, woe is to those who reject what I have revealed about the Wilaya of Ali ibn abu Talib .” “Did We not destroy the ancient people (77:16) and make others settle after them in their land? (77:17). The Imam  said, “The ancient people are those who refused to obey the prophets about the executors of their will. “Thus do We deal with the sinful ones.” (77:18) The Imam  said, “It refers to those who sinned in the matters of Ahl al-Bayt (family) of Muhammad (s.a) and did to them what they did.” I then read the words of Allah. “The pious ones . .” (77:41) The Imam  said, “By Allah, only we and our Shi‘a (followers) follow truly the religion of Abraham/Ibrahim. Other people have no relationship with it.” I then read the words of Allah. “On that day, the Spirit and the angels who stand in lines will not speak . .” (78:38) The Imam  said, “We, by Allah, on the Day of judgment will the permission to speak the truth.” I asked him, “What will you say when you will speak?” The Imam  said, “We will praise our Lord, greet our The Holy Prophet (s.a) and intercede for our Shi‘a Our Lord will not reject our request.” I then read the words of Allah. “the records of the sinner’s deeds are in Sij4 n.” (83:7) The Imam  said, “They are the ones who did injustice to the Imams and treated them with hostility.” I then read the words of Allah. “. .This is what you had called a lie.” (83:17) The Imam  said, “It refers to Amir al-Mu’minin Ali .” I then asked, “Is it the revealed word of Allah ?” The Imam  said, “yes, it is.”",
                "href": "https://thaqalayn.net/hadith/1/4/108/88",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "111": {
                "hadithNumber": "Hadith #0",
                "title": "Al-Kafi - Volume 1: The Birth of The Holy Prophet (s.a) and His Demise",
                "arabicText": " وُلِدَ النَّبِيُّ (صَلَّى اللهُ عَلَيْهِ وَآلِه) لاثْنَتَيْ عَشْرَةَ لَيْلَةً مَضَتْ مِنْ شَهْرِ رَبِيعٍ الاوَّلِ فِي عَامِ الْفِيلِ يَوْمَ الْجُمُعَةِ مَعَ الزَّوَالِ وَرُوِيَ أَيْضاً عِنْدَ طُلُوعِ الْفَجْرِ قَبْلَ أَنْ يُبْعَثَ بِأَرْبَعِينَ سَنَةً وَحَمَلَتْ بِهِ أُمُّهُ فِي أَيَّامِ التَّشْرِيقِ عِنْدَ الْجَمْرَةِ الْوُسْطَى وَكَانَتْ فِي مَنْزِلِ عَبْدِ الله بْنِ عَبْدِ الْمُطَّلِبِ وَوَلَدَتْهُ فِي شِعْبِ أَبِي طَالِبٍ فِي دَارِ مُحَمَّدِ بْنِ يُوسُفَ فِي الزَّاوِيَةِ الْقُصْوَى عَنْ يَسَارِكَ وَأَنْتَ دَاخِلُ الدَّارِ وَقَدْ أَخْرَجَتِ الْخَيْزُرَانُ ذَلِكَ الْبَيْتَ فَصَيَّرَتْهُ مَسْجِداً يُصَلِّي النَّاسُ فِيهِ وَبَقِيَ بِمَكَّةَ بَعْدَ مَبْعَثِهِ ثَلاثَ عَشْرَةَ سَنَةً ثُمَّ هَاجَرَ إِلَى الْمَدِينَةِ وَمَكَثَ بِهَا عَشْرَ سِنِينَ ثُمَّ قُبِضَ (عَلَيْهِ السَّلام) لاثْنَتَيْ عَشْرَةَ لَيْلَةً مَضَتْ مِنْ رَبِيعٍ الاوَّلِ يَوْمَ الاثْنَيْنِ وَهُوَ ابْنُ ثَلاثٍ وَسِتِّينَ سَنَةً وَتُوُفِّيَ أَبُوهُ عَبْدُ الله بْنُ عَبْدِ الْمُطَّلِبِ بِالْمَدِينَةِ عِنْدَ أَخْوَالِهِ وَهُوَ ابْنُ شَهْرَيْنِ وَمَاتَتْ أُمُّهُ آمِنَةُ بِنْتُ وَهْبِ بْنِ عَبْدِ مَنَافِ بْنِ زُهْرَةَ بْنِ كِلابِ بْنِ مُرَّةَ بْنِ كَعْبِ بْنِ لُؤَيِّ بْنِ غَالِبٍ وَهُوَ (عَلَيْهِ السَّلام) ابْنُ أَرْبَعِ سِنِينَ وَمَاتَ عَبْدُ الْمُطَّلِبِ وَلِلنَّبِيِّ (صَلَّى اللهُ عَلَيْهِ وَآلِه) نَحْوُ ثَمَانِ سِنِينَ وَتَزَوَّجَ خَدِيجَةَ وَهُوَ ابْنُ بِضْعٍ وَعِشْرِينَ سَنَةً فَوُلِدَ لَهُ مِنْهَا قَبْلَ مَبْعَثِهِ (عَلَيْهِ السَّلام) الْقَاسِمُ وَرُقَيَّةُ وَزَيْنَبُ وَأُمُّ كُلْثُومٍ وَوُلِدَ لَهُ بَعْدَ الْمَبْعَثِ الطَّيِّبُ وَالطَّاهِرُ وَفَاطِمَةُ (عليها السلام) وَرُوِيَ أَيْضاً أَنَّهُ لَمْ يُولَدْ بَعْدَ الْمَبْعَثِ إِلا فَاطِمَةُ (عليها السلام) وَأَنَّ الطَّيِّبَ وَالطَّاهِرَ وُلِدَا قَبْلَ مَبْعَثِهِ وَمَاتَتْ خَدِيجَةُ (عليها السلام) حِينَ خَرَجَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) مِنَ الشِّعْبِ وَكَانَ ذَلِكَ قَبْلَ الْهِجْرَةِ بِسَنَةٍ وَمَاتَ أَبُو طَالِبٍ بَعْدَ مَوْتِ خَدِيجَةَ بِسَنَةٍ فَلَمَّا فَقَدَهُمَا رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) شَنَأَ الْمُقَامَ بِمَكَّةَ وَدَخَلَهُ حُزْنٌ شَدِيدٌ وَشَكَا ذَلِكَ إِلَى جَبْرَئِيلَ (عَلَيْهِ السَّلام) فَأَوْحَى الله تَعَالَى إِلَيْهِ اخْرُجْ مِنَ الْقَرْيَةِ الظَّالِمِ أَهْلُهَا فَلَيْسَ لَكَ بِمَكَّةَ نَاصِرٌ بَعْدَ أَبِي طَالِبٍ وَأَمَرَهُ بِالْهِجْرَةِ.",
                "englishText": " The Holy Prophet (s.a) was born on the twelfth of the month of Rabi‘ al-Awwal, in the year of Elephant on a Friday at noon. Also it is narrated that it was at dawn forty years before his receiving Divine messages. His mother conceived with him on the days of Tashriq (11, 12, 13) of dhul Hajj near the middle Jamara (a pillar of stones) and she was in the house of ‘Abdallah ibn ‘Abd al-Muttalib. She gave birth in the Sha‘b of abu Talib  in the house of Muhammad ibn Yusuf at the left far corner of the house as you would enter. al-Khayzuran made that house into a mosque and people use for prayers. After receiving Divine commands to work as the Messenger of Allah he remained in Makka for thirteen years. Thereafter he migrated to Madina wherein he lived for ten years. He passed away on Monday the twelfth of the month of Rabi‘ al-Awwal at the age of sixty three. His father ‘Abdallah ibn ‘Abd al-Muttalib died in Madina among his maternal uncles when he (Muhammad) was only two months old. His mother, ’Amina daughter of Wahab ibn ‘Abd Manaf, ibn Zuhra ibn Kilab ibn Murra ibn Ka‘b ibn Luway ibn Ghalib, died when he was a boy of four years old. ‘Abd al-Muttalib died when the Holy Prophet (s.a.) was about eight years old. He married khadija when he was twenty and some years old. From Khadija before receiving the Divine commands of his children born were al-Qasim, Ruqiyya, Zaynab and ’Umm Kulthum. Of his children born after he received Divine commands were al-Tayyib, al-Tahir and Fatima . It is also narrated that after he received Divine commands no other children besides Fatima  and that al-Tayyib and al-Tahir were born before he received divine commands. Khadija  died at the time the Holy Prophet (s.a.) came out of Sha‘b of abu Talib. This was one year before his migration to Madina. Abu Talib died one year after the death of Khaija. When the Messenger of Allah lost these two people it became very difficult for him to live in Makka. He became extremely sad and complained to Jibril . Allah then sent him the message to leave the town of the unjust people because after abu Talib there is no one in Makka to support you. He was commanded to migrate.",
                "href": "https://thaqalayn.net/hadith/1/4/111/0",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "111": {
                "hadithNumber": "Hadith #7",
                "title": "Al-Kafi - Volume 1: The Birth of The Holy Prophet (s.a) and His Demise",
                "arabicText": " 7ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ إِبْرَاهِيمَ عَنْ عَلِيِّ بْنِ حَمَّادٍ عَنِ الْمُفَضَّلِ قَالَ قُلْتُ لابِي عَبْدِ الله (عَلَيْهِ السَّلام) كَيْفَ كُنْتُمْ حَيْثُ كُنْتُمْ فِي الاظِلَّةِ فَقَالَ يَا مُفَضَّلُ كُنَّا عِنْدَ رَبِّنَا لَيْسَ عِنْدَهُ أَحَدٌ غَيْرُنَا فِي ظُلَّةٍ خَضْرَاءَ نُسَبِّحُهُ وَنُقَدِّسُهُ وَنُهَلله وَنُمَجِّدُهُ وَمَا مِنْ مَلَكٍ مُقَرَّبٍ وَلا ذِي رُوحٍ غَيْرُنَا حَتَّى بَدَا لَهُ فِي خَلْقِ الاشْيَاءِ فَخَلَقَ مَا شَاءَ كَيْفَ شَاءَ مِنَ الْمَلائِكَةِ وَغَيْرِهِمْ ثُمَّ أَنْهَى عِلْمَ ذَلِكَ إِلَيْنَا.",
                "englishText": "7. Ali b. Muhammad has narrated from Sahl b. Ziyad from Muhammad ibn Ali b. Ibrahim from Ali b. Hammad from Al-Mufadhal who has said the following. “Once I asked Abu ‘Abdallah , “How did you exist when you existed in the shadows?” The Imam  said, “O Mufadhal, we were in the presence of our Lord and there was no one else in the green shadow. We spoke of His Glory, Holiness, acknowledged Him as the Lords and spoke of His Majesty. There was no angel even of the ones close to Allah or a living being except us in His presence until He decided to create all things. He then created whatever He wanted, in the way He wanted of the angels and others. He then made the knowledge of that to reach and come to us.”",
                "href": "https://thaqalayn.net/hadith/1/4/111/7",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "111": {
                "hadithNumber": "Hadith #50",
                "title": "Al-Kafi - Volume 1: The Birth of The Holy Prophet (s.a) and His Demise",
                "arabicText": " 50ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ الْحُسَيْنِ بْنِ عُلْوَانَ الْكَلْبِيِّ عَنْ عَلِيِّ بْنِ الْحَزَوَّرِ الْغَنَوِيِّ عَنْ أَصْبَغَ بْنِ نُبَاتَةَ الْحَنْظَلِيِّ قَالَ رَأَيْتُ أَمِيرَ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) يَوْمَ افْتَتَحَ الْبَصْرَةَ وَرَكِبَ بَغْلَةَ رَسُولِ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) ثُمَّ قَالَ أَيُّهَا النَّاسُ أَ لا أُخْبِرُكُمْ بِخَيْرِ الْخَلْقِ يَوْمَ يَجْمَعُهُمُ الله فَقَامَ إِلَيْهِ أَبُو أَيُّوبَ الانْصَارِيُّ فَقَالَ بَلَى يَا أَمِيرَ الْمُؤْمِنِينَ حَدِّثْنَا فَإِنَّكَ كُنْتَ تَشْهَدُ وَنَغِيبُ فَقَالَ إِنَّ خَيْرَ الْخَلْقِ يَوْمَ يَجْمَعُهُمُ الله سَبْعَةٌ مِنْ وُلْدِ عَبْدِ الْمُطَّلِبِ لا يُنْكِرُ فَضْلَهُمْ إِلا كَافِرٌ وَلا يَجْحَدُ بِهِ إِلا جَاحِدٌ فَقَامَ عَمَّارُ بْنُ يَاسِرٍ رَحِمَهُ الله فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ سَمِّهِمْ لَنَا لِنَعْرِفَهُمْ فَقَالَ إِنَّ خَيْرَ الْخَلْقِ يَوْمَ يَجْمَعُهُمُ الله الرُّسُلُ وَإِنَّ أَفْضَلَ الرُّسُلِ مُحَمَّدٌ (صَلَّى اللهُ عَلَيْهِ وَآلِه) وَإِنَّ أَفْضَلَ كُلِّ أُمَّةٍ بَعْدَ نَبِيِّهَا وَصِيُّ نَبِيِّهَا حَتَّى يُدْرِكَهُ نَبِيٌّ أَلا وَإِنَّ أَفْضَلَ الاوْصِيَاءِ وَصِيُّ مُحَمَّدٍ عَلَيْهِ وَآلِهِ السَّلامُ أَلا وَإِنَّ أَفْضَلَ الْخَلْقِ بَعْدَ الاوْصِيَاءِ الشُّهَدَاءُ أَلا وَإِنَّ أَفْضَلَ الشُّهَدَاءِ حَمْزَةُ بْنُ عَبْدِ الْمُطَّلِبِ وَجَعْفَرُ بْنُ أَبِي طَالِبٍ لَهُ جَنَاحَانِ خَضِيبَانِ يَطِيرُ بِهِمَا فِي الْجَنَّةِ لَمْ يُنْحَلْ أَحَدٌ مِنْ هَذِهِ الامَّةِ جَنَاحَانِ غَيْرُهُ شَيْ‏ءٌ كَرَّمَ الله بِهِ مُحَمَّداً (صَلَّى اللهُ عَلَيْهِ وَآلِه) وَشَرَّفَهُ وَالسِّبْطَانِ الْحَسَنُ وَالْحُسَيْنُ وَالْمَهْدِيُّ (عَلَيْهم السَّلام) يَجْعَلُهُ الله مَنْ شَاءَ مِنَّا أَهْلَ الْبَيْتِ ثُمَّ تَلا هَذِهِ الايَةَ وَمَنْ يُطِعِ الله وَالرَّسُولَ فَأُولئِكَ مَعَ الَّذِينَ أَنْعَمَ الله عَلَيْهِمْ مِنَ النَّبِيِّينَ وَالصِّدِّيقِينَ وَالشُّهَداءِ وَالصَّالِحِينَ وَحَسُنَ أُولئِكَ رَفِيقاً. ذلِكَ الْفَضْلُ مِنَ الله وَكَفى‏ بِالله عَلِيماً.",
                "englishText": "50. Yahya has narrated from Ahmad b. Muhammad from Ibn al-Fadhal from al-Husayn ibn ‘Ulwan al-Kalbi from Ali b. al-Hazwar al-Ghanawi from Asbagh ibn Nubata al-Hanzali who has said the following: “Once I saw Amir al-Mu’minin Ali  on the day of victory in Basra while he was riding the on the mule of the Messenger of Allah ﷺ. Then he said, ‘Oh people, do you want me to tell you who the best of the creatures of Allah will be on the Day when He will bring all of them to one place?’ Abu Ayyub al-Ansari  stood up and said, ‘Yes, O Amir al-Mu’minin , please explain to us. You were present and we were absent.’ The Imam  then said, ‘The best of the people on the day of resurrection when Allah will bring all people together are seven people descended of ‘Abd al-Muttalib whose distinction no one except an unbeliever would deny and no one would reject except a deviant.’ ‘Ammar b. Yasir  then stood up and said, ‘O Amir al-Mu’minin  tell us their names so we can recognise them properly.’ The Imam  said, “The best in the creatures of Allah on the Day when He will bring all creatures together are the messengers and the best of the messengers is Muhammad ﷺ. The best after the prophet in his Ummah (followers) is the executor of his will until a prophet comes. There is no doubt that the best among the executors of the wills of the prophets is the executor of the will of Prophet Muhammad ﷺ. There is also no doubt that the best among the people after the executors of the will of the prophets are the martyrs and the best of the martyrs is Hamza b. ‘Abd al-Muttalib and Ja‘far b. Abu Talib who was given two fresh wings with which he flies in Paradise. No one else besides him from this Ummah received two wings. With this Allah honored and granted dignity to Muhammad ﷺ. Also of the seven people are the two grandsons of the Holy Prophet ﷺ and al-Mahdi . Whoever Allah wants will be al-Mahdi from our Ahl al-Bayt. Then he read this verse of the Holy Quran. “One who obeys God and the Messenger is the friend of the Prophets, saints, martyrs, and the righteous ones to whom God has granted His favors. They are the best friends that one can have. [4:69] The favors of God are such, and He knows very well (how to reward you).’” [4:70]",
                "href": "https://thaqalayn.net/hadith/1/4/111/50",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "112": {
                "hadithNumber": "Hadith #1",
                "title": "Al-Kafi - Volume 1: Climbing over the grave of the Holy Prophet (s.a) prohibited",
                "arabicText": " 1ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ عَنْ جَعْفَرِ بْنِ الْمُثَنَّى الْخَطِيبِ قَالَ كُنْتُ بِالْمَدِينَةِ وَسَقْفُ الْمَسْجِدِ الَّذِي يُشْرِفُ عَلَى الْقَبْرِ قَدْ سَقَطَ وَالْفَعَلَةُ يَصْعَدُونَ وَيَنْزِلُونَ وَنَحْنُ جَمَاعَةٌ فَقُلْتُ لاصْحَابِنَا مَنْ مِنْكُمْ لَهُ مَوْعِدٌ يَدْخُلُ عَلَى أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) اللَّيْلَةَ فَقَالَ مِهْرَانُ بْنُ أَبِي نَصْرٍ أَنَا وَقَالَ إِسْمَاعِيلُ بْنُ عَمَّارٍ الصَّيْرَفِيُّ أَنَا فَقُلْنَا لَهُمَا سَلاهُ لَنَا عَنِ الصُّعُودِ لِنُشْرِفَ عَلَى قَبْرِ النَّبِيِّ (صَلَّى اللهُ عَلَيْهِ وَآلِه) فَلَمَّا كَانَ مِنَ الْغَدِ لَقِينَاهُمَا فَاجْتَمَعْنَا جَمِيعاً فَقَالَ إِسْمَاعِيلُ قَدْ سَأَلْنَاهُ لَكُمْ عَمَّا ذَكَرْتُمْ فَقَالَ مَا أُحِبُّ لاحَدٍ مِنْهُمْ أَنْ يَعْلُوَ فَوْقَهُ وَلا آمَنُهُ أَنْ يَرَى شَيْئاً يَذْهَبُ مِنْهُ بَصَرُهُ أَوْ يَرَاهُ قَائِماً يُصَلِّي أَوْ يَرَاهُ مَعَ بَعْضِ أَزْوَاجِهِ (صَلَّى اللهُ عَلَيْهِ وَآلِه )",
                "englishText": " 1. A number of our people has narrated from Ahmad ibn Muhammad al-Barqi from Ja‘far ibn al-Muthanna al-Khatib who has said the following. “I was in Madina when the roof over the grave of the Holy Prophet (s.a) had crumbled down and the workers were climbing up and down (for repairs). We were a group and said to our people, “Who has an appointment with abu ‘Abdallah ?” Mihran ibn abu Nasr said, “I have an appointment with the Imam .” ’Isma‘il ibn ‘Ammar al-Sayrafi said, “I have an appointment with the Imam .” I said to them, “Ask the Imam  if it is permissible to climb up and look on to the grave of the Holy Prophet (s.a).” Next day we met them and we all came together. ’Isma‘il said, “We asked your question and he said this. “I do not like anyone to climb over him and I do not feel safe for anyone whose eye sight may go away because of catching sight of something that cause him such loss or see him standing in prayer or see him with anyone of his wives.”",
                "href": "https://thaqalayn.net/hadith/1/4/112/1",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "113": {
                "hadithNumber": "Hadith #0",
                "title": "Al-Kafi - Volume 1: The birth of Amir al-Mu’minin Ali (a.s.)",
                "arabicText": " وُلِدَ أَمِيرُ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) بَعْدَ عَامِ الْفِيلِ بِثَلاثِينَ سَنَةً وَقُتِلَ (عَلَيْهِ السَّلام) فِي شَهْرِ رَمَضَانَ لِتِسْعٍ بَقِينَ مِنْهُ لَيْلَةَ الاحَدِ سَنَةَ أَرْبَعِينَ مِنَ الْهِجْرَةِ وَهُوَ ابْنُ ثَلاثٍ وَسِتِّينَ سَنَةً بَقِيَ بَعْدَ قَبْضِ النَّبِيِّ (صَلَّى اللهُ عَلَيْهِ وَآلِه) ثَلاثِينَ سَنَةً وَأُمُّهُ فَاطِمَةُ بِنْتُ أَسَدِ بْنِ هَاشِمِ بْنِ عَبْدِ مَنَافٍ وَهُوَ أَوَّلُ هَاشِمِيٍّ وَلَدَهُ هَاشِمٌ مَرَّتَيْنِ.",
                "englishText": " Amir al-Mu’minin Ali  was born thirty years after the year of elephant. He was martyred in month of Ramadan twenty first Sunday night in the year fortieth after Hijra (migration). He was sixty three years at that time. He lived for thirty years after the death of the Holy Prophet (s.a). His mother was Fatima daughter of Asad Ibrahimn Hashim ibn ‘Abd Manaf. He was the first person whose both parents belonged to Hashim.",
                "href": "https://thaqalayn.net/hadith/1/4/113/0",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "113": {
                "hadithNumber": "Hadith #11",
                "title": "Al-Kafi - Volume 1: The birth of Amir al-Mu’minin Ali (a.s.)",
                "arabicText": " 11ـ سَعْدُ بْنُ عَبْدِ الله عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ فَضَّالٍ عَنْ عَبْدِ الله بُكَيْرٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) أَنَّهُ سَمِعَهُ يَقُولُ لَمَّا قُبِضَ أَمِيرُ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) أَخْرَجَهُ الْحَسَنُ وَالْحُسَيْنُ وَرَجُلانِ آخَرَانِ حَتَّى إِذَا خَرَجُوا مِنَ الْكُوفَةِ تَرَكُوهَا عَنْ أَيْمَانِهِمْ ثُمَّ أَخَذُوا فِي الْجَبَّانَةِ حَتَّى مَرُّوا بِهِ إِلَى الْغَرِيِّ فَدَفَنُوهُ وَسَوَّوْا قَبْرَهُ فَانْصَرَفُوا.",
                "englishText": " 11. Sa‘d ibn ‘Abdallah has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Hassan ibn Ali ibn Faddal from ‘Abdallah ibn Bukaayr from certain persons of our people who has said the following. “He heard abu ‘Abdallah  say, ‘ When Amir al-Mu’minin Ali  died, al-Hassan and al-Husayn and two other man carried his body out until they went out of Kufa. They continued with Kufa on their right and then they moved forwards on the path of Jabana until they passed al-Ghari. They then buried him and leveelled his grave and then return (home).”",
                "href": "https://thaqalayn.net/hadith/1/4/113/11",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "114": {
                "hadithNumber": "Hadith #0",
                "title": "Al-Kafi - Volume 1: The birth of al-Zahra’, Fatima (a.s.)",
                "arabicText": " وُلِدَتْ فَاطِمَةُ عَلَيْهَا وَعَلَى بَعْلِهَا السَّلامُ بَعْدَ مَبْعَثِ رَسُولِ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) بِخَمْسِ سِنِينَ وَتُوُفِّيَتْ (عليها السلام) وَلَهَا ثَمَانَ عَشْرَةَ سَنَةً وَخَمْسَةٌ وَسَبْعُونَ يَوْماً وَبَقِيَتْ بَعْدَ أَبِيهَا (صَلَّى اللهُ عَلَيْهِ وَآلِه) خَمْسَةً وَسَبْعِينَ يَوْماً.",
                "englishText": " Fatima  was born five years after the Messenger of Allah declared his message. She died when she was eighteen years and seventy five days old. She lived for seventy five days after the death of her father ﷺ.”",
                "href": "https://thaqalayn.net/hadith/1/4/114/0",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "115": {
                "hadithNumber": "Hadith #0",
                "title": "Al-Kafi - Volume 1: The Birth of al-Hassan ibn Ali (a.s.)",
                "arabicText": " وُلِدَ الْحَسَنُ بن علي (عَلَيْهما السَّلام) فِي شَهْرِ رَمَضَانَ فِي سَنَةِ بَدْرٍ سَنَةِ اثْنَتَيْنِ بَعْدَ الْهِجْرَةِ وَرُوِيَ أَنَّهُ وُلِدَ فِي سَنَةِ ثَلاثٍ وَمَضَى (عَلَيْهِ السَّلام) فِي شَهْرِ صَفَرٍ فِي آخِرِهِ مِنْ سَنَةِ تِسْعٍ وَأَرْبَعِينَ وَمَضَى وَهُوَ ابْنُ سَبْعٍ وَأَرْبَعِينَ سَنَةً وَأَشْهُرٍ وَأُمُّهُ فَاطِمَةُ بِنْتُ رَسُولِ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه )",
                "englishText": " Al-Hassan ibn Ali  was born in the month of Ramadan in the year that the battle of Badr took place, the second year after Hijra (AH) (migration of the Holy Prophet ﷺ from Mecca to Medina). It is also narrated that he was born in the third year. He passed away in the end of the month of Safar in the year forty nine AH. He lived for forty seven years and a few months. His mother was Fatima, daughter of the Messenger of Allah ﷺ.",
                "href": "https://thaqalayn.net/hadith/1/4/115/0",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "116": {
                "hadithNumber": "Hadith #0",
                "title": "Al-Kafi - Volume 1: The Birth of al-Husayn ibn Ali (a.s.)",
                "arabicText": " وُلِدَ الْحُسَيْنُ بن علي (عَلَيْهما السَّلام) فِي سَنَةِ ثَلاثٍ وَقُبِضَ (عَلَيْهِ السَّلام) فِي شَهْرِ الْمُحَرَّمِ مِنْ سَنَةِ إِحْدَى وَسِتِّينَ مِنَ الْهِجْرَةِ وَلَهُ سَبْعٌ وَخَمْسُونَ سَنَةً وَأَشْهُرٌ قَتَلَهُ عُبَيْدُ الله بْنُ زِيَادٍ لَعَنَهُ الله فِي خِلافَةِ يَزِيدَ بْنِ مُعَاوِيَةَ لَعَنَهُ الله وَهُوَ عَلَى الْكُوفَةِ وَكَانَ عَلَى الْخَيْلِ الَّتِي حَارَبَتْهُ وَقَتَلَتْهُ عُمَرُ بْنُ سَعْدٍ لَعَنَهُ الله بِكَرْبَلاءَ يَوْمَ الاثْنَيْنِ لِعَشْرٍ خَلَوْنَ مِنَ الْمُحَرَّمِ وَأُمُّهُ فَاطِمَةُ بِنْتُ رَسُولِ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه )",
                "englishText": " Al-Husayn ibn Ali  was born in the third year AH. He left this word in the month of Muharram in the year sixty one AH. He lived for fifty seven years and few months. ‘Ubaydulla ibn Ziyad murdered him (may Allah condemn him) during the Caliphate of Yazid ibn Mu‘awiya (may Allah’s condemnation be up on him. He was the governor of Kufa. The horse men who murdered him were lead by ‘Umar ibn Sa‘d (may condemn him) in the plain of Karbala. It took place on Monday the tenth of the month of Muharram. His mother was Fatima, daughter of the Messenger of Allah .",
                "href": "https://thaqalayn.net/hadith/1/4/116/0",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "117": {
                "hadithNumber": "Hadith #0",
                "title": "Al-Kafi - Volume 1: The Birth of Ali ibn al-Husayn (a.s.)",
                "arabicText": " وُلِدَ عَلِيُّ بن الحسين (عَلَيْهما السَّلام) فِي سَنَةِ ثَمَانٍ وَثَلاثِينَ وَقُبِضَ فِي سَنَةِ خَمْسٍ وَتِسْعِينَ وَلَهُ سَبْعٌ وَخَمْسُونَ سَنَةً وَأُمُّهُ سَلامَةُ بِنْتُ يَزْدَجَرْدَ بْنِ شَهْرِيَارَ بْنِ شِيرَوَيْهِ بْنِ كِسْرَى أَبَرْوِيزَ وَكَانَ يَزْدَجَرْدُ آخِرَ مُلُوكِ الْفُرْسِ.",
                "englishText": " Ali ibn al-Husayn was born in the year thirty eight AH. He passed away in the year ninety five at the age of fifty seven. His mother was Slama daughter of Yazdjurd ibn Sharyar ibn Shiruwayh ibn kisra ‘A Perwiz. Yazdjurd was the last Persian king.",
                "href": "https://thaqalayn.net/hadith/1/4/117/0",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "118": {
                "hadithNumber": "Hadith #0",
                "title": "Al-Kafi - Volume 1: The Birth of Abu Ja‘far, Muhammad ibn Ali (a.s.)",
                "arabicText": " وُلِدَ أَبُو جَعْفَرٍ (عَلَيْهِ السَّلام) سَنَةَ سَبْعٍ وَخَمْسِينَ وَقُبِضَ (عَلَيْهِ السَّلام) سَنَةَ أَرْبَعَ عَشْرَةَ وَمِائَةٍ وَلَهُ سَبْعٌ وَخَمْسُونَ سَنَةً وَدُفِنَ بِالْبَقِيعِ بِالْمَدِينَةِ فِي الْقَبْرِ الَّذِي دُفِنَ فِيهِ أَبُوهُ عَلِيُّ بن الحسين (عَلَيْهما السَّلام) وَكَانَتْ أُمُّهُ أُمَّ عَبْدِ الله بِنْتَ الْحَسَنِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ عَلَيْهم السَّلام وَعَلَى ذُرِّيَّتِهِمُ الْهَادِيَةِ.",
                "englishText": " Abu Ja‘far  was born in the year seventy five AH. He passed away in the year one hundred fourteen at the age of fifty seven. He was buried in al-Baqi’ cemetery in Madina near the gave of his father, Ali ibn al-Husayn . His mother was ’Umm ‘Abdallah daughter of al-Hassan ibn Ali ibn abu Talib, may Allah grant him and his rightly guided offspring blessings.",
                "href": "https://thaqalayn.net/hadith/1/4/118/0",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "119": {
                "hadithNumber": "Hadith #0",
                "title": "Al-Kafi - Volume 1: The Birth of abu ‘Abdullah Ja‘far ibn Muhammad (a.s.)",
                "arabicText": " وُلْدِ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) سَنَةَ ثَلاثٍ وَثَمَانِينَ وَمَضَى فِي شَوَّالٍ مِنْ سَنَةِ ثَمَانٍ وَأَرْبَعِينَ وَمِائَةٍ وَلَهُ خَمْسٌ وَسِتُّونَ سَنَةً وَدُفِنَ بِالْبَقِيعِ فِي الْقَبْرِ الَّذِي دُفِنَ فِيهِ أَبُوهُ وَجَدُّهُ وَالْحَسَنُ بن علي (عَلَيْهما السَّلام) وَأُمُّهُ أُمُّ فَرْوَةَ بِنْتُ الْقَاسِمِ بْنِ مُحَمَّدِ بْنِ أَبِي بَكْرٍ وَأُمُّهَا أَسْمَاءُ بِنْتُ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ.",
                "englishText": " Abu ‘Abdallah  was born in the year eighty three AH. He passed away in the month of Shawwal in the year one hundred forty eight at the age of sixty five. He was buried in al-Baqi‘ cemetery in Madina in the grave yard where his father and grandfather and al-Hassan ibn Ali were buried. His mother was ’Umm Farwa daughter of al-Qasim ibn Muhammad ibn abu Bakr and her mother was ’Asma’ daughter of ‘Abd al-Rahman ibn abu Bakr.",
                "href": "https://thaqalayn.net/hadith/1/4/119/0",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "120": {
                "hadithNumber": "Hadith #0",
                "title": "Al-Kafi - Volume 1: The Birth of abu al-Hassan Musa ibn Ja‘far (a.s.)",
                "arabicText": " وُلِدَ أَبُو الْحَسَنِ مُوسَى (عَلَيْهِ السَّلام) بِالابْوَاءِ سَنَةَ ثَمَانٍ وَعِشْرِينَ وَمِائَةٍ وَقَالَ بَعْضُهُمْ تِسْعٍ وَعِشْرِينَ وَمِائَةٍ وَقُبِضَ (عَلَيْهِ السَّلام) لِسِتٍّ خَلَوْنَ مِنْ رَجَبٍ مِنْ سَنَةِ ثَلاثٍ وَثَمَانِينَ وَمِائَةٍ وَهُوَ ابْنُ أَرْبَعٍ أَوْ خَمْسٍ وَخَمْسِينَ سَنَةً وَقُبِضَ (عَلَيْهِ السَّلام) بِبَغْدَادَ فِي حَبْسِ السِّنْدِيِّ بْنِ شَاهَكَ وَكَانَ هَارُونُ حَمَلَهُ مِنَ الْمَدِينَةِ لِعَشْرِ لَيَالٍ بَقِينَ مِنْ شَوَّالٍ سَنَةَ تِسْعٍ وَسَبْعِينَ وَمِائَةٍ وَقَدْ قَدِمَ هَارُونُ الْمَدِينَةَ مُنْصَرَفَهُ مِنْ عُمْرَةِ شَهْرِ رَمَضَانَ ثُمَّ شَخَصَ هَارُونُ إِلَى الْحَجِّ وَحَمَلَهُ مَعَهُ ثُمَّ انْصَرَفَ عَلَى طَرِيقِ الْبَصْرَةِ فَحَبَسَهُ عِنْدَ عِيسَى بْنِ جَعْفَرٍ ثُمَّ أَشْخَصَهُ إِلَى بَغْدَادَ فَحَبَسَهُ عِنْدَ السِّنْدِيِّ بْنِ شَاهَكَ فَتُوُفِّيَ (عَلَيْهِ السَّلام) فِي حَبْسِهِ وَدُفِنَ بِبَغْدَادَ فِي مَقْبَرَةِ قُرَيْشٍ وَأُمُّهُ أُمُّ وَلَدٍ يُقَالُ لَهَا حَمِيدَةُ.",
                "englishText": " Abu al-Hassan Musa  was born in Abwa’ in the year one hundred twenty eight AH. Certain historians have said that it to be the year one hundred twenty six. He passed away on the sixth of the month of Rajab in the year one hundred eighty six at the age of fifty four of fifty five in Baghdad in the prison of al-Sindi ibn Shahik. Haarun has summoned him from Madina on twentieth of the month of Shawwal in the year one hundred seventy nine. Harun went to Madina on his way back from ‘Umra (pilgrimage to Makka) in the month of Ramadan. Thereafter Harum went for hHajj and took abu al-Hassan Musa ibn Ja‘far  with him to Baghdad. He then imprisoned him in the control of al-Sindi ibn Shahik and in his prison he  died. He was buried in Baghdad ingrave yard of Quraysh. His mother was ’Umm walad, called Hamida.”",
                "href": "https://thaqalayn.net/hadith/1/4/120/0",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "121": {
                "hadithNumber": "Hadith #0",
                "title": "Al-Kafi - Volume 1: The birth of abu al-Hassan al-Rida (a.s.)",
                "arabicText": " وُلِدَ أَبُو الْحَسَنِ الرِّضَا (عَلَيْهِ السَّلام) سَنَةَ ثَمَانٍ وَأَرْبَعِينَ وَمِائَةٍ وَقُبِضَ (عَلَيْهِ السَّلام) فِي صَفَرٍ مِنْ سَنَةِ ثَلاثٍ وَمِائَتَيْنِ وَهُوَ ابْنُ خَمْسٍ وَخَمْسِينَ سَنَةً وَقَدِ اخْتُلِفَ فِي تَارِيخِهِ إِلا أَنَّ هَذَا التَّارِيخَ هُوَ أَقْصَدُ إِنْ شَاءَ الله وَتُوُفِّيَ (عَلَيْهِ السَّلام) بِطُوسَ فِي قَرْيَةٍ يُقَالُ لَهَا سَنَابَادُ مِنْ نُوقَانَ عَلَى دَعْوَةٍ وَدُفِنَ بِهَا وَكَانَ الْمَأْمُونُ أَشْخَصَهُ مِنَ الْمَدِينَةِ إِلَى مَرْوَ عَلَى طَرِيقِ الْبَصْرَةِ وَفَارِسَ فَلَمَّا خَرَجَ الْمَأْمُونُ وَشَخَصَ إِلَى بَغْدَادَ أَشْخَصَهُ مَعَهُ فَتُوُفِّيَ فِي هَذِهِ الْقَرْيَةِ وَأُمُّهُ أُمُّ وَلَدٍ يُقَالُ لَهَا أُمُّ الْبَنِينَ.",
                "englishText": " Abu al-Hassan al-Rida  was born in the year the one hundred forty eight AH. He passed away in the month of Safar in the year two hundred and three at the age of fifty-five. All the views about this date are not the same but it is more accurate, if Allah would so will. He died in Tus in the town called Sanabad, that is within the reach of human voice from Nawqan. He was buried there. Al-Ma’mun had summoned him from Madina to Marw via Basra to Persia. When al-Ma’mun left for Baghdad he took The Imam  he passed away in this town. His mother was ’Umm Walad called ’Umm al-Banin.",
                "href": "https://thaqalayn.net/hadith/1/4/121/0",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "122": {
                "hadithNumber": "Hadith #0",
                "title": "Al-Kafi - Volume 1: The Birth of Abu Ja‘far, Muhammad ibn Ali, the Second (a.s.)",
                "arabicText": " وُلِدَ (عَلَيْهِ السَّلام) فِي شَهْرِ رَمَضَانَ مِنْ سَنَةِ خَمْسٍ وَتِسْعِينَ وَمِائَةٍ وَقُبِضَ (عَلَيْهِ السَّلام) سَنَةَ عِشْرِينَ وَمِائَتَيْنِ فِي آخِرِ ذِي الْقَعْدَةِ وَهُوَ ابْنُ خَمْسٍ وَعِشْرِينَ سَنَةً وَشَهْرَيْنِ وَثَمَانِيَةَ عَشَرَ يَوْماً وَدُفِنَ بِبَغْدَادَ فِي مَقَابِرِ قُرَيْشٍ عِنْدَ قَبْرِ جَدِّهِ مُوسَى (عَلَيْهِ السَّلام) وَقَدْ كَانَ الْمُعْتَصِمُ أَشْخَصَهُ إِلَى بَغْدَادَ فِي أَوَّلِ هَذِهِ السَّنَةِ الَّتِي تُوُفِّيَ فِيهَا (عَلَيْهِ السَّلام) وَأُمُّهُ أُمُّ وَلَدٍ يُقَالُ لَهَا سَبِيكَةُ نُوبِيَّةٌ وَقِيلَ أَيْضاً إِنَّ اسْمَهَا كَانَ خَيْزُرَانَ وَرُوِيَ أَنَّهَا كَانَتْ مِنْ أَهْلِ بَيْتِ مَارِيَةَ أُمِّ إِبْرَاهِيمَ بْنِ رَسُولِ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه )",
                "englishText": " Abu Ja‘far, Muhammad ibn Ali  was born in the month of Ramadan in the year one hundred ninety five and passed away in the year two hundred twenty at the end of the month of Dhu al-Al-Qa‘da at the age of twenty five and two months and eighteen days. He was buried in Baghdad in the grave yard of Quraysh near the grave of his grandfather, Musa ibn Ja‘far . Al-Mu‘tasam had summoned him to Baghdad at the beginning of the year in which he left this world. His mother was ’Umm Walad, called, Sabika Nuwbiyya. It is also said that her name was Khizuran. It also is narrated that she was from the family of Maria, mother of Ibrahim, son of the Messenger of Allah.”",
                "href": "https://thaqalayn.net/hadith/1/4/122/0",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "123": {
                "hadithNumber": "Hadith #0",
                "title": "Al-Kafi - Volume 1: The Birth of abu al-Hassan Ali ibn Muhammad (a.s.)",
                "arabicText": "وُلِدَ (عَلَيْهِ السَّلام) لِلنِّصْفِ مِنْ ذِي الْحِجَّةِ سَنَةَ اثْنَتَيْ عَشْرَةَ وَمِائَتَيْنِ.\r\n وَرُوِيَ أَنَّهُ وُلِدَ (عَلَيْهِ السَّلام) فِي رَجَبٍ سَنَةَ أَرْبَعَ عَشْرَةَ وَمِائَتَيْنِ وَمَضَى لارْبَعٍ بَقِينَ مِنْ جُمَادَى الاخِرَةِ سَنَةَ أَرْبَعٍ وَخَمْسِينَ وَمِائَتَيْنِ.\r\n وَرُوِيَ أَنَّهُ قُبِضَ (عَلَيْهِ السَّلام) فِي رَجَبٍ سَنَةَ أَرْبَعٍ وَخَمْسِينَ وَمِائَتَيْنِ وَلَهُ أَحَدٌ وَأَرْبَعُونَ سَنَةً وَسِتَّةُ أَشْهُرٍ.\r\n وَأَرْبَعُونَ سَنَةً عَلَى الْمَوْلِدِ الاخَرِ الَّذِي رُوِيَ وَكَانَ الْمُتَوَكِّلُ أَشْخَصَهُ مَعَ يَحْيَى بْنِ هَرْثَمَةَ بْنِ أَعْيَنَ مِنَ الْمَدِينَةِ إِلَى سُرَّ مَنْ رَأَى فَتُوُفِّيَ بِهَا (عَلَيْهِ السَّلام) وَدُفِنَ فِي دَارِهِ وَأُمُّهُ أُمُّ وَلَدٍ يُقَالُ لَهَا سَمَانَةُ.",
                "englishText": " He was born on Dhil Hajj fifteen in the year two hundred twelve. It is said that he was born in the month of Rajab in the year two hundred and fourteen AH. He passed away on twenty sixth of Jamadi al-Akhir in the year two hundred fifty two. It is narrated that he passed away in the month of Rajab in the year two hundred fifty four AH. He lived for forty one years and six months. According to the previously mentioned date he lived for forty years. Ali-Mutawakkil had summond him from al-Madina with Yahya ibn Harthama ibn ’Ayan to Surra man Ra‘Abdallah. He left this world therefrom and he was buried in his house. His mother was ’Umm Walad, called Samana.",
                "href": "https://thaqalayn.net/hadith/1/4/123/0",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "124": {
                "hadithNumber": "Hadith #0",
                "title": "Al-Kafi - Volume 1: The Birth of abu Muhammad al-Hassan ibn Ali (a.s.)",
                "arabicText": " وُلِدَ (عَلَيْهِ السَّلام) فِي شَهْرِ رَمَضَانَ وَفِي نُسْخَةٍ أُخْرَى فِي شَهْرِ رَبِيعٍ الاخِرِ سَنَةَ اثْنَتَيْنِ وَثَلاثِينَ وَمِائَتَيْنِ وَقُبِضَ (عَلَيْهِ السَّلام) يَوْمَ الْجُمُعَةِ لِثَمَانِ لَيَالٍ خَلَوْنَ مِنْ شَهْرِ رَبِيعٍ الاوَّلِ سَنَةَ سِتِّينَ وَمِائَتَيْنِ وَهُوَ ابْنُ ثَمَانٍ وَعِشْرِينَ سَنَةً وَدُفِنَ فِي دَارِهِ فِي الْبَيْتِ الَّذِي دُفِنَ فِيهِ أَبُوهُ بِسُرَّ مَنْ رَأَى وَأُمُّهُ أُمُّ وَلَدٍ يُقَالُ لَهَا حُدَيْثٌ وَقِيلَ سَوْسَنُ.",
                "englishText": " Abu Muhammad al-Hassan ibn Ali  was born in the month of Ramadan (in an other copy it is in ‘the month of Rabi‘ al-Awwal) in the year two hundred thirty two. He died on a Friday on the eighth of the month of Rabi‘ al-Awwal in the year two hundred sixty at the age of twenty eight. He was buried in the house where his father was buried in the city of Surra man Ra‘a (Samarra).her was ’Umm Walad, called Hudayth (or Sawsan).",
                "href": "https://thaqalayn.net/hadith/1/4/124/0",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "125": {
                "hadithNumber": "Hadith #0",
                "title": "Al-Kafi - Volume 1: The Birth of the Possessor (of Divine Authority) (a.s.)",
                "arabicText": " وُلِدَ (عَلَيْهِ السَّلام) لِلنِّصْفِ مِنْ شَعْبَانَ سَنَةَ خَمْسٍ وَخَمْسِينَ وَمِائَتَيْنِ.",
                "englishText": " He was born on fifteenth of the month of Sha‘ban in the year two hundred fifty five AH.",
                "href": "https://thaqalayn.net/hadith/1/4/125/0",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "126": {
                "hadithNumber": "Hadith #8",
                "title": "Al-Kafi - Volume 1: The Statements and the Explicit Texts on Leadership with Divine Authority) of the Twelve Imams (a.s.)",
                "arabicText": " 8ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مَسْعَدَةَ بْنِ زِيَادٍ عَنْ أَبِي عَبْدِ الله وَمُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ إِبْرَاهِيمَ عَنْ أَبِي يَحْيَى الْمَدَائِنِيِّ عَنْ أَبِي هَارُونَ الْعَبْدِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ كُنْتُ حَاضِراً لَمَّا هَلَكَ أَبُو بَكْرٍ وَاسْتَخْلَفَ عُمَرَ أَقْبَلَ يَهُودِيٌّ مِنْ عُظَمَاءِ يَهُودِ يَثْرِبَ وَتَزْعُمُ يَهُودُ الْمَدِينَةِ أَنَّهُ أَعْلَمُ أَهْلِ زَمَانِهِ حَتَّى رُفِعَ إِلَى عُمَرَ فَقَالَ لَهُ يَا عُمَرُ إِنِّي جِئْتُكَ أُرِيدُ الاسْلامَ فَإِنْ أَخْبَرْتَنِي عَمَّا أَسْأَلُكَ عَنْهُ فَأَنْتَ أَعْلَمُ أَصْحَابِ مُحَمَّدٍ بِالْكِتَابِ وَالسُّنَّةِ وَجَمِيعِ مَا أُرِيدُ أَنْ أَسْأَلَ عَنْهُ قَالَ فَقَالَ لَهُ عُمَرُ إِنِّي لَسْتُ هُنَاكَ لَكِنِّي أُرْشِدُكَ إِلَى مَنْ هُوَ أَعْلَمُ أُمَّتِنَا بِالْكِتَابِ وَالسُّنَّةِ وَجَمِيعِ مَا قَدْ تَسْأَلُ عَنْهُ وَهُوَ ذَاكَ فَأَوْمَأَ إِلَى علي (عَلَيْهِ السَّلام) فَقَالَ لَهُ الْيَهُودِيُّ يَا عُمَرُ إِنْ كَانَ هَذَا كَمَا تَقُولُ فَمَا لَكَ وَلِبَيْعَةِ النَّاسِ وَإِنَّمَا ذَاكَ أَعْلَمُكُمْ فَزَبَرَهُ عُمَرُ ثُمَّ إِنَّ الْيَهُودِيَّ قَامَ إِلَى علي (عَلَيْهِ السَّلام) فَقَالَ لَهُ أَنْتَ كَمَا ذَكَرَ عُمَرُ فَقَالَ وَمَا قَالَ عُمَرُ فَأَخْبَرَهُ قَالَ فَإِنْ كُنْتَ كَمَا قَالَ سَأَلْتُكَ عَنْ أَشْيَاءَ أُرِيدُ أَنْ أَعْلَمَ هَلْ يَعْلَمُهُ أَحَدٌ مِنْكُمْ فَأَعْلَمَ أَنَّكُمْ فِي دَعْوَاكُمْ خَيْرُ الامَمِ وَأَعْلَمُهَا صَادِقِينَ وَمَعَ ذَلِكَ أَدْخُلُ فِي دِينِكُمُ الاسْلامِ فَقَالَ أَمِيرُ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) نَعَمْ أَنَا كَمَا ذَكَرَ لَكَ عُمَرُ سَلْ عَمَّا بَدَا لَكَ أُخْبِرْكَ بِهِ إِنْ شَاءَ الله قَالَ أَخْبِرْنِي عَنْ ثَلاثٍ وَثَلاثٍ وَوَاحِدَةٍ فَقَالَ لَهُ علي (عَلَيْهِ السَّلام) يَا يَهُودِيُّ وَلِمَ لَمْ تَقُلْ أَخْبِرْنِي عَنْ سَبْعٍ فَقَالَ لَهُ الْيَهُودِيُّ إِنَّكَ إِنْ أَخْبَرْتَنِي بِالثَّلاثِ سَأَلْتُكَ عَنِ الْبَقِيَّةِ وَإِلا كَفَفْتُ فَإِنْ أَنْتَ أَجَبْتَنِي فِي هَذِهِ السَّبْعِ فَأَنْتَ أَعْلَمُ أَهْلِ الارْضِ وَأَفْضَلُهُمْ وَأَوْلَى النَّاسِ بِالنَّاسِ فَقَالَ لَهُ سَلْ عَمَّا بَدَا لَكَ يَا يَهُودِيُّ قَالَ أَخْبِرْنِي عَنْ أَوَّلِ حَجَرٍ وُضِعَ عَلَى وَجْهِ الارْضِ وَأَوَّلِ شَجَرَةٍ غُرِسَتْ عَلَى وَجْهِ الارْضِ وَأَوَّلِ عَيْنٍ نَبَعَتْ عَلَى وَجْهِ الارْضِ فَأَخْبَرَهُ أَمِيرُ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) ثُمَّ قَالَ لَهُ الْيَهُودِيُّ أَخْبِرْنِي عَنْ هَذِهِ الامَّةِ كَمْ لَهَا مِنْ إِمَامٍ هُدًى وَأَخْبِرْنِي عَنْ نَبِيِّكُمْ مُحَمَّدٍ أَيْنَ مَنْزِلُهُ فِي الْجَنَّةِ وَأَخْبِرْنِي مَنْ مَعَهُ فِي الْجَنَّةِ فَقَالَ لَهُ أَمِيرُ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) إِنَّ لِهَذِهِ الامَّةِ اثْنَيْ عَشَرَ إِمَاماً هُدًى مِنْ ذُرِّيَّةِ نَبِيِّهَا وَهُمْ مِنِّي وَأَمَّا مَنْزِلُ نَبِيِّنَا فِي الْجَنَّةِ فَفِي أَفْضَلِهَا وَأَشْرَفِهَا جَنَّةِ عَدْنٍ وَأَمَّا مَنْ مَعَهُ فِي مَنْزِلِهِ فِيهَا فَهَؤُلاءِ الاثْنَا عَشَرَ مِنْ ذُرِّيَّتِهِ وَأُمُّهُمْ وَجَدَّتُهُمْ وَأُمُّ أُمِّهِمْ وَذَرَارِيُّهُمْ لا يَشْرَكُهُمْ فِيهَا أَحَدٌ.",
                "englishText": " 8. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Mas‘ada ibn Ziyad from abu ‘Abdallah and Muhammad ibn al-Husayn from Ibrahim from ibn abu Yahya al-Madyani from abu Harun al-‘Abdi from abu Sa‘id al-Khudriy who has said the following. “I was (in the city of al-Madina) when abu Bakr was no more and he appointed ‘Umar as his successor. Once one of the great Jewish men of Yathrib came to ‘Umar. The Jewish people of the city of al-Madina thought that he (‘Umar) was the most knowledgeable person of his time.He came to ‘Umar and said, “O ‘Umar, I have come to accept Islam if you would answer what I will ask. Are you the most knowledgeable person among the companions of Muhammad in the matters of the book, the Sunnah (his traditions) and all that I like to ask from you.” The narrator has said that ‘Umar than said to him, “I am not the one you are looking for. However, I can guide you to the one who is the most knowledgeable person in our nation in the matters of the book, the Sunnah (traditions of the Holy Prophet (s.a.) and all that you like to ask.” He pointed out to Ali . the Jewish man then said, “If what you say is true then why have you taken the oath of allegiance from people? The most knowledge among you is that man.” ‘Umar then treated him harshly. The Jewish man went to Ali  and said, “Are you as such as ‘Umar has said?” He (Ali  then asked, “What has ‘Umar said?” He then informed him of what ‘Umar had said. The Jewish man said, “If are as has said you are, I like to ask you certain questions toknow if anyone of you knows the answer so I would know that your claim is true that you are the best, the best and the truth among the nations. In such case I will accept your religion, Islam.” Amir al-Mu’minin  said, “Yes, I am as ‘Umar has I am. Ask whatever you would like to ask. I will give the answer by the will of Allah.” He said, “Tell me about three and three and one.” Ali  said, “O Jewish man, why do not say, “Tell me about seven?” The Jewish man then said, “If you would tell me the answer to the three then I will ask you other questions, otherwise, I will abstain. If you would provide me the answer to these seven you then you are the most knowledgeable person on earth, the best of them and have more authority over the people than they themselves do” he then said, “Ask your questions O Jewish man.” .He said, “Tell me about the first stone that was placed on the face of earth, the first tree that was planted on earth and the first water fountain that gushed out of earth.” Amir al-Mu’minin  answered his questions. The Jewish man then said to him, “Tell me how many Imams (Leaders with Divine Authority) will this nation have? Tell me about your Prophet as to where will be his place in paradise and who will be with him therein?” Amir al-Mu’minin  said, “This nation will have twelve Imams ((Leaders with Divine Authority).All of them will be from the descendants of the the Holy Prophet (s.a.) of this nation. They will be from my descendants. The place of out the Holy Prophet (s.a.) in paradise will be the best and holiest of them in Eden. Those who will be with him therein in his dwelling will be these twelve people from his descendants. Their mother and grand mother and the mother of their mother and their descendants will live with them therein. No one else will live therein as their partner.”",
                "href": "https://thaqalayn.net/hadith/1/4/126/8",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "127": {
                "hadithNumber": "Hadith #3",
                "title": "Al-Kafi - Volume 1: Something said about a man and it is not in him but is found in his sons or grand sons than it is as if it is in him",
                "arabicText": " 3ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ أَحْمَدَ بْنِ عَائِذٍ عَنْ أَبِي خَدِيجَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) يَقُولُ قَدْ يَقُومُ الرَّجُلُ بِعَدْلٍ أَوْ بِجَوْرٍ وَيُنْسَبُ إِلَيْهِ وَلَمْ يَكُنْ قَامَ بِهِ فَيَكُونُ ذَلِكَ ابْنَهُ أَوِ ابْنَ ابْنِهِ مِنْ بَعْدِهِ فَهُوَ هُوَ.",
                "englishText": " 3. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from al-Washsha’ from Ahmad ibn ‘A’idh from abu Khadija who has said the following. “I heard abu ‘Abdallah  say, ‘Sometimes a man is considered as practicing justice or acting unjustly and such acts are ascribed to him even if he may not have committed them but such acts are found in his sons or his grandsons after him then he will be it (the one who has in reality his practiced such acts).”",
                "href": "https://thaqalayn.net/hadith/1/4/127/3",
                "gradings": {}
            }
        }
    },
    {
        "4": {
            "130": {
                "hadithNumber": "Hadith #0",
                "title": "Al-Kafi - Volume 1: The Fay’, al-Anfal, al-Khums, its rules and the properties subject to al-Khums",
                "arabicText": " إِنَّ الله تَبَارَكَ وَتَعَالَى جَعَلَ الدُّنْيَا كُلَّهَا بِأَسْرِهَا لِخَلِيفَتِهِ حَيْثُ يَقُولُ لِلْمَلائِكَةِ إِنِّي جاعِلٌ فِي الارْضِ خَلِيفَةً فَكَانَتِ الدُّنْيَا بِأَسْرِهَا لآِدَمَ وَصَارَتْ بَعْدَهُ لابْرَارِ وُلْدِهِ وَخُلَفَائِهِ فَمَا غَلَبَ عَلَيْهِ أَعْدَاؤُهُمْ ثُمَّ رَجَعَ إِلَيْهِمْ بِحَرْبٍ أَوْ غَلَبَةٍ سُمِّيَ فَيْئاً وَهُوَ أَنْ يَفِي‏ءَ إِلَيْهِمْ بِغَلَبَةٍ وَحَرْبٍ وَكَانَ حُكْمُهُ فِيهِ مَا قَالَ الله تَعَالَى وَاعْلَمُوا أَنَّما غَنِمْتُمْ مِنْ شَيْ‏ءٍ فَأَنَّ لله خُمُسَهُ وَلِلرَّسُولِ وَلِذِي الْقُرْبى‏ وَالْيَتامى‏ وَالْمَساكِينِ وَابْنِ السَّبِيلِ فَهُوَ لله وَلِلرَّسُولِ وَلِقَرَابَةِ الرَّسُولِ فَهَذَا هُوَ الْفَيْ‏ءُ الرَّاجِعُ وَإِنَّمَا يَكُونُ الرَّاجِعُ مَا كَانَ فِي يَدِ غَيْرِهِمْ فَأُخِذَ مِنْهُمْ بِالسَّيْفِ وَأَمَّا مَا رَجَعَ إِلَيْهِمْ مِنْ غَيْرِ أَنْ يُوجَفَ عَلَيْهِ بِخَيْلٍ وَلا رِكَابٍ فَهُوَ الانْفَالُ هُوَ لله وَلِلرَّسُولِ خَاصَّةً لَيْسَ لاحَدٍ فِيهِ الشِّرْكَةُ وَإِنَّمَا جُعِلَ الشِّرْكَةُ فِي شَيْ‏ءٍ قُوتِلَ عَلَيْهِ فَجُعِلَ لِمَنْ قَاتَلَ مِنَ الْغَنَائِمِ أَرْبَعَةُ أَسْهُمٍ وَلِلرَّسُولِ سَهْمٌ وَالَّذِي لِلرَّسُولِ (صَلَّى اللهُ عَلَيْهِ وَآلِه) يَقْسِمُهُ عَلَى سِتَّةِ أَسْهُمٍ ثَلاثَةٌ لَهُ وَثَلاثَةٌ لِلْيَتَامَى وَالْمَسَاكِينِ وَابْنِ السَّبِيلِ وَأَمَّا الانْفَالُ فَلَيْسَ هَذِهِ سَبِيلَهَا كَانَ لِلرَّسُولِ (صَلَّى اللهُ عَلَيْهِ وَآلِه) خَاصَّةً وَكَانَتْ فَدَكُ لِرَسُولِ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) خَاصَّةً لانَّهُ (صَلَّى اللهُ عَلَيْهِ وَآلِه) فَتَحَهَا وَأَمِيرَ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) لَمْ يَكُنْ مَعَهُمَا أَحَدٌ فَزَالَ عَنْهَا اسْمُ الْفَيْ‏ءِ وَلَزِمَهَا اسْمُ الانْفَالِ وَكَذَلِكَ الاجَامُ وَالْمَعَادِنُ وَالْبِحَارُ وَالْمَفَاوِزُ هِيَ لِلامَامِ خَاصَّةً فَإِنْ عَمِلَ فِيهَا قَوْمٌ بِإِذْنِ الامَامِ فَلَهُمْ أَرْبَعَةُ أَخْمَاسٍ وَلِلامَامِ خُمُسٌ وَالَّذِي لِلامَامِ يَجْرِي مَجْرَى الْخُمُسِ وَمَنْ عَمِلَ فِيهَا بِغَيْرِ إِذْنِ الامَامِ فَالامَامُ يَأْخُذُهُ كُلَّهُ لَيْسَ لاحَدٍ فِيهِ شَيْ‏ءٌ وَكَذَلِكَ مَنْ عَمَرَ شَيْئاً أَوْ أَجْرَى قَنَاةً أَوْ عَمِلَ فِي أَرْضٍ خَرَابٍ بِغَيْرِ إِذْنِ صَاحِبِ الارْضِ فَلَيْسَ لَهُ ذَلِكَ فَإِنْ شَاءَ أَخَذَهَا مِنْهُ كُلَّهَا وَإِنْ شَاءَ تَرَكَهَا فِي يَدِهِ.",
                "englishText": " Al-Kulayni, may grant him blessings has said the following. “Allah, the Most Holy, the Most High, has invented the whole world for His deputy as He has said to His angels. “When your Lord said to the angels, “I am appointing someone as my deputy on earth, . .” (2:30) The whole world was for Adam and after him it belonged to the good ones among his descendants and his successors. Whatever their enemies had taken away from them came back to them through war or conquest that is called Fay’. It is the propety that would come to the as a result of conquest or war. The rules for such properties in it (the book) is as Allah has said, “Know that whatever property you may gain, one fifth belongs to God, the Messenger, the kindred, orphans, the needy and those who need money while on a journey. . .” (8:41) Such properties belong to Allah, the Messenger and the relatives of the Messenger. Such properties are called al-Fay’ (taken back). It is the property taken back from others by force. However, whatever would come to them without the use of force and resources such as horses and man it is called al-Anfal. This kind of properties belong to Allah and the Messenger only and no one else woill have any share in it. Others can have shares only in what is acquired through blood shed and fighting. All those who would take part in the struggle will have certain shares. Properties taken in such way is divided into four portions out of which one would belong to the Messeenger. The portion that belongs to the Messenger is divided into six portions. Three will be for him and the other three for the orphans. The destitute and those left without means on a journey. However, the case of al-Anfal is different. It belongs to the Messenger only. Of such properties was Fadak that belonged to the Messenger of Allah only. It is because he and Amir al-Mu’minin  conquered it and there no one else took part. The name al-Fay’ therefore does not apply to it. Al-Anfal applies to it. Similar to al-Anfal are such properties as the marshes, mines, oceans and the wilderness. They all belong to Imam exclusively. If people would work in them by the permission of the Imam four fifth will belong to them for labor and one fifth would belong to the Imam. Such one fifth is like al-Khums. If people would work in such properties without the permission of the Imam, the Imam will have all of it and no one would have any thing in them. The same would be the case if someone would work, revive, improve, develop and build on a land without the permission of the Imam. It would be up to the Imam to leave it with him or take it away from him or settle it differently.”",
                "href": "https://thaqalayn.net/hadith/1/4/130/0",
                "gradings": {}
            }
        }
    }
]