[
    {
        "1": {
            "19": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: About the words of Allah ‘Mischief has spread over the land…’ (30:41)",
                    "arabicText": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنِ ابْنِ مُسْكَانَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِهِ عَزَّ وَ جَلَّ ظَهَرَ الْفَسادُ فِي الْبَرِّ وَ الْبَحْرِ بِما كَسَبَتْ أَيْدِي النَّاسِ قَالَ ذَاكَ وَ اللَّهِ حِينَ قَالَتِ الْأَنْصَارُ مِنَّا أَمِيرٌ وَ مِنْكُمْ أَمِيرٌ .",
                    "englishText": "19. Muhammad Bin Yahya, from Muhammad Bin Al-Husyan, fom Ali Bin Al-No’man, from Ibn Muskaan, from Muhammad Bin Muslim who has said: Abu Ja’far  regarding the Statement of the Mighty and Majestic: “[30:41] Corruption has appeared in the land and the sea on account of what the hands of men have wrought”, he  said: ‘By Allah (azwj), that was when the ‘Al-Ansar’ (Helpers) said, ‘from us should be an Emir (commander), and from you should be an Emir’ (referring to Saqifa).",
                    "href": "https://thaqalayn.net/hadith/8/1/19/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3/383)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "45": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: The potter and the farmer in-laws",
                    "arabicText": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ فَضَّالٍ عَنْ عَبْدِ اللَّهِ بْنِ بُكَيْرٍ وَ ثَعْلَبَةَ بْنِ مَيْمُونٍ وَ عَلِيِّ بْنِ عُقْبَةَ عَنْ زُرَارَةَ عَنْ عَبْدِ الْمَلِكِ قَالَ وَقَعَ بَيْنَ أَبِي جَعْفَرٍ وَ بَيْنَ وَلَدِ الْحَسَنِ ( عليه السلام ) كَلَامٌ فَبَلَغَنِي ذَلِكَ فَدَخَلْتُ عَلَى أَبِي جَعْفَرٍ ( عليه السلام ) فَذَهَبْتُ أَتَكَلَّمُ فَقَالَ لِي مَهْ لَا تَدْخُلْ فِيمَا بَيْنَنَا فَإِنَّمَا مَثَلُنَا وَ مَثَلُ بَنِي عَمِّنَا كَمَثَلِ رَجُلٍ كَانَ فِي بَنِي إِسْرَائِيلَ كَانَتْ لَهُ ابْنَتَانِ فَزَوَّجَ إِحْدَاهُمَا مِنْ رَجُلٍ زَرَّاعٍ وَ زَوَّجَ الْأُخْرَى مِنْ رَجُلٍ فَخَّارٍ ثُمَّ زَارَهُمَا فَبَدَأَ بِامْرَأَةِ الزَّرَّاعِ فَقَالَ لَهَا كَيْفَ حَالُكُمْ فَقَالَتْ قَدْ زَرَعَ زَوْجِي زَرْعاً كَثِيراً فَإِنْ أَرْسَلَ اللَّهُ السَّمَاءَ فَنَحْنُ أَحْسَنُ بَنِي إِسْرَائِيلَ حَالًا ثُمَّ مَضَى إِلَى امْرَأَةِ الْفَخَّارِ فَقَالَ لَهَا كَيْفَ حَالُكُمْ فَقَالَتْ قَدْ عَمِلَ زَوْجِي فَخَّاراً كَثِيراً فَإِنْ أَمْسَكَ اللَّهُ السَّمَاءَ فَنَحْنُ أَحْسَنُ بَنِي إِسْرَائِيلَ حَالًا فَانْصَرَفَ وَ هُوَ يَقُولُ اللَّهُمَّ أَنْتَ لَهُمَا وَ كَذَلِكَ نَحْنُ.",
                    "englishText": "45. Muhammad Bin Yahya, form Ahmad Bin Muhammad Bin Isa, from Ibn Fazzaal, from Abdullah Bin Bukeyr and Sa’alba Bin Maymoun and Ali Bin Uqba, from Zarara, from Abdul Malik who said: ‘A discussion took place between Abu Ja’far  and the children of Al-Hassan . That reached me, so I came up to Abu Ja’far  to speak to him  about it. He  said to me: ‘Shhh! Do not interfere in what is in between us , for our  example and the example of the sons of our  uncle is like the man who was in the Children of Israel who had two daughters. So he married one of them to a farmer and married the other one to a potter. Then he went to visit them both. So he first went to the wife of the farmer and said to her, ‘What is your condition?’ She said, ‘The farm of my husband is a large farm, so if Allah (azwj) were to send (rain from) the sky, we would be in the best condition of the Children of Israel’. Then he went to the wife of the potter, so he said to her, ‘What is your condition?’ She said, ‘My husband has worked to produce a lot of pottery, so if Allah (azwj) were to Withhold (the rain from) the sky, we would be in the best condition of the Children of Israel’. So he left and he was saying, ‘Our Allah (azwj) You are for them both’, and that is how it is with us’.",
                    "href": "https://thaqalayn.net/hadith/8/1/45/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 383)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "49": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: The tax collector harasses the imam",
                    "arabicText": "عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ مُرَازِمٍ عَنْ أَبِيهِ قَالَ خَرَجْنَا مَعَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) حَيْثُ خَرَجَ مِنْ عِنْدِ أَبِي جَعْفَرٍ الْمَنْصُورِ مِنَ الْحِيرَةِ فَخَرَجَ سَاعَةَ أُذِنَ لَهُ وَ انْتَهَى إِلَى السَّالِحِينَ فِي أَوَّلِ اللَّيْلِ فَعَرَضَ لَهُ عَاشِرٌ كَانَ يَكُونُ فِي السَّالِحِينَ فِي أَوَّلِ اللَّيْلِ فَقَالَ لَهُ لَا أَدَعُكَ أَنْ تَجُوزَ فَأَلَحَّ عَلَيْهِ وَ طَلَبَ إِلَيْهِ فَأَبَى إِبَاءً وَ أَنَا وَ مُصَادِفٌ مَعَهُ فَقَالَ لَهُ مُصَادِفٌ جُعِلْتُ فِدَاكَ إِنَّمَا هَذَا كَلْبٌ قَدْ آذَاكَ وَ أَخَافُ أَنْ يَرُدَّكَ وَ مَا أَدْرِي مَا يَكُونُ مِنْ أَمْرِ أَبِي جَعْفَرٍ وَ أَنَا وَ مُرَازِمٌ أَ تَأْذَنُ لَنَا أَنْ نَضْرِبَ عُنُقَهُ ثُمَّ نَطْرَحَهُ فِي النَّهَرِ فَقَالَ كُفَّ يَا مُصَادِفُ فَلَمْ يَزَلْ يَطْلُبُ إِلَيْهِ حَتَّى ذَهَبَ مِنَ اللَّيْلِ أَكْثَرُهُ فَأَذِنَ لَهُ فَمَضَى فَقَالَ يَا مُرَازِمُ هَذَا خَيْرٌ أَمِ الَّذِي قُلْتُمَاهُ قُلْتُ هَذَا جُعِلْتُ فِدَاكَ فَقَالَ إِنَّ الرَّجُلَ يَخْرُجُ مِنَ الذُّلِّ الصَّغِيرِ فَيُدْخِلُهُ ذَلِكَ فِي الذُّلِّ الْكَبِيرِ.",
                    "englishText": "49. From him, from Ahmad Bin Muhammad, from Muhammad Bin Murazim, from his father who said: ‘We went out with Abu Abdullah  when he  left from the presence of Abu Ja’far Al-Mansour from Al-Hira. So he  left at the time permitted for him  and ended up at Al-Saliheen in the beginning of the night. A tax collector presented himself to him  who was in Al-Saliheen in the beginning of the night. He said to him , ‘I will not permit you  to leave’. So he  urged him and requested him, but he refused, rejecting it. And I and Musaddaf were with him . So Musaddaf said to him , ‘May I be sacrificed for you, but this one is a dog. He has troubled you, and I fear that he would make you  return, and I do not know what would be the order of Abu Ja’far (Al-Mansour). If you  permit us, I and Murazim can strike his neck, then throw him (his body) in the river’. He  said: ‘Restrain yourself, O Musaddaf’. So he  did not stop requesting him until most of the night had passed, and he permitted him  to pass. He  said: ‘O Murazim, is this better or that which you had said?’ I said, ‘May I be sacrificed for you, this (is better)’. So he  said: ‘The man comes out of the smaller humiliation, but that pushes him enter into the greater humiliation’.",
                    "href": "https://thaqalayn.net/hadith/8/1/49/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 384)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "66": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Meaning of relatives",
                    "arabicText": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ إِسْمَاعِيلَ بْنِ عَبْدِ الْخَالِقِ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ لِأَبِي جَعْفَرٍ الْأَحْوَلِ وَ أَنَا أَسْمَعُ أَتَيْتَ الْبَصْرَةَ فَقَالَ نَعَمْ قَالَ كَيْفَ رَأَيْتَ مُسَارَعَةَ النَّاسِ إِلَى هَذَا الْأَمْرِ وَ دُخُولَهُمْ فِيهِ قَالَ وَ اللَّهِ إِنَّهُمْ لَقَلِيلٌ وَ لَقَدْ فَعَلُوا وَ إِنَّ ذَلِكَ لَقَلِيلٌ فَقَالَ عَلَيْكَ بِالْأَحْدَاثِ فَإِنَّهُمْ أَسْرَعُ إِلَى كُلِّ خَيْرٍ ثُمَّ قَالَ مَا يَقُولُ أَهْلُ الْبَصْرَةِ فِي هَذِهِ الْآيَةِ قُلْ لا أَسْئَلُكُمْ عَلَيْهِ أَجْراً إِلَّا الْمَوَدَّةَ فِي الْقُرْبى قُلْتُ جُعِلْتُ فِدَاكَ إِنَّهُمْ يَقُولُونَ إِنَّهَا لِأَقَارِبِ رَسُولِ اللَّهِ (صلى الله عليه وآله) فَقَالَ كَذَبُوا إِنَّمَا نَزَلَتْ فِينَا خَاصَّةً فِي أَهْلِ الْبَيْتِ فِي عَلِيٍّ وَ فَاطِمَةَ وَ الْحَسَنِ وَ الْحُسَيْنِ أَصْحَابِ الْكِسَاءِ (عليهم السلام).",
                    "englishText": "66. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al-Hakam, from Ismail Bin Abd Al-Khaliq who said: ‘I heard Abu Abdullah  saying to Abu Ja’far Al-Ahwal, and I was listening: ‘Did you go to Al-Basra?’ He said, ‘Yes’. He  said: ‘How did you see the hastening of the people to this matter and their entering in it to be?’ He said, ‘By Allah (azwj), they are few, and they have done it but that is little’. He  said: ‘It is on you to (approach) the juveniles for they are quick to every good’. Then he  said: ‘What are the people of Al-Basra saying regarding this Verse: ‘[42:23] Say: I do not ask of you any reward for it but love for my near relatives”. I said, ‘May I be sacrificed for you , they are saying that it is for the near relatives of the Rasool ﷺ of Allah (azwj)’. He  said: ‘They lie. But rather it Descended with regards to us  especially, regarding the People  of the Household, regarding Ali , and Fatima , and Al-Hassan , and Al-Husayn  the ones of the Cloak (As’haab Al-Kisaa)’.",
                    "href": "https://thaqalayn.net/hadith/8/1/66/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 384)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "80": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Those who love Ahl al Bayt,'Alayhim al-Salam",
                    "arabicText": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ فَضَّالٍ عَنْ ثَعْلَبَةَ بْنِ مَيْمُونٍ عَنْ أَبِي أُمَيَّةَ يُوسُفَ بْنِ ثَابِتِ بْنِ أَبِي سَعِيدَةَ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) أَنَّهُمْ قَالُوا حِينَ دَخَلُوا عَلَيْهِ إِنَّمَا أَحْبَبْنَاكُمْ لِقَرَابَتِكُمْ مِنْ رَسُولِ اللَّهِ (صلى الله عليه وآله) وَ لِمَا أَوْجَبَ اللَّهُ عَزَّ وَ جَلَّ مِنْ حَقِّكُمْ مَا أَحْبَبْنَاكُمْ لِلدُّنْيَا نُصِيبُهَا مِنْكُمْ إِلَّا لِوَجْهِ اللَّهِ وَ الدَّارِ الْآخِرَةِ وَ لِيَصْلُحَ لِامْرِئٍ مِنَّا دِينُهُ فَقَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) صَدَقْتُمْ صَدَقْتُمْ ثُمَّ قَالَ مَنْ أَحَبَّنَا كَانَ مَعَنَا أَوْ جَاءَ مَعَنَا يَوْمَ الْقِيَامَةِ هَكَذَا ثُمَّ جَمَعَ بَيْنَ السَّبَّابَتَيْنِ ثُمَّ قَالَ وَ اللَّهِ لَوْ أَنَّ رَجُلًا صَامَ النَّهَارَ وَ قَامَ اللَّيْلَ ثُمَّ لَقِيَ اللَّهَ عَزَّ وَ جَلَّ بِغَيْرِ وَلَايَتِنَا أَهْلَ الْبَيْتِ لَلَقِيَهُ وَ هُوَ عَنْهُ غَيْرُ رَاضٍ أَوْ سَاخِطٌ عَلَيْهِ ثُمَّ قَالَ وَ ذَلِكَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ وَ ما مَنَعَهُمْ أَنْ تُقْبَلَ مِنْهُمْ نَفَقاتُهُمْ إِلَّا أَنَّهُمْ كَفَرُوا بِاللَّهِ وَ بِرَسُولِهِ وَ لا يَأْتُونَ الصَّلاةَ إِلَّا وَ هُمْ كُسالى وَ لا يُنْفِقُونَ إِلَّا وَ هُمْ كارِهُونَ فَلا تُعْجِبْكَ أَمْوالُهُمْ وَ لا أَوْلادُهُمْ إِنَّما يُرِيدُ اللَّهُ لِيُعَذِّبَهُمْ بِها فِي الْحَياةِ الدُّنْيا وَ تَزْهَقَ أَنْفُسُهُمْ وَ هُمْ كافِرُونَ ثُمَّ قَالَ وَ كَذَلِكَ الْإِيمَانُ لَا يَضُرُّ مَعَهُ الْعَمَلُ وَ كَذَلِكَ الْكُفْرُ لَا يَنْفَعُ مَعَهُ الْعَمَلُ ثُمَّ قَالَ إِنْ تَكُونُوا وَحْدَانِيِّينَ فَقَدْ كَانَ رَسُولُ اللَّهِ (صلى الله عليه وآله) وَحْدَانِيّاً يَدْعُو النَّاسَ فَلَا يَسْتَجِيبُونَ لَهُ وَ كَانَ أَوَّلَ مَنِ اسْتَجَابَ لَهُ عَلِيُّ بْنُ أَبِي طَالِبٍ (عليه السلام) وَ قَدْ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) أَنْتَ مِنِّي بِمَنْزِلَةِ هَارُونَ مِنْ مُوسَى إِلَّا أَنَّهُ لَا نَبِيَّ بَعْدِي. َلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ يُونُسَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) لِعَبَّادِ بْنِ كَثِيرٍ الْبَصْرِيِّ الصُّوفِيِّ وَيْحَكَ يَا عَبَّادُ غَرَّكَ أَنْ عَفَّ بَطْنُكَ وَ فَرْجُكَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ فِي كِتَابِهِ يا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَ قُولُوا قَوْلًا سَدِيداً يُصْلِحْ لَكُمْ أَعْمالَكُمْ اعْلَمْ أَنَّهُ لَا يَتَقَبَّلُ اللَّهُ مِنْكَ شَيْئاً حَتَّى تَقُولَ قَوْلًا عَدْلًا.",
                    "englishText": "80. Abu Ali Al-Ashary, from Muhammad Bin Abdul Jabbaar, from Al-Hassan Bin Ali Bin Fazzaal, from Tha’albat Bin Maymoun, from Aby Amiyya Yusuf Bin Sabit Bin Abu Saeeda, who has narrated the following: Abu Abdullah  having said when they came up to him and said, ‘But rather, we love you  due to your  nearness to the Rasool ﷺ Allah (azwj), and for what Allah (azwj) Mighty and Majestic has Obligated from your  rights. We do not love you  for the sake of the world for getting a share of it from you . But (we love you ) only for the Sake of Allah (azwj) and the House of the Hereafter and that the man from among us would be able to correct his Religion’. So Abu Abdullah  said: ‘You have spoken the truth, you have spoken the truth’. Then he  said: ‘The one who loves us  is as if he is with us , or will come with us  on the Day of Judgement like this’ – then he  joined the two forefingers, then said – ‘By Allah (azwj)! If the man were to Fast during the day, and stand up (for Prayer) during the night, then meets Allah (azwj) Mighty and Majestic without our  Wilayah, (the People  of the Household) he then would be facing Him (azwj) (in such that) Allah (azwj) would either be Unhappy with him or Angry against him’. Then he  said: ‘And that is the Statement of Allah (azwj) Mighty and Majestic: “[9:54] The only reasons why their contributions are not accepted are: that they reject Allah and His Rasool; that they come to prayer without earnestness; and that they offer contributions unwillingly [9:55] Let not then their property and their children excite your admiration; Allah only wishes to chastise them with these in this world’s life and (that) their souls may depart while they are unbelievers” Then he  said: ‘And such is that belief that the (bad) deed neither had affected it adversely nor is that disbelief that the (good) deed had provided any profit to it’. Then he  said; ‘You should become (believers in) Oneness (of Allah (azwj)) for the Rasool ﷺ Allah (azwj) had called the people to the Oneness (of Allah (azwj)) but they did not answer him ﷺ, and the first one who had came forward to him ﷺ was Ali  Bin Abu Talib , and the Rasool ﷺ Allah (azwj) said: ‘You  are from me ﷺ of the status which Haroun  had from Musa  except that there is no Prophet  after me ﷺ’.",
                    "href": "https://thaqalayn.net/hadith/8/1/80/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 385)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "96": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: The rare hadith about Abu Dharr",
                    "arabicText": "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ مُحَمَّدِ بْنِ أَيُّوبَ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ أَتَى أَبُو ذَرٍّ رَسُولَ اللَّهِ (صلى الله عليه وآله) فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي قَدِ اجْتَوَيْتُ الْمَدِينَةَ أَ فَتَأْذَنُ لِي أَنْ أَخْرُجَ أَنَا وَ ابْنُ أَخِي إِلَى مُزَيْنَةَ فَنَكُونَ بِهَا فَقَالَ إِنِّي أَخْشَى أَنْ يُغِيرَ عَلَيْكَ خَيْلٌ مِنَ الْعَرَبِ فَيُقْتَلَ ابْنُ أَخِيكَ فَتَأْتِيَنِي شَعَثاً فَتَقُومَ بَيْنَ يَدَيَّ مُتَّكِئاً عَلَى عَصَاكَ فَتَقُولَ قُتِلَ ابْنُ أَخِي وَ أُخِذَ السَّرْحُ فَقَالَ يَا رَسُولَ اللَّهِ بَلْ لَا يَكُونُ إِلَّا خَيْراً إِنْ شَاءَ اللَّهُ فَأَذِنَ لَهُ رَسُولُ اللَّهِ (صلى الله عليه وآله) فَخَرَجَ هُوَ وَ ابْنُ أَخِيهِ وَ امْرَأَتُهُ فَلَمْ يَلْبَثْ هُنَاكَ إِلَّا يَسِيراً حَتَّى غَارَتْ خَيْلٌ لِبَنِي فَزَارَةَ فِيهَا عُيَيْنَةُ بْنُ حِصْنٍ فَأُخِذَتِ السَّرْحُ وَ قُتِلَ ابْنُ أَخِيهِ وَ أُخِذَتِ امْرَأَتُهُ مِنْ بَنِي غِفَارٍ وَ أَقْبَلَ أَبُو ذَرٍّ يَشْتَدُّ حَتَّى وَقَفَ بَيْنَ يَدَيْ رَسُولِ اللَّهِ (صلى الله عليه وآله) وَ بِهِ طَعْنَةٌ جَائِفَةٌ فَاعْتَمَدَ عَلَى عَصَاهُ وَ قَالَ صَدَقَ اللَّهُ وَ رَسُولُهُ أُخِذَ السَّرْحُ وَ قُتِلَ ابْنُ أَخِي وَ قُمْتُ بَيْنَ يَدَيْكَ عَلَى عَصَايَ فَصَاحَ رَسُولُ اللَّهِ (صلى الله عليه وآله) فِي الْمُسْلِمِينَ فَخَرَجُوا فِي الطَّلَبِ فَرَدُّوا السَّرْحَ وَ قَتَلُوا نَفَراً مِنَ الْمُشْرِكِينَ.",
                    "englishText": "96. Humeyd Bin Ziyad, from Al-Hassan Bin Muhammad Bin Sama’at, from Muhammad Bin Ayyub and Ali Bin Ibrahim, from his father altogether from Ahmad Bin Muhammad Bin Abu Nasr, from Abaan Bin Usmaan, from Abu Baseer, who has narrated the following: Abu Abdullah  having said: ‘Abu Dharr (ar) came to the Rasool ﷺ Allah (azwj) and said, ‘O Rasool ﷺ Allah (azwj), I  have begun disliking Al-Medina. Will you ﷺ permit me , and that I (ar) and the son of my (ar) brother go out to Muzeyna, for we are from it?’ He ﷺ said: ‘I ﷺ fear that you (ar) might be attacked by Arab horsemen, so they would kill the son of your (ar) brother and you will come to me ﷺ beaten up, and stand in front of me ﷺ leaning upon your stick and you will say, ‘The son of my (ar) brother has been killed, and the cattle taken away’. He (ar) said, ‘O Rasool ﷺ Allah (azwj), but nothing will happen except for the good, Allah (azwj) Willing’. So the Rasool ﷺ Allah (azwj) gave him (ar) permission. So he (ar) and the son of his (ar) brother, and his (ar) wife went out. But, very soon the horsemen of the Clan of Fazaarat, among whom was Uyaynah Bin Hasan attacked them, took away the cattle, and killed the son of his (ar) brother, and took his (ar) wife who as from the Clan of Ghaffaar. And Abu Dharr (ar) came up in an intensely difficult condition and paused in front of the Rasool ﷺ Allah (azwj), badly wounded and leaning upon his stick and said, ‘Allah (azwj) and His (azwj) Rasool ﷺ were right. The cattle were taken, and the son of my (ar) brother being killed, and I (ar) am leaning upon my stick’. So the Rasool ﷺ Allah (azwj) cried out among the Muslims. So they went out in the search, and returned the cattle, and killed a number from the Polytheists’.",
                    "href": "https://thaqalayn.net/hadith/8/1/96/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 385)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "97": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Armed expedition of Dhat al-Riqa’",
                    "arabicText": "أَبَانٌ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) نَزَلَ رَسُولُ اللَّهِ (صلى الله عليه وآله) فِي غَزْوَةِ ذَاتِ الرِّقَاعِ تَحْتَ شَجَرَةٍ عَلَى شَفِيرِ وَادٍ فَأَقْبَلَ سَيْلٌ فَحَالَ بَيْنَهُ وَ بَيْنَ أَصْحَابِهِ فَرَآهُ رَجُلٌ مِنَ الْمُشْرِكِينَ وَ الْمُسْلِمُونَ قِيَامٌ عَلَى شَفِيرِ الْوَادِي يَنْتَظِرُونَ مَتَى يَنْقَطِعُ السَّيْلُ فَقَالَ رَجُلٌ مِنَ الْمُشْرِكِينَ لِقَوْمِهِ أَنَا أَقْتُلُ مُحَمَّداً فَجَاءَ وَ شَدَّ عَلَى رَسُولِ اللَّهِ (صلى الله عليه وآله) بِالسَّيْفِ ثُمَّ قَالَ مَنْ يُنْجِيكَ مِنِّي يَا مُحَمَّدُ فَقَالَ رَبِّي وَ رَبُّكَ فَنَسَفَهُ جَبْرَئِيلُ (عليه السلام) عَنْ فَرَسِهِ فَسَقَطَ عَلَى ظَهْرِهِ فَقَامَ رَسُولُ اللَّهِ (صلى الله عليه وآله) وَ أَخَذَ السَّيْفَ وَ جَلَسَ عَلَى صَدْرِهِ وَ قَالَ مَنْ يُنْجِيكَ مِنِّي يَا غَوْرَثُ فَقَالَ جُودُكَ وَ كَرَمُكَ يَا مُحَمَّدُ فَتَرَكَهُ فَقَامَ وَ هُوَ يَقُولُ وَ اللَّهِ لَأَنْتَ خَيْرٌ مِنِّي وَ أَكْرَمُ.",
                    "englishText": "97. Abaan, from Abu Baseer has narrated the following: Abu Abdullah  has said that the Rasool ﷺ Allah (azwj) encamped under a tree on the edge of the valley during the (military) expedition of Zaat Al-Raqa’a. A flooding came in between him ﷺ and his ﷺ companions. A man from the Polytheists saw it, and the Muslims were standing upon the edge of the valley waiting for the flood to be cut-off (subside). So a man from the Polytheists said to his people, ‘I will kill Muhammad ﷺ’. So he came and pulled out his sword against the Rasool ﷺ Allah (azwj) then said, ‘Who is going to save you from me, O Muhammad ﷺ?’ He ﷺ said: ‘My ﷺ Lord (azwj), and your Lord (azwj)’. So Jibraeel  blew him off his horse and he fell upon his back. The Rasool ﷺ stood up and took the sword, and sat upon his chest and said: ‘Who is the one who will rescue you from me ﷺ, O Gowras?’ He said, ‘Your ﷺ benevolence and your ﷺ generosity, O Muhammad ﷺ’. So he ﷺ left him. He stood up and he was saying, ‘By Allah (azwj), you ﷺ are better than me and more generous’.",
                    "href": "https://thaqalayn.net/hadith/8/1/97/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 386)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "105": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Hadith on Iblis La’natullah a’lay",
                    "arabicText": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنْ يَعْقُوبَ بْنِ شُعَيْبٍ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ (عليه السلام) مَنْ أَشَدُّ النَّاسِ عَلَيْكُمْ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ كُلٌّ قَالَ أَ تَدْرِي مِمَّ ذَاكَ يَا يَعْقُوبُ قَالَ قُلْتُ لَا أَدْرِي جُعِلْتُ فِدَاكَ قَالَ إِنَّ إِبْلِيسَ دَعَاهُمْ فَأَجَابُوهُ وَ أَمَرَهُمْ فَأَطَاعُوهُ وَ دَعَاكُمْ فَلَمْ تُجِيبُوهُ وَ أَمَرَكُمْ فَلَمْ تُطِيعُوهُ فَأَغْرَى بِكُمُ النَّاسَ.",
                    "englishText": "105. Abu Ali Al-Ashary, from Muhammad Bin Abdul Jabbaar, from Safwaan, from Yaqoub Bin Shuayb who said: Abu Abdullah  said to me: ‘Who is the harshest of the people against you?’ I said, ‘May I be sacrificed for you , all of them are’. He  said: ‘Do you know why that is so, O Yaqoub?’ I said, ‘I do not know, may I be sacrificed for you ’. He  said: ‘It is Iblees (la) who called them, so they answered him (la), and ordered them, so they obeyed him (la), and he (la) called you, so you did not answer him (la), and he (la) ordered you, so you did not obey him (la), so he (la) beckons (instigates) the people against you’.",
                    "href": "https://thaqalayn.net/hadith/8/1/105/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 386)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "106": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: If one sees a disturbing dream",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ إِذَا رَأَى الرَّجُلُ مَا يَكْرَهُ فِي مَنَامِهِ فَلْيَتَحَوَّلْ عَنْ شِقِّهِ الَّذِي كَانَ عَلَيْهِ نَائِماً وَ لْيَقُلْ إِنَّمَا النَّجْوى مِنَ الشَّيْطانِ لِيَحْزُنَ الَّذِينَ آمَنُوا وَ لَيْسَ بِضارِّهِمْ شَيْئاً إِلَّا بِإِذْنِ اللَّهِ ثُمَّ لْيَقُلْ عُذْتُ بِمَا عَاذَتْ بِهِ مَلَائِكَةُ اللَّهِ الْمُقَرَّبُونَ وَ أَنْبِيَاؤُهُ الْمُرْسَلُونَ وَ عِبَادُهُ الصَّالِحُونَ مِنْ شَرِّ مَا رَأَيْتُ وَ مِنْ شَرِّ الشَّيْطَانِ الرَّجِيمِ.",
                    "englishText": "106. Ali Bin Ibrahim, from his father, from Ibn Abi ‘Umayr, from Muawiya Bin Ammaar, who has said: Abu Abdullah  said: ‘If the man sees what he does not like in his dream, so he should change his sleeping position which he was in and should say, ‘The whispering is from the Satan (la) to aggrieve those who Believe’, and nothing would harm him except by the Permission of Allah (azwj). Then he should say, ‘I seek Refuge with what the Angels of Proximity of Allah (azwj) and His (azwj) Prophets , and the righteous servants sought Refuge with, from the evil what I saw, and from the evil of the castaway Satan (la)’.",
                    "href": "https://thaqalayn.net/hadith/8/1/106/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 386)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "113": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Despicability of a believing person’s complaint before an unbeliever",
                    "arabicText": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ يُونُسَ بْنِ عَمَّارٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ أَيُّمَا مُؤْمِنٍ شَكَا حَاجَتَهُ وَ ضُرَّهُ إِلَى كَافِرٍ أَوْ إِلَى مَنْ يُخَالِفُهُ عَلَى دِينِهِ فَكَأَنَّمَا شَكَا اللَّهَ عَزَّ وَ جَلَّ إِلَى عَدُوٍّ مِنْ أَعْدَاءِ اللَّهِ وَ أَيُّمَا رَجُلٍ مُؤْمِنٍ شَكَا حَاجَتَهُ وَ ضُرَّهُ إِلَى مُؤْمِنٍ مِثْلِهِ كَانَتْ شَكْوَاهُ إِلَى اللَّهِ عَزَّ وَ جَلَّ.",
                    "englishText": "113. Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Yunus Bin Ammaar who said: ‘I heard Abu Abdullah  saying: ‘Whichever Believer complains of his need and presents it to an Infidel or to the one who is opposed to his Religion, so it is as if he has complained against Allah (azwj) before an enemy from the enemies of Allah (azwj). And whichever Believing man complains of his need and presents it to a Believer like him, so it is as if he has complained to Allah (azwj)’.",
                    "href": "https://thaqalayn.net/hadith/8/1/113/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 387)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "118": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: In praise of Zurarah ibn ‘Ayun",
                    "arabicText": "ابْنُ مَحْبُوبٍ عَنْ حَنَانٍ وَ عَلِيِّ بْنِ رِئَابٍ عَنْ زُرَارَةَ قَالَ قُلْتُ لَهُ قَوْلُهُ عَزَّ وَ جَلَّ لَأَقْعُدَنَّ لَهُمْ صِراطَكَ الْمُسْتَقِيمَ ثُمَّ لَآتِيَنَّهُمْ مِنْ بَيْنِ أَيْدِيهِمْ وَ مِنْ خَلْفِهِمْ وَ عَنْ أَيْمانِهِمْ وَ عَنْ شَمائِلِهِمْ وَ لا تَجِدُ أَكْثَرَهُمْ شاكِرِينَ قَالَ فَقَالَ أَبُو جَعْفَرٍ (عليه السلام) يَا زُرَارَةُ إِنَّهُ إِنَّمَا صَمَدَ لَكَ وَ لِأَصْحَابِكَ فَأَمَّا الْآخَرُونَ فَقَدْ فَرَغَ مِنْهُمْ.",
                    "englishText": "118. Ibn Mahboub, from Hanaan and Ali Bin Ra’ib, from Zurara who said: I said to him , ‘The Statement of the Mighty and Majestic: “[7:16] I will certainly lie in wait for them in Thy straight path [7:17] Then I will certainly come to them from before them and from behind them, and from their right-hand side and from their left-hand side; and Thou shalt not find most of them thankful”, so Abu Ja’far  said: ‘O Zurara! But rather, he (Satan (la)) is lying in wait for you and for your companions. So as for the other ones, he has finished from them’.",
                    "href": "https://thaqalayn.net/hadith/8/1/118/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 387)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "119": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Excellence of the Shi’ah and Yahaya ibn Sabur",
                    "arabicText": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ وَ الْحُسَيْنِ بْنِ سَعِيدٍ جَمِيعاً عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى بْنِ عِمْرَانَ الْحَلَبِيِّ عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ بَدْرِ بْنِ الْوَلِيدِ الْخَثْعَمِيِّ قَالَ دَخَلَ يَحْيَى بْنُ سَابُورَ عَلَى أَبِي عَبْدِ اللَّهِ (عليه السلام) لِيُوَدِّعَهُ فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ (عليه السلام) أَمَا وَ اللَّهِ إِنَّكُمْ لَعَلَى الْحَقِّ وَ إِنَّ مَنْ خَالَفَكُمْ لَعَلَى غَيْرِ الْحَقِّ وَ اللَّهِ مَا أَشُكُّ لَكُمْ فِي الْجَنَّةِ وَ إِنِّي لَأَرْجُو أَنْ يُقِرَّ اللَّهُ لِأَعْيُنِكُمْ عَنْ قَرِيبٍ.",
                    "englishText": "119. Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Khalid and Al-Husayn Bin Saeed altogether, from Al-Nazar Bin Suweyd, from Yahya Bin Umraan Al-Halby, from Abdullah Bin Muskaan, from Badr Bin Al-Waleed Al-Khash’amy who said: Yahya Bin Sabour came up to Abu Abdullah  to say farewell to him . So Abu Abdullah  said to him: ‘By Allah (azwj)! You are upon the ‘الْحَقِّ’ Just, and that the ones opposed to you are upon other than the Just. By Allah (azwj)! I  have no doubt for you with regards to the Paradise, and I  hope that Allah (azwj) would Delight your eyes very soon’.",
                    "href": "https://thaqalayn.net/hadith/8/1/119/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 387)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "120": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Excellence of the Shi’ah",
                    "arabicText": "يَحْيَى الْحَلَبِيُّ عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ أَ رَأَيْتَ الرَّادَّ عَلَيَّ هَذَا الْأَمْرَ فَهُوَ كَالرَّادِّ عَلَيْكُمْ فَقَالَ يَا أَبَا مُحَمَّدٍ مَنْ رَدَّ عَلَيْكَ هَذَا الْأَمْرَ فَهُوَ كَالرَّادِّ عَلَى رَسُولِ اللَّهِ (صلى الله عليه وآله) وَ عَلَى اللَّهِ تَبَارَكَ وَ تَعَالَى يَا أَبَا مُحَمَّدٍ إِنَّ الْمَيِّتَ مِنْكُمْ عَلَى هَذَا الْأَمْرِ شَهِيدٌ قَالَ قُلْتُ وَ إِنْ مَاتَ عَلَى فِرَاشِهِ قَالَ إِي وَ اللَّهِ وَ إِنْ مَاتَ عَلَى فِرَاشِهِ حَيٌّ عِنْدَ رَبِّهِ يُرْزَقُ.",
                    "englishText": "120. Yahya Al-Halby, from Abdullah Bin Muskaan, from Abu Baseer who said: I said to him , ‘May I be sacrificed for you , do you  see the one who rejects this matter (Al-Wilayah) to me as if he has rejected you ?’ He  said: ‘O Abu Muhammad! The one who rejects this matter to you, so he has rejected against the Rasool Allah ﷺ, and against Allah (azwj) Blessed and High. O Abu Muhammad! The dead ones from among you who were upon this matter (Al-Wilayah) is the martyr’. I said, ‘Even if he died upon his bed?’ He  said: ‘Yes, by Allah (azwj), even if he died upon his bed, he is alive in the Presence of his Lord (azwj) being given Sustenance’.",
                    "href": "https://thaqalayn.net/hadith/8/1/120/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 388)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "121": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Excellence of Shi’ah and advice of Abu ‘Abd Allah,'Alayhim al-Salam",
                    "arabicText": "يَحْيَى الْحَلَبِيُّ عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ حَبِيبٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ أَمَا وَ اللَّهِ مَا أَحَدٌ مِنَ النَّاسِ أَحَبَّ إِلَيَّ مِنْكُمْ وَ إِنَّ النَّاسَ سَلَكُوا سُبُلًا شَتَّى فَمِنْهُمْ مَنْ أَخَذَ بِرَأْيِهِ وَ مِنْهُمْ مَنِ اتَّبَعَ هَوَاهُ وَ مِنْهُمْ مَنِ اتَّبَعَ الرِّوَايَةَ وَ إِنَّكُمْ أَخَذْتُمْ بِأَمْرٍ لَهُ أَصْلٌ فَعَلَيْكُمْ بِالْوَرَعِ وَ الِاجْتِهَادِ وَ اشْهَدُوا الْجَنَائِزَ وَ عُودُوا الْمَرْضَى وَ احْضُرُوا مَعَ قَوْمِكُمْ فِي مَسَاجِدِهِمْ لِلصَّلَاةِ أَ مَا يَسْتَحْيِي الرَّجُلُ مِنْكُمْ أَنْ يَعْرِفَ جَارُهُ حَقَّهُ وَ لَا يَعْرِفَ حَقَّ جَارِهِ.",
                    "englishText": "121. Yahya Al-Halby, from Abdullah Bin Muskaan, from Habeeb who said: I heard Abu Abdullah  saying: ‘By Allah (azwj)! There is no one from the people more beloved to me  than you are, and that the people have gone in various directions. So among them is the ‘one’ who takes (religion) to his own opinion, and among them is one who follows his own desires, and among them is the one who follows the narration (Al-Riwayah), and you all have grabbed to a matter for which there is an origin. So it is for you to observe piety, and the struggle, and bear witness to the funerals, and console the sick, and be present with your people in their Masjids for the Prayers. Is it not shameful for the man among you that his right is being observed by his neighbour whilst he himself does not observe the rights of his neighbour?’",
                    "href": "https://thaqalayn.net/hadith/8/1/121/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 388)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "122": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Excellence of Shi’ah and reproach of their opposition",
                    "arabicText": "عَنْهُ عَنِ ابْنِ مُسْكَانَ عَنْ مَالِكٍ الْجُهَنِيِّ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ (عليه السلام) يَا مَالِكُ أَ مَا تَرْضَوْنَ أَنْ تُقِيمُوا الصَّلَاةَ وَ تُؤْتُوا الزَّكَاةَ وَ تَكُفُّوا وَ تَدْخُلُوا الْجَنَّةَ يَا مَالِكُ إِنَّهُ لَيْسَ مِنْ قَوْمٍ ائْتَمُّوا بِإِمَامٍ فِي الدُّنْيَا إِلَّا جَاءَ يَوْمَ الْقِيَامَةِ يَلْعَنُهُمْ وَ يَلْعَنُونَهُ إِلَّا أَنْتُمْ وَ مَنْ كَانَ عَلَى مِثْلِ حَالِكُمْ يَا مَالِكُ إِنَّ الْمَيِّتَ وَ اللَّهِ مِنْكُمْ عَلَى هَذَا الْأَمْرِ لَشَهِيدٌ بِمَنْزِلَةِ الضَّارِبِ بِسَيْفِهِ فِي سَبِيلِ اللَّهِ.",
                    "englishText": "122. From him, from Ibn Muskaan, from maalik Al-Juhny who said: Abu Abdullah  said to me: ‘O Maalik! Will you not be happy that you establish the Prayer, and you give the Zakaat, and you restrain yourself, and you enter Paradise? O Maalik! There is none from the people who followed the imam in the world except that he (their imam) will come on the Day of Judgement cursing them and they would be cursing him except for you and the one who is similar to your condition. O Maalik! By Allah (azwj), the dead ones from among you who were upon this matter (Al-Wilayah) are martyrs of the status of the striker with his sword in the Way of Allah (azwj)’.",
                    "href": "https://thaqalayn.net/hadith/8/1/122/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 388)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "139": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Victory is in protecting al-Islam",
                    "arabicText": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ مَا الْتَقَتْ فِئَتَانِ قَطُّ مِنْ أَهْلِ الْبَاطِلِ إِلَّا كَانَ النَّصْرُ مَعَ أَحْسَنِهِمَا بَقِيَّةً عَلَى أَهْلِ الْإِسْلَامِ.",
                    "englishText": "139. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al-Hakam, from Hisham Bin Salim, who has narrated the following: Abu Abdullah  said: ‘No two groups of the people of falsehood ever confronted each other at all except that the victory was with the better one of them, while the other way round (opposite) being for the people of Al-Islam’.",
                    "href": "https://thaqalayn.net/hadith/8/1/139/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 388)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "142": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Everything was water",
                    "arabicText": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ وَ الْحَجَّالِ عَنِ الْعَلَاءِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ قَالَ لِي أَبُو جَعْفَرٍ (عليه السلام) كَانَ كُلُّ شَيْ‏ءٍ مَاءً وَ كَانَ عَرْشُهُ عَلَى الْمَاءِ فَأَمَرَ اللَّهُ عَزَّ ذِكْرُهُ الْمَاءَ فَاضْطَرَمَ نَاراً ثُمَّ أَمَرَ النَّارَ فَخَمَدَتْ فَارْتَفَعَ مِنْ خُمُودِهَا دُخَانٌ فَخَلَقَ اللَّهُ عَزَّ وَ جَلَّ السَّمَاوَاتِ مِنْ ذَلِكَ الدُّخَانِ وَ خَلَقَ اللَّهُ عَزَّ وَ جَلَّ الْأَرْضَ مِنَ الرَّمَادِ ثُمَّ اخْتَصَمَ الْمَاءُ وَ النَّارُ وَ الرِّيحُ فَقَالَ الْمَاءُ أَنَا جُنْدُ اللَّهِ الْأَكْبَرُ وَ قَالَتِ النَّارُ أَنَا جُنْدُ اللَّهِ الْأَكْبَرُ وَ قَالَتِ الرِّيحُ أَنَا جُنْدُ اللَّهِ الْأَكْبَرُ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَى الرِّيحِ أَنْتِ جُنْدِيِّ الْأَكْبَر.",
                    "englishText": "142. Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboun from Al-A’ala Bin Razeyn, from Muhammad Bin Muslim and Al-Hajjaal from Al-A’ala, from Muhammad Bin Muslim who said: ‘Abu Ja’far  said to me: ‘Everything used to be water, and His (azwj) Throne was upon the water. So Allah (azwj) Commanded the water so the fire was ignited. Then He (azwj) Commanded the fire, so it was extinguished and from its smoldering a smoke arose. So Allah (azwj) Mighty and Majestic Created the Heavens from that smoke, and Allah (azwj) Mighty and Majestic Created the earth from the ashes. Then the water, and the fire, and the wind contended. So the water said, ‘I am the great army of Allah (azwj)’, and the fire said, ‘I am the great army of Allah (azwj), and the wind said, ‘I am the great army of Allah (azwj)’. So Allah (azwj) Mighty and Majestic Revealed unto the wind: “You are My (azwj) Great army’.",
                    "href": "https://thaqalayn.net/hadith/8/1/142/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 388)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "145": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: The rights of the family of Muhammad,'Alayhim al-Salam are obligatory",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ كَانَتِ امْرَأَةٌ مِنَ الْأَنْصَارِ تَوَدُّنَا أَهْلَ الْبَيْتِ وَ تُكْثِرُ التَّعَاهُدَ لَنَا وَ إِنَّ عُمَرَ بْنَ الْخَطَّابِ لَقِيَهَا ذَاتَ يَوْمٍ وَ هِيَ تُرِيدُنَا فَقَالَ لَهَا أَيْنَ تَذْهَبِينَ يَا عَجُوزَ الْأَنْصَارِ فَقَالَتْ أَذْهَبُ إِلَى آلِ مُحَمَّدٍ أُسَلِّمُ عَلَيْهِمْ وَ أُجَدِّدُ بِهِمْ عَهْداً وَ أَقْضِي حَقَّهُمْ فَقَالَ لَهَا عُمَرُ وَيْلَكِ لَيْسَ لَهُمُ الْيَوْمَ حَقٌّ عَلَيْكِ وَ لَا عَلَيْنَا إِنَّمَا كَانَ لَهُمْ حَقٌّ عَلَى عَهْدِ رَسُولِ اللَّهِ (صلى الله عليه وآله) فَأَمَّا الْيَوْمَ فَلَيْسَ لَهُمْ حَقٌّ فَانْصَرِفِي فَانْصَرَفَتْ حَتَّى أَتَتْ أُمَّ سَلَمَةَ فَقَالَتْ لَهَا أُمُّ سَلَمَةَ مَا ذَا أَبْطَأَ بِكِ عَنَّا فَقَالَتْ إِنِّي لَقِيتُ عُمَرَ بْنَ الْخَطَّابِ وَ أَخْبَرَتْهَا بِمَا قَالَتْ لِعُمَرَ وَ مَا قَالَ لَهَا عُمَرُ فَقَالَتْ لَهَا أُمُّ سَلَمَةَ كَذَبَ لَا يَزَالُ حَقُّ آلِ مُحَمَّدٍ (صلى الله عليه وآله) وَاجِباً عَلَى الْمُسْلِمِينَ إِلَى يَوْمِ الْقِيَامَةِ.",
                    "englishText": "145. Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Abdullah Bin Sinan who said: I heard Abu Abdullah  saying: ‘There was a woman from the Helpers who had cordiality with us  the People  of the Household, and used to frequently pledge her allegiance to us , and Umar Bin Al-Khattab met her one day whilst she was on her way to us . He said to her, ‘Where are you headed, O elderly woman of the Helpers?’ She said, ‘I am going to the Progeny  of Muhammad ﷺ to greet them , and renew my allegiance with them , and give their  rights to them . So Umar said to her, ‘Woe be unto you! There are no rights for them  today, neither from you nor from us. But rather, there used to be rights for them during the era of the Rasool Allah ﷺ. As for today, there are no rights for them , so leave’. So she left until she came up to Umm Salma (ar). Umm Salma (ar) said to her, ‘What was it that delayed you in coming to us ?’ So she said, ‘I met Umar Bin Al-Khattaab’, and she informed her  of what she had said to Umar and what Umar had said to her’. So Umm Salma (ar) said to her, ‘He lied. The rights of the Progeny  of Muhammad ﷺ have not stopped. They are Obligatory upon the Muslims up to the Day of Judgement’.",
                    "href": "https://thaqalayn.net/hadith/8/1/145/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 389)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "146": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: About the words of Allah ‘...they give gald news to those who have not joined them…” (3:170)",
                    "arabicText": "ابْنُ مَحْبُوبٍ عَنِ الْحَارِثِ بْنِ مُحَمَّدِ بْنِ النُّعْمَانِ عَنْ بُرَيْدٍ الْعِجْلِيِّ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ (عليه السلام) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ يَسْتَبْشِرُونَ بِالَّذِينَ لَمْ يَلْحَقُوا بِهِمْ مِنْ خَلْفِهِمْ أَلَّا خَوْفٌ عَلَيْهِمْ وَ لا هُمْ يَحْزَنُونَ قَالَ هُمْ وَ اللَّهِ شِيعَتُنَا حِينَ صَارَتْ أَرْوَاحُهُمْ فِي الْجَنَّةِ وَ اسْتَقْبَلُوا الْكَرَامَةَ مِنَ اللَّهِ عَزَّ وَ جَلَّ عَلِمُوا وَ اسْتَيْقَنُوا أَنَّهُمْ كَانُوا عَلَى الْحَقِّ وَ عَلَى دِينِ اللَّهِ عَزَّ وَ جَلَّ وَ اسْتَبْشَرُوا بِمَنْ لَمْ يَلْحَقْ بِهِمْ مِنْ إِخْوَانِهِمْ مِنْ خَلْفِهِمْ مِنَ الْمُؤْمِنِينَ أَلَّا خَوْفٌ عَلَيْهِمْ وَ لَا هُمْ يَحْزَنُونَ.",
                    "englishText": "146. Ibn Mahboub, from Al-Haris Bin Muhammad Bin Al-No’man, from Bureyd Al-Ajaly who said: ‘I asked Abu Ja’far  about the Statement of Allah (azwj) Mighty and Majestic: “[3:170] and they rejoice for the sake of those who, (being left) behind them, have not yet joined them, that they shall have no fear, nor shall they grieve”. He  said: ‘By Allah (azwj)! These are our  Shiites, when their souls will arrive in the Paradise, and they will be Welcomed honourably from Allah (azwj) Mighty and Majestic, they would come to know and be convinced that they were upon the ‘الْحَقِّ’ Just, and upon the Religion of Allah (azwj) Mighty and Majestic, and they would receive the good news of the ones whom they had left behind from their brethren from the Believers. There would be no fear to come upon them, nor would they be in any grief’.",
                    "href": "https://thaqalayn.net/hadith/8/1/146/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 389)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "173": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Manners of Ali, 'Alayhim al-Salam, and his restraint from unlawful matters",
                    "arabicText": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنِ ابْنِ مُسْكَانَ عَنِ الْحَسَنِ الصَّيْقَلِ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ إِنَّ وَلِيَّ عَلِيٍّ (عليه السلام) لَا يَأْكُلُ إِلَّا الْحَلَالَ لِأَنَّ صَاحِبَهُ كَانَ كَذَلِكَ وَ إِنَّ وَلِيَّ عُثْمَانَ لَا يُبَالِي أَ حَلَالًا أَكَلَ أَوْ حَرَاماً لِأَنَّ صَاحِبَهُ كَذَلِكَ قَالَ ثُمَّ عَادَ إِلَى ذِكْرِ عَلِيٍّ (عليه السلام) فَقَالَ أَمَا وَ الَّذِي ذَهَبَ بِنَفْسِهِ مَا أَكَلَ مِنَ الدُّنْيَا حَرَاماً قَلِيلًا وَ لَا كَثِيراً حَتَّى فَارَقَهَا وَ لَا عَرَضَ لَهُ أَمْرَانِ كِلَاهُمَا لِلَّهِ طَاعَةٌ إِلَّا أَخَذَ بِأَشَدِّهِمَا عَلَى بَدَنِهِ وَ لَا نَزَلَتْ بِرَسُولِ اللَّهِ (صلى الله عليه وآله) شَدِيدَةٌ قَطُّ إِلَّا وَجَّهَهُ فِيهَا ثِقَةً بِهِ وَ لَا أَطَاقَ أَحَدٌ مِنْ هَذِهِ الْأُمَّةِ عَمَلَ رَسُولِ اللَّهِ (صلى الله عليه وآله) بَعْدَهُ غَيْرُهُ وَ لَقَدْ كَانَ يَعْمَلُ عَمَلَ رَجُلٍ كَأَنَّهُ يَنْظُرُ إِلَى الْجَنَّةِ وَ النَّارِ وَ لَقَدْ أَعْتَقَ أَلْفَ مَمْلُوكٍ مِنْ صُلْبِ مَالِهِ كُلُّ ذَلِكَ تَحَفَّى فِيهِ يَدَاهُ وَ تَعْرَقُ جَبِينُهُ الْتِمَاسَ وَجْهِ اللَّهِ عَزَّ وَ جَلَّ وَ الْخَلَاصِ مِنَ النَّارِ وَ مَا كَانَ قُوتُهُ إِلَّا الْخَلَّ وَ الزَّيْتَ وَ حَلْوَاهُ التَّمْرُ إِذَا وَجَدَهُ وَ مَلْبُوسُهُ الْكَرَابِيسُ فَإِذَا فَضَلَ عَنْ ثِيَابِهِ شَيْ‏ءٌ دَعَا بِالْجَلَمِ فَجَزَّهُ.",
                    "englishText": "173. Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al-No’man, from Ibn Muskaan, from Al-Hassan Al-Sayqal who said: I heard Abu Abdullah  saying that a friend of Ali  does not eat except for the Permissible because his Master  was like that, and the friend of Usman does not care whether he eats the Permissible or the Prohibited because his master was like that’. He (the narrator) said, ‘Then he  returned to the mention of Ali , so he  said; ‘But, by the One Who (azwj) Took his  soul, he  did not eat anything Prohibited in the world, be it little or a lot, until he  departed from it. And there were not presented to him  two matters both of them in obedience to Allah (azwj) except that he  chose the more difficult one of the two for his  body, and there did not descend any difficulty upon the Rasool Allah ﷺ at all except that he  faced it, being relied upon for it. And no one from this community can endure the deeds of the Rasool Allah ﷺ after him ﷺ apart from him . And he  would work like a man as if he could see into the Paradise and the Fire, and he  had freed one thousand slaves from his  wealth. All of that was from what he  had worked by his  own hands, making his  forehead perspire for the Sake of Allah (azwj) Mighty and Majestic, seeking to be free from the Fire. And there was no meal for him  except for the vinegar and oil, and the sweetness of the dates if he  could find them. And his  clothing was the cotton. If he  found extra in his clothes, he  would call for the scissors and cut it off’.",
                    "href": "https://thaqalayn.net/hadith/8/1/173/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 390)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "174": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Undesirability of eating hot food",
                    "arabicText": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ يُونُسَ بْنِ يَعْقُوبَ عَنْ سُلَيْمَانَ بْنِ خَالِدٍ عَنْ عَامِلٍ كَانَ لِمُحَمَّدِ بْنِ رَاشِدٍ قَالَ حَضَرْتُ عَشَاءَ جَعْفَرِ بْنِ مُحَمَّدٍ (عليه السلام) فِي الصَّيْفِ فَأُتِيَ بِخِوَانٍ عَلَيْهِ خُبْزٌ وَ أُتِيَ بِجَفْنَةٍ فِيهَا ثَرِيدٌ وَ لَحْمٌ تَفُورُ فَوَضَعَ يَدَهُ فِيهَا فَوَجَدَهَا حَارَّةً ثُمَّ رَفَعَهَا وَ هُوَ يَقُولُ نَسْتَجِيرُ بِاللَّهِ مِنَ النَّارِ نَعُوذُ بِاللَّهِ مِنَ النَّارِ نَحْنُ لَا نَقْوَى عَلَى هَذَا فَكَيْفَ النَّارُ وَ جَعَلَ يُكَرِّرُ هَذَا الْكَلَامَ حَتَّى أَمْكَنَتِ الْقَصْعَةُ فَوَضَعَ يَدَهُ فِيهَا وَ وَضَعْنَا أَيْدِيَنَا حِينَ أَمْكَنَتْنَا فَأَكَلَ وَ أَكَلْنَا مَعَهُ ثُمَّ إِنَّ الْخِوَانَ رُفِعَ فَقَالَ يَا غُلَامُ ائْتِنَا بِشَيْ‏ءٍ فَأُتِيَ بِتَمْرٍ فِي طَبَقٍ فَمَدَدْتُ يَدِي فَإِذَا هُوَ تَمْرٌ فَقُلْتُ أَصْلَحَكَ اللَّهُ هَذَا زَمَانُ الْأَعْنَابِ وَ الْفَاكِهَةِ قَالَ إِنَّهُ تَمْرٌ ثُمَّ قَالَ ارْفَعْ هَذَا وَ ائْتِنَا بِشَيْ‏ءٍ فَأُتِيَ بِتَمْرٍ فَمَدَدْتُ يَدِي فَقُلْتُ هَذَا تَمْرٌ فَقَالَ إِنَّهُ طَيِّبٌ.",
                    "englishText": "174. Abu Ali Al-Ashary, from Muhammad Bin Abdul Jabbaar, from Al-Hassan Bin Ali, from Yunus Bin Yaqoub, from Suleyman Bin Khalid, from a worker of Muhammad Bin Rashid who said: I was present at the evening meal of Ja’far Bin Muhammad  during the summer. A tray of bread was brought to him , and a bowl of porridge and boiling meat. So he  extended his hand towards it and found it to be hot. Then he  raised his  hand and said: ‘We  seek Refuge with Allah (azwj) from the Fire, we  seek Refuge with Allah (azwj) from the Fire. We are not strong enough (to bear) this, so how can we (bear) the Fire (of Hell)?’ And he  went on repeating these words until it was possible to (touch) the bowl. So he  placed his  in it (the hot food in front of him ), and we placed our hands in it (our portion) when it was possible. So he  ate, and we ate with him . Then the (food) from the food-mat was taken away. So he  said: ‘O young boy, bring us something’. So he came with the dates on a platter. I extended my hand, and there were dates, so I said, ‘May Allah (azwj) Keep you  well, this is the time (season) for the grapes and the apples’. He  said: ‘these are the dates’. Then he  said: ‘Take this away and bring us something’. So he came up with dates (another variety of dates). I extended my hand and said, ‘These are dates’. He  said: ‘It is good’.",
                    "href": "https://thaqalayn.net/hadith/8/1/174/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 390)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "189": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Advice of Abu 'Abd Allah, 'Alayhim al-Salam",
                    "arabicText": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبِي الْمَغْرَاءِ عَنْ زَيْدٍ الشَّحَّامِ عَنْ عَمْرِو بْنِ سَعِيدِ بْنِ هِلَالٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ (عليه السلام) إِنِّي لَا أَكَادُ أَلْقَاكَ إِلَّا فِي السِّنِينَ فَأَوْصِنِي بِشَيْ‏ءٍ آخُذُ بِهِ قَالَ أُوصِيكَ بِتَقْوَى اللَّهِ وَ صِدْقِ الْحَدِيثِ وَ الْوَرَعِ وَ الِاجْتِهَادِ وَ اعْلَمْ أَنَّهُ لَا يَنْفَعُ اجْتِهَادٌ لَا وَرَعَ مَعَهُ وَ إِيَّاكَ أَنْ تُطْمِحَ نَفْسَكَ إِلَى مَنْ فَوْقَكَ وَ كَفَى بِمَا قَالَ اللَّهُ عَزَّ وَ جَلَّ لِرَسُولِهِ (صلى الله عليه وآله) فَلا تُعْجِبْكَ أَمْوالُهُمْ وَ لا أَوْلادُهُمْ وَ قَالَ اللَّهُ عَزَّ وَ جَلَّ لِرَسُولِهِ وَ لا تَمُدَّنَّ عَيْنَيْكَ إِلى ما مَتَّعْنا بِهِ أَزْواجاً مِنْهُمْ زَهْرَةَ الْحَياةِ الدُّنْيا فَإِنْ خِفْتَ شَيْئاً مِنْ ذَلِكَ فَاذْكُرْ عَيْشَ رَسُولِ اللَّهِ (صلى الله عليه وآله) فَإِنَّمَا كَانَ قُوتُهُ الشَّعِيرَ وَ حَلْوَاهُ التَّمْرَ وَ وَقُودُهُ السَّعَفَ إِذَا وَجَدَهُ وَ إِذَا أُصِبْتَ بِمُصِيبَةٍ فَاذْكُرْ مُصَابَكَ بِرَسُولِ اللَّهِ (صلى الله عليه وآله) فَإِنَّ الْخَلْقَ لَمْ يُصَابُوا بِمِثْلِهِ (عليه السلام) قَطُّ.",
                    "englishText": "189. A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al-Hakam, from Abu Al-Magra’a, from Zayd Al-Shahaam, from Amro Bin Saeed Bin Hilal who said: ‘I said to Abu Abdullah , ‘I hardly ever meet you  after years, so advise me with something that I can take to it’. He  said: ‘I  advise you to fear Allah (azwj), and be truthful in (narrating) the Hadeeth, and the piety, and strive hard (Ijtihad for your affairs). And know that he who has not piety with him would not benefit from his hard work (in submission to Allah (azwj)). And beware of ‘تُطْمِحَ نَفْسَكَ’ the craving desires of your ‘Nafs’ that (tempt you to have) which is with the one above you, hence restrain from that. Allah (azwj) Mighty and Majestic has Said to His (azwj) Messenger ﷺ: “[9:55] Let not then their property and their children excite your admiration”, and Allah (azwj) Mighty and Majestic Said to His (azwj) Messenger ﷺ: “[20:131] And do not stretch your eyes after that with which We have provided different classes of them, (of) the splendour of this world’s life”. So if you are scared of that, remember the example of the Rasool Allah ﷺ, for his ﷺ meal was of barley (bread) and sweetness of the dates, and his ﷺ fire (for heat) was from twigs of the palm tree, if he ﷺ found them. And if you are in hardship, remember the hardships of the Rasool Allah ﷺ, for the creatures (people) have never been afflicted with the like of what he ﷺ had been afflicted with, at all’.",
                    "href": "https://thaqalayn.net/hadith/8/1/189/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 391)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "203": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Certain companions’ harassing Salman Farsi",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ حَنَانٍ قَالَ سَمِعْتُ أَبِي يَرْوِي عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ كَانَ سَلْمَانُ جَالِساً مَعَ نَفَرٍ مِنْ قُرَيْشٍ فِي الْمَسْجِدِ فَأَقْبَلُوا يَنْتَسِبُونَ وَ يَرْفَعُونَ فِي أَنْسَابِهِمْ حَتَّى بَلَغُوا سَلْمَانَ فَقَالَ لَهُ عُمَرُ بْنُ الْخَطَّابِ أَخْبِرْنِي مَنْ أَنْتَ وَ مَنْ أَبُوكَ وَ مَا أَصْلُكَ فَقَالَ أَنَا سَلْمَانُ بْنُ عَبْدِ اللَّهِ كُنْتُ ضَالًّا فَهَدَانِي اللَّهُ عَزَّ وَ جَلَّ بِمُحَمَّدٍ (صلى الله عليه وآله) وَ كُنْتُ عَائِلًا فَأَغْنَانِي اللَّهُ بِمُحَمَّدٍ (صلى الله عليه وآله) وَ كُنْتُ مَمْلُوكاً فَأَعْتَقَنِي اللَّهُ بِمُحَمَّدٍ (صلى الله عليه وآله) هَذَا نَسَبِي وَ هَذَا حَسَبِي قَالَ فَخَرَجَ رَسُولُ اللَّهِ (صلى الله عليه وآله) وَ سَلْمَانُ رَضِيَ اللَّهُ عَنْهُ يُكَلِّمُهُمْ فَقَالَ لَهُ سَلْمَانُ يَا رَسُولَ اللَّهِ مَا لَقِيتُ مِنْ هَؤُلَاءِ جَلَسْتُ مَعَهُمْ فَأَخَذُوا يَنْتَسِبُونَ وَ يَرْفَعُونَ فِي أَنْسَابِهِمْ حَتَّى إِذَا بَلَغُوا إِلَيَّ قَالَ عُمَرُ بْنُ الْخَطَّابِ مَنْ أَنْتَ وَ مَا أَصْلُكَ وَ مَا حَسَبُكَ فَقَالَ النَّبِيُّ (صلى الله عليه وآله) فَمَا قُلْتَ لَهُ يَا سَلْمَانُ قَالَ قُلْتُ لَهُ أَنَا سَلْمَانُ بْنُ عَبْدِ اللَّهِ كُنْتُ ضَالًّا فَهَدَانِي اللَّهُ عَزَّ ذِكْرُهُ بِمُحَمَّدٍ (صلى الله عليه وآله) وَ كُنْتُ عَائِلًا فَأَغْنَانِي اللَّهُ عَزَّ ذِكْرُهُ بِمُحَمَّدٍ (صلى الله عليه وآله) وَ كُنْتُ مَمْلُوكاً فَأَعْتَقَنِي اللَّهُ عَزَّ ذِكْرُهُ بِمُحَمَّدٍ (صلى الله عليه وآله) هَذَا نَسَبِي وَ هَذَا حَسَبِي فَقَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) يَا مَعْشَرَ قُرَيْشٍ إِنَّ حَسَبَ الرَّجُلِ دِينُهُ وَ مُرُوءَتَهُ خُلُقُهُ وَ أَصْلَهُ عَقْلُهُ وَ قَالَ اللَّهُ عَزَّ وَ جَلَّ إِنَّا خَلَقْناكُمْ مِنْ ذَكَرٍ وَ أُنْثى وَ جَعَلْناكُمْ شُعُوباً وَ قَبائِلَ لِتَعارَفُوا إِنَّ أَكْرَمَكُمْ عِنْدَ اللَّهِ أَتْقاكُمْ ثُمَّ قَالَ النَّبِيُّ (صلى الله عليه وآله) لِسَلْمَانَ لَيْسَ لِأَحَدٍ مِنْ هَؤُلَاءِ عَلَيْكَ فَضْلٌ إِلَّا بِتَقْوَى اللَّهِ عَزَّ وَ جَلَّ وَ إِنْ كَانَ التَّقْوَى لَكَ عَلَيْهِمْ فَأَنْتَ أَفْضَلُ.",
                    "englishText": "203. Ali Bin Ibrahim, from Abdullah Bin Muhammad Bin Isa, from Safwan Bin yahya, from Hanaan who said: ‘I heard my father narrated from Abu Ja’far  having said: ‘Salman (ar) was seated with a number of people from Qureish in the Masjid. They started priding over their lineages and ancestry until they reached Salman (ar). Umar Bin Al-Khattab said to him (ar), ‘Inform me, who you (ar) are, and who your (ar) father is, and what is your (ar) origin’. So he (ar) said: ‘I (ar) am Salman (ar) son of a servant of Allah (azwj). I (ar) had strayed, so Allah (azwj) Mighty and Majestic Guided me (ar) by Muhammad ﷺ, and I  was needy, so Allah (azwj) Made me (ar) to be self-sufficient by Muhammad ﷺ, and I (ar) was a slave, so Allah (azwj) Freed me (ar) by Muhammad ﷺ. This is my (ar) lineage, and this is my  nobility’. He  said: ‘The Rasool Allah ﷺ came out and Salman (ar) spoke to him ﷺ. Salman (ar) said to him ﷺ, ‘O Rasool Allah ﷺ, what has been meted out to me (ar) from those when I (ar) was seated with them. They took to priding themselves over their lineages and ancestry to the extent that they reached me (ar). Umar Bin Al-Khattab said to me, ‘Who are you (ar), and what is your (ar) origin, and what is your (ar) status?’ So the Prophet ﷺ said: ‘So what did you (ar) say to him, O Salman (ar)?’ He (ar) said, ‘I (ar) said, ‘‘I (ar) am Salman (ar) son of a servant of Allah (azwj). I (ar) had strayed, so Allah (azwj) Guided me (ar) through Muhammad ﷺ, and I  was needy, so Allah (azwj) Made me (ar) to be self-sufficient through Muhammad ﷺ, and I (ar) was a slave, so Allah (azwj) Freed me (ar) through Muhammad ﷺ. This is my (ar) lineage, and this is my  nobility’. So the Rasool Allah ﷺ said: ‘O group of Qureish, the nobility of a man is his Religion, and his chivalry in his manners, and his origin is his intellect. And Allah (azwj) Mighty and Majestic has Said: “[49:13] O you men! surely We have created you of a male and a female, and made you tribes and families that you may know each other; surely the most honorable of you with Allah is the one among you most careful (of his duty)”. Then the Prophet ﷺ said to Salman (ar): ‘There is no preference over you (ar) from any of these ones except by fear of Allah (azwj) Mighty and Majestic, and if there is piety for you (ar) over them, so you (ar) are more preferable’.",
                    "href": "https://thaqalayn.net/hadith/8/1/203/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 391)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "204": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Equitable practice of ‘Amir al-Mu’minin, 'Alayhim al-Salam",
                    "arabicText": "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ لَمَّا وَلِيَ عَلِيٌّ (عليه السلام) صَعِدَ الْمِنْبَرَ فَحَمِدَ اللَّهَ وَ أَثْنَى عَلَيْهِ ثُمَّ قَالَ إِنِّي وَ اللَّهِ لَا أَرْزَؤُكُمْ مِنْ فَيْئِكُمْ دِرْهَماً مَا قَامَ لِي عِذْقٌ بِيَثْرِبَ فَلْيَصْدُقْكُمْ أَنْفُسُكُمْ أَ فَتَرَوْنِي مَانِعاً نَفْسِي وَ مُعْطِيَكُمْ قَالَ فَقَامَ إِلَيْهِ عَقِيلٌ فَقَالَ لَهُ وَ اللَّهِ لَتَجْعَلَنِّي وَ أَسْوَدَ بِالْمَدِينَةِ سَوَاءً فَقَالَ اجْلِسْ أَ مَا كَانَ هَاهُنَا أَحَدٌ يَتَكَلَّمُ غَيْرُكَ وَ مَا فَضْلُكَ عَلَيْهِ إِلَّا بِسَابِقَةٍ أَوْ بِتَقْوَى.",
                    "englishText": "204. Ali, from his father, from Ibn Abi ‘Umayr, from Abdul Rahmaan Bin Al-Hajjaaj, from Muhammad Bin Muslim, who has narrated the following: Abu Abdullah  having said: ‘When Ali  became the ruler, he  ascended the Pulpit. So he  Praised Allah (azwj) and Extolled Him (azwj), then said: ‘By Allah (azwj)! I  will not give you the sustenance from your spoils of war (Al-Fey) a single Dirham (more than what each of you deserve) so long as I have a palm tree left in Yasrab (Al-Medina). So be truthful to yourselves. Do you see what I  have prevented from myself  that I  shall give it to you?’ So Aqeel stood up and said to him , ‘By Allah (azwj)! You will consider me to be equal to a black man of Al-Medina?’ So he  said: ‘Sit down! Is there not one here besides you to speak? And there is no preference to you except by a precedent (being foremost in Al-Islam) or by piety’.",
                    "href": "https://thaqalayn.net/hadith/8/1/204/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 392)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "206": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: The Dream of Abu Jafar, Alayhim al-Salam",
                    "arabicText": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنِ الْحَلَبِيِّ عَنِ ابْنِ مُسْكَانَ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ رَأَيْتُ كَأَنِّي عَلَى رَأْسِ جَبَلٍ وَ النَّاسُ يَصْعَدُونَ إِلَيْهِ مِنْ كُلِّ جَانِبٍ حَتَّى إِذَا كَثُرُوا عَلَيْهِ تَطَاوَلَ بِهِمْ فِي السَّمَاءِ وَ جَعَلَ النَّاسُ يَتَسَاقَطُونَ عَنْهُ مِنْ كُلِّ جَانِبٍ حَتَّى لَمْ يَبْقَ مِنْهُمْ أَحَدٌ إِلَّا عِصَابَةٌ يَسِيرَةٌ فَفُعِلَ ذَلِكَ خَمْسَ مَرَّاتٍ فِي كُلِّ ذَلِكَ يَتَسَاقَطُ عَنْهُ النَّاسُ وَ يَبْقَى تِلْكَ الْعِصَابَةُ أَمَا إِنَّ قَيْسَ بْنَ عَبْدِ اللَّهِ بْنِ عَجْلَانَ فِي تِلْكَ الْعِصَابَةِ قَالَ فَمَا مَكَثَ بَعْدَ ذَلِكَ إِلَّا نَحْواً مِنْ خَمْسٍ حَتَّى هَلَكَ.",
                    "englishText": "206. A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Al-Nazar Bin Suweyd, from Al-Halby, from Ibn Muskaan, from Zurara, who has narrated the following: Abu Ja’far  having said: ‘I  saw (in a dream) as if I  am on top of a mountain, and the people are climbing up from all sides, to the extent that they were many of them, and it prolonged by them in the sky, and the people started falling off from it from all sides until there did not remain among them any one except for a small group. So they made an attempt five times, and during each of that the people fell off from it and there did not remain except for a (small) group. As for Qays Bin Abdullah Bin Ajlaan, he was in that group’. He (the narrator) said: ‘He  did not remain after that except for about five (days) until he  passed away’.",
                    "href": "https://thaqalayn.net/hadith/8/1/206/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 392)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "207": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Angels Give Ghusl to Abu Jafar, Alayhim al-Salam",
                    "arabicText": "عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ قَالَ حَدَّثَنِي أَبُو بَصِيرٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ إِنَّ رَجُلًا كَانَ عَلَى أَمْيَالٍ مِنَ الْمَدِينَةِ فَرَأَى فِي مَنَامِهِ فَقِيلَ لَهُ انْطَلِقْ فَصَلِّ عَلَى أَبِي جَعْفَرٍ (عليه السلام) فَإِنَّ الْمَلَائِكَةَ تُغَسِّلُهُ فِي الْبَقِيعِ فَجَاءَ الرَّجُلُ فَوَجَدَ أَبَا جَعْفَرٍ (عليه السلام) قَدْ تُوُفِّيَ.",
                    "englishText": "207. From him, from Ahmad Bin Muhammad Bin Abu Nasr, from Hammaad Bin Usman who said: ‘Abu Baseer narrated to me by saying, ‘I heard Abu Abdullah  saying that: ‘A man who was miles away from Al-Medina, saw in his dream in which it was said to him, ‘Go and Pray over Abu Ja’far , for the Angels have performed his  washing in Al-Baqi’e’. So the man went, and found Abu Ja’far  to have passed away’.",
                    "href": "https://thaqalayn.net/hadith/8/1/207/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 393)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "216": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Question of a Man from Abu Ja’afar, ‘Alayhi al-Salam",
                    "arabicText": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ سَدِيرٍ قَالَ كُنَّا عِنْدَ أَبِي جَعْفَرٍ (عليه السلام) فَذَكَرْنَا مَا أَحْدَثَ النَّاسُ بَعْدَ نَبِيِّهِمْ (صلى الله عليه وآله) وَ اسْتِذْلَالَهُمْ أَمِيرَ الْمُؤْمِنِينَ (عليه السلام) فَقَالَ رَجُلٌ مِنَ الْقَوْمِ أَصْلَحَكَ اللَّهُ فَأَيْنَ كَانَ عِزُّ بَنِي هَاشِمٍ وَ مَا كَانُوا فِيهِ مِنَ الْعَدَدِ فَقَالَ أَبُو جَعْفَرٍ (عليه السلام) وَ مَنْ كَانَ بَقِيَ مِنْ بَنِي هَاشِمٍ إِنَّمَا كَانَ جَعْفَرٌ وَ حَمْزَةُ فَمَضَيَا وَ بَقِيَ مَعَهُ رَجُلَانِ ضَعِيفَانِ ذَلِيلَانِ حَدِيثَا عَهْدٍ بِالْإِسْلَامِ عَبَّاسٌ وَ عَقِيلٌ وَ كَانَا مِنَ الطُّلَقَاءِ أَمَا وَ اللَّهِ لَوْ أَنَّ حَمْزَةَ وَ جَعْفَراً كَانَا بِحَضْرَتِهِمَا مَا وَصَلَا إِلَى مَا وَصَلَا إِلَيْهِ وَ لَوْ كَانَا شَاهِدَيْهِمَا لَأَتْلَفَا نَفْسَيْهِمَا.",
                    "englishText": "216. Muhammad Bin yahya, from Ahmad Bin Muhammad, from Al-Husayn Bin Saeed, from Ali Bin Al-No’man, from Abdullah Bin Muskaan, from Sudeyr who said: We were in the presence of Abu Ja’far , so we mentioned what the people had done after their Prophet ﷺ, and their humiliating Amir-ul-Momineen . So a man from the people said, ‘May Allah (azwj) Keep you well, so where were the strong ones of the Clan of Hashim  and what was their number?’ So Abu Ja’far  said: ‘And from those ones of the Clan of Hashim  that remained were Ja’far  and Hamza  who had passed away (martyred), and there remained with them two men who were weak, disgraceful, new ones in the era of Al-Islam, Abbas and Aqeel who were from the freed ones. By Allah (azwj)! If Hamza  and Ja’far  were present among them, they would not have achieved what they achieved. And had they seen them  two, they would not have damaged themselves’.",
                    "href": "https://thaqalayn.net/hadith/8/1/216/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 393)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "230": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Permission to cut veins",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ يُونُسَ بْنِ يَعْقُوبَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ (عليه السلام) الرَّجُلُ يَشْرَبُ الدَّوَاءَ وَ يَقْطَعُ الْعِرْقَ وَ رُبَّمَا انْتَفَعَ بِهِ وَ رُبَّمَا قَتَلَهُ قَالَ يَقْطَعُ وَ يَشْرَبُ.",
                    "englishText": "230. Ali Bin Ibrahim, from his father, from Ibn Abi ‘Umayr, from Yunus Bin Yaqoub who said: I said to Abu Abdullah , ‘The man drinks the medicine, and cuts the vein, and perhaps it benefits him and perhaps it kills him’. He  said: ‘He can cut and he can drink’.",
                    "href": "https://thaqalayn.net/hadith/8/1/230/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 393)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "244": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Abbas and ‘Aqil on the day of Badr",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ سَمِعْتُهُ يَقُولُ فِي هَذِهِ الْآيَةِ يا أَيُّهَا النَّبِيُّ قُلْ لِمَنْ فِي أَيْدِيكُمْ مِنَ الْأَسْرى إِنْ يَعْلَمِ اللَّهُ فِي قُلُوبِكُمْ خَيْراً يُؤْتِكُمْ خَيْراً مِمَّا أُخِذَ مِنْكُمْ وَ يَغْفِرْ لَكُمْ قَالَ نَزَلَتْ فِي الْعَبَّاسِ وَ عَقِيلٍ وَ نَوْفَلٍ وَ قَالَ إِنَّ رَسُولَ اللَّهِ (صلى الله عليه وآله) نَهَى يَوْمَ بَدْرٍ أَنْ يُقْتَلَ أَحَدٌ مِنْ بَنِي هَاشِمٍ وَ أَبُو الْبَخْتَرِيِّ فَأُسِرُوا فَأَرْسَلَ عَلِيّاً ( عليه السلام ) فَقَالَ انْظُرْ مَنْ هَاهُنَا مِنْ بَنِي هَاشِمٍ قَالَ فَمَرَّ عَلِيٌّ (عليه السلام) عَلَى عَقِيلِ بْنِ أَبِي طَالِبٍ كَرَّمَ اللَّهُ وَجْهَهُ فَحَادَ عَنْهُ فَقَالَ لَهُ عَقِيلٌ يَا ابْنَ أُمِّ عَلَيَّ أَمَا وَ اللَّهِ لَقَدْ رَأَيْتَ مَكَانِي قَالَ فَرَجَعَ إِلَى رَسُولِ اللَّهِ (صلى الله عليه وآله) وَ قَالَ هَذَا أَبُو الْفَضْلِ فِي يَدِ فُلَانٍ وَ هَذَا عَقِيلٌ فِي يَدِ فُلَانٍ وَ هَذَا نَوْفَلُ بْنُ الْحَارِثِ فِي يَدِ فُلَانٍ فَقَامَ رَسُولُ اللَّهِ (صلى الله عليه وآله) حَتَّى انْتَهَى إِلَى عَقِيلٍ فَقَالَ لَهُ يَا أَبَا يَزِيدَ قُتِلَ أَبُو جَهْلٍ فَقَالَ إِذاً لَا تُنَازَعُونَ فِي تِهَامَةَ فَقَالَ إِنْ كُنْتُمْ أَثْخَنْتُمُ الْقَوْمَ وَ إِلَّا فَارْكَبُوا أَكْتَافَهُمْ فَقَالَ فَجِي‏ءَ بِالْعَبَّاسِ فَقِيلَ لَهُ افْدِ نَفْسَكَ وَ افْدِ ابْنَ أَخِيكَ فَقَالَ يَا مُحَمَّدُ تَتْرُكُنِي أَسْأَلُ قُرَيْشاً فِي كَفِّي فَقَالَ أَعْطِ مِمَّا خَلَّفْتَ عِنْدَ أُمِّ الْفَضْلِ وَ قُلْتَ لَهَا إِنْ أَصَابَنِي فِي وَجْهِي هَذَا شَيْ‏ءٌ فَأَنْفِقِيهِ عَلَى وُلْدِكِ وَ نَفْسِكِ فَقَالَ لَهُ يَا ابْنَ أَخِي مَنْ أَخْبَرَكَ بِهَذَا فَقَالَ أَتَانِي بِهِ جَبْرَئِيلُ ( عليه السلام ) مِنْ عِنْدِ اللَّهِ عَزَّ وَ جَلَّ فَقَالَ وَ مَحْلُوفِهِ مَا عَلِمَ بِهَذَا أَحَدٌ إِلَّا أَنَا وَ هِيَ أَشْهَدُ أَنَّكَ رَسُولُ اللَّهِ قَالَ فَرَجَعَ الْأَسْرَى كُلُّهُمْ مُشْرِكِينَ إِلَّا الْعَبَّاسُ وَ عَقِيلٌ وَ نَوْفَلٌ كَرَّمَ اللَّهُ وُجُوهَهُمْ وَ فِيهِمْ نَزَلَتْ هَذِهِ الْآيَةُ قُلْ لِمَنْ فِي أَيْدِيكُمْ مِنَ الْأَسْرى إِنْ يَعْلَمِ اللَّهُ فِي قُلُوبِكُمْ خَيْراً إِلَى آخِرِ الْآيَةِ.",
                    "englishText": "244. Ali Bin Ibrahim, from his father, from Ibn Abi ‘Umayr, from Muawiya Bin Ammar, who has said the following: Abu Abdullah , said, ‘I heard him  saying regarding this Verse: “[8:70] O Prophet! say to those of the captives who are in your hands: If Allah knows anything good in your hearts, He will give to you better than that which has been taken away from you and will forgive you”, he  said: ‘This was Revealed regarding Al-Abbas, and Aqeel, and Naufal’. And he  said that: ‘The Rasool Allah ﷺ prohibited the killing of anyone from the Clan of Hashim  and Abu Al-Bakhtary on the Day of Badr. So they were made captives. The Rasool Allah ﷺ sent for Ali  and said: ‘Go and see over there, who are the ones from the Clan of Hashim ’. So Ali  passed by Aqeel son of Abu Talib , may Allah (azwj) Honour his  face. He  turned away from him. So Aqeel said to him , ‘O son  of my mother  Ali ! But, by Allah (azwj), you  can see my situation’. He  returned to the Rasool Allah ﷺ and said: ‘This is Abu Al-Fazl in the hand of so and so, and this is Aqeel in the hand of so and so, and this is Naufal Bin Al-Haris in the hand of so and so’. So the Rasool Allah ﷺ stood up and came up to Aqeel and said to him: ‘O Abu Yazeed, Abu Jahl has been killed’. He said, ‘Then you ﷺ will not be disputing about Tahaamat’. He ﷺ said: ‘If you are strong people, otherwise tie up their hands’. They came up with Al-Abbas, so he ﷺ said: ‘Ransom yourself and ransom the son of your brother’. He said, ‘O Muhammad ﷺ! Let me go and ask the Qureish for ransoming me’. He ﷺ said: ‘Give from what you have left behind with Umm Al-Fazl and said to her that, ‘If this I face this difficulty, so spend upon your children and on yourself’. So he said to him ﷺ: ‘O son ﷺ of my brother , who informed you ﷺ of this?’ He ﷺ said: ‘Jibraeel  came with it to me ﷺ from the Presence of Allah (azwj) Mighty and Majestic’. So he said, ‘And I had held her on oath that no one would know of this except for myself and her. I hereby testify that you ﷺ are the Rasool Allah ﷺ’. He  said; ‘All the captives returned as Polytheists except for Al-Abbas, and Aqeel, and Naufal, may Allah (azwj) Honour their faces, and it was regarding them that this Verse was Revealed: “[8:70] O Prophet! say to those of the captives who are in your hands: If Allah knows anything good in your hearts, He will give to you better than that which has been taken away from you and will forgive you” up to the end of the Verse’.",
                    "href": "https://thaqalayn.net/hadith/8/1/244/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 393)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "245": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: About the words of Allah ‘...do you think providing water for al-Hajj...’ (9:19)",
                    "arabicText": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَحَدِهِمَا (عليهما السلام) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ أَ جَعَلْتُمْ سِقايَةَ الْحاجِّ وَ عِمارَةَ الْمَسْجِدِ الْحَرامِ كَمَنْ آمَنَ بِاللَّهِ وَ الْيَوْمِ الْآخِرِ نَزَلَتْ فِي حَمْزَةَ وَ عَلِيٍّ وَ جَعْفَرٍ وَ الْعَبَّاسِ وَ شَيْبَةَ إِنَّهُمْ فَخَرُوا بِالسِّقَايَةِ وَ الْحِجَابَةِ فَأَنْزَلَ اللَّهُ جَلَّ وَ عَزَّ أَ جَعَلْتُمْ سِقايَةَ الْحاجِّ وَ عِمارَةَ الْمَسْجِدِ الْحَرامِ كَمَنْ آمَنَ بِاللَّهِ وَ الْيَوْمِ الْآخِرِ وَ كَانَ عَلِيٌّ وَ حَمْزَةُ وَ جَعْفَرٌ صَلَوَاتُ اللَّهِ عَلَيْهِمُ الَّذِينَ آمَنُوا بِاللَّهِ وَ الْيَوْمِ الْآخِرِ وَ جَاهَدُوا فِي سَبِيلِ اللَّهِ لَا يَسْتَوُونَ عِنْدَ اللَّهِ.",
                    "englishText": "245. Abu Ali Al-Ashary, from Muhammad Bin Abdul Jabbar, from Safwaan Bin yahya, from Ibn Muskan, from Abu Baseer, who has said: One of them  regarding the Statement of Allah (azwj) Mighty and Majestic: “[9:19] What! do you make (one who undertakes) the giving of drink to the pilgrims and the guarding of the Sacred Mosque like him who believes in Allah and the latter day”. He  said: ‘This was Revealed regarding Hamza , and Ali , and Ja’far , and Al-Abbas , and Shaeba. They prided themselves for quenching (the thirst) of the Pilgrims. So Allah (azwj) Majestic and Mighty Revealed “[9:19] What! do you make (one who undertakes) the giving of drink to the pilgrims and the guarding of the Sacred Mosque like him who believes in Allah and the latter day”, and it was Ali , and Hamza , and Ja’far , may greeting be upon them  are the ones who  believed in Allah (azwj) and the Last Day, and they  fought in the Way of Allah (azwj), and (others) are not equal to them  in the Presence of Allah (azwj)’.",
                    "href": "https://thaqalayn.net/hadith/8/1/245/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 394)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "257": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Destruction of Abbasids from where it began",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ الْمُفَضَّلِ بْنِ مَزْيَدٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قُلْتُ لَهُ أَيَّامَ عَبْدِ اللَّهِ بْنِ عَلِيٍّ قَدِ اخْتَلَفَ هَؤُلَاءِ فِيمَا بَيْنَهُمْ فَقَالَ دَعْ ذَا عَنْكَ إِنَّمَا يَجِي‏ءُ فَسَادُ أَمْرِهِمْ مِنْ حَيْثُ بَدَا صَلَاحُهُمْ.",
                    "englishText": "257. Ali Bin Ibrahim, from his father, from Ibn Abi ‘Umayr, from Al-Mufazzal Bin Mazeed, who has narrated the following: I said to Abu Abdullah , ‘The days of Abdullah Bin Ali, they (Abbasid rulers) disputed regarding what was in between them’. So he  said: ‘You leave that. But rather, the spoiling of their command would come from where their success began’.",
                    "href": "https://thaqalayn.net/hadith/8/1/257/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 394)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "261": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: The Complaints of ‘Abd Allah, ‘Alayhi al-Salam, before Allah",
                    "arabicText": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مَنْصُورِ بْنِ يُونُسَ عَنْ عَنْبَسَةَ بْنِ مُصْعَبٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ أَشْكُو إِلَى اللَّهِ عَزَّ وَ جَلَّ وَحْدَتِي وَ تَقَلْقُلِي بَيْنَ أَهْلِ الْمَدِينَةِ حَتَّى تَقْدَمُوا وَ أَرَاكُمْ وَ آنَسَ بِكُمْ فَلَيْتَ هَذِهِ الطَّاغِيَةَ أَذِنَ لِي فَأَتَّخِذَ قَصْراً فِي الطَّائِفِ فَسَكَنْتُهُ وَ أَسْكَنْتُكُمْ مَعِيَ وَ أَضْمَنَ لَهُ أَنْ لَا يَجِي‏ءَ مِنْ نَاحِيَتِنَا مَكْرُوهٌ أَبَداً.",
                    "englishText": "261. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al-Hakam, from Mansour Bin Yunus, from Anbasat Bin Mus’ab who said: I heard Abu Abdullah  saying: ‘I  ‘أَشْكُو’ complain to Allah (azwj) Might and Majestic of my  loneliness, and restlessness among the people of Al-Medina, until you (Shites) come over and I  see you, and be comforted by you. If only this tyrant would allow me, so I  would take a fort in Al-Taef, so I  would dwell in it and you would all dwell in it with me . I  would guarantee to him that there would not come from our area any harm to him ever’.",
                    "href": "https://thaqalayn.net/hadith/8/1/261/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 395)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "293": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: May Allah bless one who makes us loveable to people",
                    "arabicText": "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ عَنْ وُهَيْبِ بْنِ حَفْصٍ عَنْ أَبِي بَصِيرٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ رَحِمَ اللَّهُ عَبْداً حَبَّبَنَا إِلَى النَّاسِ وَ لَمْ يُبَغِّضْنَا إِلَيْهِمْ أَمَا وَ اللَّهِ لَوْ يَرْوُونَ مَحَاسِنَ كَلَامِنَا لَكَانُوا بِهِ أَعَزَّ وَ مَا اسْتَطَاعَ أَحَدٌ أَنْ يَتَعَلَّقَ عَلَيْهِمْ بِشَيْ‏ءٍ وَ لَكِنْ أَحَدُهُمْ يَسْمَعُ الْكَلِمَةَ فَيَحُطُّ إِلَيْهَا عَشْراً.",
                    "englishText": "293. Humeyd bin Ziyad, from Al-Hassan Bin Muhammad, from Wuheyb Bin Hafs, from Abu Baseer who said: I heard Abu Abdullah  saying: ‘May Allah (azwj) have Mercy upon a servant who makes us  to be loveable to the people, and does not make us  to be hateful towards them. But, by Allah (azwj), they are reporting our  beautiful words to be honoured by it, and there is no leeway for anyone that he should attach anything to these (our words ), but one of them hears the words, so he degrades the beauty of these words by ten times (by dropping our  words from himself)’.",
                    "href": "https://thaqalayn.net/hadith/8/1/293/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 395)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "295": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: People calling to falsehood soon find followers",
                    "arabicText": "وُهَيْبُ بْنُ حَفْصٍ عَنْ أَبِي بَصِيرٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) مَا مِنْ عَبْدٍ يَدْعُو إِلَى ضَلَالَةٍ إِلَّا وَجَدَ مَنْ يُتَابِعُهُ.",
                    "englishText": "295. Wuheyb Bin hafs, from Abu Baseer who said: Abu Abdullah  said: ‘There is none from the servants who calls to the misguidance except that he finds the one who follows him’.",
                    "href": "https://thaqalayn.net/hadith/8/1/295/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 395)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "316": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Worship without Wilayah is not accepted",
                    "arabicText": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ ابْنِ فَضَّالٍ عَنْ إِبْرَاهِيمَ بْنِ أَخِي أَبِي شِبْلٍ عَنْ أَبِي شِبْلٍ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ (عليه السلام) ابْتِدَاءً مِنْهُ أَحْبَبْتُمُونَا وَ أَبْغَضَنَا النَّاسُ وَ صَدَّقْتُمُونَا وَ كَذَّبَنَا النَّاسُ وَ وَصَلْتُمُونَا وَ جَفَانَا النَّاسُ فَجَعَلَ اللَّهُ مَحْيَاكُمْ مَحْيَانَا وَ مَمَاتَكُمْ مَمَاتَنَا أَمَا وَ اللَّهِ مَا بَيْنَ الرَّجُلِ وَ بَيْنَ أَنْ يُقِرَّ اللَّهُ عَيْنَهُ إِلَّا أَنْ تَبْلُغَ نَفْسُهُ هَذَا الْمَكَانَ وَ أَوْمَأَ بِيَدِهِ إِلَى حَلْقِهِ فَمَدَّ الْجِلْدَةَ ثُمَّ أَعَادَ ذَلِكَ فَوَ اللَّهِ مَا رَضِيَ حَتَّى حَلَفَ لِي فَقَالَ وَ اللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ لَحَدَّثَنِي أَبِي مُحَمَّدُ بْنُ عَلِيٍّ (عليه السلام) بِذَلِكَ يَا أَبَا شِبْلٍ أَ مَا تَرْضَوْنَ أَنْ تُصَلُّوا وَ يُصَلُّوا فَيُقْبَلَ مِنْكُمْ وَ لَا يُقْبَلَ مِنْهُمْ أَ مَا تَرْضَوْنَ أَنْ تُزَكُّوا وَ يُزَكُّوا فَيُقْبَلَ مِنْكُمْ وَ لَا يُقْبَلَ مِنْهُمْ أَ مَا تَرْضَوْنَ أَنْ تَحُجُّوا وَ يَحُجُّوا فَيَقْبَلَ اللَّهُ جَلَّ ذِكْرُهُ مِنْكُمْ وَ لَا يَقْبَلَ مِنْهُمْ وَ اللَّهِ مَا تُقْبَلُ الصَّلَاةُ إِلَّا مِنْكُمْ وَ لَا الزَّكَاةُ إِلَّا مِنْكُمْ وَ لَا الْحَجُّ إِلَّا مِنْكُمْ فَاتَّقُوا اللَّهَ عَزَّ وَ جَلَّ فَإِنَّكُمْ فِي هُدْنَةٍ وَ أَدُّوا الْأَمَانَةَ فَإِذَا تَمَيَّزَ النَّاسُ فَعِنْدَ ذَلِكَ ذَهَبَ كُلُّ قَوْمٍ بِهَوَاهُمْ وَ ذَهَبْتُمْ بِالْحَقِّ مَا أَطَعْتُمُونَا أَ لَيْسَ الْقُضَاةُ وَ الْأُمَرَاءُ وَ أَصْحَابُ الْمَسَائِلِ مِنْهُمْ قُلْتُ بَلَى قَالَ (عليه السلام) فَاتَّقُوا اللَّهَ عَزَّ وَ جَلَّ فَإِنَّكُمْ لَا تُطِيقُونَ النَّاسَ كُلَّهُمْ إِنَّ النَّاسَ أَخَذُوا هَاهُنَا وَ هَاهُنَا وَ إِنَّكُمْ أَخَذْتُمْ حَيْثُ أَخَذَ اللَّهُ عَزَّ وَ جَلَّ إِنَّ اللَّهَ عَزَّ وَ جَلَّ اخْتَارَ مِنْ عِبَادِهِ مُحَمَّداً (صلى الله عليه وآله) فَاخْتَرْتُمْ خِيَرَةَ اللَّهِ فَاتَّقُوا اللَّهَ وَ أَدُّوا الْأَمَانَاتِ إِلَى الْأَسْوَدِ وَ الْأَبْيَضِ وَ إِنْ كَانَ حَرُورِيّاً وَ إِنْ كَانَ شَامِيّاً.",
                    "englishText": "316. Abu Ali Al-Ashary, from Muhammad Bin Abdul Jabbaar, from Ibn Fazaal, from Ibrahim Bin Akhay Abu Shabl, from Abu Shabl who said: Abu Abdullah  said to me initiating a conversation: ‘You have loved us  whilst the people have hated us , and you have ratified us  whilst the people have belied us , and you have submitted to us  whilst the people have been disloyal to us . So Allah (azwj) has Made your lives to be our , and your deaths to be like our  passing away. But, by Allah (azwj), there is nothing between the man and the delight which Allah (azwj) has kept for him except for the soul to reach this place’ – and he  gestured with his  to his  throat and extended the skin. Then he  repeated that, so by Allah (azwj), he  was not happy until he  took an oath to me, so he  said: ‘By Allah (azwj) besides Whom there is no god except for Him (azwj), my  father  Muhammad Bin Ali  narrated that to me. O Abu Shabl! Are you not happy that you pray, and they pray, so it is accepted from you and it’s not accepted from them? Are you not happy that you give zakat, and they give zakat, so it is accepted from you and it’s not accepted from them? Are you not happy that you perform the pilgrimage and they perform the pilgrimage, so Allah (azwj) Accepts from you and does not Accept from them? By Allah (azwj)! The prayer is not accepted except from you, nor the zakat except from you, nor the pilgrimage except from you’. So fear Allah (azwj) for you are in a truce and fulfil the trusts for it is an excellent (merit) of the people. So fulfil that. All the people went according to their desires and you went with the truth in what you obeyed us . Is it not that the judges, and the rulers, and the problem solvers (those who would give fatwa) are among them?’ I said, ‘Yes’. He  said: ‘So fear Allah (azwj) for you will not be able to tolerate all these people. The people take from here and there, and you are taking from where Allah (azwj) has Told you to take from. Allah (azwj) Chose Muhammad ﷺ from His (azwj) servants, so you have chosen the Choice of Allah (azwj). So fear Allah (azwj) and fulfil the trusts to the black and the white, even if he was a Haruriyya (a sect) or if he was a Syrian’.",
                    "href": "https://thaqalayn.net/hadith/8/1/316/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 395)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "329": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: When al-Qai’m will rise..",
                    "arabicText": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ عَنِ الْعَبَّاسِ بْنِ عَامِرٍعَنِ الرَّبِيعِ بْنِ مُحَمَّدٍ الْمُسْلِيِّ عَنْ أَبِي الرَّبِيعِ الشَّامِيِّ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ إِنَّ قَائِمَنَا إِذَا قَامَ مَدَّ اللَّهُ عَزَّ وَ جَلَّ لِشِيعَتِنَا فِي أَسْمَاعِهِمْ وَ أَبْصَارِهِمْ حَتَّى لَا يَكُونَ بَيْنَهُمْ وَ بَيْنَ الْقَائِمِ بَرِيدٌ يُكَلِّمُهُمُ فَيَسْمَعُونَ وَ يَنْظُرُونَ إِلَيْهِ وَ هُوَ فِي مَكَانِهِ.",
                    "englishText": "329. Abu Ali Al-Ashary, from Al-Hassan Bin Ali Al-kufy, from Al-Abbas Bin Aamir, from Al-Rabi’e Bin Muhammad Al-Muslyy, from Abu Al-Rabi’e who said: I heard Abu Abdullah  saying that: ‘When our Qaim  makes a stand, Allah (azwj) will extend the hearing of our  Shites, and their vision to the extent that there will not be a postman in between them and Al-Qaim . They will be speaking, and hearing, and visualising him  and he  would be in Mecca’.",
                    "href": "https://thaqalayn.net/hadith/8/1/329/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 396)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "338": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Advantageous advice",
                    "arabicText": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ لِحُمْرَانَ بْنِ أَعْيَنَ يَا حُمْرَانُ انْظُرْ إِلَى مَنْ هُوَ دُونَكَ فِي الْمَقْدُرَةِ وَ لَا تَنْظُرْ إِلَى مَنْ هُوَ فَوْقَكَ فِي الْمَقْدُرَةِ فَإِنَّ ذَلِكَ أَقْنَعُ لَكَ بِمَا قُسِمَ لَكَ وَ أَحْرَى أَنْ تَسْتَوْجِبَ الزِّيَادَةَ مِنْ رَبِّكَ وَ اعْلَمْ أَنَّ الْعَمَلَ الدَّائِمَ الْقَلِيلَ عَلَى الْيَقِينِ أَفْضَلُ عِنْدَ اللَّهِ جَلَّ ذِكْرُهُ مِنَ الْعَمَلِ الْكَثِيرِ عَلَى غَيْرِ يَقِينٍ وَ اعْلَمْ أَنَّهُ لَا وَرَعَ أَنْفَعُ مِنْ تَجَنُّبِ مَحَارِمِ اللَّهِ وَ الْكَفِّ عَنْ أَذَى الْمُؤْمِنِينَ وَ اغْتِيَابِهِمْ وَ لَا عَيْشَ أَهْنَأُ مِنْ حُسْنِ الْخُلُقِ وَ لَا مَالَ أَنْفَعُ مِنَ الْقُنُوعِ بِالْيَسِيرِ الْمُجْزِي وَ لَا جَهْلَ أَضَرُّ مِنَ الْعُجْبِ.",
                    "englishText": "338. A number of our companions, from Sahl Bin Ziyad, and Ali Bin Ibrahim, from his father altogether, from Ibn Mahboub, from Hisham Bin Saalim who said: I heard Abu Abdullah  saying to Humraan Bin Ayn: ‘O Humraan! Look to the one who is below you in the capability, and do not look at the one who is above you in the capability, for that would be contentment for you with what Allah (azwj) has Distributed for you, and you would be more likely to receive more from your Lord (azwj). And know that a small amount of deeds with certainty are more preferable in the Presence of Allah (azwj) than the numerous deeds performed without certainty. And know that there is no devoutness which is more beneficial than avoiding the Prohibitions of Allah (azwj) and the restraint from hurting the Believers and back-biting against them, and no life more enjoyable than good manners, and no wealth more beneficial than contentment with less, and no ignorance more harmful than ‘الْعُجْبِ’ the self-conceit’.",
                    "href": "https://thaqalayn.net/hadith/8/1/338/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 396)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "361": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Before the Messenger of Allah, Sallallahu ʿAlayhi waalihi wa-sallam deeds of his followers are presented",
                    "arabicText": "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُحَمَّدِ بْنِ أَبِي حَمْزَةَ وَ غَيْرِ وَاحِدٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ قَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) إِنَّ لَكُمْ فِي حَيَاتِي خَيْراً وَ فِي مَمَاتِي خَيْراً قَالَ فَقِيلَ يَا رَسُولَ اللَّهِ أَمَّا حَيَاتَكَ فَقَدْ عَلِمْنَا فَمَا لَنَا فِي وَفَاتِكَ فَقَالَ أَمَّا فِي حَيَاتِي فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ قَالَ وَ ما كانَ اللَّهُ لِيُعَذِّبَهُمْ وَ أَنْتَ فِيهِمْ وَ أَمَّا فِي مَمَاتِي فَتُعْرَضُ عَلَيَّ أَعْمَالُكُمْ فَأَسْتَغْفِرُ لَكُمْ.",
                    "englishText": "361. Ali, from his father, from Ibn Abi ‘Umayr, from Muhammad Bin Abu Hamza and someone else, has reported the following: Abu Abdullah  says that the Rasool Allah ﷺ said: ‘There is goodness for you in my ﷺ being alive and goodness for you in my ﷺ passing away’. So they said, ‘O Rasool Allah ﷺ! As for your ﷺ being alive, so we have known that. So what is (goodness) for us in your ﷺ passing away?’ He ﷺ said: ‘As for my ﷺ being alive, so Allah (azwj) Mighty and Majestic has Said: “[8:33] But Allah was not going to chastise them while you were among them”. And as for my ﷺ passing away, your deeds would get presented to me ﷺ, so I ﷺ would be seeking Forgiveness for you’.",
                    "href": "https://thaqalayn.net/hadith/8/1/361/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3/ 397)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "362": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Claim to be the Imam without qualification",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍعَنْ هِشَامِ بْنِ سَالِمٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) إِنَّ مِمَّنْ يَنْتَحِلُ هَذَا الْأَمْرَ لَيَكْذِبُ حَتَّى إِنَّ الشَّيْطَانَ لَيَحْتَاجُ إِلَى كَذِبِهِ.",
                    "englishText": "362. Ali Bin Ibrahim, from his father, from Ibn Abi ‘Umayr, from Hashaam Bin Saalim who said: Abu Abdullah  said: ‘Whosoever (other than us ) claims to have the  Command (Wilayah), he has lied to the extent that the Satan (la) would be needy of his lie’.",
                    "href": "https://thaqalayn.net/hadith/8/1/362/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3/ 397)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "376": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Hadith of the night journey",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ حَدِيدٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ لَمَّا أُسْرِيَ بِرَسُولِ اللَّهِ (صلى الله عليه وآله) أَصْبَحَ فَقَعَدَ فَحَدَّثَهُمْ بِذَلِكَ فَقَالُوا لَهُ صِفْ لَنَا بَيْتَ الْمَقْدِسِ قَالَ فَوَصَفَ لَهُمْ وَ إِنَّمَا دَخَلَهُ لَيْلًا فَاشْتَبَهَ عَلَيْهِ النَّعْتُ فَأَتَاهُ جَبْرَئِيلُ (عليه السلام) فَقَالَ انْظُرْ هَاهُنَا فَنَظَرَ إِلَى الْبَيْتِ فَوَصَفَهُ وَ هُوَ يَنْظُرُ إِلَيْهِ ثُمَّ نَعَتَ لَهُمْ مَا كَانَ مِنْ عِيرٍ لَهُمْ فِيمَا بَيْنَهُمْ وَ بَيْنَ الشَّامِ ثُمَّ قَالَ هَذِهِ عِيرُ بَنِي فُلَانٍ تَقْدَمُ مَعَ طُلُوعِ الشَّمْسِ يَتَقَدَّمُهَا جَمَلٌ أَوْرَقُ أَوْ أَحْمَرُ قَالَ وَ بَعَثَ قُرَيْشٌ رَجُلًا عَلَى فَرَسٍ لِيَرُدَّهَا قَالَ وَ بَلَغَ مَعَ طُلُوعِ الشَّمْسِ قَالَ قُرْطَةُ بْنُ عَبْدِ عَمْرٍو يَا لَهْفاً أَلَّا أَكُونَ لَكَ جَذَعاً حِينَ تَزْعُمُ أَنَّكَ أَتَيْتَ بَيْتَ الْمَقْدِسِ وَ رَجَعْتَ مِنْ لَيْلَتِكَ.",
                    "englishText": "376. Ali Bin Ibrahim, from his father, from Ahmad Bin Muhammad Bin Abu Nasr, from Abaan Bin Usmaan, from Hadeed, who has narrated the following: Abu Abdullah  has said: ‘When the ascension (Me’raaj) took place with the Rasool Allah ﷺ, in the morning he ﷺ sat and narrated it to them (his ﷺ companions). So they said to him ﷺ, ‘Describe for us Bayt Al-Maqdas’. So he ﷺ described it for them, as he ﷺ had seen it during the night, therefore they remained vague about it. So Jibraeel came to him ﷺ and said: ‘Look over there!’ So he ﷺ looked towards Al-Bayt (Al-Maqdas) and described it to them whilst looking at it. Then he ﷺ described for them the caravan, which was in between them and Syria. Then said: ‘These were the camels of the Clan of so and so and will be arriving with the rise of the sun, led by a red camel’. And the Quresyh then sent a man upon a horse to turn these back, but it still arrived with the rise of the sun. Qurtat Bin Abd Amro said, ‘O a grief that I don’t be for you a trunk (strong enough) when you ﷺ claims that you ﷺ came to Bait Al-Maqdis and returned in the same night (O Prophet ﷺ!).",
                    "href": "https://thaqalayn.net/hadith/8/1/376/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3/ 397)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "381": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: In praise of Zayd ibn Ali; the rise of Sufyani as a sign of the rise of al-Qa’im",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عِيصِ بْنِ الْقَاسِمِ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ عَلَيْكُمْ بِتَقْوَى اللَّهِ وَحْدَهُ لَا شَرِيكَ لَهُ وَ انْظُرُوا لِأَنْفُسِكُمْ فَوَ اللَّهِ إِنَّ الرَّجُلَ لَيَكُونُ لَهُ الْغَنَمُ فِيهَا الرَّاعِي فَإِذَا وَجَدَ رَجُلًا هُوَ أَعْلَمُ بِغَنَمِهِ مِنَ الَّذِي هُوَ فِيهَا يُخْرِجُهُ وَ يَجِي‏ءُ بِذَلِكَ الرَّجُلِ الَّذِي هُوَ أَعْلَمُ بِغَنَمِهِ مِنَ الَّذِي كَانَ فِيهَا وَ اللَّهِ لَوْ كَانَتْ لِأَحَدِكُمْ نَفْسَانِ يُقَاتِلُ بِوَاحِدَةٍ يُجَرِّبُ بِهَا ثُمَّ كَانَتِ الْأُخْرَى بَاقِيَةً فَعَمِلَ عَلَى مَا قَدِ اسْتَبَانَ لَهَا وَ لَكِنْ لَهُ نَفْسٌ وَاحِدَةٌ إِذَا ذَهَبَتْ فَقَدْ وَ اللَّهِ ذَهَبَتِ التَّوْبَةُ فَأَنْتُمْ أَحَقُّ أَنْ تَخْتَارُوا لِأَنْفُسِكُمْ إِنْ أَتَاكُمْ آتٍ مِنَّا فَانْظُرُوا عَلَى أَيِّ شَيْ‏ءٍ تَخْرُجُونَ وَ لَا تَقُولُوا خَرَجَ زَيْدٌ فَإِنَّ زَيْداً كَانَ عَالِماً وَ كَانَ صَدُوقاً وَ لَمْ يَدْعُكُمْ إِلَى نَفْسِهِ إِنَّمَا دَعَاكُمْ إِلَى الرِّضَا مِنْ آلِ مُحَمَّدٍ (عليهم السلام) وَ لَوْ ظَهَرَ لَوَفَى بِمَا دَعَاكُمْ إِلَيْهِ إِنَّمَا خَرَجَ إِلَى سُلْطَانٍ مُجْتَمِعٍ لِيَنْقُضَهُ فَالْخَارِجُ مِنَّا الْيَوْمَ إِلَى أَيِّ شَيْ‏ءٍ يَدْعُوكُمْ إِلَى الرِّضَا مِنْ آلِ مُحَمَّدٍ (عليهم السلام) فَنَحْنُ نُشْهِدُكُمْ أَنَّا لَسْنَا نَرْضَى بِهِ وَ هُوَ يَعْصِينَا الْيَوْمَ وَ لَيْسَ مَعَهُ أَحَدٌ وَ هُوَ إِذَا كَانَتِ الرَّايَاتُ وَ الْأَلْوِيَةُ أَجْدَرُ أَنْ لَا يَسْمَعَ مِنَّا إِلَّا مَعَ مَنِ اجْتَمَعَتْ بَنُو فَاطِمَةَ مَعَهُ فَوَ اللَّهِ مَا صَاحِبُكُمْ إِلَّا مَنِ اجْتَمَعُوا عَلَيْهِ إِذَا كَانَ رَجَبٌ فَأَقْبِلُوا عَلَى اسْمِ اللَّهِ عَزَّ وَ جَلَّ وَ إِنْ أَحْبَبْتُمْ أَنْ تَتَأَخَّرُوا إِلَى شَعْبَانَ فَلَا ضَيْرَ وَ إِنْ أَحْبَبْتُمْ أَنْ تَصُومُوا فِي أَهَالِيكُمْ فَلَعَلَّ ذَلِكَ أَنْ يَكُونَ أَقْوَى لَكُمْ وَ كَفَاكُمْ بِالسُّفْيَانِيِّ عَلَامَةً.",
                    "englishText": "381. Ali Bin Ibrahim, from his father, from Safwaan Bin Yahya, from Ays Bin Al-Qasim who said: I heard Abu Abdullah  saying: ‘It is upon you to fear Allah (azwj), One with no associates to Him (azwj), and look into yourselves, for, by Allah (azwj), the man who has sheep and the shepherd for it, if he finds a man who is more knowledgeable about the sheep than him, would let him go and come to that man who is more knowledgeable about his sheep. By Allah (azwj)! If one of you had two souls, he could have fought with one, experimenting by it, then he would have worked with the other one with what has been clarified for it. But, for him there is only one soul, if it goes, by Allah (azwj), the repentance goes (with it). So you are more deserving that you should choose for yourselves the one who comes to you from us , and upon which matter you are coming out, and do not go around saying that Zayd has come out, for Zayd was a scholar, and he was truthful, and he did not call you for himself. But rather he called to the pleasure (Al-Ridha) from the Progeny  of Muhammad ﷺ, and had he made an appearance he would have been loyal to what he called you to. But rather, he came out against an authority to break it. So the one who comes out from us  today for anything, he will call you to the pleasure (Al-Ridha) from the Progeny  of Muhammad ﷺ. So we  are testifying to you that we  are not happy with it, and he has disobeyed us  today. And there is no one with him and he with the banners and the flags, more worthy that he should listen from us  except that with him would be gathered the children of Fatima . By Allah (azwj)! What is your Master  (Al-Qaim ) except that there will be gathered around him  in the month of Rajab. So go towards him  in the Name of Allah (azwj), and if you would like to delay it to the month of Shabaan, so it is not harmful, and if you would like to Fast in your situations so that would be more strengthening for you, and let Al-Sufyani suffice for you as a sign’.",
                    "href": "https://thaqalayn.net/hadith/8/1/381/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 397)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "383": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: The command to remain at home before the rise of Sufyani",
                    "arabicText": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ بَكْرِ بْنِ مُحَمَّدٍ عَنْ سَدِيرٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ (عليه السلام) يَا سَدِيرُ الْزَمْ بَيْتَكَ وَ كُنْ حِلْساً مِنْ أَحْلَاسِهِ وَ اسْكُنْ مَا سَكَنَ اللَّيْلُ وَ النَّهَارُ فَإِذَا بَلَغَكَ أَنَّ السُّفْيَانِيَّ قَدْ خَرَجَ فَارْحَلْ إِلَيْنَا وَ لَوْ عَلَى رِجْلِكَ.",
                    "englishText": "383. A number of our companions, from Ahmad Bin Muhammad, from Usmaan Bin Isa, from Bakr Bin Muhammad, from Sudeyr who said: Abu Abdullah  said: ‘O Sudeyr! Be seated in your houses and remain calm, and stay like that overnight, and when the day arrives, and Al-Sufyani has come out, so get out to come to us  even if you have to walk on your feet’.",
                    "href": "https://thaqalayn.net/hadith/8/1/383/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 398)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "395": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Permission to use words with hidden meanings, irony",
                    "arabicText": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ مَالِكِ بْنِ عَطِيَّةَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ (عليه السلام) إِنِّي رَجُلٌ مِنْ بَجِيلَةَ وَ أَنَا أَدِينُ اللَّهَ عَزَّ وَ جَلَّ بِأَنَّكُمْ مَوَالِيَّ وَ قَدْ يَسْأَلُنِي بَعْضُ مَنْ لَا يَعْرِفُنِي فَيَقُولُ لِي مِمَّنِ الرَّجُلُ فَأَقُولُ لَهُ أَنَا رَجُلٌ مِنَ الْعَرَبِ ثُمَّ مِنْ بَجِيلَةَ فَعَلَيَّ فِي هَذَا إِثْمٌ حَيْثُ لَمْ أَقُلْ إِنِّي مَوْلًى لِبَنِي هَاشِمٍ فَقَالَ لَا أَ لَيْسَ قَلْبُكَ وَ هَوَاكَ مُنْعَقِداً عَلَى أَنَّكَ مِنْ مَوَالِينَا فَقُلْتُ بَلَى وَ اللَّهِ فَقَالَ لَيْسَ عَلَيْكَ فِي أَنْ تَقُولَ أَنَا مِنَ الْعَرَبِ إِنَّمَا أَنْتَ مِنَ الْعَرَبِ فِي النَّسَبِ وَ الْعَطَاءِ وَ الْعَدَدِ وَ الْحَسَبِ فَأَنْتَ فِي الدِّينِ وَ مَا حَوَى الدِّينُ بِمَا تَدِينُ اللَّهَ عَزَّ وَ جَلَّ بِهِ مِنْ طَاعَتِنَا وَ الْأَخْذِ بِهِ مِنَّا مِنْ مَوَالِينَا وَ مِنَّا وَ إِلَيْنَا.",
                    "englishText": "395. Muhammad Bin Yahya, from Ahmad Bin Muhammad and a number of our companions, from Sahl Biin Ziyad together from Ibn Mahboub, from Malik Bin Atiyya who said: I said to Abu Abdullah , ‘I am a man from Bajilat (tribe), and I am on the Religion of Allah (azwj) by having befriended you , and some who do not know me have asked me by saying to me, ‘Who are you?’, so I say to them, ‘I am a man from the Arabs’, then (I say), from Bajilat. So is this a sin for me where I do not say that I am a friend (Mawaly) of the Clan of Hashim ?’ So he  said: ‘No. Is not your heart and your desire determined upon that you are from our  friends?’ So I said, ‘Yes, by Allah (azwj)!’ So he  said: ‘It is not upon you to say, ‘I am from the Arabs’. But rather, you are from the Arabs with regards to the lineage, and the gifts, and the number, and the nobility. But you are, with regards to the Religion, and what you had made a Religion by what Allah (azwj) Mighty and Majestic Made from being obedient to us  and taking to it from us . You are from us , and from our  friends, and from us  and to us ’.",
                    "href": "https://thaqalayn.net/hadith/8/1/395/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 398)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "408": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Apply cupping",
                    "arabicText": "عَنْهُ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ اقْرَأْ آيَةَ الْكُرْسِيِّ وَ احْتَجِمْ أَيَّ يَوْمٍ شِئْتَ وَ تَصَدَّقْ وَ اخْرُجْ أَيَّ يَوْمٍ شِئْتَ.",
                    "englishText": "408. From him, from Ibn Mahboub, from Abdul Rahmaan Bin Al-Hajjaaj, who has narrated the following: Abu Abdullah  has said: ‘Recite the Verse of the Throne (Aayat Al-Kursy), and get cupping done on whichever day you like to, and give charity, and go out on whichever day you like’.",
                    "href": "https://thaqalayn.net/hadith/8/1/408/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 399)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "409": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Medicine agitates",
                    "arabicText": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحَسَنِ عَنْ مُعَاوِيَةَ بْنِ حُكَيْمٍ قَالَ سَمِعْتُ عُثْمَانَ الْأَحْوَلِ يَقُولُ سَمِعْتُ أَبَا الْحَسَنِ (عليه السلام) يَقُولُ لَيْسَ مِنْ دَوَاءٍ إِلَّا وَ هُوَ يُهَيِّجُ دَاءً وَ لَيْسَ شَيْ‏ءٌ فِي الْبَدَنِ أَنْفَعَ مِنْ إِمْسَاكِ الْيَدِ إِلَّا عَمَّا يُحْتَاجُ إِلَيْهِ.",
                    "englishText": "409. Muhammad Bin Yahya, from Muhammad Bin Al-Hassan, from Muawiya Biin Hukeym who said, ‘I heard Usman Ahowl saying, who has narrated the following: I heard from Abu Al-Hassan  saying: ‘There is none from the medicine but it agitates the illness, and there is nothing in the body more beneficial than restraining the hand except from what is needy for it’.",
                    "href": "https://thaqalayn.net/hadith/8/1/409/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 399)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "412": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Letter of Abu Muslim",
                    "arabicText": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي هَاشِمٍ عَنِ الْفَضْلِ الْكَاتِبِ قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ (عليه السلام) فَأَتَاهُ كِتَابُ أَبِي مُسْلِمٍ فَقَالَ لَيْسَ لِكِتَابِكَ جَوَابٌ اخْرُجْ عَنَّا فَجَعَلْنَا يُسَارُّ بَعْضُنَا بَعْضاً فَقَالَ أَيَّ شَيْ‏ءٍ تُسَارُّونَ يَا فَضْلُ إِنَّ اللَّهَ عَزَّ ذِكْرُهُ لَا يَعْجَلُ لِعَجَلَةِ الْعِبَادِ وَ لَإِزَالَةُ جَبَلٍ عَنْ مَوْضِعِهِ أَيْسَرُ مِنْ زَوَالِ مُلْكٍ لَمْ يَنْقَضِ أَجَلُهُ ثُمَّ قَالَ إِنَّ فُلَانَ بْنَ فُلَانٍ حَتَّى بَلَغَ السَّابِعَ مِنْ وُلْدِ فُلَانٍ قُلْتُ فَمَا الْعَلَامَةُ فِيمَا بَيْنَنَا وَ بَيْنَكَ جُعِلْتُ فِدَاكَ قَالَ لَا تَبْرَحِ الْأَرْضَ يَا فَضْلُ حَتَّى يَخْرُجَ السُّفْيَانِيُّ فَإِذَا خَرَجَ السُّفْيَانِيُّ فَأَجِيبُوا إِلَيْنَا يَقُولُهَا ثَلَاثاً وَ هُوَ مِنَ الْمَحْتُومِ.",
                    "englishText": "412. Muhammad Bin Yahya, from Muhammad Bin Al-Husayn, from Abdul Rahmaan Bin Abu Hashim, from Al-Fazl Al-Katib who said: I was in the presence of Abu Abdullah  when a letter of Abu Muslim came to him ’. So he  said: ‘There is no answer to your letter. Exit from us ’. So some of us left the others. He  said: ‘Which thing are you walking upon, O Fazl? Allah (azwj) does not Make Haste due to the hastiness of the servants. And removing a mountain from its place is easier than toppling a government whose term has not ended’. Then said: ‘So and so, son of so and so’ – until he  reached seven from the sons of so and so’. I said, ‘May I be sacrificed for you , so what are the signs with regards to what is in between us and you ?’ He  said: ‘The earth will not depart (end), O Fazl, until the Sufyani comes out. So if the Sufyani comes out, so answer to us  (to our  call)’. And he  said it thrice: ‘And it is inevitable’.",
                    "href": "https://thaqalayn.net/hadith/8/1/412/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 399)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "413": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: The case of Iblis",
                    "arabicText": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ عَلِيِّ بْنِ حَدِيدٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) عَنْ إِبْلِيسَ أَ كَانَ مِنَ الْمَلَائِكَةِ أَمْ كَانَ يَلِي شَيْئاً مِنْ أَمْرِ السَّمَاءِ فَقَالَ لَمْ يَكُنْ مِنَ الْمَلَائِكَةِ وَ لَمْ يَكُنْ يَلِي شَيْئاً مِنْ أَمْرِ السَّمَاءِ وَ لَا كَرَامَةَ فَأَتَيْتُ الطَّيَّارَ فَأَخْبَرْتُهُ بِمَا سَمِعْتُ فَأَنْكَرَهُ وَ قَالَ وَ كَيْفَ لَا يَكُونُ مِنَ الْمَلَائِكَةِ وَ اللَّهُ عَزَّ وَ جَلَّ يَقُولُ وَ إِذْ قُلْنا لِلْمَلائِكَةِ اسْجُدُوا لِآدَمَ فَسَجَدُوا إِلَّا إِبْلِيسَ فَدَخَلَ عَلَيْهِ الطَّيَّارُ فَسَأَلَهُ وَ أَنَا عِنْدَهُ فَقَالَ لَهُ جُعِلْتُ فِدَاكَ رَأَيْتَ قَوْلَهُ عَزَّ وَ جَلَّ يا أَيُّهَا الَّذِينَ آمَنُوا فِي غَيْرِ مَكَانٍ مِنْ مُخَاطَبَةِ الْمُؤْمِنِينَ أَ يَدْخُلُ فِي هَذَا الْمُنَافِقُونَ قَالَ نَعَمْ يَدْخُلُ فِي هَذَا الْمُنَافِقُونَ وَ الضُّلَّالُ وَ كُلُّ مَنْ أَقَرَّ بِالدَّعْوَةِ الظَّاهِرَةِ.",
                    "englishText": "413. Abu Ali Al-Ashary, from Muhammad Bin Abdul Jabbaar, from Ali Bin Hadeed, from Jameel Bin Darraaj who said: I asked Abu Abdullah  about Iblees (la), ‘Was he (la) from the Angels or was he (la) in charge of something from the matters of the sky?’ So he  said: ‘He (la) was not from the Angels, nor was he (la) in charge of anything from the matters of the sky, nor was he (la) honourable’. I came up to Al-Tayyaar, so I informed him of what I had heard, He denied it and said, ‘How can he (la) not be from the Angels and Allah (azwj) is Saying: “[2:34] And when We said to the angels: Make obeisance to Adam they did obeisance, but Iblis (did it not)”. Al-Tayyaar came up to him , so he asked him  and I was in his  presence, ‘May I be sacrificed for you , do you  see that the Statement of the Mighty and Majestic: “O you those who believe”, and in another place where the Believers are addressed, are the hypocrites included in this?’ The Imam  replied: ‘Yes, the hypocrites are included in this, and the strayed ones, and everyone who accepted the Call apparently’.",
                    "href": "https://thaqalayn.net/hadith/8/1/413/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 399)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "418": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Dealing with Abu Lahab",
                    "arabicText": "محمد بن يحيى، عن أحمد بن محمد بن عيسى، عن أبن أبي عمير، وعلي بن إبراهيم عن أبيه، عن ابن أبي عمير، عن الحسين بن أبي حمزة، عن أبي عبد الله (عليه السلام) قال: لما أرادت قريش قتل النبي (صلى الله عليه وآله) قالت: كيف لنا بأبي لهب؟ فقالت أم جميل: أنا أكفيكموه أنا أقول له: إني أحب أن تقعد اليوم في البيت نصطبح فلما أن كان من الغد وتهيأ المشركون للنبي (صلى الله عليه وآله) قعد أبو لهب وامرأته يشربان فدعا أبو طالب عليا (عليه السلام) فقال له: يا بني اذهب إلى عمك أبي لهب فاستفتح عليه فإن فتح لك فأدخل وإن لم يفتح لك فتحامل على الباب واكسره وادخل عليه فإذا دخلت عليه فقل له: يقول لك أبي: إن امرءا عمه عينه في القوم فليس بذليل، قال فذهب أمير المؤمنين (عليه السلام) فوجد الباب مغلقا فاستفتح فلم يفتح له فتحامل على الباب وكسره ودخل فلما رآه أبو لهب قال له: ما لك يا ابن أخي؟ فقال له: إن أبي يقول لك: إن امرءا عمه عينه في القوم ليس بذليل فقال له: صدق أبوك فما ذاك يا ابن أخي؟ فقال له: يقتل ابن أخيك وأنت تأكل وتشرب فوثب وأخذ سيفه فتعلقت به أم جميل فرفع يده ولطم وجهها لطمة ففقئ عينها، فماتت وهي عوراء وخرج أبو لهب ومعه السيف فلما رأته قريش عرفت الغضب في وجهه، فقالت:ما لك يا أبا لهب؟ فقال: أبايعكم على ابن أخي ثم تريدون قتله واللات والعزى لقد هممت أن أسلم، ثم تنظرون ما أصنع فاعتذورا إليه ورجع.",
                    "englishText": "418. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ibn abu ‘Umayr and Ali ibn Ibrahim has narrated from his father from Ibn Abi ‘Umayr from a;-Husayn ibn Abu Hamzah who has narrated the following: “Abu ‘Abd Allah AS has said that when Quraysh decided to murder the Holy Prophet SWWA they said, ‘How do we deal with Abu Lahab?’ ‘Umm Jamil said, ‘I will keep him occupied and ask him to remain with me until morning.’ When it was morning, the pagans prepared themselves against the Holy Prophet SWWA. Abu Lahab and his woman woke up and they were drinking. Abu Talib AS called Ali AS, and said, ‘Son, go to your uncle Abu Lahab and ask him to open the door; if he responds then go inside his home: but if he does not respond, then force the door to break it. Go inside and say to him, “My father says to you,’If a man’s uncle is his eye (master) among the people he is not humiliated.'’ He said that ‘Amir al-Mu’minin, Ali, AS, went and found the door locked. He then forced the door, broke it and went inside. When Abu Lahab saw him he asked, ‘What has happened to you, O son of my brother?’ He responded with what his father said,’If a man’s uncle is his master (eye) among the people he is not humiliated.’ He said,’Your father has spoken the truth. What is happening, O son of my brother?’ He replied, ‘The son of your brother is being killed but you are eating and drinking.’ He then jumped and took his sword but ‘Umm Jamil held him back. He raised his hand and slapped her face, which made her eye pop out. She later died blind. Abu Lahab went out with his sword. When Quraysh saw him, they found anger on his face. They asked, ‘What is the matter with you, O Abu Lahab?’ He said, “I pledged allegiance with you against the son of my brother and you want to kill him! I swear by al-Lat and al-’Uzza; I am thinking of becoming Muslim then you will see what I will do.’ They apologized and he returned,’”",
                    "href": "https://thaqalayn.net/hadith/8/1/418/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 400)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "442": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Stopping a person in his illness..",
                    "arabicText": "عَنْهُ عَنْ أَحْمَدَ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنِ الْحَلَبِيِّ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ لَا تَنْفَعُ الْحِمْيَةُ لِمَرِيضٍ بَعْدَ سَبْعَةِ أَيَّامٍ.",
                    "englishText": "442. From him, from Ahmad, from Ibn Mahboub, from Ibn Ra’ib, from Halby who said: I heard Abu Abdullah  saying: ‘Dieting is not beneficial to the sick after seven days’.",
                    "href": "https://thaqalayn.net/hadith/8/1/442/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 401)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "443": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Reducing such foods is benefical",
                    "arabicText": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مُوسَى بْنِ بَكْرٍ عَنْ أَبِي الْحَسَنِ مُوسَى (عليه السلام) قَالَ لَيْسَ الْحِمْيَةُ أَنْ تَدَعَ الشَّيْ‏ءَ أَصْلًا لَا تَأْكُلَهُ وَ لَكِنَّ الْحِمْيَةَ أَنْ تَأْكُلَ مِنَ الشَّيْ‏ءِ وَ تُخَفِّفَ.",
                    "englishText": "443. A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Ali Bin Al-Hakam, from Musa Bin Bakr, who has narrated the following: Abu Al-Hassan Musa  has said: ‘Dieting is not leaving something which you originally did not eat, but the dieting is to eat from the thing but at a reduced level’.",
                    "href": "https://thaqalayn.net/hadith/8/1/443/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 401)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "449": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Supporting myself...and wept",
                    "arabicText": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ أَبِي بَكْرٍ الْحَضْرَمِيِّ عَنْ عَبْدِ الْمَلِكِ بْنِ أَعْيَنَ قَالَ قُمْتُ مِنْ عِنْدِ أَبِي جَعْفَرٍ ( عليه السلام ) فَاعْتَمَدْتُ عَلَى يَدِي فَبَكَيْتُ فَقَالَ مَا لَكَ فَقُلْتُ كُنْتُ أَرْجُو أَنْ أُدْرِكَ هَذَا الْأَمْرَ وَ بِيَ قُوَّةٌ فَقَالَ أَ مَا تَرْضَوْنَ أَنَّ عَدُوَّكُمْ يَقْتُلُ بَعْضُهُمْ بَعْضاً وَ أَنْتُمْ آمِنُونَ فِي بُيُوتِكُمْ إِنَّهُ لَوْ قَدْ كَانَ ذَلِكَ أُعْطِيَ الرَّجُلُ مِنْكُمْ قُوَّةَ أَرْبَعِينَ رَجُلًا وَ جُعِلَتْ قُلُوبُكُمْ كَزُبَرِ الْحَدِيدِ لَوْ قُذِفَ بِهَا الْجِبَالَ لَقَلَعَتْهَا وَ كُنْتُمْ قِوَامَ الْأَرْضِ وَ خُزَّانَهَا.",
                    "englishText": "449. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al-Husayn Bin Saeed, from Fazaalat Bin Ayyub, from Sayf Bin Umeyr, from Abu Bakr Al-Hazramy, from Abdul Malik Bin Ayn who said: I got up in the presence of Abu Ja’far , supporting myself by my hands, so I wept’. He  said: ‘What is the matter with you?’ So I said, ‘I used to hope that I would see this Command (Al-Qaim ) whilst having strength’. So he  said: ‘But are you not happy that your enemies kill each other and you are safe in your houses?’ If that event were to take place, the man from among you would be given the strength of forty men and your hearts would become like blocks of iron. If thrown against the mountain, it would be uprooted. You are the strength of the earth and its treasures’.",
                    "href": "https://thaqalayn.net/hadith/8/1/449/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 401)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "451": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: How far is Qarqisah...",
                    "arabicText": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنْ عَلِيِّ بْنِ عُقْبَةَ عَنْ أَبِيهِ عَنْ مُيَسِّرٍ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ يَا مُيَسِّرُ كَمْ بَيْنَكُمْ وَ بَيْنَ قِرْقِيسَا قُلْتُ هِيَ قَرِيبٌ عَلَى شَاطِئِ الْفُرَاتِ فَقَالَ أَمَا إِنَّهُ سَيَكُونُ بِهَا وَقْعَةٌ لَمْ يَكُنْ مِثْلُهَا مُنْذُ خَلَقَ اللَّهُ تَبَارَكَ وَ تَعَالَى السَّمَاوَاتِ وَ الْأَرْضَ وَ لَا يَكُونُ مِثْلُهَا مَا دَامَتِ السَّمَاوَاتُ وَ الْأَرْضُ مَأْدُبَةٌ لِلطَّيْرِ تَشْبَعُ مِنْهَا سِبَاعُ الْأَرْضِ وَ طُيُورُ السَّمَاءِ يُهْلَكُ فِيهَا قَيْسٌ وَ لَا يَدَّعِي لَهَا دَاعِيَةٌ قَالَ وَ رَوَى غَيْرُ وَاحِدٍ وَ زَادَ فِيهِ وَ يُنَادِي مُنَادٍ هَلُمُّوا إِلَى لُحُومِ الْجَبَّارِينَ.",
                    "englishText": "451. Muhammad bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzaal, from Ali Bin Uqba, from his father, from Muyassar, who has narrated the following: Abu Ja’far  has said: ‘O Muyassar, how much distance is there in between you and Qarqaysa?’ I said, ‘It is near to the banks of the Euphrates’. So he  said: ‘But, there will transpire an event with it, the like of which has never happened since Allah (azwj) Created the Heavens and the earth, nor will the like of it happen so long as the Heavens and the earth remain. It will be a banquet for the birds. The lions of the earth and the birds of the skies would satisfy their hunger. Qays would be killed in it and there will be no helper called for him’. (The narrator) said, ‘And someone else has reported an addition to it: ‘And a caller will call out, ‘Come to the meat of the tyrants!’",
                    "href": "https://thaqalayn.net/hadith/8/1/451/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 401)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "452": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Any banner raised before...",
                    "arabicText": "عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ حَمَّادِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ الْمُخْتَارِ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ كُلُّ رَايَةٍ تُرْفَعُ قَبْلَ قِيَامِ الْقَائِمِ فَصَاحِبُهَا طَاغُوتٌ يُعْبَدُ مِنْ دُونِ اللَّهِ عَزَّ وَ جَلَّ.",
                    "englishText": "452. From him, from Ahmad Bin Muhammad, from Al-Husayn Bin Saeed, from Hammaad Bin Isa, from Al-Husayn Bin Al-Mukhtar, from Abu Baseer, who has narrated the following: Abu Abdullah  having said: ‘Every banner rose before the rising of Al-Qaim , so its owner is a tyrant who worships someone apart from Allah (azwj) Mighty and Majestic’.",
                    "href": "https://thaqalayn.net/hadith/8/1/452/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 402)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "454": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: When people did what they did",
                    "arabicText": "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ الْكِنْدِيِّ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنِ الْفُضَيْلِ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ إِنَّ النَّاسَ لَمَّا صَنَعُوا مَا صَنَعُوا إِذْ بَايَعُوا أَبَا بَكْرٍ لَمْ يَمْنَعْ أَمِيرَ الْمُؤْمِنِينَ (عليه السلام) مِنْ أَنْ يَدْعُوَ إِلَى نَفْسِهِ إِلَّا نَظَراً لِلنَّاسِ وَتَخَوُّفاً عَلَيْهِمْ أَنْ يَرْتَدُّوا عَنِ الْإِسْلَامِ فَيَعْبُدُوا الْأَوْثَانَ وَ لَا يَشْهَدُوا أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَنَّ مُحَمَّداً رَسُولُ اللَّهِ (صلى الله عليه وآله) وَ كَانَ الْأَحَبَّ إِلَيْهِ أَنْ يُقِرَّهُمْ عَلَى مَا صَنَعُوا مِنْ أَنْ يَرْتَدُّوا عَنْ جَمِيعِ الْإِسْلَامِ وَ إِنَّمَا هَلَكَ الَّذِينَ رَكِبُوا مَا رَكِبُوا فَأَمَّا مَنْ لَمْ يَصْنَعْ ذَلِكَ وَ دَخَلَ فِيمَا دَخَلَ فِيهِ النَّاسُ عَلَى غَيْرِ عِلْمٍ وَ لَا عَدَاوَةٍ لِأَمِيرِ الْمُؤْمِنِينَ (عليه السلام) فَإِنَّ ذَلِكَ لَا يُكْفِرُهُ وَ لَا يُخْرِجُهُ مِنَ الْإِسْلَامِ وَ لِذَلِكَ كَتَمَ عَلِيٌّ (عليه السلام) أَمْرَهُ وَ بَايَعَ مُكْرَهاً حَيْثُ لَمْ يَجِدْ أَعْوَاناً.",
                    "englishText": "454. Humeyd Bin Ziyad, from Al-Hassan Bin Muhammad Al-Kindy, from someone else, from Abaan Bin Usmaan, from Al-Fazel, from Zurara, who has narrated the following: Abu Ja’far  has said that: ‘The people, when they did what they did, they pledged their allegiances to Abu Bakr, nothing prevented Amir-ul- Momineen  calling the people to himself  except that he  looked around at the people and feared for them that they would renege from Al-Islam, and resort to worshipping the idols and not testify that there is no god except Allah (azwj) and that Muhamamd ﷺ is the Rasool Allah ﷺ, and it was more beloved to him  than he  should agree with them upon what they had done rather than them reneging against the whole of Al-Islam. But rather, destroyed is the one who does what they did. So, as for the one who did not do that, and entered into what the people had entered into without knowledge or enmity against Amir-ul- Momineen , so for that they have neither blasphemed nor exited from Al-Islam, and it is for that reason that Ali  concealed his  matter, and had to pledge allegiance unwillingly, when he  did not find any helpers’.",
                    "href": "https://thaqalayn.net/hadith/8/1/454/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 402)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "455": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: They turned to apostasy",
                    "arabicText": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ عَبْدِ الرَّحِيمِ الْقَصِيرِ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ (عليه السلام) إِنَّ النَّاسَ يَفْزَعُونَ إِذَا قُلْنَا إِنَّ النَّاسَ ارْتَدُّوا فَقَالَ يَا عَبْدَ الرَّحِيمِ إِنَّ النَّاسَ عَادُوا بَعْدَ مَا قُبِضَ رَسُولُ اللَّهِ (صلى الله عليه وآله) أَهْلَ جَاهِلِيَّةٍ إِنَّ الْأَنْصَارَ اعْتَزَلَتْ فَلَمْ تَعْتَزِلْ بِخَيْرٍ جَعَلُوا يُبَايِعُونَ سَعْداً وَ هُمْ يَرْتَجِزُونَ ارْتِجَازَ الْجَاهِلِيَّةِ يَا سَعْدُ أَنْتَ الْمُرَجَّى وَ شَعْرُكَ الْمُرَجَّلُ وَ فَحْلُكَ الْمُرَجَّمُ.",
                    "englishText": "455. Narrated to us Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al-Husayn Bin Saeed, from Ali Bin Al-No’man, from Abdullah Bin Muskaan, from Abdul Raheem Al-Qaseer who said: I said to Abu Ja’far  that the people are appalled when we say that the people turned apostate’. So he  said: ‘O Abdul Raheem, after the passing away of the Rasool Allah ﷺ, the people turned to the terms of ignorance. The Helpers were isolated and their isolation was not in goodness. They went and pledged their allegiances to Sa’d and were shouting slogans of the era of ignorance, ‘O Sa’d, you are the hope, and you are the vessel, and the solution!’",
                    "href": "https://thaqalayn.net/hadith/8/1/455/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 402)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "456": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Like those who followed Harun...",
                    "arabicText": "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ الْكِنْدِيِّ عَنْ غَيْرِ وَاحِدٍ مِنْ أَصْحَابِهِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ أَبِي جَعْفَرٍ الْأَحْوَلِ وَ الْفُضَيْلِ بْنِ يَسَارٍ عَنْ زَكَرِيَّا النَّقَّاضِ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ سَمِعْتُهُ يَقُولُ النَّاسُ صَارُوا بَعْدَ رَسُولِ اللَّهِ (صلى الله عليه وآله) بِمَنْزِلَةِ مَنِ اتَّبَعَ هَارُونَ (عليه السلام) وَ مَنِ اتَّبَعَ الْعِجْلَ وَ إِنَّ أَبَا بَكْرٍ دَعَا فَأَبَى عَلِيٌّ (عليه السلام) إِلَّا الْقُرْآنَ وَ إِنَّ عُمَرَ دَعَا فَأَبَى عَلِيٌّ (عليه السلام) إِلَّا الْقُرْآنَ وَ إِنَّ عُثْمَانَ دَعَا فَأَبَى عَلِيٌّ (عليه السلام) إِلَّا الْقُرْآنَ وَ إِنَّهُ لَيْسَ مِنْ أَحَدٍ يَدْعُو إِلَى أَنْ يَخْرُجَ الدَّجَّالُ إِلَّا سَيَجِدُ مَنْ يُبَايِعُهُ وَ مَنْ رَفَعَ رَايَةَ ضَلَالَةٍ فَصَاحِبُهَا طَاغُوتٌ.",
                    "englishText": "456. Humeyd Bin Ziyad, from Al-Hassan Bin Muhammad Al-Kindy, from someone else, from his companions, from Abaan Bin Usmaan, from Abu Ja’far Al-Ahowl, and Al-Fazeyl Bin Yasaar, from Zakariyya Al-Naqqaaz, who has narrated the following: I heard Abu Ja’far  saying: ‘After the Rasool Allah ﷺ, the people became of the status of the one who followed Haroun  and the one who followed the calf. And Abu Bakr called, so Ali  refused except for the Quran. And Umar called, so Ali  refused except for the Quran. And Usman called, so Ali  refused except for the Quran. And there is no one who will call, up to the coming out of Al-Dajjaal (la), except that he will find the one who pledges his allegiance to him. And the one who raises a banner of misguidance, so its owner is a tyrant’.",
                    "href": "https://thaqalayn.net/hadith/8/1/456/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 402)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "458": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Thumamah ibn 'Uthal, captured",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ (عليه السلام) أَنَّ ثُمَامَةَ بْنَ أُثَالٍ أَسَرَتْهُ خَيْلُ النَّبِيِّ (صلى الله عليه وآله) وَ قَدْ كَانَ رَسُولُ اللَّهِ (صلى الله عليه وآله) قَالَ اللَّهُمَّ أَمْكِنِّي مِنْ ثُمَامَةَ فَقَالَ لَهُ رَسُولُ اللَّهِ (صلى الله عليه وآله) إِنِّي مُخَيِّرُكَ وَاحِدَةً مِنْ ثَلَاثٍ أَقْتُلُكَ قَالَ إِذاً تَقْتُلَ عَظِيماً أَوْ أُفَادِيكَ قَالَ إِذاً تَجِدَنِي غَالِياً أَوْ أَمُنُّ عَلَيْكَ قَالَ إِذاً تَجِدَنِي شَاكِراً قَالَ فَإِنِّي قَدْ مَنَنْتُ عَلَيْكَ قَالَ فَإِنِّي أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَنَّكَ مُحَمَّدٌ رَسُولُ اللَّهِ وَ قَدْ وَ اللَّهِ عَلِمْتُ أَنَّكَ رَسُولُ اللَّهِ حَيْثُ رَأَيْتُكَ وَ مَا كُنْتُ لِأَشْهَدَ بِهَا وَ أَنَا فِي الْوَثَاقِ.",
                    "englishText": "458. Ali Bin Ibrahim, from his father, from Ahmad Bin Muhammad Bin Abu Nasr, from Abaan Bin Usmaan, from Zurara, who has narrated the following: Abu Ja’far  that: ‘Samama Bin Asaal was captured by the cavalry of the Prophet ﷺ and the Rasool Allah ﷺ had said; ‘Our Allah (azwj)! Make me ﷺ to overcome Samama!’ So the Rasool Allah ﷺ said to him: ‘I ﷺ give you one of three choices. I ﷺ could kill you’. He said, ‘Then you ﷺ would have killed a great person’. He ﷺ said: ‘I ﷺ could ransom you’. He said, ‘Then you ﷺ would find me to be expensive’. He ﷺ said: ‘Or I ﷺ give safety to you’. He said, ‘Then you would find me to be thankful’. He ﷺ said: ‘So I ﷺ give safety to you’. He said, ‘I hereby testify that there is no god except Allah (azwj), and you ﷺ Muhammad ﷺ are the Rasool Allah ﷺ, and by Allah (azwj), I knew you ﷺ were the Rasool Allah ﷺ when I saw you ﷺ, and I did not testify by it whilst I was in bondage’.",
                    "href": "https://thaqalayn.net/hadith/8/1/458/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 403)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "468": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: prepare fine supplies...",
                    "arabicText": "عَلِيٌّ عَنْ أَبِيهِ عَنْ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ كَانَ عَلِيُّ بْنُ الْحُسَيْنِ (عليه السلام) إِذَا سَافَرَ إِلَى الْحَجِّ وَ الْعُمْرَةِ تَزَوَّدَ مِنْ أَطْيَبِ الزَّادِ مِنَ اللَّوْزِ وَ السُّكَّرِ وَ السَّوِيقِ الْمُحَمَّصِ وَ الْمُحَلَّى.",
                    "englishText": "468. Ali, from his father, from Ibn Abi ‘Umayr, from Abdullah Bin Sinan, who has narrated the following: Abu Abdullah  having said: ‘Whenever Ali  Bin Al-Husayn  used to travel to the Pilgrimage and the Umra, would provide himself  with good provisions from the almonds, and the sugar, and the roasted and sweetened stem (beans)’.",
                    "href": "https://thaqalayn.net/hadith/8/1/468/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 403)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "481": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: \"they pleaded with Allah for Victory...\"",
                    "arabicText": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ زُرْعَةَ بْنِ مُحَمَّدٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ كانُوا مِنْ قَبْلُ يَسْتَفْتِحُونَ عَلَى الَّذِينَ كَفَرُوا فَقَالَ كَانَتِ الْيَهُودُ تَجِدُ فِي كُتُبِهَا أَنَّ مُهَاجَرَ مُحَمَّدٍ (صلى الله عليه وآله) مَا بَيْنَ عَيْرٍ وَ أُحُدٍ فَخَرَجُوا يَطْلُبُونَ الْمَوْضِعَ فَمَرُّوا بِجَبَلٍ يُسَمَّى حَدَاداً فَقَالُوا حَدَادٌ وَ أُحُدٌ سَوَاءٌ فَتَفَرَّقُوا عِنْدَهُ فَنَزَلَ بَعْضُهُمْ بِتَيْمَاءَ وَ بَعْضُهُمْ بِفَدَكَ وَ بَعْضُهُمْ بِخَيْبَرَ فَاشْتَاقَ الَّذِينَ بِتَيْمَاءَ إِلَى بَعْضِ إِخْوَانِهِمْ فَمَرَّ بِهِمْ أَعْرَابِيٌّ مِنْ قَيْسٍ فَتَكَارَوْا مِنْهُ وَ قَالَ لَهُمْ أَمُرُّ بِكُمْ مَا بَيْنَ عَيْرٍ وَ أُحُدٍ فَقَالُوا لَهُ إِذَا مَرَرْتَ بِهِمَا فَآذِنَّا بِهِمَا فَلَمَّا تَوَسَّطَ بِهِمْ أَرْضَ الْمَدِينَةِ قَالَ لَهُمْ ذَاكَ عَيْرٌ وَ هَذَا أُحُدٌ فَنَزَلُوا عَنْ ظَهْرِ إِبِلِهِ وَ قَالُوا قَدْ أَصَبْنَا بُغْيَتَنَا فَلَا حَاجَةَ لَنَا فِي إِبِلِكَ فَاذْهَبْ حَيْثُ شِئْتَ وَ كَتَبُوا إِلَى إِخْوَانِهِمُ الَّذِينَ بِفَدَكَ وَ خَيْبَرَ أَنَّا قَدْ أَصَبْنَا الْمَوْضِعَ فَهَلُمُّوا إِلَيْنَا فَكَتَبُوا إِلَيْهِمْ أَنَّا قَدِ اسْتَقَرَّتْ بِنَا الدَّارُ وَ اتَّخَذْنَا الْأَمْوَالَ وَ مَا أَقْرَبَنَا مِنْكُمْ فَإِذَا كَانَ ذَلِكَ فَمَا أَسْرَعَنَا إِلَيْكُمْ فَاتَّخَذُوا بِأَرْضِ الْمَدِينَةِ الْأَمْوَالَ فَلَمَّا كَثُرَتْ أَمْوَالُهُمْ بَلَغَ تُبَّعَ فَغَزَاهُمْ فَتَحَصَّنُوا مِنْهُ فَحَاصَرَهُمْ وَ كَانُوا يَرِقُّونَ لِضُعَفَاءِ أَصْحَابِ تُبَّعٍ فَيُلْقُونَ إِلَيْهِمْ بِاللَّيْلِ التَّمْرَ وَ الشَّعِيرَ فَبَلَغَ ذَلِكَ تُبَّعَ فَرَقَّ لَهُمْ وَ آمَنَهُمْ فَنَزَلُوا إِلَيْهِ فَقَالَ لَهُمْ إِنِّي قَدِ اسْتَطَبْتُ بِلَادَكُمْ وَ لَا أَرَانِي إِلَّا مُقِيماً فِيكُمْ فَقَالُوا لَهُ إِنَّهُ لَيْسَ ذَاكَ لَكَ إِنَّهَا مُهَاجَرُ نَبِيٍّ وَ لَيْسَ ذَلِكَ لِأَحَدٍ حَتَّى يَكُونَ ذَلِكَ فَقَالَ لَهُمْ إِنِّي مُخَلِّفٌ فِيكُمْ مِنْ أُسْرَتِي مَنْ إِذَا كَانَ ذَلِكَ سَاعَدَهُ وَ نَصَرَهُ فَخَلَّفَ حَيَّيْنِ الْأَوْسَ وَ الْخَزْرَجَ فَلَمَّا كَثُرُوا بِهَا كَانُوا يَتَنَاوَلُونَ أَمْوَالَ الْيَهُودِ وَ كَانَتِ الْيَهُودُ تَقُولُ لَهُمْ أَمَا لَوْ قَدْ بُعِثَ مُحَمَّدٌ لَيُخْرِجَنَّكُمْ مِنْ دِيَارِنَا وَ أَمْوَالِنَا فَلَمَّا بَعَثَ اللَّهُ عَزَّ وَ جَلَّ مُحَمَّداً (صلى الله عليه وآله) آمَنَتْ بِهِ الْأَنْصَارُ وَ كَفَرَتْ بِهِ الْيَهُودُ وَ هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ وَ كانُوا مِنْ قَبْلُ يَسْتَفْتِحُونَ عَلَى الَّذِينَ كَفَرُوا فَلَمَّا جاءَهُمْ ما عَرَفُوا كَفَرُوا بِهِ فَلَعْنَةُ اللَّهِ عَلَى الْكافِرِينَ.",
                    "englishText": "481. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al-Husayn Bin Saeed, from Al-Nazar Bin Suweyd, from Zur’at Bin Muhammad, from Abu Baseer, who has said: Abu Abdullah  regarding the Statement of Allah (azwj) Mighty and Majestic: “[2:89] and before that they used to pray for victory against those who disbelieve”. He  said: ‘The Jews had found in their Book that Muhammad ﷺ would emigrate between Ayr and Ohad, so they went out look for these places. They passed by a mountain called Hadaad, so they said, ‘Hadaad and Ohad are one and the same’. So they dispersed upon that. Some of them encamped at Tayma and some of them at Fadak, and some of them at Khyber’. The ones who were at Tayma longed to be with some of their brothers. A Bedouin from Qays, passed by them so they hired (a camel) from him and he said to them, ‘I shall pass with you in between Ayr and Ohad’. They said to him, ‘When you pass by these two, point these two places out to us. So when he was in the middle of the land of Al-Medina, he said to them, ‘That is Ayr and this is Ohad’. So they descended from the backs of his camels and said, ‘We have reached where we wanted to be, therefore we do not have any need for your camels, and so you can go to wherever you like’. And they wrote to their brothers who were at Fadak and Khyber, ‘We have got to the place so come to us’. They wrote back to them, ‘We have settled in the houses and acquired assets, and there is no one closer to us than you are. So when that event transpires, we would quickly come to you’. They acquired assets in the land of Al-Medina. When their wealth increased, it (news) reached Tubba and he attacked them. They fortified themselves from him, so he surrounded them. They felt sympathetic towards the weak ones of Tubba and they would throw the dates and the barley towards them at night. So (the news of) that reached Tubba, and he sympathised with them and granted them amnesty. They came down to him. He said to them, ‘I have come to like your city and would like to reside among you’. So they said to him, ‘It is not for you to dwell in that place, for a Prophet ﷺ would be emigrating and that is not for anyone until that happens’. He said to them, ‘I will leave behind among you members of my family, so when that happens, they would support him ﷺ and help him ﷺ’. So he left behind two tribes, Al-Aws and Al-Khazraj. So when they multiplied, they used to take the wealth of the Jews and the Jews used to say to them, ‘But, when Muhammad ﷺ is Sent, he ﷺ would take you all out from our houses and our wealth’. So when Allah (azwj) Mighty and Majestic Sent Muhammad ﷺ, the Helpers believed in him ﷺ, but the Jews denied him ﷺ, and it is the Statement of Allah (azwj) Mighty and Majestic: “[2:89] and before that they used to pray for victory against those who disbelieve, but when there came to them (Prophet) that which they did not recognize, they disbelieved in him; so Allah’s curse is on the unbelievers.”",
                    "href": "https://thaqalayn.net/hadith/8/1/481/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 403)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "483": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Five signs of the rise of al-Qa'im",
                    "arabicText": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبِي أَيُّوبَ الْخَزَّازِ عَنْ عُمَرَ بْنِ حَنْظَلَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ خَمْسُ عَلَامَاتٍ قَبْلَ قِيَامِ الْقَائِمِ الصَّيْحَةُ وَ السُّفْيَانِيُّ وَ الْخَسْفُ وَ قَتْلُ النَّفْسِ الزَّكِيَّةِ وَ الْيَمَانِيُّ فَقُلْتُ جُعِلْتُ فِدَاكَ إِنْ خَرَجَ أَحَدٌ مِنْ أَهْلِ بَيْتِكَ قَبْلَ هَذِهِ الْعَلَامَاتِ أَ نَخْرُجُ مَعَهُ قَالَ لَا فَلَمَّا كَانَ مِنَ الْغَدِ تَلَوْتُ هَذِهِ الْآيَةَ إِنْ نَشَأْ نُنَزِّلْ عَلَيْهِمْ مِنَ السَّماءِ آيَةً فَظَلَّتْ أَعْناقُهُمْ لَها خاضِعِينَ فَقُلْتُ لَهُ أَ هِيَ الصَّيْحَةُ فَقَالَ أَمَا لَوْ كَانَتْ خَضَعَتْ أَعْنَاقُ أَعْدَاءِ اللَّهِ عَزَّ وَ جَلَّ.",
                    "englishText": "483. Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al-Hakam, from Abu Ayyub Al-Khazaz, from Umar Bin Hanzala who said: I heard Abu Abdullah  saying: ‘There are five signs before the rising of Al-Qaim  – The scream, and the Sufyani, and the sinking (of the earth), and the killing of the pure soul (Al-Nafs Al-Zakkiyya) and Al-Yamany’. So I said, ‘May I be sacrificed for you , if someone from your  Household comes out (in revolt) before these signs, shall we come out (revolt) with him?’ He  said: ‘No’. So when it was the next morning, I recited this Verse: “[26:4] If We please, We should send down upon them a sign from the heaven so that their necks should stoop to it”. I said, ‘Is this the scream?’ He  said: ‘If that was, then the necks of the enemies of Allah (azwj) Mighty and Majestic would stoop down in humility’.",
                    "href": "https://thaqalayn.net/hadith/8/1/483/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 404)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "490": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: How does it happen?",
                    "arabicText": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ إِسْمَاعِيلَ بْنِ مِهْرَانَ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ بَشِيرٍ النَّبَّالِ عَنْ حُمْرَانَ بْنِ أَعْيَنَ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ (عليه السلام) يَقُولُ النَّاسُ تُطْوَى لَنَا الْأَرْضُ بِاللَّيْلِ كَيْفَ تُطْوَى قَالَ هَكَذَا ثُمَّ عَطَفَ ثَوْبَهُ.",
                    "englishText": "490. A number of our companions, Ahmad Bin Muhammad Bin Khalid, from Ismail Bin Mahraan, from Sayf Bin Umeyra, from Basheer Al-Nabaal, from Humraan Bin Ayn who said: I said to Abu Ja’far , ‘The people are saying the earth would fold up for us at night, how it would fold up?’ He  said: ‘Like this’, then folded his  cloth’.",
                    "href": "https://thaqalayn.net/hadith/8/1/490/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 405)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "491": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: The Earth wraps around...",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ الْأَرْضُ تُطْوَى فِي آخِرِ اللَّيْلِ.",
                    "englishText": "491. Ali Bin Ibrahim, from his father, from Ibn Abi ‘Umayr, from Hammaad Bin Usman, who has narrated the following: Abu Abdullah  has said: ‘The earth folds up during the end of the night’.",
                    "href": "https://thaqalayn.net/hadith/8/1/491/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 405)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "497": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: People of the noble manners...",
                    "arabicText": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ رِبْعِيٍّ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ وَ اللَّهِ لَا يُحِبُّنَا مِنَ الْعَرَبِ وَ الْعَجَمِ إِلَّا أَهْلُ الْبُيُوتَاتِ وَ الشَّرَفِ وَ الْمَعْدِنِ وَ لَا يُبْغِضُنَا مِنْ هَؤُلَاءِ وَ هَؤُلَاءِ إِلَّا كُلُّ دَنَسٍ مُلْصَقٍ.",
                    "englishText": "497. Ali Bin Ibrahiim, from his father, from Hammaad Bin Isa, from Rabi’e, who has narrated the following: Abu Abdullah  has said; ‘By Allah (azwj)! No one from the Arabs or the non-Arabs loves us  except the people of noble houses, and the (noble) origins; and no one from these ones and those ones hates us  except for all the filthy ones and of illegitimate origin’.",
                    "href": "https://thaqalayn.net/hadith/8/1/497/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 405)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "498": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: News of the ark of Israelites",
                    "arabicText": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ وَ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى الْحَلَبِيِّ عَنْ هَارُونَ بْنِ خَارِجَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي جَعْفَرٍ (عليه السلام) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ إِنَّ اللَّهَ قَدْ بَعَثَ لَكُمْ طالُوتَ مَلِكاً قالُوا أَنَّى يَكُونُ لَهُ الْمُلْكُ عَلَيْنا وَ نَحْنُ أَحَقُّ بِالْمُلْكِ مِنْهُ قَالَ لَمْ يَكُنْ مِنْ سِبْطِ النُّبُوَّةِ وَ لَا مِنْ سِبْطِ الْمَمْلَكَةِ قالَ إِنَّ اللَّهَ اصْطَفاهُ عَلَيْكُمْ وَ قَالَ إِنَّ آيَةَ مُلْكِهِ أَنْ يَأْتِيَكُمُ التَّابُوتُ فِيهِ سَكِينَةٌ مِنْ رَبِّكُمْ وَ بَقِيَّةٌ مِمَّا تَرَكَ آلُ مُوسى وَ آلُ هارُونَ فَجَاءَتْ بِهِ الْمَلَائِكَةُ تَحْمِلُهُ وَ قَالَ اللَّهُ جَلَّ ذِكْرُهُ إِنَّ اللَّهَ مُبْتَلِيكُمْ بِنَهَرٍ فَمَنْ شَرِبَ مِنْهُ فَلَيْسَ مِنِّي وَ مَنْ لَمْ يَطْعَمْهُ فَإِنَّهُ مِنِّي فَشَرِبُوا مِنْهُ إِلَّا ثَلَاثَمِائَةٍ وَ ثَلَاثَةَ عَشَرَ رَجُلًا مِنْهُمْ مَنِ اغْتَرَفَ وَ مِنْهُمْ مَنْ لَمْ يَشْرَبْ فَلَمَّا بَرَزُوا قَالَ الَّذِينَ اغْتَرَفُوا لا طاقَةَ لَنَا الْيَوْمَ بِجالُوتَ وَ جُنُودِهِ وَ قَالَ الَّذِينَ لَمْ يَغْتَرِفُوا كَمْ مِنْ فِئَةٍ قَلِيلَةٍ غَلَبَتْ فِئَةً كَثِيرَةً بِإِذْنِ اللَّهِ وَ اللَّهُ مَعَ الصَّابِرِينَ.",
                    "englishText": "498. Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Khalid, and Al-Husayn Bin Sa’d, from Al-Nazar Bin Suweyd, from Yahya Al-Halby, from Haroun Bin Kharjat, from Abu Baseer, who has narrated the following: Abu Ja’far  regarding the Statement of Allah (azwj) Mighty and Majestic: “[2:247] And their prophet said to them: Surely Allah has raised Talut to be a king over you. He  said: ‘He  was neither from the grandsons of the Prophets  nor was he  from the grandsons of the kings’. He said: Surely Allah has chosen him in preference to you”. And Said: “[2:248] And the prophet said to them: Surely the sign of His kingdom is, that there shall come to you the chest in which there is tranquillity from your Lord and residue of the relics of what the children of Musa and the children of Haroun have left, the angels bearing it”. And Allah (azwj) Said: “[2:249] Surely Allah will try you with a river; whoever then drinks from it, he is not of me, and whoever does not taste of it, he is surely of me, So they drank from it except for three hundred and thirteen men. From them were those who drank, and those who did not drink. So when it was time for duel, the ones who had drunk they said: We have today no power against Jalut and his forces. And those who did not drink said: How often has a small party vanquished a numerous host by Allah’s permission, and Allah is with the patient”.",
                    "href": "https://thaqalayn.net/hadith/8/1/498/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 405)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "510": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Houses of the Holy Prophet SWWA",
                    "arabicText": "أَبَانٌ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ فِي بُيُوتٍ أَذِنَ اللَّهُ أَنْ تُرْفَعَ قَالَ هِيَ بُيُوتُ النَّبِيِّ (صلى الله عليه وآله).",
                    "englishText": "510. Aban, from Abu Baseer who said: I asked Abu Abdullah  about the Statement of Allah (azwj): “[24:36] In houses which Allah has permitted to be exalted”, he  said: ‘Houses of the Prophets ’.",
                    "href": "https://thaqalayn.net/hadith/8/1/510/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 406)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "511": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: The coat of arms of the Messenger of Allah SWWA",
                    "arabicText": "أَبَانٌ عَنْ يَحْيَى بْنِ أَبِي الْعَلَاءِ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ دِرْعُ رَسُولِ اللَّهِ (صلى الله عليه وآله) ذَاتُ الْفُضُولِ لَهَا حَلْقَتَانِ مِنْ وَرِقٍ فِي مُقَدَّمِهَا وَ حَلْقَتَانِ مِنْ وَرِقٍ فِي مُؤَخَّرِهَا وَ قَالَ لَبِسَهَا عَلِيٌّ (عليه السلام) يَوْمَ الْجَمَلِ.",
                    "englishText": "511. Aban, from Yahya Bin Abu Al-A’la who said: I heard Abu Abdullah  saying: ‘The armour of the Rasool Allah ﷺ, Zat Al-Fuzoul had two rings of foil in front of it, and two rings of foil at the back of it’. And said; ‘Ali  wore it on the Day of Al-Jamal’.",
                    "href": "https://thaqalayn.net/hadith/8/1/511/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 406)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "513": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: When al-Miqdad was about to leave the world....",
                    "arabicText": "أَبَانٌ عَنِ الْفُضَيْلِ بْنِ يَسَارٍ عَنْ أَبِي جَعْفَرٍ (عليه السلام) قَالَ إِنَّ عُثْمَانَ قَالَ لِلْمِقْدَادِ أَمَا وَ اللَّهِ لَتَنْتَهِيَنَّ أَوْ لَأَرُدَّنَّكَ إِلَى رَبِّكَ الْأَوَّلِ قَالَ فَلَمَّا حَضَرَتِ الْمِقْدَادَ الْوَفَاةُ قَالَ لِعَمَّارٍ أَبْلِغْ عُثْمَانَ عَنِّي أَنِّي قَدْ رُدِدْتُ إِلَى رَبِّيَ الْأَوَّلِ.",
                    "englishText": "513. Aban, from Al-Fazeyl Bin Yasaar, who has said: Abu Ja’far  has said: ‘Usman said to Al-Miqdad (ar), ‘By Allah (azwj), stop insulting me or I will return you (ar) to your (ar) First Lord (azwj)’. He  said: ‘So when the death presented itself to Al-Miqdad (ar), he (ar) said to Ammar, ‘Make it reach to Usman from me (ar) that I (ar) have returned to my (ar) First Lord (azwj)’.",
                    "href": "https://thaqalayn.net/hadith/8/1/513/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 406)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "514": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: 'Usamah was about to die",
                    "arabicText": "أَبَانٌ عَنْ فُضَيْلٍ وَ عُبَيْدٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ لَمَّا حَضَرَ مُحَمَّدَ بْنَ أُسَامَةَ الْمَوْتُ دَخَلَتْ عَلَيْهِ بَنُو هَاشِمٍ فَقَالَ لَهُمْ قَدْ عَرَفْتُمْ قَرَابَتِي وَ مَنْزِلَتِي مِنْكُمْ وَ عَلَيَّ دَيْنٌ فَأُحِبُّ أَنْ تَضْمَنُوهُ عَنِّي فَقَالَ عَلِيُّ بْنُ الْحُسَيْنِ (عليه السلام) أَمَا وَ اللَّهِ ثُلُثُ دَيْنِكَ عَلَيَّ ثُمَّ سَكَتَ وَ سَكَتُوا فَقَالَ عَلِيُّ بْنُ الْحُسَيْنِ (عليه السلام) عَلَيَّ دَيْنُكَ كُلُّهُ ثُمَّ قَالَ عَلِيُّ بْنُ الْحُسَيْنِ (عليه السلام) أَمَا إِنَّهُ لَمْ يَمْنَعْنِي أَنْ أَضْمَنَهُ أَوَّلًا إِلَّا كَرَاهِيَةَ أَنْ يَقُولُوا سَبَقَنَا.",
                    "englishText": "514. Aban, from Fazeyl and Ubeyd, who has said: Abu Abdullah  has said: ‘When the death presented itself to Muhammad Bin Usama, the Clan of Hashim  came up to him. So he said to them, ‘You have recognised my being near in relations to you, and my status among you, and I have a debt upon me so I would love it if you could take the responsibility of it from me’. So Ali  Bin Al-Husayn  said: ‘By Allah (azwj), a third of your debt is upon me ’, then he  was quiet and they remained quiet. So Ali  Bin Al-Husayn  said: ‘Upon me  is all of your debt’. Then Ali  Bin Al-Husayn  said: ‘But what prevented me  from assuming the responsibility of all of his debts at first was the abhorrence that they would say, ‘He  preceded us for it’.",
                    "href": "https://thaqalayn.net/hadith/8/1/514/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 406)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "515": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: He left its rein",
                    "arabicText": "أَبَانٌ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ كَانَتْ نَاقَةُ رَسُولِ اللَّهِ (صلى الله عليه وآله) الْقَصْوَاءُ إِذَا نَزَلَ عَنْهَا عَلَّقَ عَلَيْهَا زِمَامَهَا قَالَ فَتَخْرُجُ فَتَأْتِي الْمُسْلِمِينَ قَالَ فَيُنَاوِلُهَا الرَّجُلُ الشَّيْ‏ءَ وَ يُنَاوِلُهُ هَذَا الشَّيْ‏ءَ فَلَا تَلْبَثُ أَنْ تَشْبَعَ قَالَ فَأَدْخَلَتْ رَأْسَهَا فِي خِبَاءِ سَمُرَةَ بْنِ جُنْدَبٍ فَتَنَاوَلَ عَنَزَةً فَضَرَبَ بِهَا عَلَى رَأْسِهَا فَشَجَّهَا فَخَرَجَتْ إِلَى النَّبِيِّ (صلى الله عليه وآله) فَشَكَتْهُ.",
                    "englishText": "515. Aban, from Abu Baseer, who has narrated the following: Abu Abdullah  having said: ‘Whenever the Rasool Allah ﷺ descended from his ﷺ she-camel Al-Qaswa, he ﷺ would leave its reins upon it. It would go out and come to the Muslims. So this man would give it something, and that man would give it something. So it would not remain without (its hunger) is being satisfied. It entered its head in a tent of Samarat Bin Jundab, so he took hold of a stick and struck it upon its head. So he scratched it. So it went out to the Prophet ﷺ and complained to him ﷺ’.",
                    "href": "https://thaqalayn.net/hadith/8/1/515/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 406)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "517": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: They have spoken a lie",
                    "arabicText": "أَبَانٌ عَنْ عُمَرَ بْنِ يَزِيدَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ (عليه السلام) إِنَّ الْمُغِيرِيَّةَ يَزْعُمُونَ أَنَّ هَذَا الْيَوْمَ لِهَذِهِ اللَّيْلَةِ الْمُسْتَقْبَلَةِ فَقَالَ كَذَبُوا هَذَا الْيَوْمُ لِلَّيْلَةِ الْمَاضِيَةِ إِنَّ أَهْلَ بَطْنِ نَخْلَةَ حَيْثُ رَأَوُا الْهِلَالَ قَالُوا قَدْ دَخَلَ الشَّهْرُ الْحَرَامُ.",
                    "englishText": "517. Aban, from Umar Bin Yazeed who said: I said to Abu Abdullah  that: ‘Al-Mugheira (and his people) are alleging that this day is for the night that approaches it’. So he  said: ‘They lie! This day today is for the night that has passed. The people of Al-Nakhla, when they see the crescent say, ‘The Sacred Month has entered’.",
                    "href": "https://thaqalayn.net/hadith/8/1/517/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 407)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "520": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: We decided to meet in the house of Tahir",
                    "arabicText": "عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ دَاوُدَ بْنِ سُلَيْمَانَ الْحَمَّارِ عَنْ سَعِيدِ بْنِ يَسَارٍ قَالَ اسْتَأْذَنَّا عَلَى أَبِي عَبْدِ اللَّهِ (عليه السلام) أَنَا وَ الْحَارِثُ بْنُ الْمُغِيرَةِ النَّصْرِيُّ وَ مَنْصُورٌ الصَّيْقَلُ فَوَاعَدْنَا دَارَ طَاهِرٍ مَوْلَاهُ فَصَلَّيْنَا الْعَصْرَ ثُمَّ رُحْنَا إِلَيْهِ فَوَجَدْنَاهُ مُتَّكِئاً عَلَى سَرِيرٍ قَرِيبٍ مِنَ الْأَرْضِ فَجَلَسْنَا حَوْلَهُ ثُمَّ اسْتَوَى جَالِساً ثُمَّ أَرْسَلَ رِجْلَيْهِ حَتَّى وَضَعَ قَدَمَيْهِ عَلَى الْأَرْضِ ثُمَّ قَالَ الْحَمْدُ لِلَّهِ الَّذِي ذَهَبَ النَّاسُ يَمِيناً وَ شِمَالًا فِرْقَةٌ مُرْجِئَةٌ وَ فِرْقَةٌ خَوَارِجُ وَ فِرْقَةٌ قَدَرِيَّةٌ وَ سُمِّيتُمْ أَنْتُمُ التُّرَابِيَّةَ ثُمَّ قَالَ بِيَمِينٍ مِنْهُ أَمَا وَ اللَّهِ مَا هُوَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَ رَسُولُهُ وَ آلُ رَسُولِهِ (صلى الله عليه وآله) وَ شِيعَتُهُمْ كَرَّمَ اللَّهُ وُجُوهَهُمْ وَ مَا كَانَ سِوَى ذَلِكَ فَلَا كَانَ عَلِيٌّ وَ اللَّهِ أَوْلَى النَّاسِ بِالنَّاسِ بَعْدَ رَسُولِ اللَّهِ (صلى الله عليه وآله) يَقُولُهَا ثَلَاثاً.",
                    "englishText": "520. From him, from Ahmad Bin Muhammad, from Al-Hassan Bin Ali, from Dawood Bin Suleyman Al-Hammaar, from Saeed Bin Yasaar who said: We sought permission to see Abu Abdullah , I, and Al-Haris Bin Al-Mugheira Al-Nasry, and Mansour Al-Sayaqal. So we agreed to meet at the house of Tahir, his  slave. So we Prayed Al-Asr, then we went to him . We found him  leaning against a bed near to the ground. So we seated ourselves around him . Then he  sat upright and stretched his  legs until he  placed his  feet upon the ground, then said: ‘The Praise is due to Allah (azwj) Who Made the people to go to the right and left as a Murjiite sect, and a Khwarijite sect, and a Qadiriyya sect, and you have been named as the Turabiyya’. Then said to the one seated on his  right: ‘And Allah (azwj), there is no god except for Him (azwj), One with no associates to Him (azwj), and His (azwj) Messenger ﷺ, and the Progeny  of His (azwj) Messenger ﷺ and their  Shites, may Allah (azwj) honour their faces, and he who was not upon that was not upon anything. By Allah (azwj), Ali  was higher to the people than their own selves after the Rasool Allah ﷺ’. He  said it thrice’.",
                    "href": "https://thaqalayn.net/hadith/8/1/520/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 407)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "563": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Fatimah AS came to one of the pillars",
                    "arabicText": "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ الْكِنْدِيِّ عَنْ أَحْمَدَ بْنِ الْحَسَنِ الْمِيثَمِيِّ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ مُحَمَّدِ بْنِ الْمُفَضَّلِ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ جَاءَتْ فَاطِمَةُ (عليها السلام) إِلَى سَارِيَةٍ فِي الْمَسْجِدِ وَ هِيَ تَقُولُ وَ تُخَاطِبُ النَّبِيَّ (صلى الله عليه وآله) قَدْ كَانَ بَعْدَكَ أَنْبَاءٌ وَ هَنْبَثَةٌ لَوْ كُنْتَ شَاهِدَهَا لَمْ يَكْثُرِ الْخَطْبُ إِنَّا فَقَدْنَاكَ فَقْدَ الْأَرْضِ وَابِلَهَا وَ اخْتَلَّ قَوْمُكَ فَاشْهَدْهُمْ وَ لَا تَغِبُ.",
                    "englishText": "564. Humeyd Bin Ziyad, from Al-Hassan Bin Muhammad Al-Kindy, from Ahmad Bin Al-Hassan Al-Maysami, from Aban Bin Usman, from Muhammad Bin Al-Mufazzal who said: ‘I heard Abu Abdullah  saying: ‘Fatima  went to a pillar in the Masjid, and she  was addressing the Holy Prophet ﷺ: ‘Events have occurred after you ﷺ, and differences. Had you  witnessed them, they would not have increased so much. We  have missed you  like the missing of the earth of its downpour of rain. And your ﷺ people are in disturbance, so witness them and do not be absent’.",
                    "href": "https://thaqalayn.net/hadith/8/1/563/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 407)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "564": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Ja'far AS was killed",
                    "arabicText": "أَبَانٌ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ (عليه السلام) قَالَ بَيْنَا رَسُولُ اللَّهِ (صلى الله عليه وآله) فِي الْمَسْجِدِ إِذْ خُفِضَ لَهُ كُلُّ رَفِيعٍ وَ رُفِعَ لَهُ كُلُّ خَفِيضٍ حَتَّى نَظَرَ إِلَى جَعْفَرٍ (عليه السلام) يُقَاتِلُ الْكُفَّارَ قَالَ فَقُتِلَ فَقَالَ رَسُولُ اللَّهِ (صلى الله عليه وآله) قُتِلَ جَعْفَرٌ وَ أَخَذَهُ الْمَغْصُ فِي بَطْنِهِ.",
                    "englishText": "565. Aban, from Abu Baseer, who said the following: Abu Abdullah  has said: ‘Once the Rasool Allah ﷺ was in the Masjid, when every high thing was lowered for him ﷺ and every low thing was raised for him ﷺ, to the extent that he ﷺ saw Ja’far  fighting the infidels. He  got killed. So the Messenger ﷺ said: ‘Ja’far has been killed’, and a severe pain struck him  in his ﷺ stomach’.",
                    "href": "https://thaqalayn.net/hadith/8/1/564/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 408)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    },
    {
        "1": {
            "565": {
                "Hadith #1": {
                    "title": "Al-Kafi - Volume 8: Day of Hunayn",
                    "arabicText": "حُمَيْدُ بْنُ زِيَادٍ عَنْ عُبَيْدِ اللَّهِ بْنِ أَحْمَدَ الدِّهْقَانِ عَنْ عَلِيِّ بْنِ الْحَسَنِ الطَّاطَرِيِّ عَنْ مُحَمَّدِ بْنِ زِيَادٍ بَيَّاعِ السَّابِرِيِّ عَنْ عَجْلَانَ أَبِي صَالِحٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ (عليه السلام) يَقُولُ قَتَلَ عَلِيُّ بْنُ أَبِي طَالِبٍ (عليه السلام) بِيَدِهِ يَوْمَ حُنَيْنٍ أَرْبَعِينَ.",
                    "englishText": "566. Humeyd Bin Ziyad, from Ubeydullah Bin Ahmad Al-Dahqaan, from Ali Bin Al-Hassan Al-Tatary, from Muhammad Bin Ziyad Al-Sabiry, from Ajlaan Abu Salih who said: ‘I heard Abu Abdullah  saying: ‘Ali  Bin Abu Talib  killed forty by his  hands on the Day of Hunain’.",
                    "href": "https://thaqalayn.net/hadith/8/1/565/1",
                    "grading": {
                        "gradeEnglish": "Sahih",
                        "gradeArabic": "صحيح",
                        "book": "Sahih al-Kafi (3 / 408)",
                        "author": "Shaykh Baqir al-Behbudi"
                    }
                }
            }
        }
    }
]