{
  "1": {
    "2": {
      "1": {
        "Al-Kafi - Volume 1: Chapter on the necessity to seek knowledge and the recommendations to learn": [
          {
            "number": "Hadith #6",
            "url": "https://thaqalayn.net/hadith/1/2/1/6",
            "arabicText": "6ـ عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَبْدِ الله عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) يَقُولُ تَفَقَّهُوا فِي الدِّينِ فَإِنَّهُ مَنْ لَمْ يَتَفَقَّهْ مِنْكُمْ فِي الدِّينِ فَهُوَ أَعْرَابِيٌّ إِنَّ الله يَقُولُ فِي كِتَابِهِ لِيَتَفَقَّهُوا فِي الدِّينِ وَلِيُنْذِرُوا قَوْمَهُمْ إِذا رَجَعُوا إِلَيْهِمْ لَعَلَّهُمْ يَحْذَرُونَ.",
            "englishTranslation": "6. Ali ibn Muhammad ibn ‘Abdallah has narrated from Ahmad ibn Muhammad ibn Khalid from ‘Uthman ibn ‘Isa from Ali ibn abu Hamza who has said the following. “I heard Imam abu ‘Abdallah saying, ‘Acquire good understand in religion because those of you who do not have good understand in religion are like the Bedouins. Allah has said in His book, ‘ Why do not some people from each group of believers seek to become specialists in religious learning and, after completing their studies, guide their group so that they will have fear of God. (9:122)’”",
            "gradings": [
              {
                "grade": "ضعيف على المشهور",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (100/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #7",
            "url": "https://thaqalayn.net/hadith/1/2/1/7",
            "arabicText": "7ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنِ الْقَاسِمِ بْنِ الرَّبِيعِ عَنْ مُفَضَّلِ بْنِ عُمَرَ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) يَقُولُ عَلَيْكُمْ بِالتَّفَقُّهِ فِي دِينِ الله وَلا تَكُونُوا أَعْرَاباً فَإِنَّهُ مَنْ لَمْ يَتَفَقَّهْ فِي دِينِ الله لَمْ يَنْظُرِ الله إِلَيْهِ يَوْمَ الْقِيَامَةِ وَلَمْ يُزَكِّ لَهُ عَمَلاً.",
            "englishTranslation": "7. Al-Hassan ibn Muhammad has narrated from Ja‘far ibn Muhammad from al-Qasim ibn al-Rabi‘ from Mufaddal ibn ‘Umar who has said the following. “I heard abu ‘Abdallah  say, ‘It is necessary for you to have good understanding of religion of Allah. Do not be like Bedouins because those who do not gain good understanding of religion, Allah will not look to then on the Day of Judgement and none of his deeds will be cleansed.’”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/101)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #9",
            "url": "https://thaqalayn.net/hadith/1/2/1/9",
            "arabicText": "9ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَمَّنْ رَوَاهُ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ قَالَ لَهُ رَجُلٌ جُعِلْتُ فِدَاكَ رَجُلٌ عَرَفَ هَذَا الامْرَ لَزِمَ بَيْتَهُ وَلَمْ يَتَعَرَّفْ إِلَى أَحَدٍ مِنْ إِخْوَانِهِ قَالَ فَقَالَ كَيْفَ يَتَفَقَّهُ هَذَا فِي دِينِهِ.",
            "englishTranslation": "9. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Muhammad ibn ‘Isa from one who narrated to him from abu ‘Abdallah  the following. “A man said asked, ‘May Allah take my soul in your service, a man believes in this fact, (Leadership of Ahlul Bayt with Divine Authority) but keeps himself at home and does not acquaint himself with his brethren.” Abu ‘Abdallah  said, “How he achieves good understanding of his religion?”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (102/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "2": {
        "Al-Kafi - Volume 1: Chapter on the quality of knowledge its virtue and the virtue of the scholars": [
          {
            "number": "Hadith #1",
            "url": "https://thaqalayn.net/hadith/1/2/2/1",
            "arabicText": "1ـ مُحَمَّدُ بْنُ الْحَسَنِ وَعَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ عُبَيْدِ الله بْنِ عَبْدِ الله الدِّهْقَانِ عَنْ دُرُسْتَ الْوَاسِطِيِّ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ عَنْ أَبِي الْحَسَنِ مُوسَى (عَلَيْهِ السَّلام) قَالَ دَخَلَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) الْمَسْجِدَ فَإِذَا جَمَاعَةٌ قَدْ أَطَافُوا بِرَجُلٍ فَقَالَ مَا هَذَا فَقِيلَ عَلامَةٌ فَقَالَ وَمَا الْعَلامَةُ فَقَالُوا لَهُ أَعْلَمُ النَّاسِ بِأَنْسَابِ الْعَرَبِ وَوَقَائِعِهَا وَأَيَّامِ الْجَاهِلِيَّةِ وَالاشْعَارِ الْعَرَبِيَّةِ قَالَ فَقَالَ النَّبِيُّ (صَلَّى اللهُ عَلَيْهِ وَآلِه) ذَاكَ عِلْمٌ لا يَضُرُّ مَنْ جَهِلَهُ وَلا يَنْفَعُ مَنْ عَلِمَهُ ثُمَّ قَالَ النَّبِيُّ (صَلَّى اللهُ عَلَيْهِ وَآلِه) إِنَّمَا الْعِلْمُ ثَلاثَةٌ آيَةٌ مُحْكَمَةٌ أَوْ فَرِيضَةٌ عَادِلَةٌ أَوْ سُنَّةٌ قَائِمَةٌ وَمَا خَلاهُنَّ فَهُوَ فَضْلٌ.",
            "englishTranslation": "1. Muhammad ibn al-Hassan has narrated from Ali ibn Muhammad from Sahl ibn Ziyad from Muhammad ibn ‘Isa from ‘Ubaudallah al-Dihqan from Durust al-Wasiti from Ibrahim ibn ‘Abd al-Hamid from abu al-Hassan Musa  who has said the following. “Once the Holy Prophet (s.a) entered the Mosque and found a group of people gathered around a man. He asked, “who is he?” It was said that he was a ‘allamah. He then asked them, “What is that? “ They replied that he is the most learned man about the genealogy, the chronology, and the history of the pre-Islamic days of darkness and the poetry of Arabs. The Imam said, ‘The holy Prophet (s.a.) then told them. “Knowledge consists of only three kinds: A strong sign, a justly enjoined obligation or an established tradition. Other then these are of the extra achievements.”’",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/102)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #2",
            "url": "https://thaqalayn.net/hadith/1/2/2/2",
            "arabicText": "2ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِي الْبَخْتَرِيِّ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ إِنَّ الْعُلَمَاءَ وَرَثَةُ الانْبِيَاءِ وَذَاكَ أَنَّ الانْبِيَاءَ لَمْ يُورِثُوا دِرْهَماً وَلا دِينَاراً وَإِنَّمَا أَوْرَثُوا أَحَادِيثَ مِنْ أَحَادِيثِهِمْ فَمَنْ أَخَذَ بِشَيْ‏ءٍ مِنْهَا فَقَدْ أَخَذَ حَظّاً وَافِراً فَانْظُرُوا عِلْمَكُمْ هَذَا عَمَّنْ تَأْخُذُونَهُ فَإِنَّ فِينَا أَهْلَ الْبَيْتِ فِي كُلِّ خَلَفٍ عُدُولاً يَنْفُونَ عَنْهُ تَحْرِيفَ الْغَالِينَ وَانْتِحَالَ الْمُبْطِلِينَ وَتَأْوِيلَ الْجَاهِلِينَ.",
            "englishTranslation": "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Khalid from abu al-Bakhtari from abu ‘Abdallah  who has said the following. “The scholars are the heirs of the prophets because the prophets did not leave any Dirham or Dinar, (units of money) as their legacy. What they left was certain pieces of their statements. Those who acquired anything of these pieces of their statements they have certainly gained a large share. You must be very careful, when acquiring such knowledge, to see from what kinds of people you receive them. Among us (the Ahlul Bayt, family of the holy Prophet s.a.) after every one there comes a just person who removes (and exposes) the forgeries of the exaggerators from it (knowledge), the infiltrated materials of the fallacious ones and the interpretations of the ignorant ones.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/103)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #3",
            "url": "https://thaqalayn.net/hadith/1/2/2/3",
            "arabicText": "3ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ إِذَا أَرَادَ الله بِعَبْدٍ خَيْراً فَقَّهَهُ فِي الدِّينِ.",
            "englishTranslation": "3. Al-Hassan ibn Muhammad has narrated from Mu‘alla ibn Muhammad from al-Hassan ibn Ali al-Washsha’ from Hammad ibn ‘Uthman from abu ‘Abdallah  who has said the following. “When Allah wants goodness for a person He gives him (Fiqh) good understanding of religion.”",
            "gradings": [
              {
                "grade": "ضعيف على المشهور",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (106/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #5",
            "url": "https://thaqalayn.net/hadith/1/2/2/5",
            "arabicText": "5ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ إِسْمَاعِيلَ بْنِ جَابِرٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ الْعُلَمَاءُ أُمَنَاءُ وَالاتْقِيَاءُ حُصُونٌ وَالاوْصِيَاءُ سَادَةٌ وَفِي رِوَايَةٍ أُخْرَى الْعُلَمَاءُ مَنَارٌ وَالاتْقِيَاءُ حُصُونٌ وَالاوْصِيَاءُ سَادَةٌ.",
            "englishTranslation": "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Sinan from ’Isma‘il ibn Jabir from abu ‘Abdallah  who has said the following. “The scholars are trust worthy people, The pious ones are the strongholds and the successors (of the holy Prophet (s.a.) are the leaders.” In another Hadith it is said, “The scholars are the light houses, the pious people are the strongholds and the successors are the leaders.”",
            "gradings": [
              {
                "grade": "ضعيف على المشهور",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (106/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #6",
            "url": "https://thaqalayn.net/hadith/1/2/2/6",
            "arabicText": "6ـ أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ حَسَّانَ عَنْ إِدْرِيسَ بْنِ الْحَسَنِ عَنْ أَبِي إِسْحَاقَ الْكِنْدِيِّ عَنْ بَشِيرٍ الدَّهَّانِ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) لا خَيْرَ فِيمَنْ لا يَتَفَقَّهُ مِنْ أَصْحَابِنَا يَا بَشِيرُ إِنَّ الرَّجُلَ مِنْهُمْ إِذَا لَمْ يَسْتَغْنِ بِفِقْهِهِ احْتَاجَ إِلَيْهِمْ فَإِذَا احْتَاجَ إِلَيْهِمْ أَدْخَلُوهُ فِي بَابِ ضَلالَتِهِمْ وَهُوَ لا يَعْلَمُ.",
            "englishTranslation": "6. Ahmad ibn Idris has narrated from Muhammad ibn Hassa’n from Idris ibn al-Hassan from abu Ishaq al-Kindi from Bashir al-Dahhan from abu ‘Abdallah  who has said the following. “O Bashir, there is nothing good in those of our people who do not acquire (Fiqh) good understand of religion. If one of them would not have good understanding of the religion he would need to ask those who oppose us. When he would need them they would lead him into their straying ways in a manner that he would not even realize.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (107/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #7",
            "url": "https://thaqalayn.net/hadith/1/2/2/7",
            "arabicText": "7ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) عَنْ آبَائِهِ قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) لا خَيْرَ فِي الْعَيْشِ إِلا لِرَجُلَيْنِ عَالِمٍ مُطَاعٍ أَوْ مُسْتَمِعٍ وَاعٍ.",
            "englishTranslation": "7. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from al-Nawfali from al-Sakuni from abu ‘Abdallah  who has narrated from his ancestors from the Holy Prophet (s.a.), who has said the following. “There is nothing good in life except for two kinds of people: a scholar who is obeyed and an audience who listens carefully.”",
            "gradings": [
              {
                "grade": "ضعيف على المشهور",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (107/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "3": {
        "Al-Kafi - Volume 1: Chapter on Kinds of People": [
          {
            "number": "Hadith #2",
            "url": "https://thaqalayn.net/hadith/1/2/3/2",
            "arabicText": "2ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ الاشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ أَحْمَدَ بْنِ عَائِذٍ عَنْ أَبِي خَدِيجَةَ سَالِمِ بْنِ مُكْرَمٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ النَّاسُ ثَلاثَةٌ عَالِمٌ وَمُتَعَلِّمٌ وَغُثَاءٌ.",
            "englishTranslation": "2. Al-Husayn ibn Muhammad al-Ash’ari has narrated from Mu‘alla ibn Muhammad from al-Hassan ibn Ali al-Washsha’ from Ahmad ibn ‘A’idh from abu Khadija Salim ibn Mukram from abu ‘Abdallah  who has said the following. “People are of three kinds: The scholars, the learning group and the garbled ones.”",
            "gradings": [
              {
                "grade": "ضعيف على المشهور",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (110/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "4": {
        "Al-Kafi - Volume 1: Chapter on the reward for the scholars and those who seek knowledge": [
          {
            "number": "Hadith #6",
            "url": "https://thaqalayn.net/hadith/1/2/4/6",
            "arabicText": "6ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ الْمِنْقَرِيِّ عَنْ حَفْصِ بْنِ غِيَاثٍ قَالَ قَالَ لِي أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) مَنْ تَعَلَّمَ الْعِلْمَ وَعَمِلَ بِهِ وَعَلَّمَ لله دُعِيَ فِي مَلَكُوتِ السَّمَاوَاتِ عَظِيماً فَقِيلَ تَعَلَّمَ لله وَعَمِلَ لله وَعَلَّمَ لله.",
            "englishTranslation": "6. Ali ibn Ibrahim has narrated from his father from al-Qasim ibn Muhammad from Sulayman ibn Dawud al-Minqari from Hafs ibn Ghiyath who has said that abu ‘Abdallah  said the following. “Whoever acquires knowledge and practice what he has learned and teach it to others for the sake of Allah, among the angels of heavens he will be called a great personality. It will be said there: ‘He learned for the sake of Allah, practiced for the sake of Allah and taught it for the sake of Allah.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/117)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "5": {
        "Al-Kafi - Volume 1: Chapter on the Qualities of the Scholars": [
          {
            "number": "Hadith #6",
            "url": "https://thaqalayn.net/hadith/1/2/5/6",
            "arabicText": "6ـ وَبِهَذَا الاسْنَادِ عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ رَفَعَهُ قَالَ قَالَ عِيسَى ابْنُ مَرْيَمَ (عَلَيْهِ السَّلام) يَا مَعْشَرَ الْحَوَارِيِّينَ لِي إِلَيْكُمْ حَاجَةٌ اقْضُوهَا لِي قَالُوا قُضِيَتْ حَاجَتُكَ يَا رُوحَ الله فَقَامَ فَغَسَلَ أَقْدَامَهُمْ فَقَالُوا كُنَّا نَحْنُ أَحَقَّ بِهَذَا يَا رُوحَ الله فَقَالَ إِنَّ أَحَقَّ النَّاسِ بِالْخِدْمَةِ الْعَالِمُ إِنَّمَا تَوَاضَعْتُ هَكَذَا لِكَيْمَا تَتَوَاضَعُوا بَعْدِي فِي النَّاسِ كَتَوَاضُعِي لَكُمْ ثُمَّ قَالَ عِيسَى (عَلَيْهِ السَّلام) بِالتَّوَاضُعِ تُعْمَرُ الْحِكْمَةُ لا بِالتَّكَبُّرِ وَكَذَلِكَ فِي السَّهْلِ يَنْبُتُ الزَّرْعُ لا فِي الْجَبَلِ.",
            "englishTranslation": "Through the same chain of narrators it is narrated from Muhammad ibn Khalid from Muhammad ibn Sinan in a marfu‘ manner (rafa’ahu ) from Jesus son of Mary who has said the following to his disciples. “O disciples, I need your help so help me.” They replied, “Your request is granted, O Spirit of God.” Jesus then got up and washed their feet. To this the disciples said, “We were supposed to serve you O Spirit of God.” Jesus then said, “Of the people who must serve others are the scholars. I acted in this humble way so that you will act among people in the humble way I acted before you.” Jesus then said, “With humbleness wisdom is established but not with arrogance. Just as plants grow in plain and soft grounds but not on the hard grounds and rocks.”",
            "gradings": [
              {
                "grade": "ضعيف على المشهور",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (120/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "7": {
        "Al-Kafi - Volume 1: Chapter on the Loss of a Scholar": [
          {
            "number": "Hadith #5",
            "url": "https://thaqalayn.net/hadith/1/2/7/5",
            "arabicText": "5ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ عَمِّهِ يَعْقُوبَ بْنِ سَالِمٍ عَنْ دَاوُدَ بْنِ فَرْقَدٍ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) إِنَّ أَبِي كَانَ يَقُولُ إِنَّ الله عَزَّ وَجَلَّ لا يَقْبِضُ الْعِلْمَ بَعْدَ مَا يُهْبِطُهُ وَلَكِنْ يَمُوتُ الْعَالِمُ فَيَذْهَبُ بِمَا يَعْلَمُ فَتَلِيهِمُ الْجُفَاةُ فَيَضِلُّونَ وَيُضِلُّونَ وَلا خَيْرَ فِي شَيْ‏ءٍ لَيْسَ لَهُ أَصْلٌ.",
            "englishTranslation": "5. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Ali ibn Asbat from his uncle Ya’qub ibn Salim from Dawud ibn Farqad who has said the following. “Imam abu ‘Abdallah  has said, ‘My father used to say, ‘Allah does not take back the knowledge that He has sent down. But when the scholar dies it takes away his knowledge and after this the unjust ones come and they go astray and mislead people and there is no good in things without basis.’”",
            "gradings": [
              {
                "grade": "ضعيف على المشهور",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/126)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "8": {
        "Al-Kafi - Volume 1: Chapter on Meeting the Scholars and Associating with Them": [
          {
            "number": "Hadith #2",
            "url": "https://thaqalayn.net/hadith/1/2/8/2",
            "arabicText": "2ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَمُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ دُرُسْتَ بْنِ أَبِي مَنْصُورٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْحَمِيدِ عَنْ أَبِي الْحَسَنِ مُوسَى بْنِ جَعْفَرٍ (عَلَيْهما السَّلام) قَالَ مُحَادَثَةُ الْعَالِمِ عَلَى الْمَزَابِلِ خَيْرٌ مِنْ مُحَادَثَةِ الْجَاهِلِ عَلَى الزَّرَابِيِّ.",
            "englishTranslation": "2. Ali ibn Ibrahim has narrated from his father and Muhammad ibn Yahya from Ahmad ibn Muhammad ibn ‘Isa, all from ibn Mahbub from Durust ibn abu Mansur from Ibrahim ibn ‘Abd al-Hamid from abu al-Hassan Musa ibn Ja‘far  who has said the following. “Speaking to a scholar even at a dump-site is better than speaking to an ignorant person at a best furnished palace.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (128/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #3",
            "url": "https://thaqalayn.net/hadith/1/2/8/3",
            "arabicText": "3ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ عَنْ شَرِيفِ بْنِ سَابِقٍ عَنِ الْفَضْلِ بْنِ أَبِي قُرَّةَ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) قَالَتِ الْحَوَارِيُّونَ لِعِيسَى يَا رُوحَ الله مَنْ نُجَالِسُ قَالَ مَنْ يُذَكِّرُكُمُ الله رُؤْيَتُهُ وَيَزِيدُ فِي عِلْمِكُمْ مَنْطِقُهُ وَيُرَغِّبُكُمْ فِي الاخِرَةِ عَمَلُهُ.",
            "englishTranslation": "3. A number of our people has narrated from Ahmad ibn Muhammad al-Barqi from Sharif ibn Sabiq from al-Fadl ibn abu Qurrah from abu ‘Abdallah  who has said the following. “The Holy Prophet said, ‘The disciples asked Jesus, ‘O the spirit of Allah who should we associate with?’ Jesus replied, “Associate with those whose visitation would remind you of Allah, whose speech and logic increase your knowledge and whose deeds would attract you to the next life.’”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/128)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "9": {
        "Al-Kafi - Volume 1: Chapter on Asking the Scholar and Discussing with him": [
          {
            "number": "Hadith #7",
            "url": "https://thaqalayn.net/hadith/1/2/9/7",
            "arabicText": "7ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ أَبِي الْجَارُودِ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ (عَلَيْهِ السَّلام) يَقُولُ رَحِمَ الله عَبْداً أَحْيَا الْعِلْمَ قَالَ قُلْتُ وَمَا إِحْيَاؤُهُ قَالَ أَنْ يُذَاكِرَ بِهِ أَهْلَ الدِّينِ وَأَهْلَ الْوَرَعِ.",
            "englishTranslation": "7. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Sinan from abu al-Jarud from abu Ja’far  who has said the following. “May Allah grant forgiveness to a man who revives knowledge.” Abu al-Jarud has said, “I asked the Imam, ‘What is reviving knowledge?’” The Imam  replied, “It is his discussing knowledge among the religious people and the people of piety.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/132)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "10": {
        "Al-Kafi - Volume 1: Chapter on Giving Knowledge as Charity": [
          {
            "number": "Hadith #3",
            "url": "https://thaqalayn.net/hadith/1/2/10/3",
            "arabicText": "3ـ وَبِهَذَا الاسْنَادِ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ النَّضْرِ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ ابي جعفر (عَلَيْهِ السَّلام) قَالَ زَكَاةُ الْعِلْمِ أَنْ تُعَلِّمَهُ عِبَادَ الله.",
            "englishTranslation": "3. Through the same chain of narrators he has narrated from his father from Ahmad ibn Nadr from ‘Amr and ibn Shimr from Jabir from abu Ja’far  who has said the following. “Zakat, the tax, on knowledge is teaching it to the servants of Allah.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/135)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "11": {
        "Al-Kafi - Volume 1: Prohibition on Speaking without Knowledge.": [
          {
            "number": "Hadith #7",
            "url": "https://thaqalayn.net/hadith/1/2/11/7",
            "arabicText": "7ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ جَعْفَرِ بْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانٍ عَنْ زُرَارَةَ بْنِ أَعْيَنَ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ (عَلَيْهِ السَّلام) مَا حَقُّ الله عَلَى الْعِبَادِ قَالَ أَنْ يَقُولُوا مَا يَعْلَمُونَ وَيَقِفُوا عِنْدَ مَا لا يَعْلَمُونَ.",
            "englishTranslation": "7. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Ali ibn Asbat from Ja’far ibn Sama‘a from several persons, from aban, from Zurara ibn A‘yan who has said the following. “I asked Imam abu Ja‘far  this, ‘What are the rights of Allah on people?’” The Imam  replied, “They must say what they know and abstain from saying anything that they have no knowledge of.’”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (138/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #9",
            "url": "https://thaqalayn.net/hadith/1/2/11/9",
            "arabicText": "9ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ دَاوُدَ بْنِ فَرْقَدٍ عَمَّنْ حَدَّثَهُ عَنِ ابْنِ شُبْرُمَةَ قَالَ مَا ذَكَرْتُ حَدِيثاً سَمِعْتُهُ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ (عَلَيْهما السَّلام) إِلا كَادَ أَنْ يَتَصَدَّعَ قَلْبِي قَالَ حَدَّثَنِي أَبِي عَنْ جَدِّي عَنْ رَسُولِ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) قَالَ ابْنُ شُبْرُمَةَ وَأُقْسِمُ بِالله مَا كَذَبَ أَبُوهُ عَلَى جَدِّهِ وَلا جَدُّهُ عَلَى رَسُولِ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) مَنْ عَمِلَ بِالْمَقَايِيسِ فَقَدْ هَلَكَ وَأَهْلَكَ وَمَنْ أَفْتَى النَّاسَ بِغَيْرِ عِلْمٍ وَهُوَ لا يَعْلَمُ النَّاسِخَ مِنَ الْمَنْسُوخِ وَالْمُحْكَمَ مِنَ الْمُتَشَابِهِ فَقَدْ هَلَكَ وَأَهْلَكَ.",
            "englishTranslation": "9. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from Dawad ibn Farqad from one he narrated from ibn Shubruma (a judge in al-Kufa during the rule of al-Mansur) who has said the following. “I never heard any thing like a statement I heard from Imam abu ‘Abdallah  and it is almost as he said, ‘Pierced my heart.’” The Imam  said, “My father narrated from my great-great-great-great grandfather, the holy Prophet (s.a.) who said, ‘Those who act on the basis of analogy will face their destruction and lead others to their destruction. Those who give fatwas without the knowledge of the abrogating and the abrogated, the clear text and that which requires interpretation, they will face destruction and lead others to their destruction.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/140)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "12": {
        "Al-Kafi - Volume 1: Chapter on Those who Act without Knowledge": [
          {
            "number": "Hadith #1",
            "url": "https://thaqalayn.net/hadith/1/2/12/1",
            "arabicText": "1ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ طَلْحَةَ بْنِ زَيْدٍ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) يَقُولُ الْعَامِلُ عَلَى غَيْرِ بَصِيرَةٍ كَالسَّائِرِ عَلَى غَيْرِ الطَّرِيقِ لا يَزِيدُهُ سُرْعَةُ السَّيْرِ إِلا بُعْداً.",
            "englishTranslation": "1. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from his father from Muhammad ibn Sinan from Talha ibn Zayd who has said the following. “(Imam) abu ‘Abdallah  has said, ‘Working without understanding and insight is like travelling in the wrong direction that only takes one farther away from the destination.’”",
            "gradings": [
              {
                "grade": "ضعيف على المشهور",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (140/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #2",
            "url": "https://thaqalayn.net/hadith/1/2/12/2",
            "arabicText": "2 ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ ابْنِ مُسْكَانَ عَنْ حُسَيْنٍ الصَّيْقَلِ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) يَقُولُ لا يَقْبَلُ الله عَمَلاً إِلا بِمَعْرِفَةٍ وَلا مَعْرِفَةَ إِلا بِعَمَلٍ فَمَنْ عَرَفَ دَلَّتْهُ الْمَعْرِفَةُ عَلَى الْعَمَلِ وَمَنْ لَمْ يَعْمَلْ فَلا مَعْرِفَةَ لَهُ أَلا إِنَّ الايمَانَ بَعْضُهُ مِنْ بَعْضٍ.",
            "englishTranslation": "2. Muhammad ibn Yahya from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Sinan from ibn Muskan from Hassan al-Sayqal who has said the following. “(Imam) abu ‘Abdallah  who has said, “Allah does not accept a deed without good understanding and proper understanding does not come into being without work. One who achieves proper understanding it will guide him to good deeds and one who does not work will not have any understanding. Is it not a fact that parts of faith comes from other parts?”",
            "gradings": [
              {
                "grade": "ضعيف على المشهور",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (141/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "13": {
        "Al-Kafi - Volume 1: Chapter on Utilization of Knowledge": [
          {
            "number": "Hadith #2",
            "url": "https://thaqalayn.net/hadith/1/2/13/2",
            "arabicText": "2ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ إِسْمَاعِيلَ بْنِ جَابِرٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ الْعِلْمُ مَقْرُونٌ إِلَى الْعَمَلِ فَمَنْ عَلِمَ عَمِلَ وَمَنْ عَمِلَ عَلِمَ وَالْعِلْمُ يَهْتِفُ بِالْعَمَلِ فَإِنْ أَجَابَهُ وَإِلا ارْتَحَلَ عَنْهُ.",
            "englishTranslation": "2. Muhammad ibn Yahya from Ahmad ibn Muhammad from Muhammad ibn Sinan from ‘Isma’il ibn Jabir from abu ‘Abdallah  who has said the following. “Knowledge and work are closely related. One who has knowledge he works and one who works he learns. Knowledge invites work and if it is not accepted knowledge departs the deeds.”",
            "gradings": [
              {
                "grade": "ضعيف على المشهور",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/142)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #3",
            "url": "https://thaqalayn.net/hadith/1/2/13/3",
            "arabicText": "3ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عَلِيِّ بْنِ مُحَمَّدٍ الْقَاسَانِيِّ عَمَّنْ ذَكَرَهُ عَنْ عَبْدِ الله بْنِ الْقَاسِمِ الْجَعْفَرِيِّ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ إِنَّ الْعَالِمَ إِذَا لَمْ يَعْمَلْ بِعِلْمِهِ زَلَّتْ مَوْعِظَتُهُ عَنِ الْقُلُوبِ كَمَا يَزِلُّ الْمَطَرُ عَنِ الصَّفَا.",
            "englishTranslation": "3. A number of our people has narrated from Ahmad ibn Muhammad ibn Khalid from Ali ibn Muhammad al-Qasani from one he mentioned from ‘Abdallah ibn Qasim al-Ja’fari from abu ‘Abdallah  who has said the following. “If a scholar preaches and does not practice his words bounce away from the hearts of the audience like rains that bounce away off the rocks.”",
            "gradings": [
              {
                "grade": "ضعيف على المشهور",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/143)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #4",
            "url": "https://thaqalayn.net/hadith/1/2/13/4",
            "arabicText": "4ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنِ الْمِنْقَرِيِّ عَنْ عَلِيِّ بْنِ هَاشِمِ بْنِ الْبَرِيدِ عَنْ أَبِيهِ قَالَ جَاءَ رَجُلٌ إِلَى عَلِيِّ بن الحسين (عَلَيْهما السَّلام) فَسَأَلَهُ عَنْ مَسَائِلَ فَأَجَابَ ثُمَّ عَادَ لِيَسْأَلَ عَنْ مِثْلِهَا فَقَالَ عَلِيُّ بن الحسين (عَلَيْهما السَّلام) مَكْتُوبٌ فِي الانْجِيلِ لا تَطْلُبُوا عِلْمَ مَا لا تَعْلَمُونَ وَلَمَّا تَعْمَلُوا بِمَا عَلِمْتُمْ فَإِنَّ الْعِلْمَ إِذَا لَمْ يُعْمَلْ بِهِ لَمْ يَزْدَدْ صَاحِبُهُ إِلا كُفْراً وَلَمْ يَزْدَدْ مِنَ الله إِلا بُعْداً.",
            "englishTranslation": "4. Ali ibn Ibrahim has narrated from his father from al-Qasim ibn Muhammad from al-Minqari from Ali ibn Hashim ibn al-Burayd from his father who has said the following. “A man came to (Imam) Ali ibn al-Husayn  and asked him certain questions and the Imam answered his questions. The man then wanted to ask similar questions but the Imam said, “It is written in the Gospel, ‘Do not inquire to know what you do not know until you practice what you know because not practicing what one knows does not increase to one anything but disbelief and nor it increases anything to one’s relation with Allah but alienation.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/143)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #5",
            "url": "https://thaqalayn.net/hadith/1/2/13/5",
            "arabicText": "5ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ الْمُفَضَّلِ بْنِ عُمَرَ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ قُلْتُ لَهُ بِمَ يُعْرَفُ النَّاجِي قَالَ مَنْ كَانَ فِعْلُهُ لِقَوْلِهِ مُوَافِقاً فَأَثْبَتَ لَهُ الشَّهَادَةَ وَمَنْ لَمْ يَكُنْ فِعْلُهُ لِقَوْلِهِ مُوَافِقاً فَإِنَّمَا ذَلِكَ مُسْتَوْدَعٌ.",
            "englishTranslation": "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Sinan from al-Mufaddal ibn ‘Umar who has said the following. “I asked Imam abu ‘Abdallah , ‘What are the facts that help one know those who have gained their salvation?’ The Imam replied, “One whose words agree with his deeds you must consider his testimony as valid and one whose words do not agree with his deeds (if he may have faith) it is temporarily.’”",
            "gradings": [
              {
                "grade": "ضعيف على المشهور",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/144)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #7",
            "url": "https://thaqalayn.net/hadith/1/2/13/7",
            "arabicText": "7ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَمَّنْ ذَكَرَهُ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ أَبِيهِ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ (عَلَيْهِ السَّلام) يَقُولُ إِذَا سَمِعْتُمُ الْعِلْمَ فَاسْتَعْمِلُوهُ وَلْتَتَّسِعْ قُلُوبُكُمْ فَإِنَّ الْعِلْمَ إِذَا كَثُرَ فِي قَلْبِ رَجُلٍ لا يَحْتَمِلُهُ قَدَرَ الشَّيْطَانُ عَلَيْهِ فَإِذَا خَاصَمَكُمُ الشَّيْطَانُ فَأَقْبِلُوا عَلَيْهِ بِمَا تَعْرِفُونَ فَإِنَّ كَيْدَ الشَّيْطَانِ كَانَ ضَعِيفاً فَقُلْتُ وَمَا الَّذِي نَعْرِفُهُ قَالَ خَاصِمُوهُ بِمَا ظَهَرَ لَكُمْ مِنْ قُدْرَةِ الله عَزَّ وَجَلَّ.",
            "englishTranslation": "7. A number of our people has narrated from Ahmad ibn Muhammad ibn Khalid from his father from the one mentioned from Muhammad ibn ’Abd al-Rahman ibn abu Layla from his father who has said the following. “Imam abu Ja‘far  has said, ‘When you hear knowledge you must utilize it and your hearts must become more open. When knowledge increases in one’s heart it becomes harder to bear and Satan may over power him. If Satan would dispute with you move on him with whatever you know. The plots of Satan are weak.” I asked the Imam  “What is it that we know?’” The Imam replied, “Fight him with whatever of the power of Allah, the Majestic, the Glorious, has come to light before you.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (146/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "14": {
        "Al-Kafi - Volume 1: Chapter on Those who use their Knowledge to Fill their Stomach and are Boastful for it": [
          {
            "number": "Hadith #3",
            "url": "https://thaqalayn.net/hadith/1/2/14/3",
            "arabicText": "3ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ الاصْبَهَانِيِّ عَنِ الْمِنْقَرِيِّ عَنْ حَفْصِ بْنِ غِيَاثٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ مَنْ أَرَادَ الْحَدِيثَ لِمَنْفَعَةِ الدُّنْيَا لَمْ يَكُنْ لَهُ فِي الاخِرَةِ نَصِيبٌ.",
            "englishTranslation": "3. Ali ibn Ibrahim has narrated from his father from al-Qasim ibn Muhammad al-Isbahani from al-Minqari from Hafs ibn Ghiyath from abu ‘Abdallah  who has said the following. “Whoever would want al-Hadith for the worldly gains he will have no share for it in the next life.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/149)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #4",
            "url": "https://thaqalayn.net/hadith/1/2/14/4",
            "arabicText": "4ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْقَاسِمِ عَنِ الْمِنْقَرِيِّ عَنْ حَفْصِ بْنِ غِيَاثٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ إِذَا رَأَيْتُمُ الْعَالِمَ مُحِبّاً لِدُنْيَاهُ فَاتَّهِمُوهُ عَلَى دِينِكُمْ فَإِنَّ كُلَّ مُحِبٍّ لِشَيْ‏ءٍ يَحُوطُ مَا أَحَبَّ وَقَالَ (صَلَّى اللهُ عَلَيْهِ وَآلِه) أَوْحَى الله إِلَى دَاوُدَ (عَلَيْهِ السَّلام) لا تَجْعَلْ بَيْنِي وَبَيْنَكَ عَالِماً مَفْتُوناً بِالدُّنْيَا فَيَصُدَّكَ عَنْ طَرِيقِ مَحَبَّتِي فَإِنَّ أُولَئِكَ قُطَّاعُ طَرِيقِ عِبَادِيَ الْمُرِيدِينَ إِنَّ أَدْنَى مَا أَنَا صَانِعٌ بِهِمْ أَنْ أَنْزِعَ حَلاوَةَ مُنَاجَاتِي عَنْ قُلُوبِهِمْ.",
            "englishTranslation": "4. Ali ibn Ibrahim has narrated from his father from al-Qasim from al-Minqari from Hafs ibn Ghiyath from abu ‘Abdallah  who has said the following. “If you would find a learned person who loves the worldly gains you must not trust him in the matters of your religion because whoever would love something it will encompass and entangle him. The holy Prophet has said, ‘Allah sent wahy, revelation to David  and told him, “Do not set between Me and yourself a learned person who loves the worldly gains lest he will bar you from the way to My love. Such people are bandits who ambush my servants who want Me. The least that I will do to such bandits is to take away from them the sweetness of their private conversations and prayers with Me.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (149/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #5",
            "url": "https://thaqalayn.net/hadith/1/2/14/5",
            "arabicText": "5ـ عَلِيٌّ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) الْفُقَهَاءُ أُمَنَاءُ الرُّسُلِ مَا لَمْ يَدْخُلُوا فِي الدُّنْيَا قِيلَ يَا رَسُولَ الله وَمَا دُخُولُهُمْ فِي الدُّنْيَا قَالَ اتِّبَاعُ السُّلْطَانِ فَإِذَا فَعَلُوا ذَلِكَ فَاحْذَرُوهُمْ عَلَى دِينِكُمْ.",
            "englishTranslation": "5. Ali from his father from al-Nawfali from al-Sakuni from abu ‘Abdallah  who has said the following. “The holy Prophet has said, Al-Fuqaha, the scholars of the Fiqh, Islamic laws are the trustees of the prophets until they are not involved in the worldly matters.” People asked, “What is their ‘entering in the worldly matters, O the holy Prophet of Allah?” “Their following the kings is entering in the worldly matters. When they follow the kings then you must be very careful in involving them in your religion.” Replied the holy Prophet (s.a.)",
            "gradings": [
              {
                "grade": "ضعيف على المشهور",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (149/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "15": {
        "Al-Kafi - Volume 1: Chapter on the Need for the Existence of a Divine Authority in the World and the Seriousness of this Matter": [
          {
            "number": "Hadith #1",
            "url": "https://thaqalayn.net/hadith/1/2/15/1",
            "arabicText": "1ـ عَلِيُّ بْنُ إِبْرَاهِيمَ بْنِ هَاشِمٍ عَنْ أَبِيهِ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنِ الْمِنْقَرِيِّ عَنْ حَفْصِ بْنِ غِيَاثٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ قَالَ يَا حَفْصُ يُغْفَرُ لِلْجَاهِلِ سَبْعُونَ ذَنْباً قَبْلَ أَنْ يُغْفَرَ لِلْعَالِمِ ذَنْبٌ وَاحِدٌ.",
            "englishTranslation": "1. Ali ibn Ibrahim ibn Hashim has narrated from his father from al-Qasim ibn Muhammad from al-Minqari from Hafs ibn Ghiyath from abu ‘Abdallah  who has said the following. “O Hafs, seventy sins of an ignorant person may be forgiven before only one sin of a learned person is forgiven.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (151/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #2",
            "url": "https://thaqalayn.net/hadith/1/2/15/2",
            "arabicText": "2ـ وَبِهَذَا الاسْنَادِ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ عِيسَى ابْنُ مَرْيَمَ عَلَى نَبِيِّنَا وَآلِهِ وَعَلَيْهِ السَّلامُ وَيْلٌ لِلْعُلَمَاءِ السَّوْءِ كَيْفَ تَلَظَّى عَلَيْهِمُ النَّارُ.",
            "englishTranslation": "2. Through the same chain of narrators it is narrated from abu ‘Abdallah  who has said the following. “Jesus son of Mary (s.a.) said, ‘Woe to bad scholars! If only they knew how raging fire will engulf them.’”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/152)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #4",
            "url": "https://thaqalayn.net/hadith/1/2/15/4",
            "arabicText": "4ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى الْحَلَبِيِّ عَنْ أَبِي سَعِيدٍ الْمُكَارِي عَنْ أَبِي بَصِيرٍ عَنْ ابي جعفر (عَلَيْهِ السَّلام) فِي قَوْلِ الله عَزَّ وَجَلَّ فَكُبْكِبُوا فِيها هُمْ وَالْغاوُونَ قَالَ هُمْ قَوْمٌ وَصَفُوا عَدْلاً بِأَلْسِنَتِهِمْ ثُمَّ خَالَفُوهُ إِلَى غَيْرِهِ.",
            "englishTranslation": "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Husayn ibn Sa‘id from al-Nadr ibn Suwayd from Yahya al-Halabi from abu Sa‘id al-Mukari from abu Basir from abu Ja’far  who has said the following. “Imam abu Ja‘far  has said about the words of Allah in the holy Quran, ‘The idol worshippers, the idols, the rebellious ones, (26:94) and the army of Satan will all be thrown headlong into hell. (26:95)’ They are the people who speak about justice a great deal but in their own practice they would disregard it altogether.’”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/153)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "16": {
        "Al-Kafi - Volume 1: Chapter on Miscellaneous Issues": [
          {
            "number": "Hadith #2",
            "url": "https://thaqalayn.net/hadith/1/2/16/2",
            "arabicText": "2ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ نُوحِ بْنِ شُعَيْبٍ النَّيْسَابُورِيِّ عَنْ عُبَيْدِ الله بْنِ عَبْدِ الله الدِّهْقَانِ عَنْ دُرُسْتَ بْنِ أَبِي مَنْصُورٍ عَنْ عُرْوَةَ بْنِ أَخِي شُعَيْبٍ الْعَقَرْقُوفِيِّ عَنْ شُعَيْبٍ عَنْ أَبِي بَصِيرٍ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) يَقُولُ كَانَ أَمِيرُ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) يَقُولُ يَا طَالِبَ الْعِلْمِ إِنَّ الْعِلْمَ ذُو فَضَائِلَ كَثِيرَةٍ فَرَأْسُهُ التَّوَاضُعُ وَعَيْنُهُ الْبَرَاءَةُ مِنَ الْحَسَدِ وَأُذُنُهُ الْفَهْمُ وَلِسَانُهُ الصِّدْقُ وَحِفْظُهُ الْفَحْصُ وَقَلْبُهُ حُسْنُ النِّيَّةِ وَعَقْلُهُ مَعْرِفَةُ الاشْيَاءِ وَالامُورِ وَيَدُهُ الرَّحْمَةُ وَرِجْلُهُ زِيَارَةُ الْعُلَمَاءِ وَهِمَّتُهُ السَّلامَةُ وَحِكْمَتُهُ الْوَرَعُ وَمُسْتَقَرُّهُ النَّجَاةُ وَقَائِدُهُ الْعَافِيَةُ وَمَرْكَبُهُ الْوَفَاءُ وَسِلاحُهُ لِينُ الْكَلِمَةِ وَسَيْفُهُ الرِّضَا وَقَوْسُهُ الْمُدَارَاةُ وَجَيْشُهُ مُحَاوَرَةُ الْعُلَمَاءِ وَمَالُهُ الادَبُ وَذَخِيرَتُهُ اجْتِنَابُ الذُّنُوبِ وَزَادُهُ الْمَعْرُوفُ وَمَاؤُهُ الْمُوَادَعَةُ وَدَلِيلُهُ الْهُدَى وَرَفِيقُهُ مَحَبَّةُ الاخْيَارِ.",
            "englishTranslation": "2. A number of our people has narrated from Ahmad ibn Muhammad from Nuh ibn Shu‘ayb al-Naysaburi from ‘Ubaydallah ibn ‘Abdallah al-Dihqan from Durust ibn abu Mansur from ’Urwa cousin of Shu‘ayb al-’Aqarqi from Shu‘ayb from abu Basir who has said the following. “(Imam) abu ‘Abdallah  who has said that Imam Ali  used to say, “O seekers of knowledge, knowledge (in a personified form) has a great deal of virtues. Humbleness is his head, freedom from jealousy forms his eyes, proper understanding shapes his ears, truthfulness constitutes his tongue, research and investigation produce his memory, optimism stands for his heart, the knowledge of facts and affairs strengthen his intellect. Intelligence and kindness are his hands, visitation of the scholars builds his legs, safety and peace emerge from his stamina, chastity develops his wisdom, salvation is his head quarters, good health and tranquility are his lead, loyalty will provide him his conveyance, politeness in communication gives him weapons, consent frames his sword, yielding to the truth stands for his bow and arrow, communication with the scholars establishes his army, proper discipline treasures his wealth, avoiding sins preserves his savings, uprightness institutes his supplies, amicable dealings supply him water, guidance determines his direction and love of virtuous people is the archetype for his friends.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/155)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #4",
            "url": "https://thaqalayn.net/hadith/1/2/16/4",
            "arabicText": "4ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ الاشْعَرِيِّ عَنْ عَبْدِ الله بْنِ مَيْمُونٍ الْقَدَّاحِ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) عَنْ آبَائِهِ (عَلَيْهم السَّلام) قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) فَقَالَ يَا رَسُولَ الله مَا الْعِلْمُ قَالَ الانْصَاتُ قَالَ ثُمَّ مَهْ قَالَ الاسْتِمَاعُ قَالَ ثُمَّ مَهْ قَالَ الْحِفْظُ قَالَ ثُمَّ مَهْ قَالَ الْعَمَلُ بِهِ قَالَ ثُمَّ مَهْ يَا رَسُولَ الله قَالَ نَشْرُهُ.",
            "englishTranslation": "4. Ali ibn Muhammad from Sahl ibn Ziyad from Ja’far ibn Muhammad al-Ash‘ari from ‘Abdallah ibn Maymun al-Qaddah from abu ‘Abdallah  from his ancestors (the Imams  who has said the following. “Once a man came to the holy Prophet (s.a.) and said, ‘O messenger of Allah what is knowledge?’ The holy Prophet replied, “It is silence.” The man then asked, “Then what?” The holy Prophet said, “It is listening.” The man asked, “Then what?” The holy Prophet (s.a.) said, “Then it is memorizing.” The man asked, “Then what?” The holy Prophet said, “Then it is practice accordingly.” The man then asked, “Then what O messenger of Allah?” The holy Prophet said, “Then it is to propagate what one has learned.”",
            "gradings": [
              {
                "grade": "ضعيف على المشهور",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/158)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #6",
            "url": "https://thaqalayn.net/hadith/1/2/16/6",
            "arabicText": "6ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ طَلْحَةَ بْنِ زَيْدٍ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) يَقُولُ إِنَّ رُوَاةَ الْكِتَابِ كَثِيرٌ وَإِنَّ رُعَاتَهُ قَلِيلٌ وَكَمْ مِنْ مُسْتَنْصِحٍ لِلْحَدِيثِ مُسْتَغِشٍّ لِلْكِتَابِ فَالْعُلَمَاءُ يَحْزُنُهُمْ تَرْكُ الرِّعَايَةِ وَالْجُهَّالُ يَحْزُنُهُمْ حِفْظُ الرِّوَايَةِ فَرَاعٍ يَرْعَى حَيَاتَهُ وَرَاعٍ يَرْعَى هَلَكَتَهُ فَعِنْدَ ذَلِكَ اخْتَلَفَ الرَّاعِيَانِ وَتَغَايَرَ الْفَرِيقَانِ.",
            "englishTranslation": "6. Ali ibn Ibrahim has narrated from his father from Muhammad ibn Yahya from Talha ibn Zayd who has said the following. “(Imam) abu ‘Abdallah  said, ‘The narrators of the book are a great many but those who would follow the proper discipline are very few. There are many, who are sincere about Hadith but mess up with the book. Lack of protection and discipline saddens the scholars and the (zeal) of ignorant ones to protect the (words of) narration (of a false text in reality) betrays the later group altogether. One kind of protectionism seeks protection of life and the other leads to its destruction and in such a situation the two forms of protectionism become different and the two groups distinct from each other.’”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (163/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #7",
            "url": "https://thaqalayn.net/hadith/1/2/16/7",
            "arabicText": "7ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ الاشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي نَجْرَانَ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ مَنْ حَفِظَ مِنْ أَحَادِيثِنَا أَرْبَعِينَ حَدِيثاً بَعَثَهُ الله يَوْمَ الْقِيَامَةِ عَالِماً فَقِيهاً.",
            "englishTranslation": "7. Al-Husayn ibn Muhammad al-Ash‘ari from Mu‘alla ibn Muhammad from Muhammad ibn Jumhur from ’Abd al-Rahman ibn abu Najran from one he mentioned from abu ‘Abdallah  who has said the following. “Whoever would preserve and memorize forty of our Hadith on the Day of Judgment Allah will raise him as a scholar and Faqih, one with proper understanding of religion.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (165/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #9",
            "url": "https://thaqalayn.net/hadith/1/2/16/9",
            "arabicText": "9ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ عَبْدِ الله بْنِ مُسْكَانَ عَنْ دَاوُدَ بْنِ فَرْقَدٍ عَنْ أَبِي سَعِيدٍ الزُّهْرِيِّ عَنْ ابي جعفر (عَلَيْهِ السَّلام) قَالَ الْوُقُوفُ عِنْدَ الشُّبْهَةِ خَيْرٌ مِنَ الاقْتِحَامِ فِي الْهَلَكَةِ وَتَرْكُكَ حَدِيثاً لَمْ تُرْوَهُ خَيْرٌ مِنْ رِوَايَتِكَ حَدِيثاً لَمْ تُحْصِهِ.",
            "englishTranslation": "9. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn an-Ni‘man from ‘Abdallah ibn Muskan from Daiwud ibn Farqad from abu Sa‘id al-Zuhri from abu Ja’far  who has said the following. “Holding back in an uncertain conditions is better than indulging in a destructive case. Your ignoring a Hadith that you do not narrate is better than your narrating a Hadith that you have not verified.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/168)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #11",
            "url": "https://thaqalayn.net/hadith/1/2/16/11",
            "arabicText": "11ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنِ الْمِنْقَرِيِّ عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) يَقُولُ وَجَدْتُ عِلْمَ النَّاسِ كُلَّهُ فِي أَرْبَعٍ أَوَّلُهَا أَنْ تَعْرِفَ رَبَّكَ وَالثَّانِي أَنْ تَعْرِفَ مَا صَنَعَ بِكَ وَالثَّالِثُ أَنْ تَعْرِفَ مَا أَرَادَ مِنْكَ وَالرَّابِعُ أَنْ تَعْرِفَ مَا يُخْرِجُكَ مِنْ دِينِكَ.",
            "englishTranslation": "11. Ali ibn Ibrahim has narrated from his father from al-Qasim ibn Muhammad from al-Minqari from Sufyan ibn ‘Uyaynah who has said the following. “(Imam) abu ‘Abdallah  who said, ‘I have found all the knowledge of people in four categories:  The knowledge that would teach you about your Lord. (b) The knowledge that would teach you what the Lord has done for you. (c) The knowledge that would teach you what the Lord wants from you. (d) The knowledge that would teach you what destroys your religion.’”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/169)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #13",
            "url": "https://thaqalayn.net/hadith/1/2/16/13",
            "arabicText": "13ـ مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ سِنَانٍ عَنْ مُحَمَّدِ بْنِ مَرْوَانَ الْعِجْلِيِّ عَنْ عَلِيِّ بْنِ حَنْظَلَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) يَقُولُ اعْرِفُوا مَنَازِلَ النَّاسِ عَلَى قَدْرِ رِوَايَتِهِمْ عَنَّا.",
            "englishTranslation": "13. Muhammad ibn al-Hassan from Sahl ibn Ziyad from ibn Sinan from Muhammad ibn Marwan al-‘Ijli from Ali ibn Hanzala who has said the following. “(Imam) abu ‘Abdallah , said, ‘Note the position of the people from the degree of their narration of Hadith from us.’”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (170/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #15",
            "url": "https://thaqalayn.net/hadith/1/2/16/15",
            "arabicText": "15ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ عَبْدِ الله بْنِ سُلَيْمَانَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ (عَلَيْهِ السَّلام) يَقُولُ وَعِنْدَهُ رَجُلٌ مِنْ أَهْلِ الْبَصْرَةِ يُقَالُ لَهُ عُثْمَانُ الاعْمَى وَهُوَ يَقُولُ إِنَّ الْحَسَنَ الْبَصْرِيَّ يَزْعُمُ أَنَّ الَّذِينَ يَكْتُمُونَ الْعِلْمَ يُؤْذِي رِيحُ بُطُونِهِمْ أَهْلَ النَّارِ فَقَالَ أَبُو جَعْفَرٍ (عَلَيْهِ السَّلام) فَهَلَكَ إِذَنْ مُؤْمِنُ آلِ فِرْعَوْنَ مَا زَالَ الْعِلْمُ مَكْتُوماً مُنْذُ بَعَثَ الله نُوحاً (عَلَيْهِ السَّلام) فَلْيَذْهَبِ الْحَسَنُ يَمِيناً وَشِمَالاً فَوَ الله مَا يُوجَدُ الْعِلْمُ إِلا هَاهُنَا.",
            "englishTranslation": "15. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from al-Washsha’ from Aban ibn ‘Uthman from ‘Abdallah ibn Sulayman who has said the following. ‘(Imam) abu Ja‘far  said to a man from Basra called ‘Uthman al-A’ma who would keep saying, “Al-Hassan al-Basri believes that those who hide knowledge the bad odor from their stomach will cause suffering to the people of hell.” The Imam said, “The true believer of the people of Pharaoh is then destroyed. Knowledge from the time of Noah became veiled (s.a). Let Hassan go left and right. I swear by Allah he will not find knowledge in no other place but here with us.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (172/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "17": {
        "Al-Kafi - Volume 1: Chapter on narrating books and Hadith (The virtue of writing and its preservation)": [
          {
            "number": "Hadith #3",
            "url": "https://thaqalayn.net/hadith/1/2/17/3",
            "arabicText": "3ـ وَعَنْهُ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنِ ابْنِ سِنَانٍ عَنْ دَاوُدَ بْنِ فَرْقَدٍ قَالَ قُلْتُ لابِي عَبْدِ الله (عَلَيْهِ السَّلام) إِنِّي أَسْمَعُ الْكَلامَ مِنْكَ فَأُرِيدُ أَنْ أَرْوِيَهُ كَمَا سَمِعْتُهُ مِنْكَ فَلا يَجِي‏ءُ قَالَ فَتَعَمَّدُ ذَلِكَ قُلْتُ لا فَقَالَ تُرِيدُ الْمَعَانِيَ قُلْتُ نَعَمْ قَالَ فَلا بَأْسَ.",
            "englishTranslation": "3. It is narrated from him from Muhammad ibn al-Husayn from ibn Sinan from Dawud ibn Farqad who has said the following. “I asked (Imam) abu ‘Abdallah , ‘I hear your statement and I want to narrate to others but it does not come through exactly.’” The Imam asked, “Do you do it purposely?” He said, “No, I do not do it purposely.” The Imam asked, “Do you keep the meaning?” He said, “Yes, I keep the meaning.” The Imam said, “It then is alright.”",
            "gradings": [
              {
                "grade": "ضعيف على المشهور",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/175)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #4",
            "url": "https://thaqalayn.net/hadith/1/2/17/4",
            "arabicText": "4ـ وَعَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ قَالَ قُلْتُ لابِي عَبْدِ الله (عَلَيْهِ السَّلام) الْحَدِيثُ أَسْمَعُهُ مِنْكَ أَرْوِيهِ عَنْ أَبِيكَ أَوْ أَسْمَعُهُ مِنْ أَبِيكَ أَرْوِيهِ عَنْكَ قَالَ سَوَاءٌ إِلا أَنَّكَ تَرْوِيهِ عَنْ أَبِي أَحَبُّ إِلَيَّ وَقَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) لِجَمِيلٍ مَا سَمِعْتَ مِنِّي فَارْوِهِ عَنْ أَبِي.",
            "englishTranslation": "4. It is narrated from him from Ahmad ibn Muhammad ibn ‘Isa from al-Husayn ibn Sa‘id from al-Qasim ibn Muhammad from Ali ibn abu Hamza from abu Basir who has said the following: “Once I asked Abu ‘Abdillah , ‘Can I narrate a Hadith I hear from you as a Hadith of your father or narrate what I have heard from your father as your Hadith?’ The Imam said, ‘It is all the same. However, I would love if you narrate from my father.’ Abu ‘Abd Allah , once said to Jamil, ‘What you hear from me you may narrate as a Hadith of my father also.’”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/176)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #7",
            "url": "https://thaqalayn.net/hadith/1/2/17/7",
            "arabicText": "7ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَعَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) إِذَا حَدَّثْتُمْ بِحَدِيثٍ فَأَسْنِدُوهُ إِلَى الَّذِي حَدَّثَكُمْ فَإِنْ كَانَ حَقّاً فَلَكُمْ وَإِنْ كَانَ كَذِباً فَعَلَيْهِ‏.",
            "englishTranslation": "7. Ali ibn Ibrahim has narrated from his father from Ahmad ibn Muhammad ibn Khalid from al-Nawfali from al-Sakuni from abu ‘Abdallah  who has said the following. “When you would narrate Hadith you must say who its narrator is. If it would be true it will be for you and if it would be false it will be his responsibility.",
            "gradings": [
              {
                "grade": "ضعيف على المشهور",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/179)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #9",
            "url": "https://thaqalayn.net/hadith/1/2/17/9",
            "arabicText": "9ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ أَبِي بَصِيرٍ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) يَقُولُ اكْتُبُوا فَإِنَّكُمْ لا تَحْفَظُونَ حَتَّى تَكْتُبُوا.",
            "englishTranslation": "9. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from al-Hassan ibn Ali al-Washsha’ from ‘Asim ibn Humayd from abu Basir who has said the following. “(Imam) abu ‘Abdallah  said, ‘You must write down because you will not memorize until you write down.’”",
            "gradings": [
              {
                "grade": "ضعيف على المشهور",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/180)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #11",
            "url": "https://thaqalayn.net/hadith/1/2/17/11",
            "arabicText": "11ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ الْبَرْقِيِّ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي سَعِيدٍ الْخَيْبَرِيِّ عَنِ الْمُفَضَّلِ بْنِ عُمَرَ قَالَ قَالَ لِي أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) اكْتُبْ وَبُثَّ عِلْمَكَ فِي إِخْوَانِكَ فَإِنْ مِتَّ فَأَوْرِثْ كُتُبَكَ بَنِيكَ فَإِنَّهُ يَأْتِي عَلَى النَّاسِ زَمَانُ هَرْجٍ لا يَأْنَسُونَ فِيهِ إِلا بِكُتُبِهِمْ.",
            "englishTranslation": "11. A number of our people has narrated from Ahmad ibn Muhammad ibn Khalid al-Barqi from certain persons of his people from abu Sa‘id al-Khaybari from al-Mufaddal ibn ‘Umar who has said the following. “Abu ‘Abdallah  said, ‘You must write down (Hadith) and spread your knowledge among your brethren. If you will die your children will inherit your books. A time will come when people will face chaos and they will find no comfort but with their books.’”",
            "gradings": [
              {
                "grade": "ضعيف على المشهور",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (180/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #14",
            "url": "https://thaqalayn.net/hadith/1/2/17/14",
            "arabicText": "14ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ هِشَامِ بْنِ سَالِمٍ وَحَمَّادِ بْنِ عُثْمَانَ وَغَيْرِهِ قَالُوا سَمِعْنَا أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) يَقُولُ حَدِيثِي حَدِيثُ أَبِي وَحَدِيثُ أَبِي حَدِيثُ جَدِّي وَحَدِيثُ جَدِّي حَدِيثُ الْحُسَيْنِ وَحَدِيثُ الْحُسَيْنِ حَدِيثُ الْحَسَنِ وَحَدِيثُ الْحَسَنِ حَدِيثُ أَمِيرِ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) وَحَدِيثُ أَمِيرِ الْمُؤْمِنِينَ حَدِيثُ رَسُولِ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) وَحَدِيثُ رَسُولِ الله قَوْلُ الله عَزَّ وَجَلَّ.",
            "englishTranslation": "14. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad from ‘Umar ibn ’Abd al-‘Aziz from Hisham ibn Salim, Hammed ibn ‘Uthman and others who have said the following. “Abu ‘Abdallah  said, ‘My Hadith is the Hadith of my father. The Hadith of my father is the Hadith of my grandfather. The Hadith of my grandfather is the Hadith of Imam Husayn. The Hadith of Imam al-Husayn is the Hadith of Imam al- Hassan. The Hadith of Imam al-Hassan is the Hadith of Imam Ali . The Hadith of Imam Ali is the Hadith of the holy Prophet (s.a.) and the Hadith of the holy Prophet is the words of Allah, the Majestic, the Glorious.’”",
            "gradings": [
              {
                "grade": "ضعيف على المشهور",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/182)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "18": {
        "Al-Kafi - Volume 1: Chapter on Taqlid, following the opinions of someone": [
          {
            "number": "Hadith #2",
            "url": "https://thaqalayn.net/hadith/1/2/18/2",
            "arabicText": "2ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ الْهَمَذَانِيِّ عَنْ مُحَمَّدِ بْنِ عُبَيْدَةَ قَالَ قَالَ لِي أَبُو الْحَسَنِ (عَلَيْهِ السَّلام) يَا مُحَمَّدُ أَنْتُمْ أَشَدُّ تَقْلِيداً أَمِ الْمُرْجِئَةُ قَالَ قُلْتُ قَلَّدْنَا وَقَلَّدُوا فَقَالَ لَمْ أَسْأَلْكَ عَنْ هَذَا فَلَمْ يَكُنْ عِنْدِي جَوَابٌ أَكْثَرُ مِنَ الْجَوَابِ الاوَّلِ فَقَالَ أَبُو الْحَسَنِ (عَلَيْهِ السَّلام) إِنَّ الْمُرْجِئَةَ نَصَبَتْ رَجُلاً لَمْ تَفْرِضْ طَاعَتَهُ وَقَلَّدُوهُ وَأَنْتُمْ نَصَبْتُمْ رَجُلاً وَفَرَضْتُمْ طَاعَتَهُ ثُمَّ لَمْ تُقَلِّدُوهُ فَهُمْ أَشَدُّ مِنْكُمْ تَقْلِيداً.",
            "englishTranslation": "2. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Ibrahim ibn Muhammad al-Hamdani from Muhammad ibn ‘Ubayda who has said the following. “Abu al-Hassan  said, ‘O Muhammad, Do you observe Taqlid more strictly or the group of Murji’a?’ Muhammad ibn ‘ubaydah has said, “I replied, ‘They observe Taqlid and we observe Taqlid.’ The Imam then said, “I did not ask you about this.” I did not have any answer other than the first one. The Imam then said, “The group of Murji’a chose a man whose obedience was not obligatory (in the commands of Allah) but they obeyed and followed him strictly. You chose a man and considered obedience to him necessary (in commands from Allah) and then you did not follow him strictly, therefore, they are more strict in Taqlid, following than you are.”",
            "gradings": [
              {
                "grade": "ضعيف على المشهور",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/184)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "19": {
        "Al-Kafi - Volume 1: Chapter on Innovations, Personal Opinions and Analogies": [
          {
            "number": "Hadith #2",
            "url": "https://thaqalayn.net/hadith/1/2/19/2",
            "arabicText": "2ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ الْعَمِّيِّ يَرْفَعُهُ قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) إِذَا ظَهَرَتِ الْبِدَعُ فِي أُمَّتِي فَلْيُظْهِرِ الْعَالِمُ عِلْمَهُ فَمَنْ لَمْ يَفْعَلْ فَعَلَيْهِ لَعْنَةُ الله.",
            "englishTranslation": "2. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Muhammad ibn Jumhur al-‘Ammi in a marfu‘ manner (rafa ’ahu), from the Messenger of Allah who has said the following. “When innovations emerge it will be obligatory for the scholars to make their knowledge public, otherwise, Allah will condemn them.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (186/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #3",
            "url": "https://thaqalayn.net/hadith/1/2/19/3",
            "arabicText": "3ـ وَبِهَذَا الاسْنَادِ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ رَفَعَهُ قَالَ مَنْ أَتَى ذَا بِدْعَةٍ فَعَظَّمَهُ فَإِنَّمَا يَسْعَى فِي هَدْمِ الاسْلامِ.",
            "englishTranslation": "3. It is narrated through the same chain of narrators from Muhammad ibn Jumhur in a marfu’ manner from the Messenger of Allah who has said the following. “If one would meet an innovator and considers him great such person has, in fact, the destruction of Islam.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (186/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #4",
            "url": "https://thaqalayn.net/hadith/1/2/19/4",
            "arabicText": "4ـ وَبِهَذَا الاسْنَادِ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ رَفَعَهُ قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) أَبَى الله لِصَاحِبِ الْبِدْعَةِ بِالتَّوْبَةِ قِيلَ يَا رَسُولَ الله وَكَيْفَ ذَلِكَ قَالَ إِنَّهُ قَدْ أُشْرِبَ قَلْبُهُ حُبَّهَا.",
            "englishTranslation": "4. It is narrated through the same chain of narrators from Muhammad ibn Jumhur in a marfu’ manner from the Messenger of Allah who has said the following. “Allah has rejected repentance of an innovator (in religion).” People asked the holy Prophet as to why is this. The holy Prophet replied, “He (Allah) has quenched his heart with the love of his innovation.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/186)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #7",
            "url": "https://thaqalayn.net/hadith/1/2/19/7",
            "arabicText": "7ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ أَبِي شَيْبَةَ الْخُرَاسَانِيِّ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) يَقُولُ إِنَّ أَصْحَابَ الْمَقَايِيسِ طَلَبُوا الْعِلْمَ بِالْمَقَايِيسِ فَلَمْ تَزِدْهُمُ الْمَقَايِيسُ مِنَ الْحَقِّ إِلا بُعْداً وَإِنَّ دِينَ الله لا يُصَابُ بِالْمَقَايِيسِ.",
            "englishTranslation": "7. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from al-Hassan ibn Ali al-Washsha’ from Aban ibn ‘Uthman from abu Shaybah al-Khurasani who has said the following. “Abu ‘Abdallah  has said, ‘The people of analogy have sought knowledge through analogy and it has increased to their knowledge nothing but further remoteness. The religion of Allah is beyond the reach of analogy.’”",
            "gradings": [
              {
                "grade": "ضعيف على المشهور",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/192)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #17",
            "url": "https://thaqalayn.net/hadith/1/2/19/17",
            "arabicText": "17ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ مَسْعَدَةَ بْنِ صَدَقَةَ قَالَ حَدَّثَنِي جَعْفَرٌ عَنْ أَبِيهِ (عَلَيْهِ السَّلام) أَنَّ عَلِيّاً (صَلَّى اللهُ عَلَيْهِ وَآلِه) قَالَ مَنْ نَصَبَ نَفْسَهُ لِلْقِيَاسِ لَمْ يَزَلْ دَهْرَهُ فِي الْتِبَاسٍ وَمَنْ دَانَ الله بِالرَّأْيِ لَمْ يَزَلْ دَهْرَهُ فِي ارْتِمَاسٍ قَالَ وَقَالَ أَبُو جَعْفَرٍ (عَلَيْهِ السَّلام) مَنْ أَفْتَى النَّاسَ بِرَأْيِهِ فَقَدْ دَانَ الله بِمَا لا يَعْلَمُ وَمَنْ دَانَ الله بِمَا لا يَعْلَمُ فَقَدْ ضَادَّ الله حَيْثُ أَحَلَّ وَحَرَّمَ فِيمَا لا يَعْلَمُ.",
            "englishTranslation": "17. Ali ibn Ibrahim has narrated from Harun ibn Muslim from Mas‘ada ibn Sadaqa who has said the following. “(Imam) abu ‘Abdallah  who narrated from his father who said that Imam Ali  said, ‘Whoever sets out for analogy his whole life will get in confusion. Whoever would practice the religion of Allah by means of analogy his whole life will pass in a drowning condition.’” Imam abu Ja‘far  then said, “Whoever gives Fatwa on the basis of his personal opinion he has practiced the religion of Allah by means of what is not knowledge. Whoever would practice the religion of Allah without knowledge he has opposed Him by making things as lawful and unlawful by means of what he has no knowledge of.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (198/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #18",
            "url": "https://thaqalayn.net/hadith/1/2/19/18",
            "arabicText": "18ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ يَقْطِينٍ عَنِ الْحُسَيْنِ بْنِ مَيَّاحٍ عَنْ أَبِيهِ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ إِنَّ إِبْلِيسَ قَاسَ نَفْسَهُ بِ‏آدَمَ فَقَالَ خَلَقْتَنِي مِنْ نَارٍ وَخَلَقْتَهُ مِنْ طِينٍ وَلَوْ قَاسَ الْجَوْهَرَ الَّذِي خَلَقَ الله مِنْهُ آدَمَ بِالنَّارِ كَانَ ذَلِكَ أَكْثَرَ نُوراً وَضِيَاءً مِنَ النَّارِ.",
            "englishTranslation": "18. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Hassan ibn Ali ibn Yaqtin from al-Husayn ibn Mayyah from his father from abu ’Abdullah  who has said the following. “Satan analogized himself with Adam saying, “Lord, You have created me from fire and created him from clay. In an analogical explanation if the substance from which Adam was made would be compared with fire it would come to light that it has more light and value than fire.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/199)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "20": {
        "Al-Kafi - Volume 1: Chapter on the need to refer to the book and Sunnah": [
          {
            "number": "Hadith #1",
            "url": "https://thaqalayn.net/hadith/1/2/20/1",
            "arabicText": "1ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ حَدِيدٍ عَنْ مُرَازِمٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ إِنَّ الله تَبَارَكَ وَتَعَالَى أَنْزَلَ فِي الْقُرْآنِ تِبْيَانَ كُلِّ شَيْ‏ءٍ حَتَّى وَالله مَا تَرَكَ الله شَيْئاً يَحْتَاجُ إِلَيْهِ الْعِبَادُ حَتَّى لا يَسْتَطِيعَ عَبْدٌ يَقُولُ لَوْ كَانَ هَذَا أُنْزِلَ فِي الْقُرْآنِ إِلا وَقَدْ أَنْزَلَهُ الله فِيهِ.",
            "englishTranslation": "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn Hadid from Murazim from abu ‘Abdallah  who has said the following. “Allah, the Most holy, the Most High has certainly revealed an explanation for all things even, by Allah, He has not left untold anything that His servants would need up to the Day of Judgment. He has done so, so that people would not be able to say if only so and so would have been said in the Quran. The fact is that He has already said it in the holy Quran.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (202/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #2",
            "url": "https://thaqalayn.net/hadith/1/2/20/2",
            "arabicText": "2ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ حُسَيْنِ بْنِ الْمُنْذِرِ عَنْ عُمَرَ بْنِ قَيْسٍ عَنْ ابي جعفر (عَلَيْهِ السَّلام) قَالَ سَمِعْتُهُ يَقُولُ إِنَّ الله تَبَارَكَ وَتَعَالَى لَمْ يَدَعْ شَيْئاً يَحْتَاجُ إِلَيْهِ الامَّةُ إِلا أَنْزَلَهُ فِي كِتَابِهِ وَبَيَّنَهُ لِرَسُولِهِ (صَلَّى اللهُ عَلَيْهِ وَآلِه) وَجَعَلَ لِكُلِّ شَيْ‏ءٍ حَدّاً وَجَعَلَ عَلَيْهِ دَلِيلاً يَدُلُّ عَلَيْهِ وَجَعَلَ عَلَى مَنْ تَعَدَّى ذَلِكَ الْحَدَّ حَدّاً.",
            "englishTranslation": "2. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from Husayn ibn al-Mundhir from ‘Umar ibn Qays from abu Ja’far  who has said the following. “I heard Imam abu Ja‘far  saying, ‘Allah, the Most holy, the Most high, has not left untold anything that the ’ummah would need except that He has revealed in His book and has explained them to His messenger. He has made a limit for everything and an indication for it to point forwards to it and He has made a limit for those who would trespass those limits.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (203/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #5",
            "url": "https://thaqalayn.net/hadith/1/2/20/5",
            "arabicText": "5ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ حَمَّادٍ عَنْ عَبْدِ الله بْنِ سِنَانٍ عَنْ أَبِي الْجَارُودِ قَالَ قَالَ أَبُو جَعْفَرٍ (عَلَيْهِ السَّلام) إِذَا حَدَّثْتُكُمْ بِشَيْ‏ءٍ فَاسْأَلُونِي مِنْ كِتَابِ الله ثُمَّ قَالَ فِي بَعْضِ حَدِيثِهِ إِنَّ رَسُولَ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) نَهَى عَنِ الْقِيلِ وَالْقَالِ وَفَسَادِ الْمَالِ وَكَثْرَةِ السُّؤَالِ فَقِيلَ لَهُ يَا ابْنَ رَسُولِ الله أَيْنَ هَذَا مِنْ كِتَابِ الله قَالَ إِنَّ الله عَزَّ وَجَلَّ يَقُولُ لا خَيْرَ فِي كَثِيرٍ مِنْ نَجْواهُمْ إِلا مَنْ أَمَرَ بِصَدَقَةٍ أَوْ مَعْرُوفٍ أَوْ إِصْلاحٍ بَيْنَ النَّاسِ وَقَالَ وَلا تُؤْتُوا السُّفَهاءَ أَمْوالَكُمُ الَّتِي جَعَلَ الله لَكُمْ قِياماً وَقَالَ لا تَسْئَلُوا عَنْ أَشْياءَ إِنْ تُبْدَ لَكُمْ تَسُؤْكُمْ.",
            "englishTranslation": "5. Ali ibn Ibrahim has narrated from his father from Muhammad ibn ‘Isa from Yunus from Hammad from ’Abdallah ibn Sinan from abu al-Jarud who has said the following. “Abu Ja‘far  has said, ‘When you speak of anything ask me for its law in the book of Allah. He also has said in his Hadith, ‘The holy Prophet prohibited much squabbling and brawling, spoiling of property and much questionings.’” A person then asked, “O descendent of the holy Prophet, where is this in the holy Quran?” The Imam  replied, “Allah, the Most Glorious, the Most Majestic, says, ‘There is nothing good in much of their secret talks except for that which is for charity, justice, or for reconciliation among people to . (4:114) Do not give to people weak of understanding your property for which God has made you to supervise . (4:5) Believers, do not ask about things which, if revealed to you, would disappoint you . (5:101)”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/204)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #7",
            "url": "https://thaqalayn.net/hadith/1/2/20/7",
            "arabicText": "7ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ بَعْضِ أَصْحَابِهِ عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ مَسْعَدَةَ بْنِ صَدَقَةَ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) أَيُّهَا النَّاسُ إِنَّ الله تَبَارَكَ وَتَعَالَى أَرْسَلَ إِلَيْكُمُ الرَّسُولَ (صَلَّى اللهُ عَلَيْهِ وَآلِه) وَأَنْزَلَ إِلَيْهِ الْكِتَابَ بِالْحَقِّ وَأَنْتُمْ أُمِّيُّونَ عَنِ الْكِتَابِ وَمَنْ أَنْزَلَهُ وَعَنِ الرَّسُولِ وَمَنْ أَرْسَلَهُ عَلَى حِينِ فَتْرَةٍ مِنَ الرُّسُلِ وَطُولِ هَجْعَةٍ مِنَ الامَمِ وَانْبِسَاطٍ مِنَ الْجَهْلِ وَاعْتِرَاضٍ مِنَ الْفِتْنَةِ وَانْتِقَاضٍ مِنَ الْمُبْرَمِ وَعَمًى عَنِ الْحَقِّ وَاعْتِسَافٍ مِنَ الْجَوْرِ وَامْتِحَاقٍ مِنَ الدِّينِ وَتَلَظٍّ مِنَ الْحُرُوبِ عَلَى حِينِ اصْفِرَارٍ مِنْ رِيَاضِ جَنَّاتِ الدُّنْيَا وَيُبْسٍ مِنْ أَغْصَانِهَا وَانْتِثَارٍ مِنْ وَرَقِهَا وَيَأْسٍ مِنْ ثَمَرِهَا وَاغْوِرَارٍ مِنْ مَائِهَا قَدْ دَرَسَتْ أَعْلامُ الْهُدَى فَظَهَرَتْ أَعْلامُ الرَّدَى فَالدُّنْيَا مُتَهَجِّمَةٌ فِي وُجُوهِ أَهْلِهَا مُكْفَهِرَّةٌ مُدْبِرَةٌ غَيْرُ مُقْبِلَةٍ ثَمَرَتُهَا الْفِتْنَةُ وَطَعَامُهَا الْجِيفَةُ وَشِعَارُهَا الْخَوْفُ وَدِثَارُهَا السَّيْفُ مُزِّقْتُمْ كُلَّ مُمَزَّقٍ وَقَدْ أَعْمَتْ عُيُونَ أَهْلِهَا وَأَظْلَمَتْ عَلَيْهَا أَيَّامُهَا قَدْ قَطَّعُوا أَرْحَامَهُمْ وَسَفَكُوا دِمَاءَهُمْ وَدَفَنُوا فِي التُّرَابِ الْمَوْءُودَةَ بَيْنَهُمْ مِنْ أَوْلادِهِمْ يَجْتَازُ دُونَهُمْ طِيبُ الْعَيْشِ وَرَفَاهِيَةُ خُفُوضِ الدُّنْيَا لا يَرْجُونَ مِنَ الله ثَوَاباً وَلا يَخَافُونَ وَالله مِنْهُ عِقَاباً حَيُّهُمْ أَعْمَى نَجِسٌ وَمَيِّتُهُمْ فِي النَّارِ مُبْلَسٌ فَجَاءَهُمْ بِنُسْخَةِ مَا فِي الصُّحُفِ الاولَى وَتَصْدِيقِ الَّذِي بَيْنَ يَدَيْهِ وَتَفْصِيلِ الْحَلالِ مِنْ رَيْبِ الْحَرَامِ ذَلِكَ الْقُرْآنُ فَاسْتَنْطِقُوهُ وَلَنْ يَنْطِقَ لَكُمْ أُخْبِرُكُمْ عَنْهُ إِنَّ فِيهِ عِلْمَ مَا مَضَى وَعِلْمَ مَا يَأْتِي إِلَى يَوْمِ الْقِيَامَةِ وَحُكْمَ مَا بَيْنَكُمْ وَبَيَانَ مَا أَصْبَحْتُمْ فِيهِ تَخْتَلِفُونَ فَلَوْ سَأَلْتُمُونِي عَنْهُ لَعَلَّمْتُكُمْ.",
            "englishTranslation": "7. Muhammad ibn Yahya has narrated from certain persons of his people from Harun ibn Muslim from Mas‘ada ibn Sadaqa from abu ‘Abdallah  who has said the following. “Imam Ali  said, ‘O people, Allah, the Most Holy, the Most High, has sent to you the holy Prophet (s.a.) and gave him the book with truth while you all were illiterate (ignorant) about the book and the One Who revealed it and about the messenger and the One Who sent him in a period of time wherein no messenger had been sent, during a prolonged delinquency of the nations with wide spread ignorance, over-looming afflictions, the crumbling of the established social order, blindness towards the truth, the practice of injustice, the destruction of religion, the raging of wars, at the time of paling away of the gardens of the worldly life, the withering away of the branches therein, the scattering away of its protectors, the loss of hope of its fruits, the drying out of its waters and the decadence of its lighthouses. At such a period of time the elements of wickedness had been manifest everywhere. The world seemed aggressive, rough and frowning at the face of its inhabitants, regressing instead of helping to progress and with wicked fruits. Its food was but carrion, its slogan fear and the swords as overall garments. You were totally crushed and the eyes of the inhabitants of the world had turned blind, their days dark. They had boycotted their relatives, caused much bloodshed and buried their baby-girls alive, expecting thereby goodness of life and worldly tranquility. They would not cherish any hope in the rewards of Allah or preserve any fear of the punishment of Allah. Their living were blind and filthy and their dead in the fire in total despair. “At such time came to them a copy of what was in the ancient pages (of guidance) and a confirmation of what existed with them, containing a complete account of the lawful and unlawful matters. That is the holy Quran ask it for the answers but it will not speak to you. I can tell you about it. In it there is the knowledge of the past and the knowledge of what comes in the future up to the Day of Judgement. Therein is the rule (needed) among you and to settle your disputes that may arise therein.’”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/205)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "21": {
        "Al-Kafi - Volume 1: Chapter on the Differences in al-Hadith": [
          {
            "number": "Hadith #6",
            "url": "https://thaqalayn.net/hadith/1/2/21/6",
            "arabicText": "6ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ نَصْرٍ الْخَثْعَمِيِّ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) يَقُولُ مَنْ عَرَفَ أَنَّا لا نَقُولُ إِلا حَقّاً فَلْيَكْتَفِ بِمَا يَعْلَمُ مِنَّا فَإِنْ سَمِعَ مِنَّا خِلافَ مَا يَعْلَمُ فَلْيَعْلَمْ أَنَّ ذَلِكَ دِفَاعٌ مِنَّا عَنْهُ.",
            "englishTranslation": "6. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Sinan from Nasr al-Kath‘ami who has said the following. “Abu ‘Abdallah  has said, ‘Those who know that we say nothing but the truth what they know from us should consider it sufficient. If they would hear from us what is different from what they already know from us they should note that it is our way of defending them.’”",
            "gradings": [
              {
                "grade": "ضعيف على المشهور",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/117)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "22": {
        "Al-Kafi - Volume 1: Chapter on Following the Sunnah and Evidence of the Book": [
          {
            "number": "Hadith #1",
            "url": "https://thaqalayn.net/hadith/1/2/22/1",
            "arabicText": "1ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ قَالَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) إِنَّ عَلَى كُلِّ حَقٍّ حَقِيقَةً وَعَلَى كُلِّ صَوَابٍ نُوراً فَمَا وَافَقَ كِتَابَ الله فَخُذُوهُ وَمَا خَالَفَ كِتَابَ الله فَدَعُوهُ.",
            "englishTranslation": "1. Ali ibn Ibrahim has narrated from his father from al-Nawfali from al-Sakuni from abu ‘Abdallah  who has said the following. “The holy Prophet (s.a.), “Over every truth there is a reality and above every valid issue there is light. Whatever agrees with the holy Quran you must follow it and whatever does not agree disregard it.”",
            "gradings": [
              {
                "grade": "ضعيف على المشهور",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (227/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #10",
            "url": "https://thaqalayn.net/hadith/1/2/22/10",
            "arabicText": "10ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ النَّضْرِ عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ ابي جعفر (عَلَيْهِ السَّلام) قَالَ قَالَ مَا مِنْ أَحَدٍ إِلا وَلَهُ شِرَّةٌ وَفَتْرَةٌ فَمَنْ كَانَتْ فَتْرَتُهُ إِلَى سُنَّةٍ فَقَدِ اهْتَدَى وَمَنْ كَانَتْ فَتْرَتُهُ إِلَى بِدْعَةٍ فَقَدْ غَوَى.",
            "englishTranslation": "10. Ali ibn Ibrahim has narrated from his father from Ahmad ibn al-Nadr from ‘Amr ibn Shimr from Jabir from abu Ja’far  who has said the following. “There is no one without excitement and calmness. Whoever’s calmness would lead him towards the Sunnah, noble traditions of the holy prophet (s.a.), he is rightly guided but if it would lead him towards innovations then he has gone astray.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (231/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #11",
            "url": "https://thaqalayn.net/hadith/1/2/22/11",
            "arabicText": "11ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ عَنْ عَلِيِّ بْنِ حَسَّانَ وَمُحَمَّدُ بْنُ يَحْيَى عَنْ سَلَمَةَ بْنِ الْخَطَّابِ عَنْ عَلِيِّ بْنِ حَسَّانَ عَنْ مُوسَى بْنِ بَكْرٍ عَنْ زُرَارَةَ بْنِ أَعْيَنَ عَنْ ابي جعفر (عَلَيْهِ السَّلام) قَالَ كُلُّ مَنْ تَعَدَّى السُّنَّةَ رُدَّ إِلَى السُّنَّةِ.",
            "englishTranslation": "11. Ali ibn Muhammad has narrated from Ahmad ibn Muhammad al-Barqi from Ali ibn Hassa’n and Muhammad ibn Yahya from Salama ibn al-Khattab from Ali ibn Hassa’n from Musa ibn Bakr from Zurara ibn A‘yan from abu Ja’far  who has said the following. “Whoever may transgress against the Sunnah, noble traditions of the holy Prophet (s.a.), he must return to the Sunnah.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/232)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #12",
            "url": "https://thaqalayn.net/hadith/1/2/22/12",
            "arabicText": "12ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ الله عَنْ آبَائِهِ (عَلَيْهم السَّلام) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) السُّنَّةُ سُنَّتَانِ سُنَّةٌ فِي فَرِيضَةٍ الاخْذُ بِهَا هُدًى وَتَرْكُهَا ضَلالَةٌ وَسُنَّةٌ فِي غَيْرِ فَرِيضَةٍ الاخْذُ بِهَا فَضِيلَةٌ وَتَرْكُهَا إِلَى غَيْرِ خَطِيئَةٍ.",
            "englishTranslation": "12. Ali ibn Ibrahim has narrated from his father from al-Nawfali from al-Sakuni from abu ‘Abdallah from his ancestors (the Imams  who have said the following.\r\n\r\n“Imam Ali  said, ‘There are two kinds of Sunnah, (traditions). There is a Sunnah in obligations and following such Sunnah is guidance and its disregard is misguidance. There is a Sunnah, (tradition), in none obligatory issue. The following of this kind of Sunnah is a virtuous deed and its disregard for other matters is a sin.’”",
            "gradings": [
              {
                "grade": "ضعيف على المشهور",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/232)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      }
    },
    "3": {
      "1": {
        "Al-Kafi - Volume 1: Chapter on Contingency of the Universe and Proof of the Existence of its Creator": [
          {
            "number": "Hadith #2",
            "url": "https://thaqalayn.net/hadith/1/3/1/2",
            "arabicText": "2ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مُحَمَّدِ بْنِ أَبِي هَاشِمٍ عَنْ أَحْمَدَ بْنِ مُحَسِّنٍ الْمِيثَمِيِّ قَالَ كُنْتُ عِنْدَ أَبِي مَنْصُورٍ الْمُتَطَبِّبِ فَقَالَ أَخْبَرَنِي رَجُلٌ مِنْ أَصْحَابِي قَالَ كُنْتُ أَنَا وَابْنُ أَبِي الْعَوْجَاءِ وَعَبْدُ الله بْنُ الْمُقَفَّعِ فِي الْمَسْجِدِ الْحَرَامِ فَقَالَ ابْنُ الْمُقَفَّعِ تَرَوْنَ هَذَا الْخَلْقَ وَأَوْمَأَ بِيَدِهِ إِلَى مَوْضِعِ الطَّوَافِ مَا مِنْهُمْ أَحَدٌ أُوجِبُ لَهُ اسْمَ الانْسَانِيَّةِ إِلا ذَلِكَ الشَّيْخُ الْجَالِسُ يَعْنِي أَبَا عَبْدِ الله جَعْفَرَ بْنَ مُحَمَّدٍ (عَلَيْهما السَّلام) فَأَمَّا الْبَاقُونَ فَرَعَاعٌ وَبَهَائِمُ فَقَالَ لَهُ ابْنُ أَبِي الْعَوْجَاءِ وَكَيْفَ أَوْجَبْتَ هَذَا الاسْمَ لِهَذَا الشَّيْخِ دُونَ هَؤُلاءِ قَالَ لانِّي رَأَيْتُ عِنْدَهُ مَا لَمْ أَرَهُ عِنْدَهُمْ فَقَالَ لَهُ ابْنُ أَبِي الْعَوْجَاءِ لا بُدَّ مِنِ اخْتِبَارِ مَا قُلْتَ فِيهِ مِنْهُ قَالَ فَقَالَ لَهُ ابْنُ الْمُقَفَّعِ لا تَفْعَلْ فَإِنِّي أَخَافُ أَنْ يُفْسِدَ عَلَيْكَ مَا فِي يَدِكَ فَقَالَ لَيْسَ ذَا رَأْيَكَ وَلَكِنْ تَخَافُ أَنْ يَضْعُفَ رَأْيُكَ عِنْدِي فِي إِحْلالِكَ إِيَّاهُ الْمَحَلَّ الَّذِي وَصَفْتَ فَقَالَ ابْنُ الْمُقَفَّعِ أَمَّا إِذَا تَوَهَّمْتَ عَلَيَّ هَذَا فَقُمْ إِلَيْهِ وَتَحَفَّظْ مَا اسْتَطَعْتَ مِنَ الزَّلَلِ وَلا تَثْنِي عِنَانَكَ إِلَى اسْتِرْسَالٍ فَيُسَلِّمَكَ إِلَى عِقَالٍ وَسِمْهُ مَا لَكَ أَوْ عَلَيْكَ قَالَ فَقَامَ ابْنُ أَبِي الْعَوْجَاءِ وَبَقِيتُ أَنَا وَابْنُ الْمُقَفَّعِ جَالِسَيْنِ فَلَمَّا رَجَعَ إِلَيْنَا ابْنُ أَبِي الْعَوْجَاءِ قَالَ وَيْلَكَ يَا ابْنَ الْمُقَفَّعِ مَا هَذَا بِبَشَرٍ وَإِنْ كَانَ فِي الدُّنْيَا رُوحَانِيٌّ يَتَجَسَّدُ إِذَا شَاءَ ظَاهِراً وَيَتَرَوَّحُ إِذَا شَاءَ بَاطِناً فَهُوَ هَذَا فَقَالَ لَهُ وَكَيْفَ ذَلِكَ قَالَ جَلَسْتُ إِلَيْهِ فَلَمَّا لَمْ يَبْقَ عِنْدَهُ غَيْرِي ابْتَدَأَنِي فَقَالَ إِنْ يَكُنِ الامْرُ عَلَى مَا يَقُولُ هَؤُلاءِ وَهُوَ عَلَى مَا يَقُولُونَ يَعْنِي أَهْلَ الطَّوَافِ فَقَدْ سَلِمُوا وَعَطِبْتُمْ وَإِنْ يَكُنِ الامْرُ عَلَى مَا تَقُولُونَ وَلَيْسَ كَمَا تَقُولُونَ فَقَدِ اسْتَوَيْتُمْ وَهُمْ فَقُلْتُ لَهُ يَرْحَمُكَ الله وَأَيَّ شَيْ‏ءٍ نَقُولُ وَأَيَّ شَيْ‏ءٍ يَقُولُونَ مَا قَوْلِي وَقَوْلُهُمْ إِلا وَاحِدٌ فَقَالَ وَكَيْفَ يَكُونُ قَوْلُكَ وَقَوْلُهُمْ وَاحِداً وَهُمْ يَقُولُونَ إِنَّ لَهُمْ مَعَاداً وَثَوَاباً وَعِقَاباً وَيَدِينُونَ بِأَنَّ فِي السَّمَاءِ إِلَهاً وَأَنَّهَا عُمْرَانٌ وَأَنْتُمْ تَزْعُمُونَ أَنَّ السَّمَاءَ خَرَابٌ لَيْسَ فِيهَا أَحَدٌ قَالَ فَاغْتَنَمْتُهَا مِنْهُ فَقُلْتُ لَهُ مَا مَنَعَهُ إِنْ كَانَ الامْرُ كَمَا يَقُولُونَ أَنْ يَظْهَرَ لِخَلْقِهِ وَيَدْعُوَهُمْ إِلَى عِبَادَتِهِ حَتَّى لا يَخْتَلِفَ مِنْهُمُ اثْنَانِ وَلِمَ احْتَجَبَ عَنْهُمْ وَأَرْسَلَ إِلَيْهِمُ الرُّسُلَ وَلَوْ بَاشَرَهُمْ بِنَفْسِهِ كَانَ أَقْرَبَ إِلَى الايمَانِ بِهِ فَقَالَ لِي وَيْلَكَ وَكَيْفَ احْتَجَبَ عَنْكَ مَنْ أَرَاكَ قُدْرَتَهُ فِي نَفْسِكَ نُشُوءَكَ وَلَمْ تَكُنْ وَكِبَرَكَ بَعْدَ صِغَرِكَ وَقُوَّتَكَ بَعْدَ ضَعْفِكَ وَضَعْفَكَ بَعْدَ قُوَّتِكَ وَسُقْمَكَ بَعْدَ صِحَّتِكَ وَصِحَّتَكَ بَعْدَ سُقْمِكَ وَرِضَاكَ بَعْدَ غَضَبِكَ وَغَضَبَكَ بَعْدَ رِضَاكَ وَحُزْنَكَ  بَعْدَ فَرَحِكَ وَفَرَحَكَ بَعْدَ حُزْنِكَ وَحُبَّكَ بَعْدَ بُغْضِكَ وَبُغْضَكَ بَعْدَ حُبِّكَ وَعَزْمَكَ بَعْدَ أَنَاتِكَ وَأَنَاتَكَ بَعْدَ عَزْمِكَ وَشَهْوَتَكَ بَعْدَ كَرَاهَتِكَ وَكَرَاهَتَكَ بَعْدَ شَهْوَتِكَ وَرَغْبَتَكَ بَعْدَ رَهْبَتِكَ وَرَهْبَتَكَ بَعْدَ رَغْبَتِكَ وَرَجَاءَكَ بَعْدَ يَأْسِكَ وَيَأْسَكَ بَعْدَ رَجَائِكَ وَخَاطِرَكَ بِمَا لَمْ يَكُنْ فِي وَهْمِكَ وَعُزُوبَ مَا أَنْتَ مُعْتَقِدُهُ عَنْ ذِهْنِكَ وَمَا زَالَ يُعَدِّدُ عَلَيَّ قُدْرَتَهُ الَّتِي هِيَ فِي نَفْسِي الَّتِي لا أَدْفَعُهَا حَتَّى ظَنَنْتُ أَنَّهُ سَيَظْهَرُ فِيمَا بَيْنِي وَبَيْنَهُ عَنْهُ عَنْ بَعْضِ أَصْحَابِنَا رَفَعَهُ وَزَادَ فِي حَدِيثِ ابْنِ أَبِي الْعَوْجَاءِ حِينَ سَأَلَهُ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ عَادَ ابْنُ أَبِي الْعَوْجَاءِ فِي الْيَوْمِ الثَّانِي إِلَى مَجْلِسِ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) فَجَلَسَ وَهُوَ سَاكِتٌ لا يَنْطِقُ فَقَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) كَأَنَّكَ جِئْتَ تُعِيدُ بَعْضَ مَا كُنَّا فِيهِ فَقَالَ أَرَدْتُ ذَلِكَ يَا ابْنَ رَسُولِ الله فَقَالَ لَهُ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) مَا أَعْجَبَ هَذَا تُنْكِرُ الله وَتَشْهَدُ أَنِّي ابْنُ رَسُولِ الله فَقَالَ الْعَادَةُ تَحْمِلُنِي عَلَى ذَلِكَ فَقَالَ لَهُ الْعَالِمُ (عَلَيْهِ السَّلام) فَمَا يَمْنَعُكَ مِنَ الْكَلامِ قَالَ إِجْلالاً لَكَ وَمَهَابَةً مَا يَنْطَلِقُ لِسَانِي بَيْنَ يَدَيْكَ فَإِنِّي شَاهَدْتُ الْعُلَمَاءَ وَنَاظَرْتُ الْمُتَكَلِّمِينَ فَمَا تَدَاخَلَنِي هَيْبَةٌ قَطُّ مِثْلُ مَا تَدَاخَلَنِي مِنْ هَيْبَتِكَ قَالَ يَكُونُ ذَلِكَ وَلَكِنْ أَفْتَحُ عَلَيْكَ بِسُؤَالٍ وَأَقْبَلَ عَلَيْهِ فَقَالَ لَهُ أَ مَصْنُوعٌ أَنْتَ أَوْ غَيْرُ مَصْنُوعٍ فَقَالَ عَبْدُ الْكَرِيمِ بْنُ أَبِي الْعَوْجَاءِ بَلْ أَنَا غَيْرُ مَصْنُوعٍ فَقَالَ لَهُ الْعَالِمُ (عَلَيْهِ السَّلام) فَصِفْ لِي لَوْ كُنْتَ مَصْنُوعاً كَيْفَ كُنْتَ تَكُونُ فَبَقِيَ عَبْدُ الْكَرِيمِ مَلِيّاً لا يُحِيرُ جَوَاباً وَوَلَعَ بِخَشَبَةٍ كَانَتْ بَيْنَ يَدَيْهِ وَهُوَ يَقُولُ طَوِيلٌ عَرِيضٌ عَمِيقٌ قَصِيرٌ مُتَحَرِّكٌ سَاكِنٌ كُلُّ ذَلِكَ صِفَةُ خَلْقِهِ فَقَالَ لَهُ الْعَالِمُ فَإِنْ كُنْتَ لَمْ تَعْلَمْ صِفَةَ الصَّنْعَةِ غَيْرَهَا فَاجْعَلْ نَفْسَكَ مَصْنُوعاً لِمَا تَجِدُ فِي نَفْسِكَ مِمَّا يَحْدُثُ مِنْ هَذِهِ الامُورِ فَقَالَ لَهُ عَبْدُ الْكَرِيمِ سَأَلْتَنِي عَنْ مَسْأَلَةٍ لَمْ يَسْأَلْنِي عَنْهَا أَحَدٌ قَبْلَكَ وَلا يَسْأَلُنِي أَحَدٌ بَعْدَكَ عَنْ مِثْلِهَا فَقَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) هَبْكَ عَلِمْتَ أَنَّكَ لَمْ تُسْأَلْ فِيمَا مَضَى فَمَا عَلَّمَكَ أَنَّكَ لا تُسْأَلُ فِيمَا بَعْدُ عَلَى أَنَّكَ يَا عَبْدَ الْكَرِيمِ نَقَضْتَ قَوْلَكَ لانَّكَ تَزْعُمُ أَنَّ الاشْيَاءَ مِنَ الاوَّلِ سَوَاءٌ فَكَيْفَ قَدَّمْتَ وَأَخَّرْتَ ثُمَّ قَالَ يَا عَبْدَ الْكَرِيمِ أَزِيدُكَ وُضُوحاً أَ رَأَيْتَ لَوْ كَانَ مَعَكَ كِيسٌ فِيهِ جَوَاهِرُ فَقَالَ لَكَ قَائِلٌ هَلْ فِي الْكِيسِ دِينَارٌ فَنَفَيْتَ كَوْنَ الدِّينَارِ فِي الْكِيسِ فَقَالَ لَكَ صِفْ لِيَ الدِّينَارَ وَكُنْتَ غَيْرَ عَالِمٍ بِصِفَتِهِ هَلْ كَانَ لَكَ أَنْ تَنْفِيَ كَوْنَ الدِّينَارِ عَنِ الْكِيسِ وَأَنْتَ لا تَعْلَمُ قَالَ لا فَقَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) فَالْعَالَمُ أَكْبَرُ وَأَطْوَلُ وَأَعْرَضُ مِنَ الْكِيسِ فَلَعَلَّ فِي الْعَالَمِ صَنْعَةً مِنْ حَيْثُ لا تَعْلَمُ صِفَةَ الصَّنْعَةِ مِنْ غَيْرِ الصَّنْعَةِ فَانْقَطَعَ عَبْدُ الْكَرِيمِ وَأَجَابَ إِلَى الاسْلامِ بَعْضُ أَصْحَابِهِ وَبَقِيَ مَعَهُ بَعْضٌ فَعَادَ فِي الْيَوْمِ الثَّالِثِ فَقَالَ أَقْلِبُ السُّؤَالَ فَقَالَ لَهُ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) سَلْ عَمَّا شِئْتَ فَقَالَ مَا الدَّلِيلُ عَلَى حَدَثِ الاجْسَامِ فَقَالَ إِنِّي مَا وَجَدْتُ شَيْئاً صَغِيراً وَلا كَبِيراً إِلا وَإِذَا ضُمَّ إِلَيْهِ مِثْلُهُ صَارَ أَكْبَرَ وَفِي ذَلِكَ زَوَالٌ وَانْتِقَالٌ عَنِ الْحَالَةِ الاولَى وَلَوْ كَانَ قَدِيماً مَا زَالَ وَلا حَالَ لانَّ الَّذِي يَزُولُ وَيَحُولُ يَجُوزُ أَنْ يُوجَدَ وَيُبْطَلَ فَيَكُونُ بِوُجُودِهِ بَعْدَ عَدَمِهِ دُخُولٌ فِي الْحَدَثِ وَفِي كَوْنِهِ فِي الازَلِ دُخُولُهُ فِي الْعَدَمِ وَلَنْ تَجْتَمِعَ صِفَةُ الازَلِ وَالْعَدَمِ وَالْحُدُوثِ وَالْقِدَمِ فِي شَيْ‏ءٍ وَاحِدٍ فَقَالَ عَبْدُ الْكَرِيمِ هَبْكَ عَلِمْتَ فِي جَرْيِ الْحَالَتَيْنِ وَالزَّمَانَيْنِ عَلَى مَا ذَكَرْتَ وَاسْتَدْلَلْتَ بِذَلِكَ عَلَى حُدُوثِهِا فَلَوْ بَقِيَتِ الاشْيَاءُ عَلَى صِغَرِهَا مِنْ أَيْنَ كَانَ لَكَ أَنْ تَسْتَدِلَّ عَلَى حُدُوثِهِنَّ فَقَالَ الْعَالِمُ (عَلَيْهِ السَّلام) إِنَّمَا نَتَكَلَّمُ عَلَى هَذَا الْعَالَمِ الْمَوْضُوعِ فَلَوْ رَفَعْنَاهُ وَوَضَعْنَا عَالَماً آخَرَ كَانَ لا شَيْ‏ءَ أَدَلَّ عَلَى الْحَدَثِ مِنْ رَفْعِنَا إِيَّاهُ وَوَضْعِنَا غَيْرَهُ وَلَكِنْ أُجِيبُكَ مِنْ حَيْثُ قَدَّرْتَ أَنْ تُلْزِمَنَا فَنَقُولُ إِنَّ الاشْيَاءَ لَوْ دَامَتْ عَلَى صِغَرِهَا لَكَانَ فِي الْوَهْمِ أَنَّهُ مَتَى ضُمَّ شَيْ‏ءٌ إِلَى مِثْلِهِ كَانَ أَكْبَرَ وَفِي جَوَازِ التَّغْيِيرِ عَلَيْهِ خُرُوجُهُ مِنَ الْقِدَمِ كَمَا أَنَّ فِي تَغْيِيرِهِ دُخُولَهُ فِي الْحَدَثِ لَيْسَ لَكَ وَرَاءَهُ شَيْ‏ءٌ يَا عَبْدَ الْكَرِيمِ فَانْقَطَعَ وَخُزِيَ فَلَمَّا كَانَ مِنَ الْعَامِ الْقَابِلِ الْتَقَى مَعَهُ فِي الْحَرَمِ فَقَالَ لَهُ بَعْضُ شِيعَتِهِ إِنَّ ابْنَ أَبِي الْعَوْجَاءِ قَدْ أَسْلَمَ فَقَالَ الْعَالِمُ (عَلَيْهِ السَّلام) هُوَ أَعْمَى مِنْ ذَلِكَ لا يُسْلِمُ فَلَمَّا بَصُرَ بِالْعَالِمِ  قَالَ سَيِّدِي وَمَوْلايَ فَقَالَ لَهُ الْعَالِمُ (عَلَيْهِ السَّلام) مَا جَاءَ بِكَ إِلَى هَذَا الْمَوْضِعِ فَقَالَ عَادَةُ الْجَسَدِ وَسُنَّةُ الْبَلَدِ وَلِنَنْظُرَ مَا النَّاسُ فِيهِ مِنَ الْجُنُونِ وَالْحَلْقِ وَرَمْيِ الْحِجَارَةِ فَقَالَ لَهُ الْعَالِمُ (عَلَيْهِ السَّلام) أَنْتَ بَعْدُ عَلَى عُتُوِّكَ وَضَلالِكَ يَا عَبْدَ الْكَرِيمِ فَذَهَبَ يَتَكَلَّمُ فَقَالَ لَهُ (عَلَيْهِ السَّلام) لا جِدَالَ فِي الْحَجِّ وَنَفَضَ رِدَاءَهُ مِنْ يَدِهِ وَقَالَ إِنْ يَكُنِ الامْرُ كَمَا تَقُولُ وَلَيْسَ كَمَا تَقُولُ نَجَوْنَا وَنَجَوْتَ وَإِنْ يَكُنِ الامْرُ كَمَا نَقُولُ وَهُوَ كَمَا نَقُولُ نَجَوْنَا وَهَلَكْتَ فَأَقْبَلَ عَبْدُ الْكَرِيمِ عَلَى مَنْ مَعَهُ فَقَالَ وَجَدْتُ فِي قَلْبِي حَزَازَةً فَرُدُّونِي فَرَدُّوهُ فَمَاتَ لا رَحِمَهُ الله.",
            "englishTranslation": "2. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from Muhammad ibn Ali from ‘Abd al-Rahman ibn Muhammad ibn abu Hashim from Ahmad ibn Muhsin al-Maythami who said that I was with abu Mansur al-Mutatbbib who said the following. “One of my friends has said that he was with ibn abu al-‘Awja’ and ‘Abdallah ibn al-Muqaffa‘ in the holy Mosque of Makkah and ibn al-Muqaffa‘ said, “Do you see these creatures, pointing towards the location where people walk seven times around the Kabah‘? Of all these no one deserves to be called a human being accept that Shaikh sitting there, meaning thereby Imam abu ‘Abdallah . The rest is garble and beasts.” Upon this ibn abu al-‘Awja’ said, “For what reason do you call him a human being and not the rest?” Ibn al-Muqaffa‘ then replied, “Because I saw with him what I did not see with the others.” Ibn abu al-”Awja’ then said, “We must test your claim.” Ibn al-Muqaffa‘ then said, “I advise you not to do so lest you will lose whatever faith you have. Ibn abu al-‘Awja’ then said, “I do not think that is what you mean. I think you are afraid of failing to substantiate what you have just said about this man.” Ibn al-Muqaffa‘ then said, “If that is what you think then go to him and protect yourself as much as you can. Be strong as much as you can so you are not harnnessed and note all points against and in your favor. Ibn abu al-‘Awja’ then left and ibn al-Muqaffa‘ and I remained there. When ibn abu al-‘Awja’ returned he said, “Woe is you, O ibn al-Muqaffa‘. This is not a human being even though he lives in this world. He is a spiritual being but appears in the form of man whenever he wants the out world and turns into a spiritual being whenever he wants the inner world. That is the way he is.” Ibn al-Muqaffa‘ then asked, “How does that happen?” Ibn abu al-‘Awja’ then said, “I sat near him and when everyone had gone he turned to me and said, “If it is the way they (people walking around the Ka‘bah) say, which is true then they are saved and you are destroyed. If it is the way you say it is, which is not so then you and they are all equal.” I then asked, “May Allah be kind to you. What is it that we say and what is it that they say? We all say the same thing.” He said, “How can what you say be equal to what they say? They say that they will have a return, a day of receiving their rewards and penalties. They believe in a religion which says that in the heavens is the Lord and that they are habitable while you say that they are in ruins and there is nothing in them.”Ibn abu al-‘Awja’ has said, “I then found the opportunity to speak and I asked, “What then keeps this Lord, if it is true the way they say that He exists, from appearing to His creatures and call them to His worship so that no two people would oppose each other? Why is He hiding from them and has only sent messengers? If He would have been in direct contact with them it would have been more helpful to have faith in Him.” He then responded, “Woe is you, how someone who is already shown His power within you is hiding from you? He brought you up. You did not even exist. He made you grow when you were so small. He gave you strength and power when you were so weak and will make you weak again after being strong. He make you sick after being healthy and can give you good health after suffering sickness. He can make you happy after you experience anger and make you angry after being happy. He can make you sad after your joy and give you joy after sadness. He can give love after your experiencing hatred and hatred after enjoying love. He can give you determination after your uncertainty and uncertainty after having determination. He can give you strong desires after your experiencing dislike and dislike after having strong desires. He can give you willingness after experiencing fear and concerns and fear after having strong willingness. He can give you hope after despair and despair after having a great deal of hope. He can give you good remembrance of what you had no idea and remove what you may have had as a belief.” He kept reminding and counting for me the effects of His power within my soul that I could not deny and I begin to have a feeling that all that is between me and him will all appear in the open.” From the same source the following is narrated from a number of our people in a Marfu‘ manner as additional statements to the above discourse of ibn abu al-‘Awja’ with Imam abu ‘Abdallah . That abu al-‘Awja’ came the next day to the meeting of the Imam and sat down quietly. The Imam  said to him, “Would you like to review the issues we discussed yesterday?” He replied, “I did intend to do so, O son of the messenger of Allah.” The Imam then said, “It is strange that one who does not believe in Allah acknowledges the existence of the messenger of Allah.” He replied, “It is only the habit that made me say so.” The ‘Alim (the Imam) then asked, “What is it that keeps you quite?” He replied, “It is your excellence and awesome spiritual ability that hold my tongue back from speaking. I have seen many scholars and have debated many theologians but I never experienced such an awesome feeling from them as I feel in your presence.” The Imam then said, “ It may happen. I would like to open this session with a question to you. The Imam turned to him and asked, “Are you created or uncreated?” ‘Abdul Karim ibn abu al-‘Awja’ answered, “ I am uncreated.” The ‘Alim then asked him, “Describe for us then, how you might have been if you were created.” ‘Abdal Karim remained quiet and confused and began to scribble scrabble with a piece of wood, saying, long, wide, deep, short, moving and motionless all these are the qualities of His creatures.” The ‘Alim (Imam) then said, “If you do not know anything other than these as the qualities of the creation then consider yourself a creature because that is what you find within yourself that take place and come into existence.” ‘Abdal Karim then said, “You have asked me a question that no one before had ever asked and no one ever would ask afterwards.” Abu ‘Abdallah then said, “It is fine. I noticed that you did not ask any thing in the time past but how would you know that you will not ask any thing in future? Besides, O ‘Abdal Karim, what you said is against your notion that from the beginning all things are equal. How then you made them before and after? The Imam then said, “O ‘Abdal Karim let me explain it for you. Suppose if you had a bag with you full of pearls and someone asked you, “Is there a Dinar in your bag?” You then denied and said, “No, there is no Dinar in my bag.” The person then said, “Alright, then describe for me the qualities of the Dinar but you had no knowledge of the qualities of the Dinar. Could you deny the existence of the Dinar that was from the bag but you did not know about it?” he replied, “No, I would not deny.” The Imam then said, “The world is bigger, taller and wider than a bag. Perhaps in the world there is a creature as such that you do not know in whose case you would not be able to tell the qualities of the created from the non-created.” ‘Abdal Karim remained quiet but some of his people agreed to accept Islam and a few of them remained. He came again to the meeting of the Imam on the third day and said, “I like to reverse the question.” The Imam replied, “Ask whatever you like.” He then asked, “What is the proof that bodies did not exist and then they came into existence?” The Imam then said, “I have not seen anything small or large that on adding to it something of the same size would not make it bigger and in this there is a change and transformation from the first condition. If it, however, would have been eternal, there would have been no changing and transformation. What may cease to exist or change it may come into existence and may get destroyed, thus, with its existence after its none existence is entering into the state of coming into being and as being eternal this will take it into nothingness but the two qualities of being eternal and nothingness and the qualities of a contingent and something without a beginning in one thing do come together.” ‘Abdal Karim then said, “Suppose, I noticed that with a view to the two conditions you mentioned you considered it a proof of their contingency. If, however, things would remain small, despite the addition, then how would you prove their contingency?” The ‘Alim then said, “We speak of this universe that is already there. Were we to take it away and place another universe in its place nothingness would have, certainly, been a stronger proof of its contingency than its removal and its replacing with a different one. I, however, will answer you according to your assumption. If things would still remain small but it would certainly come into one’s thinking that whenever something like it added to another thing it then would be bigger. The fact that it can change is proof of its becoming temporal and in its changing condition is proof of its contingency. There is nothing beyond it for you, O ‘Abdal Karim. ‘Abdal Karim had nothing else to say. Next year he met the Imam  in Makkah again and people from his followers said that ‘Abdal Karim has become a Muslim. The Imam told him that ‘Abdal Karim was blind in this matter and would not become a Muslim. When he saw the ‘Alim he said, “My master, my chief!” The ‘Alim then asked him, “What brings you here?” He then replied, “It is the habits of the body and the traditions of the town to see what craziness makes them shave and throw pebbles.” The ‘Alim said, “It seems that you still live in your arrogance and misguidance, O ‘Abdal Karim.” He began to speak but the Imam said, “Disputation during Hajj is not permissible. The Imam freed his gown from the hand of the heretic man and said, “If it is the way you say and it is not true, then we as well as you are all saved. However, if it is the way we say and it is true we are saved but you are destroyed.” ‘Abdal Karim then turned to his people saying, “I feel pain in my heart. Take me back. They took him away and he died.",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/244)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "2": {
        "Al-Kafi - Volume 1: Chapter on Can Allah (God) be Considered a Thing?": [
          {
            "number": "Hadith #2",
            "url": "https://thaqalayn.net/hadith/1/3/2/2",
            "arabicText": "2ـ مُحَمَّدُ بْنُ أَبِي عَبْدِ الله عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنِ الْحُسَيْنِ بْنِ الْحَسَنِ عَنْ بَكْرِ بْنِ صَالِحٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ قَالَ سُئِلَ أَبُو جَعْفَرٍ الثَّانِي (عَلَيْهِ السَّلام) يَجُوزُ أَنْ يُقَالَ لله إِنَّهُ شَيْ‏ءٌ قَالَ نَعَمْ يُخْرِجُهُ مِنَ الْحَدَّيْنِ حَدِّ التَّعْطِيلِ وَحَدِّ التَّشْبِيهِ.",
            "englishTranslation": "2. Muhammad ibn ‘Abdallah has narrated from Muhammad ibn Isma‘il from al-Husayn ibn al-Hassan from Bakr ibn Salih from al-Husayn ibn Sa‘id who said that I asked Imam abu Ja‘far, the second  the following. “Is it permissible to say that Allah is a thing?” The Imam replied, “Yes, because it removes two kinds of limitations, the limitation of being forgotten altogether and that of considering Him like other things.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (282/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "4": {
        "Al-Kafi - Volume 1: Chapter on the minimum degree of knowledge of the existence of Allah": [
          {
            "number": "Hadith #2",
            "url": "https://thaqalayn.net/hadith/1/3/4/2",
            "arabicText": "2ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ طَاهِرِ بْنِ حَاتِمٍ فِي حَالِ اسْتِقَامَتِهِ أَنَّهُ كَتَبَ إِلَى الرَّجُلِ مَا الَّذِي لا يُجْتَزَأُ فِي مَعْرِفَةِ الْخَالِقِ بِدُونِهِ فَكَتَبَ إِلَيْهِ لَمْ يَزَلْ عَالِماً وَسَامِعاً وَبَصِيراً وَهُوَ الْفَعَّالُ لِمَا يُرِيدُ وَسُئِلَ أَبُو جَعْفَرٍ (عَلَيْهِ السَّلام) عَنِ الَّذِي لا يُجْتَزَأُ بِدُونِ ذَلِكَ مِنْ مَعْرِفَةِ الْخَالِقِ فَقَالَ لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وَلا يُشْبِهُهُ شَيْ‏ءٌ لَمْ يَزَلْ عَالِماً سَمِيعاً بَصِيراً.",
            "englishTranslation": "2. Ali ibn Ibrahim has narrated from Sahl ibn Ziyad, from Tahir ibn Hatam when he was normal and wrote to the man (meaning thereby Imam abul Hassan al-Rida . “What is it that without which one’s acknowledgement of the existence of Allah can not be considered sufficient?” In answer the Imam  replied, “That He is All-knowing, All-hearing All-awareness and that He acts as He wills.” Imam abu Ja‘far  was asked about the minimum required degree of knowledge about Allah without which an acknowledgement would not be considered sufficient. The Imam  said, “There is nothing similar to or like Him. He is All-knowing, All-hearing and All-awareness.”",
            "gradings": [
              {
                "grade": "ضعيف وآخره مرسل",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/302)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "6": {
        "Al-Kafi - Volume 1: Chapter On Being and Space (al-Kawn WA al-Makan)": [
          {
            "number": "Hadith #3",
            "url": "https://thaqalayn.net/hadith/1/3/6/3",
            "arabicText": "3ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ قَالَ جَاءَ رَجُلٌ إِلَى ابي جعفر (عَلَيْهِ السَّلام) فَقَالَ لَهُ أَخْبِرْنِي عَنْ رَبِّكَ مَتَى كَانَ فَقَالَ وَيْلَكَ إِنَّمَا يُقَالُ لِشَيْ‏ءٍ لَمْ يَكُنْ مَتَى كَانَ إِنَّ رَبِّي تَبَارَكَ وَتَعَالَى كَانَ وَلَمْ يَزَلْ حَيّاً بِلا كَيْفٍ وَلَمْ يَكُنْ لَهُ كَانَ وَلا كَانَ لِكَوْنِهِ كَوْنُ كَيْفٍ وَلا كَانَ لَهُ أَيْنٌ وَلا كَانَ فِي شَيْ‏ءٍ وَلا كَانَ عَلَى شَيْ‏ءٍ وَلا ابْتَدَعَ لِمَكَانِهِ مَكَاناً وَلا قَوِيَ بَعْدَ مَا كَوَّنَ الاشْيَاءَ وَلا كَانَ ضَعِيفاً قَبْلَ أَنْ يُكَوِّنَ شَيْئاً وَلا كَانَ مُسْتَوْحِشاً قَبْلَ أَنْ يَبْتَدِعَ شَيْئاً وَلا يُشْبِهُ شَيْئاً مَذْكُوراً وَلا كَانَ خِلْواً مِنْ الْمُلْكِ قَبْلَ إِنْشَائِهِ وَلا يَكُونُ مِنْهُ خِلْواً بَعْدَ ذَهَابِهِ لَمْ يَزَلْ حَيّاً بِلا حَيَاةٍ وَمَلِكاً قَادِراً قَبْلَ أَنْ يُنْشِئَ شَيْئاً وَمَلِكاً جَبَّاراً بَعْدَ إِنْشَائِهِ لِلْكَوْنِ فَلَيْسَ لِكَوْنِهِ كَيْفٌ وَلا لَهُ أَيْنٌ وَلا لَهُ حَدٌّ وَلا يُعْرَفُ بِشَيْ‏ءٍ يُشْبِهُهُ وَلا يَهْرَمُ لِطُولِ الْبَقَاءِ وَلا يَصْعَقُ لِشَيْ‏ءٍ بَلْ لِخَوْفِهِ تَصْعَقُ الاشْيَاءُ كُلُّهَا كَانَ حَيّاً بِلا حَيَاةٍ حَادِثَةٍ وَلا كَوْنٍ مَوْصُوفٍ وَلا كَيْفٍ مَحْدُودٍ وَلا أَيْنٍ مَوْقُوفٍ عَلَيْهِ وَلا مَكَانٍ جَاوَرَ شَيْئاً بَلْ حَيٌّ يُعْرَفُ وَمَلِكٌ لَمْ يَزَلْ لَهُ الْقُدْرَةُ وَالْمُلْكُ أَنْشَأَ مَا شَاءَ حِينَ شَاءَ بِمَشِيئَتِهِ لا يُحَدُّ وَلا يُبَعَّضُ وَلا يَفْنَى كَانَ أَوَّلاً بِلا كَيْفٍ وَيَكُونُ آخِراً بِلا أَيْنٍ وَكُلُّ شَيْ‏ءٍ هَالِكٌ إِلا وَجْهَهُ لَهُ الْخَلْقُ وَالامْرُ تَبَارَكَ الله رَبُّ الْعَالَمِينَ وَيْلَكَ أَيُّهَا السَّائِلُ إِنَّ رَبِّي لا تَغْشَاهُ الاوْهَامُ وَلا تَنْزِلُ بِهِ الشُّبُهَاتُ وَلا يَحَارُ وَلا يُجَاوِزُهُ شَيْ‏ءٌ وَلا تَنْزِلُ بِهِ الاحْدَاثُ وَلا يُسْأَلُ عَنْ شَيْ‏ءٍ وَلا يَنْدَمُ عَلَى شَيْ‏ءٍ وَلا تَأْخُذُهُ سِنَةٌ وَلا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الارْضِ وَمَا بَيْنَهُمَا وَمَا تَحْتَ الثَّرَى.",
            "englishTranslation": "3. Muhammad ibn Yahya from Ahmad ibn Muhammad ibn ‘Isa from al-Husayn ibn Sa’id from al-Qasim-ibn Muhammad from Ali ibn Abu Hamzah from abu Basir who has said the following. “A man came to Imam abu Ja‘far  saying, ‘Tell me about your Lord. When did He come into existence?’” The Imam  replied, “Woe upon you! Such question is asked only about a thing that did not exist. My Lord, all Glory belongs to Him is and will be eternally. He lives and no How question applies to Him. He did not have any coming into existence and nor there was any being for His coming into being. This does not apply to Him because He is not subject to the effects of space. He was not in any thing or on any thing nor did He invent any space for His own space. He did not become stronger after making all things nor was weak before giving being to the beings. He was not lonely before His inventing all things. He is not similar to any thing that could be called a thing. He was also not without Kingdom before the creation and nor will He be without it after all things. He lives eternally without life and the powerful king before His invention of the things and He is an all powerful king after the creation of all things. To His existence no How or Where question is applicable. There is no limit for Him nor is He definable by analogy. He does not become old due to eternal living. He doe not become alarmed because of any thing but that all things are fearful of His (disappointment). He lived without newly emerging life. He is not a describable being or that could be limit with conditions or that would have a space to depend on. He does not have a place so that He can be considered as neighboring something. He is living and one can know Him. He is the eternal King. He has the power and the kingdom. He has created all that He wanted and when He decided by His will. He can not be limited. He can not be divided or destroyed. He was before everything but no How question would apply to Him. He will be the last but no Where will apply to Him. All things will be destroyed except He. The creation belongs to Him and His is the command. He is the Holy Lord of the worlds. O inquirer, imaginations can not encompass my Lord and He does not face any confusions or bewilderment. Nothing is able to escape Him and nothing happens to Him. He can not be held responsible for anything and He does not become regretful. Neither slumber nor sleep overcomes Him. To Him belongs all that is in the heavens and all that is in the earth and all that is between them and under the soil.",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/309)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #6",
            "url": "https://thaqalayn.net/hadith/1/3/6/6",
            "arabicText": "6ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ قَالَ رَأْسُ الْجَالُوتِ لِلْيَهُودِ إِنَّ الْمُسْلِمِينَ يَزْعُمُونَ أَنَّ عَلِيّاً (عَلَيْهِ السَّلام) مِنْ أَجْدَلِ النَّاسِ وَأَعْلَمِهِمْ اذْهَبُوا بِنَا إِلَيْهِ لَعَلِّي أَسْأَلُهُ عَنْ مَسْأَلَةٍ وَأُخَطِّئُهُ فِيهَا فَأَتَاهُ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ إِنِّي أُرِيدُ أَنْ أَسْأَلَكَ عَنْ مَسْأَلَةٍ قَالَ سَلْ عَمَّا شِئْتَ قَالَ يَا أَمِيرَ الْمُؤْمِنِينَ مَتَى كَانَ رَبُّنَا قَالَ لَهُ يَا يَهُودِيُّ إِنَّمَا يُقَالُ مَتَى كَانَ لِمَنْ لَمْ يَكُنْ فَكَانَ مَتَى كَانَ هُوَ كَائِنٌ بِلا كَيْنُونِيَّةٍ كَائِنٍ كَانَ بِلا كَيْفٍ يَكُونُ بَلَى يَا يَهُودِيُّ ثُمَّ بَلَى يَا يَهُودِيُّ كَيْفَ يَكُونُ لَهُ قَبْلٌ هُوَ قَبْلَ الْقَبْلِ بِلا غَايَةٍ وَلا مُنْتَهَى غَايَةٍ وَلا غَايَةَ إِلَيْهَا انْقَطَعَتِ الْغَايَاتُ عِنْدَهُ هُوَ غَايَةُ كُلِّ غَايَةٍ فَقَالَ أَشْهَدُ أَنَّ دِينَكَ الْحَقُّ وَأَنَّ مَا خَالَفَهُ بَاطِلٌ.",
            "englishTranslation": "6. Ali ibn Muhammad from Sahl ibn Ziyad from ’Amr ibn ’Uthman from Muhammad ibn Yahya from Muhammad ibn Suma‘ah from abu ‘Abdallah , who has said the following. “Ra’sul Jalut said to the Jews, ‘The Muslims consider Ali excelling everyone in polemics and the most learned. Let us go to him. I will ask him certain questions and perhaps catch him in errors.’” He went to the Imam  and said, “O Amirul Mu’minin, I have a question about a matter.” The Imam  said, “Ask about whatever you like.” He then asked, “O Amirul Mu’minin, when did our Lord come into existence?” Imam Ali replied, “O Jew, the question When applies to one who did not exist and (then) came into being. Allah has exists without coming into being, and without being in any becoming. Certainly, O Jew, most certainly, O Jew, how can there be any before for He Who was before the before. He does not have any destination. He is not the end of any destination and no destination ends up to Him. All destinations fall short before Him and He is the goal of all destinations.” The Jew then said, “I testify that your religion is the true religion and any thing against it is false.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/315)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #8",
            "url": "https://thaqalayn.net/hadith/1/3/6/8",
            "arabicText": "8ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ عَنِ ابْنِ أَبِي نَصْرٍ عَنْ أَبِي الْحَسَنِ الْمَوْصِلِيِّ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ أَتَى حِبْرٌ مِنَ الاحْبَارِ أَمِيرَ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ مَتَى كَانَ رَبُّكَ قَالَ وَيْلَكَ إِنَّمَإ؛ّّ يُقَالُ مَتَى كَانَ لِمَا لَمْ يَكُنْ فَأَمَّا مَا كَانَ فَلا يُقَالُ مَتَى كَانَ كَانَ قَبْلَ الْقَبْلِ بِلا قَبْلٍ وَبَعْدَ الْبَعْدِ بِلا بَعْدٍ وَلا مُنْتَهَى غَايَةٍ لِتَنْتَهِيَ غَايَتُهُ فَقَالَ لَهُ أَ نَبِيٌّ أَنْتَ فَقَالَ لامِّكَ الْهَبَلُ إِنَّمَا أَنَا عَبْدٌ مِنْ عَبِيدِ رَسُولِ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه )",
            "englishTranslation": "8. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Muhammad ibn al-Walid from ibn Abu Nasr from Abul Hassan al-Muwsali who has narrated the following from abu ‘Abdallah . “A rabbi hibr came to Imam Ali  and asked, ‘O Amirul Mu’minin, when did your Lord come into existence?’” Imam Ali  replied, “Consider carefully. The question When applies to one who did not exist (and then came into being). When does not apply to the One Who is eternal. He was before the before without before and after the after without an after. He is not the end of some end so that His end would also end.” He then asked, “Are you a prophet?” Imam Ali  replied, “Bereft of you be your mother! I am a salve among the slaves of the Messenger of Allah (s.a.).”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (316/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "8": {
        "Al-Kafi - Volume 1: Chapter On Prohibition on Saying How is Allah (al-Kayfiyyah)": [
          {
            "number": "Hadith #1",
            "url": "https://thaqalayn.net/hadith/1/3/8/1",
            "arabicText": "1ـ مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ أَبِي بَصِيرٍ قَالَ قَالَ أَبُو جَعْفَرٍ (عَلَيْهِ السَّلام) تَكَلَّمُوا فِي خَلْقِ الله وَلا تَتَكَلَّمُوا فِي الله فَإِنَّ الْكَلامَ فِي الله لا يَزْدَادُ صَاحِبَهُ إِلا تَحَيُّراً.  وَفِي رِوَايَةٍ أُخْرَى عَنْ حَرِيزٍ تَكَلَّمُوا فِي كُلِّ شَيْ‏ءٍ وَلا تَتَكَلَّمُوا فِي ذَاتِ الله.",
            "englishTranslation": "1. Muhammad ibn al-Hassan has narrated from Sahl ibn Ziyad from al-Hassan ibn Mahbub from Ali ibn Ri’ab from abu Basir From Imam abu Ja‘ far  who has said the following. “Speak about the creation of Allah and do not speak about Allah His-self. Speaking about the Allah’s self does not increase anything to one’s knowledge except more confusion.” In another Hadith from Hariz it reads, “Speak about every thing but do not speak about Allah’s self.”",
            "gradings": [
              {
                "grade": "ضعيف وآخره مرسل",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/321)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #5",
            "url": "https://thaqalayn.net/hadith/1/3/8/5",
            "arabicText": "5ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ بَعْضِ أَصْحَابِهِ عَنِ الْحُسَيْنِ بْنِ الْمَيَّاحِ عَنْ أَبِيهِ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) يَقُولُ مَنْ نَظَرَ فِي الله كَيْفَ هُوَ هَلَكَ.",
            "englishTranslation": "5. A group of our people has narrated from Ahmad ibn Muhammad ibn Khalid from some of his people from al-Husayn ibn al-Mayyah from his father from Imam abu ‘Abdallh  who has said the following. “He who thinks of how and when about Allah he has met his doomed.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (324/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "9": {
        "Al-Kafi - Volume 1: Chapter On The Invalidity of the Belief to see God (Ru’yah of Allah)": [
          {
            "number": "Hadith #7",
            "url": "https://thaqalayn.net/hadith/1/3/9/7",
            "arabicText": "7ـ أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ ذَاكَرْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) فِيمَا يَرْوُونَ مِنَ الرُّؤْيَةِ فَقَالَ الشَّمْسُ جُزْءٌ مِنْ سَبْعِينَ جُزْءاً مِنْ نُورِ الْكُرْسِيِّ وَالْكُرْسِيُّ جُزْءٌ مِنْ سَبْعِينَ جُزْءاً مِنْ نُورِ الْعَرْشِ وَالْعَرْشُ جُزْءٌ مِنْ سَبْعِينَ جُزْءاً مِنْ نُورِ الْحِجَابِ وَالْحِجَابُ جُزْءٌ مِنْ سَبْعِينَ جُزْءاً مِنْ نُورِ السِّتْرِ فَإِنْ كَانُوا صَادِقِينَ فَلْيَمْلَئُوا أَعْيُنَهُمْ مِنَ الشَّمْسِ لَيْسَ دُونَهَا سَحَابٌ.",
            "englishTranslation": "7. Ahmad ibn Idris has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from ‘Asim ibn Hamiyd who has said the following. “I discussed with Imam abu ‘Abdallah  about what he says to eye-witnessing Allah’s self. The Imam said, “The light of the sun has a ratio equal to one seventieth of the light of the Kursi (the throne). The same is the ratio of the light of Kursi to al-‘Arsh, the light of which is of the same ration to that of al-Hijab the light of which is of the same ration to the light of al-Satr. If they tell the truth let them fill their eyes with the light of the sun without a curtain in between.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/337)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "10": {
        "Al-Kafi - Volume 1: Chapter On Prohibition on Attributing to Allah What He Himself has not Done so": [
          {
            "number": "Hadith #3",
            "url": "https://thaqalayn.net/hadith/1/3/10/3",
            "arabicText": "3ـ مُحَمَّدُ بْنُ أَبِي عَبْدِ الله عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنِ الْحُسَيْنِ بْنِ الْحَسَنِ عَنْ بَكْرِ بْنِ صَالِحٍ عَنِ الْحَسَنِ بْنِ سَعِيدٍ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ الْخَزَّازِ وَمُحَمَّدِ بْنِ الْحُسَيْنِ قَالا دَخَلْنَا عَلَى أَبِي الْحَسَنِ الرِّضَا (عَلَيْهِ السَّلام) فَحَكَيْنَا لَهُ أَنَّ مُحَمَّداً (صَلَّى اللهُ عَلَيْهِ وَآلِه) رَأَى رَبَّهُ فِي صُورَةِ الشَّابِّ الْمُوَفَّقِ فِي سِنِّ أَبْنَاءِ ثَلاثِينَ سَنَةً وَقُلْنَا إِنَّ هِشَامَ بْنَ سَالِمٍ وَصَاحِبَ الطَّاقِ وَالْمِيثَمِيَّ يَقُولُونَ إِنَّهُ أَجْوَفُ إِلَى السُّرَّةِ وَالْبَقِيَّةُ صَمَدٌ فَخَرَّ سَاجِداً لله ثُمَّ قَالَ سُبْحَانَكَ مَا عَرَفُوكَ وَلا وَحَّدُوكَ فَمِنْ أَجْلِ ذَلِكَ وَصَفُوكَ سُبْحَانَكَ لَوْ عَرَفُوكَ لَوَصَفُوكَ بِمَا وَصَفْتَ بِهِ نَفْسَكَ سُبْحَانَكَ كَيْفَ طَاوَعَتْهُمْ أَنْفُسُهُمْ أَنْ يُشَبِّهُوكَ بِغَيْرِكَ اللهمَّ لا أَصِفُكَ إِلا بِمَا وَصَفْتَ بِهِ نَفْسَكَ وَلا أُشَبِّهُكَ بِخَلْقِكَ أَنْتَ أَهْلٌ لِكُلِّ خَيْرٍ فَلا تَجْعَلْنِي مِنَ الْقَوْمِ الظَّالِمِينَ ثُمَّ الْتَفَتَ إِلَيْنَا فَقَالَ مَا تَوَهَّمْتُمْ مِنْ شَيْ‏ءٍ فَتَوَهَّمُوا الله غَيْرَهُ ثُمَّ قَالَ نَحْنُ آلُ مُحَمَّدٍ النَّمَطُ الاوْسَطُ الَّذِي لا يُدْرِكُنَا الْغَالِي وَلا يَسْبِقُنَا التَّالِي يَا مُحَمَّدُ إِنَّ رَسُولَ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) حِينَ نَظَرَ إِلَى عَظَمَةِ رَبِّهِ كَانَ فِي هَيْئَةِ الشَّابِّ الْمُوَفَّقِ وَسِنِّ أَبْنَاءِ ثَلاثِينَ سَنَةً يَا مُحَمَّدُ عَظُمَ رَبِّي عَزَّ وَجَلَّ أَنْ يَكُونَ فِي صِفَةِ الْمَخْلُوقِينَ قَالَ قُلْتُ جُعِلْتُ فِدَاكَ مَنْ كَانَتْ رِجْلاهُ فِي خُضْرَةٍ قَالَ ذَاكَ مُحَمَّدٌ كَانَ إِذَا نَظَرَ إِلَى رَبِّهِ بِقَلْبِهِ جَعَلَهُ فِي نُورٍ مِثْلِ نُورِ الْحُجُبِ حَتَّى يَسْتَبِينَ لَهُ مَا فِي الْحُجُبِ إِنَّ نُورَ الله مِنْهُ أَخْضَرُ وَمِنْهُ أَحْمَرُ وَمِنْهُ أَبْيَضُ وَمِنْهُ غَيْرُ ذَلِكَ يَا مُحَمَّدُ مَا شَهِدَ لَهُ الْكِتَابُ وَالسُّنَّةُ فَنَحْنُ الْقَائِلُونَ بِهِ.",
            "englishTranslation": "3. Muhammad ibn abu ‘Abdallah has narrated from Muhammad ibn Isma‘il from al-Husayn ibn al-Hassan from Bakr ibn Salih from al-Hassan ibn Sa‘id from Ibrahim ibn Muhammad al-Khazzaz and Muhammad ibn al-Husayn they both have said the following. “We met Imam abu abu al-Hassan al-Rida  and stated to him that Prophet Muhammad (s.a.) saw His Lord in the fashion of a full grown young man of thirty years and added that Hisham ibn Salim and Sahib al-Taq and al-Maythami say that He is hallow down to His navel and the rest is solid. The Imam bowed down to a prostrating position and then said, ‘(O Lord), Glory belongs to you they have not recognized You nor have they acknowledged Your Oneness thus, they attribute to You such things. (O Lord, Glory belongs to You, had they recognized You they would have attributed to You what you yourself have attributed to Yourself and they would not have considered You similar to things other than You. O Lord, I do not attribute to You anything other than what You have attributed to Yourself and do not consider You similar to Your creatures. To You belongs all good. Do not place me among the unjust ones.’ The Imam  then turned to us saying, “Whatever you may imagine (make Wahm of) consider Allah some thing other than it.” He continued, ‘We, people of the family of the Prophet (s.a.), are the middle type and the criteria. Those who exceed can not catch up with us and those who follow can not go ahead of us. O Muhammad, when the messenger of Allah looked at the greatness of his Lord he was of the type of people as fully grown up as thirty years old people. O Muhammad, my Lord, the Majestic, the Glorious, is far greater than to be of the qualities of the creatures.” The narrator has said that I said, “May the Lord take my soul for your service, who was the one with his feet in the green?” The Imam said, “He was Prophet Muhammad (s.a.) when looked at his Lord with his heart He placed him in the light like that of the Hujub so he can see what is inside the Hujub. Of the light of Allah some are green, red, white and others. O Muhammad whatever has confirmation in the book and the Sunnah we affirm it.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (337/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #4",
            "url": "https://thaqalayn.net/hadith/1/3/10/4",
            "arabicText": "4ـ عَلِيُّ بْنُ مُحَمَّدٍ وَمُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ بَشِيرٍ الْبَرْقِيِّ قَالَ حَدَّثَنِي عَبَّاسُ بْنُ عَامِرٍ الْقَصَبَانِيُّ قَالَ أَخْبَرَنِي هَارُونُ بْنُ الْجَهْمِ عَنْ أَبِي حَمْزَةَ عَنْ عَلِيِّ بن الحسين (عَلَيْهما السَّلام) قَالَ قَالَ لَوِ اجْتَمَعَ أَهْلُ السَّمَاءِ وَالارْضِ أَنْ يَصِفُوا الله بِعَظَمَتِهِ لَمْ يَقْدِرُوا.",
            "englishTranslation": "4. Ali ibn Muhammad and Muhammad ibn al-Hassan have narrated from Sahl ibn Ziyad from Ahmad ibn Bashir al-Barqi who has said that ‘Abbass ibn ‘Amir al-Qasbani who has said that Harun ibn al-Juham from abu Hamza from Imam Ali ibn al-Husayn  has reported the following. “Even if all those in heavens and earth would gather together to speak of the greatness of Allah they will not be able to do so.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/350)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #5",
            "url": "https://thaqalayn.net/hadith/1/3/10/5",
            "arabicText": "5ـ سَهْلٌ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ الْهَمَذَانِيِّ قَالَ كَتَبْتُ إِلَى الرَّجُلِ (عَلَيْهِ السَّلام) أَنَّ مَنْ قِبَلَنَا مِنْ مَوَالِيكَ قَدِ اخْتَلَفُوا فِي التَّوْحِيدِ فَمِنْهُمْ مَنْ يَقُولُ جِسْمٌ وَمِنْهُمْ مَنْ يَقُولُ صُورَةٌ فَكَتَبَ (عَلَيْهِ السَّلام) بِخَطِّهِ سُبْحَانَ مَنْ لا يُحَدُّ وَلا يُوصَفُ لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وَهُوَ السَّمِيعُ الْعَلِيمُ أَوْ قَالَ الْبَصِيرُ.",
            "englishTranslation": "5. Sahl has narrated from Ibrahim ibn Muhammad al-Hamdani who has said the following. “I wrote to the man (Imam abu al-Hassan the 3rd  explaining, “Your followers in this city differ on the issue of the Oneness of Allah. Some of them say that Allah has a body, and others say that Allah has a form.” The Imam replied in his own handwriting, “Glory belongs to Allah, Who can not be defined nor described. There is nothing similar to Him. He is All-hearing, All-knowing, or the Imam said All-seeing.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/351)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #6",
            "url": "https://thaqalayn.net/hadith/1/3/10/6",
            "arabicText": "6ـ سَهْلٌ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ حَكِيمٍ قَالَ كَتَبَ أَبُو الْحَسَنِ مُوسَى بْنُ جَعْفَرٍ (عَلَيْهِ السَّلام) إِلَى أَبِي أَنَّ الله أَعْلَى وَأَجَلُّ وَأَعْظَمُ مِنْ أَنْ يُبْلَغَ كُنْهُ صِفَتِهِ فَصِفُوهُ بِمَا وَصَفَ بِهِ نَفْسَهُ وَكُفُّوا عَمَّا سِوَى ذَلِكَ.",
            "englishTranslation": "6. Sahl has narrated from Muhammad ibn ‘Isa from Ibrahim from Muhammad ibn Hakim who has said the following. “Imam abu al-Hassan Musa ibn Ja‘far  wrote to my father, ‘Allah is far High, Glorious and Great than that one can reach the essence of His attribute. Speak of only those of His attributes of which He Himself has spoken and refrain from attributes other than those ones.’”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (351/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #7",
            "url": "https://thaqalayn.net/hadith/1/3/10/7",
            "arabicText": "7ـ سَهْلٌ عَنِ السِّنْدِيِّ بْنِ الرَّبِيعِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَفْصٍ أَخِي مُرَازِمٍ عَنِ الْمُفَضَّلِ قَالَ سَأَلْتُ أَبَا الْحَسَنِ (عَلَيْهِ السَّلام) عَنْ شَيْ‏ءٍ مِنَ الصِّفَةِ فَقَالَ لا تَجَاوَزْ مَا فِي الْقُرْآنِ.",
            "englishTranslation": "7. Sahl has narrated from al-Sindi ibn al-Rabi‘ from Ibn Abi ‘Umayr from Hafs, brother of Marazim from al-Mufaddal who has said the “I asked Imam abu al-Hassan  about certain matters of the attributes (of Allah) and the Imam said, “Do not exceed what is in the holy Quran.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/351)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #8",
            "url": "https://thaqalayn.net/hadith/1/3/10/8",
            "arabicText": "8ـ سَهْلٌ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ الْقَاسَانِيِّ قَالَ كَتَبْتُ إِلَيْهِ (عَلَيْهِ السَّلام) أَنَّ مَنْ قِبَلَنَا قَدِ اخْتَلَفُوا فِي التَّوْحِيدِ قَالَ فَكَتَبَ (عَلَيْهِ السَّلام) سُبْحَانَ مَنْ لا يُحَدُّ وَلا يُوصَفُ لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وَهُوَ السَّمِيعُ الْبَصِيرُ.",
            "englishTranslation": "8. Sahl has narrated from Muhammad ibn Ali al-Qasani (the right name is Ali ibn Muhammad, one of the companions of Imam abu al-Hassan al-Hadi, the tenth Imam  who has said the following. “I wrote to the Imam explaining that people before us had differences on the issue of the Oneness of Allah.” The Imam wrote, “Glory belongs to Allah, Who can not be defined nor described. There is nothing similar to Him. He is All-hearing, All-seeing.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (351/ 1)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #9",
            "url": "https://thaqalayn.net/hadith/1/3/10/9",
            "arabicText": "9ـ سَهْلٌ عَنْ بِشْرِ بْنِ بَشَّارٍ النَّيْسَابُورِيِّ قَالَ كَتَبْتُ إِلَى الرَّجُلِ (عَلَيْهِ السَّلام) أَنَّ مَنْ قِبَلَنَا قَدِ اخْتَلَفُوا فِي التَّوْحِيدِ فَمِنْهُمْ مَنْ يَقُولُ هُوَ جِسْمٌ وَمِنْهُمْ مَنْ يَقُولُ هُوَ صُورَةٌ فَكَتَبَ إِلَيَّ سُبْحَانَ مَنْ لا يُحَدُّ وَلا يُوصَفُ وَلا يُشْبِهُهُ شَيْ‏ءٌ وَلَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وَهُوَ السَّمِيعُ الْبَصِيرُ.",
            "englishTranslation": "9. Sahl has narrated from Bishr ibn Bashshar al-Nayshaburi who has said the following. “I wrote to the man (Imam) explaining that people before us had differences on the issue of the Oneness of Allah. There were people who said that Allah had a body, others said He had a form.” The Imam wrote for me, “Glory belongs to Allah, Who can not be defined nor described. There is nothing similar to Him. He is All-hearing, All-seeing.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/352)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #10",
            "url": "https://thaqalayn.net/hadith/1/3/10/10",
            "arabicText": "10ـ سَهْلٌ قَالَ كَتَبْتُ إِلَى أَبِي مُحَمَّدٍ (عَلَيْهِ السَّلام) سَنَةَ خَمْسٍ وَخَمْسِينَ وَمِائَتَيْنِ قَدِ اخْتَلَفَ يَا سَيِّدِي أَصْحَابُنَا فِي التَّوْحِيدِ مِنْهُمْ مَنْ يَقُولُ هُوَ جِسْمٌ وَمِنْهُمْ مَنْ يَقُولُ هُوَ صُورَةٌ فَإِنْ رَأَيْتَ يَا سَيِّدِي أَنْ تُعَلِّمَنِي مِنْ ذَلِكَ مَا أَقِفُ عَلَيْهِ وَلا أَجُوزُهُ فَعَلْتَ مُتَطَوِّلاً عَلَى عَبْدِكَ فَوَقَّعَ بِخَطِّهِ (عَلَيْهِ السَّلام) سَأَلْتَ عَنِ التَّوْحِيدِ وَهَذَا عَنْكُمْ مَعْزُولٌ الله وَاحِدٌ أَحَدٌ لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ خَالِقٌ وَلَيْسَ بِمَخْلُوقٍ يَخْلُقُ تَبَارَكَ وَتَعَالَى مَا يَشَاءُ مِنَ الاجْسَامِ وَغَيْرِ ذَلِكَ وَلَيْسَ بِجِسْمٍ وَيُصَوِّرُ مَا يَشَاءُ وَلَيْسَ بِصُورَةٍ جَلَّ ثَنَاؤُهُ وَتَقَدَّسَتْ أَسْمَاؤُهُ أَنْ يَكُونَ لَهُ شِبْهٌ هُوَ لا غَيْرُهُ لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ وَهُوَ السَّمِيعُ الْبَصِيرُ.",
            "englishTranslation": "10. Sahl has said that I wrote to abu Muhammad al-Hassan al-‘Askari  in 255 AH., “Our people (ashabuna) differ on the issue of the Oneness of Allah. There are those who say he has a body and others say He has a certain form. If you would consider to instruct me in this matter on which I would rely without excess it would be a great favor to your servant.” The Imam answered in his own handwriting, “You have asked about the Oneness of Allah. It is not your duty to find Allah’s self. Allah is One, the Only One. He has no children and is not anyone’s child. There nothing similar to Him. He is the Creator and is not created. He, the Most Holy, the Most High, creates whatever He wants of the bodies and non-bodies. He is not a body or a certain form. He gives form to whatever He wills but Himself is not a form, Majestic is His praise and Holy are His names and is far above being similar to other things. Only He, and not others, is the One to Who no one is similar and He is all-hearing and All-seeing.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/352)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #12",
            "url": "https://thaqalayn.net/hadith/1/3/10/12",
            "arabicText": "12ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ وَعَنْ غَيْرِهِ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ عَنْ عَلِيِّ بْنِ إِبْرَاهِيمَ عَنْ عَبْدِ الله بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ قَالَ إِنَّ الله عَظِيمٌ رَفِيعٌ لا يَقْدِرُ الْعِبَادُ عَلَى صِفَتِهِ وَلا يَبْلُغُونَ كُنْهَ عَظَمَتِهِ لا؛ّّ تُدْرِكُهُ الابْصَارُ وَهُوَ يُدْرِكُ الابْصَارَ وَهُوَ اللَّطِيفُ الْخَبِيرُ وَلا يُوصَفُ بِكَيْفٍ وَلا أَيْنٍ وَحَيْثٍ وَكَيْفَ أَصِفُهُ بِالْكَيْفِ وَهُوَ الَّذِي كَيَّفَ الْكَيْفَ حَتَّى صَارَ كَيْفاً فَعُرِفَتِ الْكَيْفُ بِمَا كَيَّفَ لَنَا مِنَ الْكَيْفِ أَمْ كَيْفَ أَصِفُهُ بِأَيْنٍ وَهُوَ الَّذِي أَيَّنَ الايْنَ حَتَّى صَارَ أَيْناً فَعُرِفَتِ الايْنُ بِمَا أَيَّنَ لَنَا مِنَ الايْنِ أَمْ كَيْفَ أَصِفُهُ بِحَيْثٍ وَهُوَ الَّذِي حَيَّثَ الْحَيْثَ حَتَّى صَارَ حَيْثاً فَعُرِفَتِ الْحَيْثُ بِمَا حَيَّثَ لَنَا مِنَ الْحَيْثِ فَالله تَبَارَكَ وَتَعَالَى دَاخِلٌ فِي كُلِّ مَكَانٍ وَخَارِجٌ مِنْ كُلِّ شَيْ‏ءٍ لا تُدْرِكُهُ الابْصَارُ وَهُوَ يُدْرِكُ الابْصَارَ لا إِلَهَ إِلا هُوَ الْعَلِيُّ الْعَظِيمُ وَهُوَ اللَّطِيفُ الْخَبِيرُ.",
            "englishTranslation": "12. Ali ibn Muhammad has narrated from Sahl ibn Ziyad and others from Muhammad ibn Sulayman from Ali ibn Ibrahim from ‘Abdallah ibn Sinan from abu ‘Abdallah  who has said the following. “Allah is Great and High. People cannot describe Him nor can they reach the depth of His Greatness. ‘ No mortal eyes can see Him, but He can see all eyes. He is All-kind and All-aware.’” (6:103) He cannot be described by means of how and where. How can I describe Him by means of any condition? He Himself has created the conditions and how and so it came into being. We came to know conditions because of His designing them for us. How can I describe Him by means of space? It is He, Who spaced the space so it became space. I, thus, came to know space by means of what He has made it into space. How can I describe Him by means of positions when He Himself has given position to positions so it came into position. I, thus, came to know the position by means of what He has made to come into position. Allah, the Holy, the Most High, is in every place but is out of everything. ‘ No mortal eyes can see Him, but He can see all eyes. He is All-kind and All-aware.’” (6:103)",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/353)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "11": {
        "Al-Kafi - Volume 1: Chapter On Prohibition on Considering Allah as having Body (JISM) and Form (SURAH)": [
          {
            "number": "Hadith #2",
            "url": "https://thaqalayn.net/hadith/1/3/11/2",
            "arabicText": "2ـ مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ حَمْزَةَ بْنِ مُحَمَّدٍ قَالَ كَتَبْتُ إِلَى أَبِي الْحَسَنِ (عَلَيْهِ السَّلام) أَسْأَلُهُ عَنِ الْجِسْمِ وَالصُّورَةِ فَكَتَبَ سُبْحَانَ مَنْ لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ لا جِسْمٌ وَلا صُورَةٌ.  وَرَوَاهُ مُحَمَّدُ بْنُ أَبِي عَبْدِ الله إِلا أَنَّهُ لَمْ يُسَمِّ الرَّجُلَ.",
            "englishTranslation": "Muhammad ibn al-Hassan has narrated from Sahl ibn Ziyad from Hamzah ibn Muhammad who has said the following. “I wrote to Imam abu al-Hassan (al-Thalith 3rd  asking about the body and form (of Allah). He wrote in reply, ‘Glorious is He similar to Who there is nothing. He is not a body nor has He any form.’” This Hadith has also been narrated by Muhammad ibn abu ‘Abdallah without giving the name of the person (from whom he has heard).",
            "gradings": [
              {
                "grade": "ضعيف وآخره مرسل",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/2)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #6",
            "url": "https://thaqalayn.net/hadith/1/3/11/6",
            "arabicText": "6ـ مُحَمَّدُ بْنُ أَبِي عَبْدِ الله عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنِ الْحُسَيْنِ بْنِ الْحَسَنِ عَنْ بَكْرِ بْنِ صَالِحٍ عَنِ الْحَسَنِ بْنِ سَعِيدٍ عَنْ عَبْدِ الله بْنِ الْمُغِيرَةِ عَنْ مُحَمَّدِ بْنِ زِيَادٍ قَالَ سَمِعْتُ يُونُسَ بْنَ ظَبْيَانَ يَقُولُ دَخَلْتُ عَلَى أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) فَقُلْتُ لَهُ إِنَّ هِشَامَ بْنَ الْحَكَمِ يَقُولُ قَوْلاً عَظِيماً إِلا أَنِّي أَخْتَصِرُ لَكَ مِنْهُ أَحْرُفاً فَزَعَمَ أَنَّ الله جِسْمٌ لانَّ الاشْيَاءَ شَيْئَانِ جِسْمٌ وَفِعْلُ الْجِسْمِ فَلا يَجُوزُ أَنْ يَكُونَ الصَّانِعُ بِمَعْنَى الْفِعْلِ وَيَجُوزُ أَنْ يَكُونَ بِمَعْنَى الْفَاعِلِ فَقَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) وَيْحَهُ أَ مَا عَلِمَ أَنَّ الْجِسْمَ مَحْدُودٌ مُتَنَاهٍ وَالصُّورَةَ مَحْدُودَةٌ مُتَنَاهِيَةٌ فَإِذَا احْتَمَلَ الْحَدَّ احْتَمَلَ الزِّيَادَةَ وَالنُّقْصَانَ وَإِذَا احْتَمَلَ الزِّيَادَةَ وَالنُّقْصَانَ كَانَ مَخْلُوقاً قَالَ قُلْتُ فَمَا أَقُولُ قَالَ لا جِسْمٌ وَلا صُورَةٌ وَهُوَ مُجَسِّمُ الاجْسَامِ وَمُصَوِّرُ الصُّوَرِ لَمْ يَتَجَزَّأْ وَلَمْ يَتَنَاهَ وَلَمْ يَتَزَايَدْ وَلَمْ يَتَنَاقَصْ لَوْ كَانَ كَمَا يَقُولُونَ لَمْ يَكُنْ بَيْنَ الْخَالِقِ وَالْمَخْلُوقِ فَرْقٌ وَلا بَيْنَ الْمُنْشِئِ وَالْمُنْشَإِ لَكِنْ هُوَ الْمُنْشِئُ فَرْقٌ بَيْنَ مَنْ جَسَّمَهُ وَصَوَّرَهُ وَأَنْشَأَهُ إِذْ كَانَ لا يُشْبِهُهُ شَيْ‏ءٌ وَلا يُشْبِهُ هُوَ شَيْئاً.",
            "englishTranslation": "6. Muhammad ibn Abu ‘Abdallah has narrated from Muhammad ibn Isma‘il from al-Husayn ibn al-Hassan from Bakr ibn Salih from al-Hassan ibn Sa‘id from ‘Abdullah ibn al-Mughirah from Muhammad ibn Ziyad who has said the following. “I heard Yunus ibn Zabyan saying, ‘I went to meet abu ‘Abdallah , and said, “Hisham ibn al-Hakam has uttered monstrous words. I will briefly mention a few words. He thinks Allah has a body because things are of two types;  body and (b) the acts. It is not possible for the Creator Himself to be just actions or functions. But it is possible to consider Him as the agent.” Abu ‘Abdallah  then said, ‘That is not proper from him. Does he not know that the body has limits and the form has limits and an end? Whatever is subject to limitations is also subject to increase and reduction and such things are created.’ I then asked, “What then I should say?” He replied, ‘Allah is without body and form. He is the giver of body to all bodies and the giver of form to all forms. He can not be divided or limited. He does not grow or decrease. If it were as they say, then there would have been no difference between the Creator and the created, the inventor and the invented. But He is the Creator and the inventor. He has made the distinction and differentiation between that to which He has given body, form and that which He has invented. This is because nothing is similar to Him nor He resembles anything.’”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/5)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #7",
            "url": "https://thaqalayn.net/hadith/1/3/11/7",
            "arabicText": "7ـ مُحَمَّدُ بْنُ أَبِي عَبْدِ الله عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ عَلِيِّ بْنِ الْعَبَّاسِ عَنِ الْحَسَنِ بْنِ عَبْدِ الرَّحْمَنِ الْحِمَّانِيِّ قَالَ قُلْتُ لابِي الْحَسَنِ مُوسَى بْنِ جَعْفَرٍ (عَلَيْهما السَّلام) إِنَّ هِشَامَ بْنَ الْحَكَمِ زَعَمَ أَنَّ الله جِسْمٌ لَيْسَ كَمِثْلِهِ شَيْ‏ءٌ عَالِمٌ سَمِيعٌ بَصِيرٌ قَادِرٌ مُتَكَلِّمٌ نَاطِقٌ وَالْكَلامُ وَالْقُدْرَةُ وَالْعِلْمُ يَجْرِي مَجْرَى وَاحِدٍ لَيْسَ شَيْ‏ءٌ مِنْهَا مَخْلُوقاً فَقَالَ قَاتَلَهُ الله أَ مَا عَلِمَ أَنَّ الْجِسْمَ مَحْدُودٌ وَالْكَلامَ غَيْرُ الْمُتَكَلِّمِ مَعَاذَ الله وَأَبْرَأُ إِلَى الله مِنْ هَذَا الْقَوْلِ لا جِسْمٌ وَلا صُورَةٌ وَلا تَحْدِيدٌ وَكُلُّ شَيْ‏ءٍ سِوَاهُ مَخْلُوقٌ إِنَّمَا تُكَوَّنُ الاشْيَاءُ بِإِرَادَتِهِ وَمَشِيئَتِهِ مِنْ غَيْرِ كَلامٍ وَلا تَرَدُّدٍ فِي نَفَسٍ وَلا نُطْقٍ بِلِسَانٍ.",
            "englishTranslation": "7. Muhammad ibn abu ‘Abdallah has narrated from Muhammad ibn Isma‘il from Ali ibn al-‘Abbass from al-Hassan ibn ‘Abd al-Rahman al-Hammani who has said the following. “I said to abu al-Hassan Musa ibn Ja‘far , ‘Hisham ibn al-Hakam claims that Allah is a body like unto Whom there is no one. He is All-knowing, All-hearing, All-seeing, All-powerful. He speaks and reasons. His word, His power, His knowledge are all in one. No one of them is created.’” The Imam said, “May Allah be his foe. Does he not know that the body is limited, and that the speech is other than what the speaker is? I seek refuge from Allah and I disclaim such words. Allah does not have a body, form or any kind of limitations. Allah has created everything. He creates things as and when He wills without any word or planing in the mind or utterance of the tongue.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/7)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "12": {
        "Al-Kafi - Volume 1: Chapter On Attribute Of Essence (Sifat al-DhDhat) Of Allah": [
          {
            "number": "Hadith #5",
            "url": "https://thaqalayn.net/hadith/1/3/12/5",
            "arabicText": "5ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدِ بْنِ حَمْزَةَ قَالَ كَتَبْتُ إِلَى الرَّجُلِ (عَلَيْهِ السَّلام) أَسْأَلُهُ أَنَّ مَوَالِيَكَ اخْتَلَفُوا فِي الْعِلْمِ فَقَالَ بَعْضُهُمْ لَمْ يَزَلِ الله عَالِماً قَبْلَ فِعْلِ الاشْيَاءِ وَقَالَ بَعْضُهُمْ لا نَقُولُ لَمْ يَزَلِ الله عَالِماً لانَّ مَعْنَى يَعْلَمُ يَفْعَلُ فَإِنْ أَثْبَتْنَا الْعِلْمَ فَقَدْ أَثْبَتْنَا فِي الازَلِ مَعَهُ شَيْئاً فَإِنْ رَأَيْتَ جَعَلَنِيَ الله فِدَاكَ أَنْ تُعَلِّمَنِي مِنْ ذَلِكَ مَا أَقِفُ عَلَيْهِ وَلا أَجُوزُهُ فَكَتَبَ (عَلَيْهِ السَّلام) بِخَطِّهِ لَمْ يَزَلِ الله عَالِماً تَبَارَكَ وَتَعَالَى ذِكْرُهُ.",
            "englishTranslation": "5. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Ja‘far ibn Muhammad ibn Hamzah who has said the following. “I wrote to the man (Imam , ‘Your followers differ about the knowledge of Allah. There are those who say that before creating all things Allah had eternally full knowledge of them. Others say that we should not say so because His knowing is like His action. If we prove that His Knowledge is eternal we have also established another thing eternal along with Him. May Allah take my soul in service for your cause, if you would consider it proper, kindly enlighten me in this issue so that I would have a firm stand and do not waver therefrom.” He wrote in his own handwriting, “Eternally Allah , the Most Holy, the Most High has had the Knowledge of all things.” ?? and Allah’s Positive Attributes such as His knowledge are the same as His Essence without any duality between His Essence and His Positive Attributes).’ “",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (11/ 2)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #6",
            "url": "https://thaqalayn.net/hadith/1/3/12/6",
            "arabicText": "6ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَبْدِ الصَّمَدِ بْنِ بَشِيرٍ عَنْ فُضَيْلِ بْنِ سُكَّرَةَ قَالَ قُلْتُ لابي جعفر (عَلَيْهِ السَّلام) جُعِلْتُ فِدَاكَ إِنْ رَأَيْتَ أَنْ تُعَلِّمَنِي هَلْ كَانَ الله جَلَّ وَجْهُهُ يَعْلَمُ قَبْلَ أَنْ يَخْلُقَ الْخَلْقَ أَنَّهُ وَحْدَهُ فَقَدِ اخْتَلَفَ مَوَالِيكَ فَقَالَ بَعْضُهُمْ قَدْ كَانَ يَعْلَمُ قَبْلَ أَنْ يَخْلُقَ شَيْئاً مِنْ خَلْقِهِ وَقَالَ بَعْضُهُمْ إِنَّمَا مَعْنَى يَعْلَمُ يَفْعَلُ فَهُوَ الْيَوْمَ يَعْلَمُ أَنَّهُ لا غَيْرُهُ قَبْلَ فِعْلِ الاشْيَاءِ فَقَالُوا إِنْ أَثْبَتْنَا أَنَّهُ لَمْ يَزَلْ عَالِماً بِأَنَّهُ لا غَيْرُهُ فَقَدْ أَثْبَتْنَا مَعَهُ غَيْرَهُ فِي أَزَلِيَّتِهِ فَإِنْ رَأَيْتَ يَا سَيِّدِي أَنْ تُعَلِّمَنِي مَا لا أَعْدُوهُ إِلَى غَيْرِهِ فَكَتَبَ (عَلَيْهِ السَّلام) مَا زَالَ الله عَالِماً تَبَارَكَ وَتَعَالَى ذِكْرُهُ.",
            "englishTranslation": "6. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Qasim ibn Muhammad from ’Abd al-Samad ibn Bashir from Fudayl ibn Sukkarah who has said the following. “I asked abu Ja‘far , ‘May Allah take my soul in service for your cause, if you would consider it proper please enlighten me about whether Allah, Majestic is Whose face, had knowledge of His Oneness before He brought the creation into existence? Your followers differ on this issue. There are those who believe that Allah did have knowledge of His Oneness before He created anything. Others say His knowledge is His action. Thus, now Allah has come to know that before He created things there had been nothing besides He Himself. They say that if we believe in the eternal knowledge of Allah of His Oneness, we have established another thing eternal along with Him. If you would consider it proper please enlighten me in this issue so I may not waver here and there.” He wrote, “Allah, the Blessed and Exalted has always had the Knowledge of all things.” (See Hadith No. 294 – 53)",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/12)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "14": {
        "Al-Kafi - Volume 1: Chapter On Will Power (IRADAH) it is of the Attributes of Action (SIFAT al-FI‘L) and the Rest of the Attributes of Action": [
          {
            "number": "Hadith #2",
            "url": "https://thaqalayn.net/hadith/1/3/14/2",
            "arabicText": "2ـ مُحَمَّدُ بْنُ أَبِي عَبْدِ الله عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنِ الْحُسَيْنِ بْنِ الْحَسَنِ عَنْ بَكْرِ بْنِ صَالِحٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنِ الْحَسَنِ بْنِ الْجَهْمِ عَنْ بُكَيْرِ بْنِ أَعْيَنَ قَالَ قُلْتُ لابِي عَبْدِ الله (عَلَيْهِ السَّلام) عِلْمُ الله وَمَشِيئَتُهُ هُمَا مُخْتَلِفَانِ أَوْ مُتَّفِقَانِ فَقَالَ الْعِلْمُ لَيْسَ هُوَ الْمَشِيئَةَ أَ لا تَرَى أَنَّكَ تَقُولُ سَأَفْعَلُ كَذَا إِنْ شَاءَ الله وَلا تَقُولُ سَأَفْعَلُ كَذَا إِنْ عَلِمَ الله فَقَوْلُكَ إِنْ شَاءَ الله دَلِيلٌ عَلَى أَنَّهُ لَمْ يَشَأْ فَإِذَا شَاءَ كَانَ الَّذِي شَاءَ كَمَا شَاءَ وَعِلْمُ الله السَّابِقُ لِلْمَشِيئَةِ.",
            "englishTranslation": "2. Muhammad ibn abu ‘Abdallah has narrated from Muhammad ibn Isma‘il from al-Husayn ibn al-Hassan from Bakr ibn Salih from Ali ibn Asbat from al-Hassan ibn al-Jahm from Bukayr ibn A‘yan who has said the following. “I asked abu ‘Abdallah , ‘Are the knowledge and the will of Allah different or the same?’” He replied, “His knowledge is not the same as His will. Consider when you say, ‘If Allah wills, I will do this,’ and you do not say, “If Allah knows I will do this.” Your own words, if Allah wills are proof that Allah has not yet willed it. If He would will what He would do, it happens exactly as He wills. His knowledge is before His will.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/16)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #5",
            "url": "https://thaqalayn.net/hadith/1/3/14/5",
            "arabicText": "5ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنِ الْمَشْرِقِيِّ حَمْزَةَ بْنِ الْمُرْتَفِعِ عَنْ بَعْضِ أَصْحَابِنَا قَالَ كُنْتُ فِي مَجْلِسِ ابي جعفر (عَلَيْهِ السَّلام) إِذْ دَخَلَ عَلَيْهِ عَمْرُو بْنُ عُبَيْدٍ فَقَالَ لَهُ جُعِلْتُ فِدَاكَ قَوْلُ الله تَبَارَكَ وَتَعَالَى وَمَنْ يَحْلِلْ عَلَيْهِ غَضَبِي فَقَدْ هَوى‏ مَا ذَلِكَ الْغَضَبُ فَقَالَ أَبُو جَعْفَرٍ (عَلَيْهِ السَّلام) هُوَ الْعِقَابُ يَا عَمْرُو إِنَّهُ مَنْ زَعَمَ أَنَّ الله قَدْ زَالَ مِنْ شَيْ‏ءٍ إِلَى شَيْ‏ءٍ فَقَدْ وَصَفَهُ صِفَةَ مَخْلُوقٍ وَإِنَّ الله تَعَالَى لا يَسْتَفِزُّهُ شَيْ‏ءٌ فَيُغَيِّرَهُ.",
            "englishTranslation": "5. A group of our people has narrated from Ahmad ibn Muhammad al-Barqi from Muhammad ibn ‘Isa from al-Mashriqi Hamzah ibn al-Murtafi‘ from some of our people who has said the following. “I was in the presence of abu Ja‘far  when ‘Amr ibn ‘Ubayd said, ‘May Allah take my soul in your service, what is the meaning of Allah’s words, “Whoever becomes subject to my anger he is destroyed.” 20:84 What is this anger?’ Abu Ja‘far  replied, “O ‘Amr, His anger is His punishment. O ‘Amr, whoever thinks Allah changes from one state to another, has ascribed to Allah the attributes of His creatures. Nothing can provoke Allah, the Sublime, to change Him.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/20)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "15": {
        "Al-Kafi - Volume 1: Chapter On the Coming into the Existence of the Names of Allah": [
          {
            "number": "Hadith #2",
            "url": "https://thaqalayn.net/hadith/1/3/15/2",
            "arabicText": "2ـ أَحْمَدُ بْنُ إِدْرِيسَ عَنِ الْحُسَيْنِ بْنِ عَبْدِ الله عَنْ مُحَمَّدِ بْنِ عَبْدِ الله وَمُوسَى بْنِ عُمَرَ وَالْحَسَنِ بْنِ عَلِيِّ بْنِ عُثْمَانَ عَنِ ابْنِ سِنَانٍ قَالَ سَأَلْتُ أَبَا الْحَسَنِ الرِّضَا (عَلَيْهِ السَّلام) هَلْ كَانَ الله عَزَّ وَجَلَّ عَارِفاً بِنَفْسِهِ قَبْلَ أَنْ يَخْلُقَ الْخَلْقَ قَالَ نَعَمْ قُلْتُ يَرَاهَا وَيَسْمَعُهَا قَالَ مَا كَانَ مُحْتَاجاً إِلَى ذَلِكَ لانَّهُ لَمْ يَكُنْ يَسْأَلُهَا وَلا يَطْلُبُ مِنْهَا هُوَ نَفْسُهُ وَنَفْسُهُ هُوَ قُدْرَتُهُ نَافِذَةٌ فَلَيْسَ يَحْتَاجُ أَنْ يُسَمِّيَ نَفْسَهُ وَلَكِنَّهُ اخْتَارَ لِنَفْسِهِ أَسْمَاءً لِغَيْرِهِ يَدْعُوهُ بِهَا لانَّهُ إِذَا لَمْ يُدْعَ بِاسْمِهِ لَمْ يُعْرَفْ فَأَوَّلُ مَا اخْتَارَ لِنَفْسِهِ الْعَلِيُّ الْعَظِيمُ لانَّهُ أَعْلَى الاشْيَاءِ كُلِّهَا فَمَعْنَاهُ الله وَاسْمُهُ الْعَلِيُّ الْعَظِيمُ هُوَ أَوَّلُ أَسْمَائِهِ عَلا عَلَى كُلِّ شَيْ‏ءٍ.",
            "englishTranslation": "2. Ahmad ibn Idris has narrated from al-Husayn ibn ‘Abdallah from Muhammad ibn ‘Abdallah and Musa ibn ‘Umar and al-Hassan ibn Ali ibn ‘Uthman from ibn Sinan who has said the following. “I asked abu al-Hassan al-Rida , ‘Did Allah, the Majestic, the Glorious, know Himself before He created the creation?’” The Imam  replied, “Yes, He knew Himself.” I further asked, “Did He see and hear His Own Self?” The Imam replied, “Allah did not need such things because He did not ask or demand it. He is His Own self and His Own self is He. His power is dominant and He does not need to name His Own self. He chose His Own name for the sake of others so they can call Him. Until one is not called by means of his names he is not recognized. The fist name He chose for His Own self was al-‘Ali al-‘Azim (the Most High, the Great) because He is above all things. It then means that Allah and His name al-‘Ali al-‘Azim is His. The Most High, He is above all things.",
            "gradings": [
              {
                "grade": "ضعيف على المشهور",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/30)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #3",
            "url": "https://thaqalayn.net/hadith/1/3/15/3",
            "arabicText": "3ـ وَبِهَذَا الاسْنَادِ عَنْ مُحَمَّدِ بْنِ سِنَانٍ قَالَ سَأَلْتُهُ عَنِ الاسْمَ مَا هُوَ قَالَ صِفَةٌ لِمَوْصُوفٍ.",
            "englishTranslation": "3. It is narrated through the same chain of narrators (as in the above Hadith) from Muhammad ibn Sinan who has said the following. “I asked the Imam, (perhaps abu al-Hassan al-Rida) about the name (of Allah), ‘What is it?’ The Imam replied, “It is an attribute of the attributes of (Allah).”",
            "gradings": [
              {
                "grade": "ضعيف على المشهور",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/31)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #4",
            "url": "https://thaqalayn.net/hadith/1/3/15/4",
            "arabicText": "4ـ مُحَمَّدُ بْنُ أَبِي عَبْدِ الله عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ بَعْضِ أَصْحَابِهِ عَنْ بَكْرِ بْنِ صَالِحٍ عَنْ عَلِيِّ بْنِ صَالِحٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ خَالِدِ بْنِ يَزِيدَ عَنْ عَبْدِ الاعْلَى عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ اسْمُ الله غَيْرُهُ وَكُلُّ شَيْ‏ءٍ وَقَعَ عَلَيْهِ اسْمُ شَيْ‏ءٍ فَهُوَ مَخْلُوقٌ مَا خَلا الله فَأَمَّا مَا عَبَّرَتْهُ الالْسُنُ أَوْ عَمِلَتِ الايْدِي فَهُوَ مَخْلُوقٌ وَالله غَايَةٌ مِنْ غَايَاتِهِ وَالْمُغَيَّا غَيْرُ الْغَايَةِ وَالْغَايَةُ مَوْصُوفَةٌ وَكُلُّ مَوْصُوفٍ مَصْنُوعٌ وَصَانِعُ الاشْيَاءِ غَيْرُ مَوْصُوفٍ بِحَدٍّ مُسَمًّى لَمْ يَتَكَوَّنْ فَيُعْرَفَ كَيْنُونِيَّتُهُ بِصُنْعِ غَيْرِهِ وَلَمْ يَتَنَاهَ إِلَى غَايَةٍ إِلا كَانَتْ غَيْرَهُ لا يَزِلُّ مَنْ فَهِمَ هَذَا الْحُكْمَ أَبَداً وَهُوَ التَّوْحِيدُ الْخَالِصُ فَارْعَوْهُ وَصَدِّقُوهُ وَتَفَهَّمُوهُ بِإِذْنِ الله مَنْ زَعَمَ أَنَّهُ يَعْرِفُ الله بِحِجَابٍ أَوْ بِصُورَةٍ أَوْ بِمِثَالٍ فَهُوَ مُشْرِكٌ لانَّ حِجَابَهُ وَمِثَالَهُ وَصُورَتَهُ غَيْرُهُ وَإِنَّمَا هُوَ وَاحِدٌ مُتَوَحِّدٌ فَكَيْفَ يُوَحِّدُهُ مَنْ زَعَمَ أَنَّهُ عَرَفَهُ بِغَيْرِهِ وَإِنَّمَا عَرَفَ الله مَنْ عَرَفَهُ بِالله فَمَنْ لَمْ يَعْرِفْهُ بِهِ فَلَيْسَ يَعْرِفُهُ إِنَّمَا يَعْرِفُ غَيْرَهُ لَيْسَ بَيْنَ الْخَالِقِ وَالْمَخْلُوقِ شَيْ‏ءٌ وَالله خَالِقُ الاشْيَاءِ لا مِنْ شَيْ‏ءٍ كَانَ وَالله يُسَمَّى بِأَسْمَائِهِ وَهُوَ غَيْرُ أَسْمَائِهِ وَالاسْمَاءُ غَيْرُهُ.",
            "englishTranslation": "4. Muhammad ibn abu ‘Abdallah has narrated from Muhammad ibn Isma‘il from some of his people from Bakr ibn Salih from Ali ibn Salih from al-Hassan ibn Muhammad ibn Khalid ibn Yazid from ‘Abd al-A‘la from abu ‘Abdallah , who has said the following. “The name of Allah is something other than Allah Himself. Every thing that is called a thing is created except Allah. Whatever is expressed by the tongue or is worked out by hands are all created. The word Allah is an intent amongst His intents, and the intended one is different from the intention. The purpose is describable, and every describable thing is made. The Maker of things is not describable by the limits of the fact behind the name. He did not become, so His becoming a being would have been recognized through the making of what is other than Him. He did not end up where there was another’s end. Do not ever move away from understanding this rule. This is the true and pure belief in the Oneness of Allah. Observe it, acknowledge it and understand it by the permission of Allah. Those who think they understand Allah by means of a barrier, form or examples they become polytheists because his barrier, form and example are not Him. He is only One and One alone. How can one form a belief in His Oneness by thinking that one may know Him through things other than Him. One comes to know Allah only by Allah His Own self. One who can not know Him by His Own self he has not known Him. He only comes to know some thing else. There is nothing between the Creator and the created. Allah is the Creator of things but not from a thing that was there already. Allah’s names are His names but He is different from His Own names and the names are other than Him.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/31)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "16": {
        "Al-Kafi - Volume 1: Chapter On The Meanings of the Names of Allah and their Derivatives": [
          {
            "number": "Hadith #1",
            "url": "https://thaqalayn.net/hadith/1/3/16/1",
            "arabicText": "1ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنِ الْقَاسِمِ بْنِ يَحْيَى عَنْ جَدِّهِ الْحَسَنِ بْنِ رَاشِدٍ عَنْ عَبْدِ الله بْنِ سِنَانٍ قَالَ سَأَلْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) عَنْ تَفْسِيرِ بِسْمِ الله الرَّحْمنِ الرَّحِيمِ قَالَ الْبَاءُ بَهَاءُ الله وَالسِّينُ سَنَاءُ الله وَالْمِيمُ مَجْدُ الله وَرَوَى بَعْضُهُمْ الْمِيمُ مُلْكُ الله وَالله إِلَهُ كُلِّ شَيْ‏ءٍ الرَّحْمَنُ بِجَمِيعِ خَلْقِهِ وَالرَّحِيمُ بِالْمُؤْمِنِينَ خَاصَّةً.",
            "englishTranslation": "1. A group of our people has narrated from Ahmad ibn Muhammad ibn Khalid from al-Qasim ibn Yahya from his grandfather al-Hassan ibn Rashid from ‘Abdallah ibn Sinan who has said the following. “I asked abu ‘Abdallah  about the interpretation of the verse of the holy Quran, ‘In the Name of Allah, the Beneficent, the Merciful.’ The Imam replied, “The first letter B in the Arabic version signifies Baha ’Ullah means beauty of Allah. The second letter S’ signifies Sana ’Ullah means radiance of Allah. The third letter M signifies Majdullah means the Grandeur of Allah or according to some other narrators, Mujdullah means Kingdom of Allah. Allah means; Lord of all things. And al-Rahman means the Beneficent to all of His creatures in general. Al-Rahim means the Most Merciful to the believers in particular.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/37)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #3",
            "url": "https://thaqalayn.net/hadith/1/3/16/3",
            "arabicText": "3ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ عَنِ الْقَاسِمِ بْنِ يَحْيَى عَنْ جَدِّهِ الْحَسَنِ بْنِ رَاشِدٍ عَنْ أَبِي الْحَسَنِ مُوسَى بْنِ جَعْفَرٍ (عَلَيْهما السَّلام) قَالَ سُئِلَ عَنْ مَعْنَى الله فَقَالَ اسْتَوْلَى عَلَى مَا دَقَّ وَجَلَّ.",
            "englishTranslation": "3. A group of our people has narrated from Ahmad ibn Muhammad from al-Barqi from al-Qasim ibn Yahya from his grandfather al-Hassan ibn Rashid from abul Hassan Musa ibn Ja‘far , who was questioned about the meaning of the word Allah. The Imam replied, “He (Allah) dominates all things small or big.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/39)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #4",
            "url": "https://thaqalayn.net/hadith/1/3/16/4",
            "arabicText": "4ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنِ الْعَبَّاسِ بْنِ هِلالٍ قَالَ سَأَلْتُ الرِّضَا (عَلَيْهِ السَّلام) عَنْ قَوْلِ الله الله نُورُ السَّماواتِ وَالارْضِ فَقَالَ هَادٍ لاهْلِ السَّمَاءِ وَهَادٍ لاهْلِ الارْضِ وَفِي رِوَايَةِ الْبَرْقِيِّ هُدَى مَنْ فِي السَّمَاءِ وَهُدَى مَنْ فِي الارْضِ.",
            "englishTranslation": "4. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Ya‘qub ibn Yazid from al-‘Abbass ibn Hilal who has said the following. “I asked Imam al-Rida , about the words of Allah, ‘Allah is the Light of the heavens and the earth’” (24:35). The Imam replied, “Allah is the Guide for all that is in the heavens and the Guide for all that is on the earth.” According to another Hadith narrated by al-Barqi,(the Imam said), “Allah has guided everyone in the heavens and every one on the earth.”",
            "gradings": [
              {
                "grade": "ضعيف على المشهور وآخره مرسل",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (40/ 2)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #8",
            "url": "https://thaqalayn.net/hadith/1/3/16/8",
            "arabicText": "8ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ قَالَ رَجُلٌ عِنْدَهُ الله أَكْبَرُ فَقَالَ الله أَكْبَرُ مِنْ أَيِّ شَيْ‏ءٍ فَقَالَ مِنْ كُلِّ شَيْ‏ءٍ فَقَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) حَدَّدْتَهُ فَقَالَ الرَّجُلُ كَيْفَ أَقُولُ قَالَ قُلْ الله أَكْبَرُ مِنْ أَنْ يُوصَفَ.",
            "englishTranslation": "8. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Ibn Mahbub from those he mentioned from abu ‘Abdallah  who has said the following. “A man said, Allahu Akbar (Allah is Greatest) in his presence.” The Imam asked, “Allah is Greatest than who?” The man replied, “Greatest than everything.” The Imam said, “You have considered Him limited.” The man asked, “Then, how should I say it?” The Imam replied, “Say, ‘Allah is Greatest beyond description.’”",
            "gradings": [
              {
                "grade": "ضعيف على المشهور",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/48)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #11",
            "url": "https://thaqalayn.net/hadith/1/3/16/11",
            "arabicText": "11ـ أَحْمَدُ بْنُ مِهْرَانَ عَنْ عَبْدِ الْعَظِيمِ بْنِ عَبْدِ الله الْحَسَنِيِّ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ سُلَيْمَانَ مَوْلَى طِرْبَالٍ عَنْ هِشَامٍ الْجَوَالِيقِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) عَنْ قَوْلِ الله عَزَّ وَجَلَّ سُبْحانَ الله مَا يُعْنَى بِهِ قَالَ تَنْزِيهُهُ.",
            "englishTranslation": "11. Ahmad ibn Mihran has narrated from ‘Abd al-‘Azim ibn ‘Abdallah al-Hassani from Ali ibn Asbat. From Sulayman Mawla Tirbal from Hisham al-Jawaliqi who has said the following. “I asked abu ‘Abdallah  about the meaning of the words of Allah, the Majestic, the Glorious, Glorious Allah (Qur’an, 12:108, 23:91, 28:68, 37:159, 52:43, 59:23). The Imam replied, “They denote Allah’s being above all things in perfection.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/49)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "18": {
        "Al-Kafi - Volume 1: Chapter on the Interpretation of al-Samad, Self-sufficient": [
          {
            "number": "Hadith #1",
            "url": "https://thaqalayn.net/hadith/1/3/18/1",
            "arabicText": "1ـ عَلِيُّ بْنُ مُحَمَّدٍ وَمُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ وَلَقَبُهُ شَبَابٌ الصَّيْرَفِيُّ عَنْ دَاوُدَ بْنِ الْقَاسِمِ الْجَعْفَرِيِّ قَالَ قُلْتُ لابِي جَعْفَرٍ الثَّانِي (عَلَيْهِ السَّلام) جُعِلْتُ فِدَاكَ مَا الصَّمَدُ قَالَ السَّيِّدُ الْمَصْمُودُ إِلَيْهِ فِي الْقَلِيلِ وَالْكَثِيرِ.",
            "englishTranslation": "1. Ali ibn Muhammad and Muhammad ibn al-Hassan has narrated from Sahl ibn Ziyad from Muhammad ibn al-Walid, whose title was Shabab al-Sayrafi from Dawud ibn al-Qasim al-Ja‘fari who has said the following. “I asked Imam abu Ja‘far al-Thani (the 2nd , ‘May Allah take my soul in your service, what is the meaning of the word al-Samad?’” The Imam replied, al-Samad means the Lord to Who one turns for help, big or small.”",
            "gradings": [
              {
                "grade": "ضعيف على المشهور",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/60)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "19": {
        "Al-Kafi - Volume 1: Chapter on Motion and Change": [
          {
            "number": "Hadith #1",
            "url": "https://thaqalayn.net/hadith/1/3/19/1",
            "arabicText": "1ـ مُحَمَّدُ بْنُ أَبِي عَبْدِ الله عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ الْبَرْمَكِيِّ عَنْ عَلِيِّ بْنِ عَبَّاسٍ الْخَرَاذِينِيِّ عَنِ الْحَسَنِ بْنِ رَاشِدٍ عَنْ يَعْقُوبَ بْنِ جَعْفَرٍ الْجَعْفَرِيِّ عَنْ أَبِي إِبْرَاهِيمَ (عَلَيْهِ السَّلام) قَالَ ذُكِرَ عِنْدَهُ قَوْمٌ يَزْعُمُونَ أَنَّ الله تَبَارَكَ وَتَعَالَى يَنْزِلُ إِلَى السَّمَاءِ الدُّنْيَا فَقَالَ إِنَّ الله لا يَنْزِلُ وَلا يَحْتَاجُ إِلَى أَنْ يَنْزِلَ إِنَّمَا مَنْظَرُهُ فِي الْقُرْبِ وَالْبُعْدِ سَوَاءٌ لَمْ يَبْعُدْ مِنْهُ قَرِيبٌ وَلَمْ يَقْرُبْ مِنْهُ بَعِيدٌ وَلَمْ يَحْتَجْ إِلَى شَيْ‏ءٍ بَلْ يُحْتَاجُ إِلَيْهِ وَهُوَ ذُو الطَّوْلِ لا إِلَهَ إِلا هُوَ الْعَزِيزُ الْحَكِيمُ أَمَّا قَوْلُ الْوَاصِفِينَ إِنَّهُ يَنْزِلُ تَبَارَكَ وَتَعَالَى فَإِنَّمَا يَقُولُ ذَلِكَ مَنْ يَنْسُبُهُ إِلَى نَقْصٍ أَوْ زِيَادَةٍ وَكُلُّ مُتَحَرِّكٍ مُحْتَاجٌ إِلَى مَنْ يُحَرِّكُهُ أَوْ يَتَحَرَّكُ بِهِ فَمَنْ ظَنَّ بِالله الظُّنُونَ هَلَكَ فَاحْذَرُوا فِي صِفَاتِهِ مِنْ أَنْ تَقِفُوا لَهُ عَلَى حَدٍّ تَحُدُّونَهُ بِنَقْصٍ أَوْ زِيَادَةٍ أَوْ تَحْرِيكٍ أَوْ تَحَرُّكٍ أَوْ زَوَالٍ أَوِ اسْتِنْزَالٍ أَوْ نُهُوضٍ أَوْ قُعُودٍ فَإِنَّ الله جَلَّ وَعَزَّ عَنْ صِفَةِ الْوَاصِفِينَ وَنَعْتِ النَّاعِتِينَ وَتَوَهُّمِ الْمُتَوَهِّمِينَ وَتَوَكَّلْ عَلَى الْعَزِيزِ الرَّحِيمِ الَّذِي يَرَاكَ حِينَ تَقُومُ وَتَقَلُّبَكَ فِي السَّاجِدِينَ.",
            "englishTranslation": "1. Muhammad ibn abu ‘Abdallah has narrated from Muhammad ibn Isma‘il al-Barmaki from Ali ibn ‘Abbass al-Kharazini from al-Hassan ibn Rashid from Ya‘qub ibn Ja‘far al-Ja‘fari, from abu Ibrahim  Who has said the following. “A people was mentioned, before the Imam , who believed that Allah, the Most Holy, the Most High, comes down to the sky above the earth.” The Imam  said, “Allah does not come down and He does not need to come down. His sight for near and far is the same. Near does not become far for Him and far does not become near for Him. He does not become needy for any thing but all things need Him and He is generous. There is no Lord except Him. He is Most Majestic and All-wise. The statement that says Allah, the Most Holy, the Most High, comes down to the sky over the earth can only come from those who consider Him to decrease or increase (in size). Besides, all moving objects need something to move it or move because of it. Whoever thinks of Allah as such has caused his own destruction. Be very careful about the attributes of Allah to have a belief about them that would limit Him through increase or reduction, moving or being moved, removal or His coming down, standing up or sitting down. Allah, the Most Holy, the Most High, is far from being described by those who would like to describe Him or being characterized by those who do so or pictured in imagination. Have trust in Allah, the Most Majestic, the Most Merciful Who sees you when you get up and when you change positions during prostration.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (63/ 2)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #2",
            "url": "https://thaqalayn.net/hadith/1/3/19/2",
            "arabicText": "2ـ وَعَنْهُ رَفَعَهُ عَنِ الْحَسَنِ بْنِ رَاشِدٍ عَنْ يَعْقُوبَ بْنِ جَعْفَرٍ عَنْ أَبِي إِبْرَاهِيمَ (عَلَيْهِ السَّلام) أَنَّهُ قَالَ لا أَقُولُ إِنَّهُ قَائِمٌ فَأُزِيلُهُ عَنْ مَكَانِهِ وَلا أَحُدُّهُ بِمَكَانٍ يَكُونُ فِيهِ وَلا أَحُدُّهُ أَنْ يَتَحَرَّكَ فِي شَيْ‏ءٍ مِنَ الارْكَانِ وَالْجَوَارِحِ وَلا أَحُدُّهُ بِلَفْظِ شَقِّ فَمٍ وَلَكِنْ كَمَا قَالَ الله تَبَارَكَ وَتَعَالَى كُنْ فَيَكُونُ بِمَشِيئَتِهِ مِنْ غَيْرِ تَرَدُّدٍ فِي نَفْسٍ صَمَداً فَرْداً لَمْ يَحْتَجْ إِلَى شَرِيكٍ يَذْكُرُ لَهُ مُلْكَهُ وَلا يَفْتَحُ لَهُ أَبْوَابَ عِلْمِهِ.",
            "englishTranslation": "2. It is narrated from him (the narrator of the above Hadith), in a marfu‘ manner, from al-Hassan ibn Rashid from Ya‘qub ibn Ja‘far from abu Ibrahim  who has said the following. “I do not say that he is standing so I would remove Him from His place. I do not limit Him in a place. I do not limit Him by His moving in something with key elements of the body or body parts. I do not limit Him by ascribing the movements of mouth or tongue. The truth is what Allah, the Most Holy, the Most High, has said, Be and it comes into existence through His will without any planning in a soul. He is Self-sufficient and all alone. He does not need any partner who would speak of His kingdom or open the doors of His knowledge.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/65)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #6",
            "url": "https://thaqalayn.net/hadith/1/3/19/6",
            "arabicText": "6ـ عَلِيُّ بْنُ مُحَمَّدٍ وَمُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُوسَى الْخَشَّابِ عَنْ بَعْضِ رِجَالِهِ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) أَنَّهُ سُئِلَ عَنْ قَوْلِ الله عَزَّ وَجَلَّ الرَّحْمنُ عَلَى الْعَرْشِ اسْتَوى‏ فَقَالَ اسْتَوَى عَلَى كُلِّ شَيْ‏ءٍ فَلَيْسَ شَيْ‏ءٌ أَقْرَبَ إِلَيْهِ مِنْ شَيْ‏ءٍ.",
            "englishTranslation": "6. Ali ibn Muhammad and Muhammad ibn al-Hassan have narrated from Sahl ibn Ziyad from al-Hassan ibn Musa al-Khashshab from a few of his people from Imam abu ‘Abdallah  who (the narrator) has said the following. “A person asked the Imam about the words of Allah, “The Beneficent God is dominant over the Throne (of the realm) (20:5)” The Imam said, “Allah established His control over all things. No one thing is closer to Him than any other thing.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (68/ 2)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "20": {
        "Al-Kafi - Volume 1: Chapter about al-‘Arsh and al-Kursi": [
          {
            "number": "Hadith #7",
            "url": "https://thaqalayn.net/hadith/1/3/20/7",
            "arabicText": "7ـ مُحَمَّدُ بْنُ الْحَسَنِ عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَثِيرٍ عَنْ دَاوُدَ الرَّقِّيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) عَنْ قَوْلِ الله عَزَّ وَجَلَّ وَكانَ عَرْشُهُ عَلَى الْماءِ فَقَالَ مَا يَقُولُونَ قُلْتُ يَقُولُونَ إِنَّ الْعَرْشَ كَانَ عَلَى الْمَاءِ وَالرَّبُّ فَوْقَهُ فَقَالَ كَذَبُوا مَنْ زَعَمَ هَذَا فَقَدْ صَيَّرَ الله مَحْمُولاً وَوَصَفَهُ بِصِفَةِ الْمَخْلُوقِ وَلَزِمَهُ أَنَّ الشَّيْ‏ءَ الَّذِي يَحْمِلُهُ أَقْوَى مِنْهُ قُلْتُ بَيِّنْ لِي جُعِلْتُ فِدَاكَ فَقَالَ إِنَّ الله حَمَّلَ دِينَهُ وَعِلْمَهُ الْمَاءَ قَبْلَ أَنْ يَكُونَ أَرْضٌ أَوْ سَمَاءٌ أَوْ جِنٌّ أَوْ إِنْسٌ أَوْ شَمْسٌ أَوْ قَمَرٌ فَلَمَّا أَرَادَ الله أَنْ يَخْلُقَ الْخَلْقَ نَثَرَهُمْ بَيْنَ يَدَيْهِ فَقَالَ لَهُمْ مَنْ رَبُّكُمْ فَأَوَّلُ مَنْ نَطَقَ رَسُولُ الله (صَلَّى اللهُ عَلَيْهِ وَآلِه) وَأَمِيرُ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) وَالائِمَّةُ صَلَوَاتُ الله عَلَيْهِمْ فَقَالُوا أَنْتَ رَبُّنَا فَحَمَّلَهُمُ الْعِلْمَ وَالدِّينَ ثُمَّ قَالَ لِلْمَلائِكَةِ هَؤُلاءِ حَمَلَةُ دِينِي وَعِلْمِي وَأُمَنَائِي فِي خَلْقِي وَهُمُ الْمَسْئُولُونَ ثُمَّ قَالَ لِبَنِي آدَمَ أَقِرُّوا لله بِالرُّبُوبِيَّةِ وَلِهَؤُلاءِ النَّفَرِ بِالْوَلايَةِ وَالطَّاعَةِ فَقَالُوا نَعَمْ رَبَّنَا أَقْرَرْنَا فَقَالَ الله لِلْمَلائِكَةِ اشْهَدُوا فَقَالَتِ الْمَلائِكَةُ شَهِدْنَا عَلَى أَنْ لا يَقُولُوا غَداً إِنَّا كُنَّا عَنْ هذا غافِلِينَ. أَوْ تَقُولُوا إِنَّما أَشْرَكَ آباؤُنا مِنْ قَبْلُ وَكُنَّا ذُرِّيَّةً مِنْ بَعْدِهِمْ أَ فَتُهْلِكُنا بِما فَعَلَ الْمُبْطِلُونَ يَا دَاوُدُ وَلايَتُنَا مُؤَكَّدَةٌ عَلَيْهِمْ فِي الْمِيثَاقِ.",
            "englishTranslation": "7. Muhammad ibn al-Hassan has narrated from Sahl ibn Ziyad from ibn Mahbub from ‘Abd al-Rahman ibn Kathir from Dawud al-Ruqyy who has said the following. “I asked Imam abu ‘Abdallah  about the words of Allah, ‘. . His Throne existed on water . (11:8).’” The Imam asked, “What do they say about it?” I said, “They say that al-‘Arsh (the Throne) was on the water and the Lord was on top of it.” The Imam then said, “They have said a lie. Whoever would think that way he has considered Allah as being carried and has described Him with the qualities of the creatures which involves that the thing that carries Him is stronger than Him.” I then asked, may Allah take my soul for your service, please explain it to me.” The Imam then said, “Allah made water to carry His religion and His knowledge before there were the earth, the heavens, the Jinns, the human beings, the sun and the moon. When Allah willed to create the creatures He spread them before His-self and said to them, “Who is you Lord? The first ones who spoke were the Holy Prophet and Amirul Mu‘minin Ali  and the Imams . They all said, “You are our Lord.” He then made them to carry the religion and the knowledge. Then He spoke to the angels, “These are the carriers of My religion and knowledge, My trustees in My people and they are responsible (or questions will be asked about them). Then Allah spoke to the children of Adam, “Acknowledge that Allah is the Lord and acknowledge that these people are the authorities (of Allah) among you and that obedience to them is obligatory. They said, “O our Lord, we acknowledge.” Allah then told the angels, “Bear witness to this.” The angels said, “We bear witness so that they, tomorrow will not say, ‘We were not aware of this or say that our forefathers have worshipped idols before us and we were only their offspring. Will You then destroy us just because what the followers of falsehood have done?” O Dawud, our authority over them was strongly stressed up on at the time of the covenant.”",
            "gradings": [
              {
                "grade": "ضعيف على المشهور",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/81)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "21": {
        "Al-Kafi - Volume 1: Chapter on al-Ruh, the Spirit": [
          {
            "number": "Hadith #4",
            "url": "https://thaqalayn.net/hadith/1/3/21/4",
            "arabicText": "4ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ عَبْدِ الله بْنِ بَحْرٍ عَنْ أَبِي أَيُّوبَ الْخَزَّازِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ (عَلَيْهِ السَّلام) عَمَّا يَرْوُونَ أَنَّ الله خَلَقَ آدَمَ عَلَى صُورَتِهِ فَقَالَ هِيَ صُورَةٌ مُحْدَثَةٌ مَخْلُوقَةٌ وَاصْطَفَاهَا الله وَاخْتَارَهَا عَلَى سَائِرِ الصُّوَرِ الْمُخْتَلِفَةِ فَأَضَافَهَا إِلَى نَفْسِهِ كَمَا أَضَافَ الْكَعْبَةَ إِلَى نَفْسِهِ وَالرُّوحَ إِلَى نَفْسِهِ فَقَالَ بَيْتِيَ وَنَفَخْتُ فِيهِ مِنْ رُوحِي.",
            "englishTranslation": "4. It is narrated from a number of our people from Ahmad ibn Muhammad ibn Khalid from his father from ‘Abdallah ibn Bahr from abu Ayyub al-Khazzan from Muhammad ibn Muslim who has said the following. “I asked Imam abu ‘Abdallah  about what people narrate that Allah created Adam in His-own form.” The Imam  replied, “It is created and newly invented form. Allah selected and chose it over the other various forms and gave His-own possessive case just like He has done so about Ka‘bah and the spirit saying, ‘My house’ ‘I have blown My spirit in Him.’”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (84/ 2)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "22": {
        "Al-Kafi - Volume 1: Chapter on Comprehensive (Ahadith) about the Oneness of Allah": [
          {
            "number": "Hadith #2",
            "url": "https://thaqalayn.net/hadith/1/3/22/2",
            "arabicText": "2ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ صَالِحِ بْنِ أَبِي حَمَّادٍ عَنِ الْحُسَيْنِ بْنِ يَزِيدَ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ إِبْرَاهِيمَ عَنْ أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) قَالَ إِنَّ الله تَبَارَكَ اسْمُهُ وَتَعَالَى ذِكْرُهُ وَجَلَّ ثَنَاؤُهُ سُبْحَانَهُ وَتَقَدَّسَ وَتَفَرَّدَ وَتَوَحَّدَ وَلَمْ يَزَلْ وَلا يَزَالُ وَهُوَ الاوَّلُ وَالاخِرُ وَالظَّاهِرُ وَالْبَاطِنُ فَلا أَوَّلَ لاوَّلِيَّتِهِ رَفِيعاً فِي أَعْلَى عُلُوِّهِ شَامِخُ الارْكَانِ رَفِيعُ الْبُنْيَانِ عَظِيمُ السُّلْطَانِ مُنِيفُ الالاءِ سَنِيُّ الْعَلْيَاءِ الَّذِي عَجَزَ الْوَاصِفُونَ عَنْ كُنْهِ صِفَتِهِ وَلا يُطِيقُونَ حَمْلَ مَعْرِفَةِ إِلَهِيَّتِهِ وَلا يَحُدُّونَ حُدُودَهُ لانَّهُ بِالْكَيْفِيَّةِ لا يُتَنَاهَى إِلَيْهِ.",
            "englishTranslation": "2. Ali ibn Muhammad has narrated from Salih ibn Hammad from al-Husayn ibn Yazid from al-Hassan ibn Ali ibn abu Hamza from Ibrahim from abu ‘Abdallah  Who has said the following. “Allah, the Most Holy is Whose name, the Most High is Whose praise, the Most Glorious are Whose attributes. He is the Most Sacred, the Most Holy, the only One in oneness. He is eternal, the First and the Last, the Manifest and the Hidden. There is no beginning for Him. He is the Most Exalted in His highness. The Highest in power, Exalted in authority, the greatest in kingdom, the Most bountiful, His Highness is the Most High. He is the One whose praise no one can complete, and can not bear the knowledge of His Lordship. No one is able to limit Him because it is not possible to reach Him with qualities.”",
            "gradings": [
              {
                "grade": "ضعيف على المشهور",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (91/ 2)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #5",
            "url": "https://thaqalayn.net/hadith/1/3/22/5",
            "arabicText": "5ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ شَبَابٍ الصَّيْرَفِيِّ وَاسْمُهُ مُحَمَّدُ بْنُ الْوَلِيدِ عَنْ عَلِيِّ بْنِ سَيْفِ بْنِ عَمِيرَةَ قَالَ حَدَّثَنِي إِسْمَاعِيلُ بْنُ قُتَيْبَةَ قَالَ دَخَلْتُ أَنَا وَعِيسَى شَلَقَانُ عَلَى أَبِي عَبْدِ الله (عَلَيْهِ السَّلام) فَابْتَدَأَنَا فَقَالَ عَجَباً لاقْوَامٍ يَدَّعُونَ عَلَى أَمِيرِ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) مَا لَمْ يَتَكَلَّمْ بِهِ قَطُّ خَطَبَ أَمِيرُ الْمُؤْمِنِينَ (عَلَيْهِ السَّلام) النَّاسَ بِالْكُوفَةِ فَقَالَ الْحَمْدُ لله الْمُلْهِمِ عِبَادَهُ حَمْدَهُ وَفَاطِرِهِمْ عَلَى مَعْرِفَةِ رُبُوبِيَّتِهِ الدَّالِّ عَلَى وُجُودِهِ بِخَلْقِهِ وَبِحُدُوثِ خَلْقِهِ عَلَى أَزَلِهِ وَبِاشْتِبَاهِهِمْ عَلَى أَنْ لا شِبْهَ لَهُ الْمُسْتَشْهِدِ بِ‏آيَاتِهِ عَلَى قُدْرَتِهِ الْمُمْتَنِعَةِ مِنَ الصِّفَاتِ ذَاتُهُ وَمِنَ الابْصَارِ رُؤْيَتُهُ وَمِنَ الاوْهَامِ الاحَاطَةُ بِهِ لا أَمَدَ لِكَوْنِهِ وَلا غَايَةَ لِبَقَائِهِ لا تَشْمُلُهُ الْمَشَاعِرُ وَلا تَحْجُبُهُ الْحُجُبُ وَالْحِجَابُ بَيْنَهُ وَبَيْنَ خَلْقِهِ خَلْقُهُ إِيَّاهُمْ لامْتِنَاعِهِ مِمَّا يُمْكِنُ فِي ذَوَاتِهِمْ وَلامْكَانٍ مِمَّا يَمْتَنِعُ مِنْهُ وَلافْتِرَاقِ الصَّانِعِ مِنَ الْمَصْنُوعِ وَالْحَادِّ مِنَ الْمَحْدُودِ وَالرَّبِّ مِنَ الْمَرْبُوبِ الْوَاحِدُ بِلا تَأْوِيلِ عَدَدٍ وَالْخَالِقُ لا بِمَعْنَى حَرَكَةٍ وَالْبَصِيرُ لا بِأَدَاةٍ وَالسَّمِيعُ لا بِتَفْرِيقِ آلَةٍ وَالشَّاهِدُ لا بِمُمَاسَّةٍ وَالْبَاطِنُ لا بِاجْتِنَانٍ وَالظَّاهِرُ الْبَائِنُ لا بِتَرَاخِي مَسَافَةٍ أَزَلُهُ نُهْيَةٌ لِمَجَاوِلِ الافْكَارِ وَدَوَامُهُ رَدْعٌ لِطَامِحَاتِ الْعُقُولِ قَدْ حَسَرَ كُنْهُهُ نَوَافِذَ الابْصَارِ وَقَمَعَ وُجُودُهُ جَوَائِلَ الاوْهَامِ فَمَنْ وَصَفَ الله فَقَدْ حَدَّهُ وَمَنْ حَدَّهُ فَقَدْ عَدَّهُ وَمَنْ عَدَّهُ فَقَدْ أَبْطَلَ أَزَلَهُ وَمَنْ قَالَ أَيْنَ فَقَدْ غَيَّاهُ وَمَنْ قَالَ عَلامَ فَقَدْ أَخْلَى مِنْهُ وَمَنْ قَالَ فِيمَ فَقَدْ ضَمَّنَهُ.",
            "englishTranslation": "5. Ali ibn Muhammad has narrated from Sahl ibn Ziyad from Shabab al-Sayarafi called Muhammad ibn al-Walid from Ali ibn Sayf from ‘Amira who has said that Isma‘il ibn Qutayba said the following. “I and ‘Isa ibn al-Shalqan went to see Imam abu ‘Abdallah . The Imam said ‘It is strange that a group of people ascribe to Amirul Mu’minin certain things that he had never said. Amirul Mu’minin addressed people in Kufa in the following words. “All praise is due to Allah Who inspired His servants with His praise and natured them in a way that would give them the desire to acknowledge His Lordship. It is He, Who guides people through His creation to His Own existence and His creatures are evidence of His eternity. The fact that His creatures are similar is evidence that there is nothing similar to Him. His signs are evidence of His great power. His Own-self prohibits acceptance of descriptions and so are His being seen with the eyes and His being comprehended in the imaginations. There is no time limit for His being in existence and there is no final destination for Him. Awareness can not contain Him and coverings can not cover Him. The curtain between Him and His creatures is His creating them. It is because of being impossible for Him what is possible in the essence of the creatures and because of what may be possible in their case is impossible in His case. It is also because of the difference between the Creator and the created, the limited and the unlimited and the Lord and the worshippers. He is One without being a unit of a particular kind. He is the Creator but not terms of motion. He is seeing but not by means of tools. He is hearing but not with distinguishing instruments. He observes but not by means of touching. He is hidden but not with covering. He is clearly manifest but not with lapse due to distance. His eternity is beyond the reach of thinking and a stop for the aims of the intelligence. His reality has worn out the ability of sight and His Own-self has uprooted the (spreading) vines of imaginations. Whoever tries to describe Allah has thought of Him as limited and whoever considers Him limited he has enumerated Him and whoever enumerates Him he has invalidated His eternity. Whoever asks where is He, he has considered Him as having an end. Whoever says on what is He, he has considered Him as distanced. Whoever says wherein is He, he has considered Him contained in some thing.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/100)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "23": {
        "Al-Kafi - Volume 1: Chapter on Miscellaneous Ahadith": [
          {
            "number": "Hadith #3",
            "url": "https://thaqalayn.net/hadith/1/3/23/3",
            "arabicText": "3ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ أَبِي سَلامٍ النَّخَّاسِ عَنْ بَعْضِ أَصْحَابِنَا عَنْ ابي جعفر (عَلَيْهِ السَّلام) قَالَ نَحْنُ الْمَثَانِي الَّذِي أَعْطَاهُ الله نَبِيَّنَا مُحَمَّداً (صَلَّى اللهُ عَلَيْهِ وَآلِه) وَنَحْنُ وَجْهُ الله نَتَقَلَّبُ فِي الارْضِ بَيْنَ أَظْهُرِكُمْ وَنَحْنُ عَيْنُ الله فِي خَلْقِهِ وَيَدُهُ الْمَبْسُوطَةُ بِالرَّحْمَةِ عَلَى عِبَادِهِ عَرَفَنَا مَنْ عَرَفَنَا وَجَهِلَنَا مَنْ جَهِلَنَا وَإِمَامَةَ الْمُتَّقِينَ.",
            "englishTranslation": "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Sinan from abu Salam al-Khannas from some of our people from Imam abu Ja‘far  who has said the following. “We (family of Prophet Muhammad) are the al-Mathani (one of two) that Allah gave to Prophet Muhammad (s.a.). We are the Wajhullah (face of Allah, meaning a certain aspect of Allah’s relation with people) that move among you on earth. We are the eyes of Allah (overseers or observers from the side of Allah) in His creatures. We are the hands of Allah that are open with blessings for His servants. Those who wanted to know us have known us. There are people who are ignorant about us they are ignorant of us and of the leadership of the pious people.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/113)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #5",
            "url": "https://thaqalayn.net/hadith/1/3/23/5",
            "arabicText": "5ـ مُحَمَّدُ بْنُ أَبِي عَبْدِ الله عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنِ الْحُسَيْنِ بْنِ الْحَسَنِ عَنْ بَكْرِ بْنِ صَالِحٍ عَنِ الْحَسَنِ بْنِ سَعِيدٍ عَنِ الْهَيْثَمِ بْنِ عَبْدِ الله عَنْ مَرْوَانَ بْنِ صَبَّاحٍ قَالَ قَالَ أَبُو عَبْدِ الله (عَلَيْهِ السَّلام) إِنَّ الله خَلَقَنَا فَأَحْسَنَ خَلْقَنَا وَصَوَّرَنَا فَأَحْسَنَ صُوَرَنَا وَجَعَلَنَا عَيْنَهُ فِي عِبَادِهِ وَلِسَانَهُ النَّاطِقَ فِي خَلْقِهِ وَيَدَهُ الْمَبْسُوطَةَ عَلَى عِبَادِهِ بِالرَّأْفَةِ وَالرَّحْمَةِ وَوَجْهَهُ الَّذِي يُؤْتَى مِنْهُ وَبَابَهُ الَّذِي يَدُلُّ عَلَيْهِ وَخُزَّانَهُ فِي سَمَائِهِ وَأَرْضِهِ بِنَا أَثْمَرَتِ الاشْجَارُ وَأَيْنَعَتِ الثِّمَارُ وَجَرَتِ الانْهَارُ وَبِنَا يَنْزِلُ غَيْثُ السَّمَاءِ وَيَنْبُتُ عُشْبُ الارْضِ وَبِعِبَادَتِنَا عُبِدَ الله وَلَوْ لا نَحْنُ مَا عُبِدَ الله.",
            "englishTranslation": "5. Muhammad ibn abu ‘Abdallah ibn Muhammad ibn Isma‘il has narrated from al-Husayn ibn al-Hassan from Bakr ibn Salih from al-Hassan ibn Sa‘id from al-Haytham ibn ‘Abdallah from Marwan ibn Salih who has said that Imam abu ‘Abdallah has said the following. “Allah created us and made it well. He gave us our form and formed it well. He made us His eyes among His servants and His speaking tongue in His creatures. He made us His open hands over His servants with kindness and mercy. He has made us his face through which He is approached and his door that shows the way leading to Him. He made us His treasurers in the heavens and on earth. Through us the trees give fruit and the fruits ripen and the canals flow. Through us the skies send rain and plants grow on earth. Through our worship Allah is worshipped and were we not there Allah would not have been worshipped.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/117)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          },
          {
            "number": "Hadith #10",
            "url": "https://thaqalayn.net/hadith/1/3/23/10",
            "arabicText": "10ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ جُمْهُورٍ عَنْ عَلِيِّ بْنِ الصَّلْتِ عَنِ الْحَكَمِ وَإِسْمَاعِيلَ ابْنَيْ حَبِيبٍ عَنْ بُرَيْدٍ الْعِجْلِيِّ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ (عَلَيْهِ السَّلام) يَقُولُ بِنَا عُبِدَ الله وَبِنَا عُرِفَ الله وَبِنَا وُحِّدَ الله تَبَارَكَ وَتَعَالَى وَمُحَمَّدٌ حِجَابُ الله تَبَارَكَ وَتَعَالَى.",
            "englishTranslation": "10. Al-Husayn ibn Muhammad has narrated from Mu‘alla ibn Muhammad from Muhammad ibn Jumhur from Ali ibn al-Salt from al-Hakam and Isma‘il sons of Habid from Burayd al-‘Ijli who has said the following. “I heard Imam abu Ja‘far  saying, ‘Through us Allah is worshipped. Through us Allah is known. Through us belief in the Oneness of Allah, the Most Holy, the Most High, is established. Muhammad is the Hijab (curtain) of Allah, the Most Holy, the Most High.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (121/ 2)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      },
      "24": {
        "Al-Kafi - Volume 1: Chapter on al-Bida’": [
          {
            "number": "Hadith #5",
            "url": "https://thaqalayn.net/hadith/1/3/24/5",
            "arabicText": "5ـ أَحْمَدُ بْنُ مِهْرَانَ عَنْ عَبْدِ الْعَظِيمِ بْنِ عَبْدِ الله الْحَسَنِيِّ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ خَلَفِ بْنِ حَمَّادٍ عَنِ ابْنِ مُسْكَانَ عَنْ مَالِكٍ الْجُهَنِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ الله (عَلَيْهِ السَّلام) عَنْ قَوْلِ الله تَعَالَى أَ وَلَمْ يَرَ الانْسانُ أَنَّا خَلَقْناهُ مِنْ قَبْلُ وَلَمْ يَكُ شَيْئاً قَالَ فَقَالَ لا مُقَدَّراً وَلا مُكَوَّناً قَالَ وَسَأَلْتُهُ عَنْ قَوْلِهِ هَلْ أَتى‏ عَلَى الانْسانِ حِينٌ مِنَ الدَّهْرِ لَمْ يَكُنْ شَيْئاً مَذْكُوراً فَقَالَ كَانَ مُقَدَّراً غَيْرَ مَذْكُورٍ.",
            "englishTranslation": "5. It is narrated from Ahmad ibn Mahran from ‘Abdal ‘Azim ibn ‘Abdallah al-Hassani from Ali ibn Asbat from Khalaf ibn Hammad from ibn Maskan from Malik al-Juhanni who has said the following. “I asked Imam abu ‘Abdallah  about the words of Allah “Does he not remember that We created him when he did not exist?” (19:67) The Imam  said, “It means that he did not exist in a definit or in the form of a being.” I asked the Imam about the words of Allah, “There was certainly a time when there was no mention of the human being” (76:1) The Imam said, “ It was definit but not mentioned.”",
            "gradings": [
              {
                "grade": "ضعيف",
                "book": "Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/139)",
                "author": "Allamah Baqir al-Majlisi"
              }
            ]
          }
        ]
      }
    }
  }
}