{
  "Volume #29": {
    "Book #1": {
      "Chapter #18": {
        "Hadith #16": {
          "Title": "Al-Amali: The Eighteenth Assembly, which is Tuesday, the Nineteenth of the Month of Ramadan, 367 AH.",
          "Link": "https://thaqalayn.net/hadith/29/1/18/16",
          "Arabic Text": "16 - حدثنا أبي ومحمد بن الحسن وأحمد بن محمد بن يحيى العطار (رضي الله عنهم)، قالوا: حدثنا سعد بن عبد الله، عن محمد بن الحسين بن أبي  الخطاب، عن موسى بن بشار العطار (1)، عن المسعودي، عن عبد الله بن الزبير، عن أبان بن تغلب والربيع بن سليمان وأبان بن أرقم وغيرهم، قالوا: أقبلنا من مكة حتى إذا كنا بوادي الاجفر (2) إذا نحن برجل يصلي، ونحن ننظر إلى شعاع الشمس، فوجدنا (3) في أنفسنا، فجعل يصلي ونحن ندعو عليه، حتى صلى ركعة ونحن ندعو عليه ونقول: هذا من شباب أهل المدينة، فلما أتيناه إذا هو أبو عبد الله جعفر بن محمد (عليهما السلام)، فنزلنا فصلينا معه، وقد فاتتنا ركعة، فلما قضينا الصلاة قمنا إليه، فقلنا: جعلنا فداك، هذه الساعة تصلي؟ فقال: إذا غابت الشمس فقد دخل الوقت (4).",
          "English Text": "My father and Muhammad b. al-Hasan and Ahmad b. Muhammad b. Yahya al-`Attar  narrated to us. They said: Sa`d b. `Abdullah narrated to us from Muhammad b. al-Husayn from Abi’l Khattab from Musa b. Bashar al-`Attar from al-Mas`udi from `Abdullah b. al-Zubayr from Aban b. Taghlub and al-Rabi` b. Sulayman and Aban b. Arqam and others. They said: We proceeded from Mecca until we reached the Ajfar valley, where we came across a man who was praying. We saw the rays of the Sun, so we felt angry. He was praying whilst we were supplicating against him. He prayed one unit whilst we were supplicating against him; we were saying: He is from the youth of the people of the Medina. When we came to him, it turned out that he was Abu `Abdillah Ja`far b. Muhammad . So, we descended and prayed with him. We had missed one unit; so, when we completed the prayer, we stood and went to him, saying: May we be your sacrifice! Is this the time that you pray? So, he said: Once the Sun sets, then the time has begun.",
          "Grading": [
            {
              "English Grade": "Acceptable",
              "Arabic Grade": "",
              "Scholar": null,
              "Book": null
            },
            {
              "English Grade": "Acceptable",
              "Arabic Grade": "",
              "Scholar": null,
              "Book": null
            },
            {
              "English Grade": "Acceptable",
              "Arabic Grade": "",
              "Scholar": null,
              "Book": null
            },
            {
              "English Grade": "Acceptable",
              "Arabic Grade": "",
              "Scholar": null,
              "Book": null
            }
          ]
        }
      },
      "Chapter #29": {
        "Hadith #17": {
          "Title": "Al-Amali: The Twenty-Ninth Assembly, the Gathering on Friday, the Eighth of Muharram, 368 AH.",
          "Link": "https://thaqalayn.net/hadith/29/1/29/17",
          "Arabic Text": "233 / 17 - حدثنا أبي (رحمه الله)، قال: حدثنا سعد بن عبد الله، قال: حدثنا محمد ابن الحسين بن أبي الخطاب، عن عيسى بن عبد الله العلوي، عن أبيه عبد الله بن محمد بن عمر بن علي بن أبي طالب، عن أبيه، عن جده، عن علي (عليه السلام)، قال: سألت رسول الله (صلى الله عليه وآله) عن الرجل ينام فيرى الرؤيا، فربما كانت حقا، وربما كانت باطلا. فقال رسول الله (صلى الله عليه وآله) يا علي، ما من عبد ينام إلا عرج بروحه إلى رب العالمين، فما رأى عند رب العالمين فهو حق، ثم إذا أمر الله العزيز الجبار برد روحه إلى جسده فصارت الروح بين السماء والارض، فما رأته فهو أضغاث أحلام (1).",
          "English Text": "My father (rh) narrated to us. He said: Sa`d b. `Abdullah narrated to us. He said: Muhammad b. al-Husayn b. Abu’l Khattab narrated to us from `Isa b. `Abdullah al-`Alawi from his father `Abdullah b. Muhammad b. `Umar b. `Ali b. Abu Talib from his father from his grandfather from `Ali .  He said: I asked the Messenger of Allah (s) about the man who sleeps and then dreams. So sometimes it is true and sometimes it is false. The Messenger of Allah (s) said: O `Ali! There is no servant who sleeps but that he is raised with his spirit towards the Lord of the worlds. So, what he sees near the Lord of the worlds is the truth. Then when Allah, the Mighty, the Omnipotent orders with the return of his spirit to his body, the spirit is between the heaven and the Earth. So, what it sees [then] are confused dreams.",
          "Grading": [
            {
              "English Grade": "Acceptable",
              "Arabic Grade": "",
              "Scholar": null,
              "Book": null
            },
            {
              "English Grade": "Acceptable",
              "Arabic Grade": "",
              "Scholar": null,
              "Book": null
            },
            {
              "English Grade": "Acceptable",
              "Arabic Grade": "",
              "Scholar": null,
              "Book": null
            }
          ]
        }
      },
      "Chapter #51": {
        "Hadith #6": {
          "Title": "Al-Amali: The Fifty-First Assembly, the Assembly of Friday, the [Nineteenth] of Rabi` al-Awwal, 368 AH.",
          "Link": "https://thaqalayn.net/hadith/29/1/51/6",
          "Arabic Text": "6 - حدثنا عتاب بن محمد بن عتاب الوراميني، قال: حدثنا يحيى بن محمد بن صاعد، قال: حدثنا أحمد بن عبد الرحمن بن المفضل ومحمد بن عبيد الله ابن سوار، قالا: حدثنا عبد الغفار بن الحكم، قال: حدثنا منصور بن أبي الاسود، عن مطرف، عن الشعبي. وحدثنا عتاب بن محمد، قال: حدثنا إسحاق بن محمد الانماطي، عن يوسف  ابن موسى، قال: حدثني جرير، عن أشعث بن سوار عن الشعبي. وحدثنا عتاب بن محمد، قال: حدثنا الحسين بن محمد الحراني، قال: حدثنا أيوب بن محمد الوزان، قال: حدثنا سعيد بن مسلمة، قال: حدثنا أشعث بن سوار عن الشعبي، كلهم قالوا عن عمه قيس بن عبد، قال عتاب: وهذا حديث مطرف، قال: كنا جلوسا في المسجد، ومعنا عبد الله بن مسعود فجاء أعرابي، فقال: أفيكم عبد الله؟ قال: نعم، أنا عبد الله، فما حاجتك؟ قال: يا عبد الله، أخبركم نبيكم (صلى الله عليه وآله) كم يكون من خليفة؟ قال: لقد سألتني عن شئ ما سألني عنه أحد منذ قدمت العراق، نعم، اثنا عشر، عدة نقباء بني إسرائيل. قال أبو عروبة في حديثه: قال: نعم عدة نقباء بني إسرائيل (1).",
          "English Text": "`Attab b. Muhammad b. `Attab al-Waramini narrated to us. He said: Yahya b. Muhammad b. Sa`id narrated to us. He said: Ahmad b. `Abd al-Rahman b. al-Mufaddal and Muhammad b. `Ubaydullah b. Sawwar narrated to us. They said: `Abd al-Ghaffar b. al-Hakam narrated to us. He said: Mansur b. Abi’l Aswad narrated to us from Mutrif from al-Sha`bi. And `Attab b. Muhammad narrated to us. He said: Ishaq b. Muhammad al-Anmati narrated to us from Yusuf b. Musa. He said: Jarir narrated to me from Ash`ath b. Sawwar from al-Sha`bi. And `Attab b. Muhammad narrated to us. He said: Al-Husayn b. Muhammad al-Harrani narrated to us. He said: Ayyub b. Muhamad al-Wizan narrated to us. He said: Sa`id b. Maslama narrated to us. He said: Ash`ath b. Sawwar narrated to us from Sha`bi. All of them reported from his uncle Qays b. `Abd. `Attab said: This is the hadith of Mutrif: He said: We were sitting in the mosque, and `Abdullah b. Mas`ud was with us. A Bedouin came and said: Is there an `Abdullah among you? He said: Yes, I am `Abdullah. What do you need? He said: O `Abdullah! Has your Prophet (s) informed you of how many caliphs there would be? He said: You have asked me about something that no one has asked me since I came to Iraq. Yes, twelve – the number of chiefs of the Children of Israel. Abu `Uruba said in his hadith: He said: Yes, the number of chiefs of the Children of Israel.",
          "Grading": [
            {
              "English Grade": "Acceptable",
              "Arabic Grade": "",
              "Scholar": null,
              "Book": null
            },
            {
              "English Grade": "Acceptable",
              "Arabic Grade": "",
              "Scholar": null,
              "Book": null
            },
            {
              "English Grade": "Acceptable",
              "Arabic Grade": "",
              "Scholar": null,
              "Book": null
            }
          ]
        }
      },
      "Chapter #55": {
        "Hadith #1": {
          "Title": "Al-Amali: The Fifty-Fifth Assembly, the Assembly of Friday, the Fourth of the Month of Rabi` al-Akhir, 368 AH.",
          "Link": "https://thaqalayn.net/hadith/29/1/55/1",
          "Arabic Text": "1 - حدثنا الشيخ الجليل أبو جعفر محمد بن علي بن الحسين بن موسى ابن بابويه القمي (رضي الله عنه)، قال: حدثنا أحمد بن الحسن القطان وعلي بن أحمد بن موسى الدقاق ومحمد بن أحمد السناني (رضي الله عنهم)، قالوا: حدثنا أبو العباس أحمد ابن يحيى بن زكريا القطان، قال: حدثنا محمد بن العباس، قال: حدثني محمد بن أبي السري، قال: حدثنا أحمد بن عبد الله بن يونس، عن سعد بن طريف الكناني، عن الاصبغ بن نباتة، قال: لما جلس علي (عليه السلام) في الخلافة وبايعه الناس، خرج إلى المسجد متعمما بعمامة رسول الله (صلى الله عليه وآله)، لابسا بردة رسول الله (صلى الله عليه وآله) منتعلا نعل رسول الله (صلى الله عليه وآله)، متقلدا سيف رسول الله (صلى الله عليه وآله) فصعد المنبر، فجلس عليه متمكنا، ثم شبك بين أصابعه، فوضعها أسفل بطنه، ثم قال: يا معشر الناس، سلوني قبل أن تفقدوني، هذا سفط العلم، هذا لعاب رسول الله (صلى الله عليه وآله)، هذا ما زقني رسول الله (صلى الله عليه وآله) زقا زقا، سلوني فإن عندي علم الاولين والآخرين، أما والله لوثنيت لي وسادة، فجلست عليها، لافتيت أهل التوراة بتوراتهم حتى تنطق التوراة فتقول: صدق علي ما كذب، لقد أفتاكم بما أنزل الله في، وأفتيت أهل الانجيل بإنجيلهم حتى ينطق الانجيل فيقول: صدق علي ما كذب، لقد  أفتاكم بما أنزل الله في، وأفتيت أهل القرآن بقرآنهم حتى ينطق القرآن فيقول: صدق علي ما كذب، لقد أفتاكم بما أنزل الله في، وأنتم تتلون القرآن ليلا ونهارا، فهل فيكم أحد يعلم ما نزل فيه؟ ولولا آية في كتاب الله عزوجل لاخبرتكم بما كان وبما يكون، وبما هو كائن إلى يوم القيامة، وهي هذه الآية: (يمحوا الله ما يشاء ويثبت وعنده أم الكتاب) (1). ثم قال: (عليه السلام): سلوني قبل أن تفقدوني، فو الذي فلق الحبة وبرأ النسمة، لو سألتموني عن أية آية، في ليل أنزلت، أو في نهار أنزلت، مكيها ومدنيها، سفريها وحضريها، ناسخها ومنسوخها، ومحكمها ومتشابهها، وتأويلها وتنزيلها، إلا أخبرتكم. فقال إليه رجل يقال له ذعلب، وكان ذرب اللسان، بليغا في الخطب، شجاع القلب، فقال: لقد ارتقى ابن أبي طالب مرقاة صعبة، لاخجلنه اليوم لكم في مسألتي إياه. فقال: يا أمير المؤمنين، هل رأيت ربك؟ فقال: ويلك يا ذعلب لم أكن بالذي أعبد ربا لم أره. قال: فكيف رأيته؟ صفه لنا. قال: ويلك! لم تره العيون بمشاهدة الابصار، ولكن رأته القلوب بحقائق الايمان، ويلك يا ذعلب، إن ربي لا يوصف بالعبد ولا بالحركة ولا بالسكون، ولا بقيام - قيام انتصاب - ولا بجيئة ولا بذهاب، لطيف اللطافة لا يوصف باللطف، عظيم العظمة لا يوصف بالعظم، كبير الكبرياء لا يوصف بالكبر، جليل الجلالة لا يوصف بالغلظ، رؤوف الرحمة لا يوصف بالرقة، مؤمن لا بعبادة، مدرك لا بمجسة (2)، قائل لا بلفظ، هو في الاشياء على غير ممازجة، خارج منها على غير مباينة، فوق كل شئ ولا يقال شئ فوقه، أمام كل شئ ولا يقال له أمام، داخل في الاشياء لا كشئ في شئ داخل، وخارج منها لا كشئ من شئ خارج. فخر ذعلب  مغشيا عليه، ثم قال: تا لله ما سمعت بمثل هذا الجواب، والله لا عدت إلى مثلها. ثم قال (عليه السلام): سلوني قبل أن تفقدوني. فقام إليه الاشعث بن قيس، فقال: يا أمير المؤمنين، كيف تؤخذ من المجوس الجزية ولم ينزل عليهم كتاب، ولم يبعث إليهم نبي؟ فقال: بلى يا أشعث، قد أنزل الله عليهم كتابا، وبعث إليهم نبيا، وكان لهم ملك سكر ذات ليلة، فدعا بابنته إلى فراشه فارتكبها، فلما أصبح تسامع به قومه، فاجتمعوا إلى بابه، فقالوا: أيها الملك، دنست علينا ديننا فأهلكته، فاخرج نطهرك ونقم عليك الحد. فقال لهم: اجتمعوا واسمعوا كلامي، فإن يكن لي مخرج مما ارتكبت وإلا فشأنكم. فاجتمعوا، فقال لهم: هل علمتم أن الله عز وجل لم يخلق خلقا أكرم عليه من أبينا آدم وأمنا حواء؟ قالوا: صدقت أيها الملك. قال: أفليس قد زوج بنيه من بناته، وبناته من بينه؟ قالوا: صدقت، هذا هو الدين، فتعاقدوا على ذلك، فمحا الله ما في صدورهم من العلم، ورفع عنهم الكتاب، فهم الكفرة، يدخلون النار بلا حساب، والمنافقون أشد حالا منهم. فقال الاشعث: والله ما سمعت بمثل هذا الجواب، والله لا عدت إلى مثلها أبدا. ثم قال (عليه السلام): سلوني قبل أن تفقدوني. فقام إليه رجل من أقصى المسجد، متوكئا على عكازة، فلم يزل يتخطى الناس حتى دنا منه فقال: يا أمير المؤمنين، دلني على عمل إذا أنا عملته نجاني الله من النار. فقال له: اسمع يا هذا، ثم افهم، ثم استيقن، قامت الدنيا بثلاثة: بعالم ناطق مستعمل لعلمه، وبغني لا يبخل بماله على أهل دين الله عزوجل، وبفقير صابر، فإذا كتم العالم علمه، وبخل الغني، ولم يصبر الفقير، فعندها الويل والثبور، وعندها يعرف العارفون بالله أن الدار قد رجعت إلى بدئها، أي إلى الكفر بعد الايمان. أيها السائل، فلا تغترن بكثرة المساجد، وجماعة أقوام أجسادهم مجتمعة وقلوبهم شتى. أيها الناس، إنما الناس ثلاثة: زاهد، وراغب، وصابر، فأما الزاهد فلا يفرح بشئ من الدنيا أتاه، ولا يحزن على شئ منها فاته، وأما الصابر فيتمناها بقلبه، فإن أدرك منها شيئا صرف عنها نفسه لما يعلم من سوء عاقبتها، وأما الراغب فلا يبالي من  حل أصابها أم من حرام. قال: يا أمير المؤمنين، فما علامة المؤمن في ذلك الزمان؟ قال: ينظر إلى ما أوجب الله عليه من حق فيتولاه، وينظر إلى ما خالفه فيتبرأ منه وإن كان حبيبا قريبا. قال: صدقت والله يا أمير المؤمنين، ثم غاب الرجل فلم نره، وطلبه الناس فلم يجدوه، فتبسم علي (عليه السلام) على المنبر ثم قال: ما لكم، هذا أخي الخضر (عليه السلام). ثم قال (عليه السلام): سلوني قبل أن تفقدوني. فلم يقم إليه أحد، فحمد الله وأثنى عليه، وصلى على نبيه (صلى الله عليه وآله)، ثم قال للحسن (عليه السلام): يا حسن، قم فاصعد المنبر، فتكلم بكلام لا تجهلك قريش من بعدي، فيقولون: إن الحسن لا يحسن شيئا. قال الحسن (عليه السلام): يا أبه، كيف أصعد وأتكلم وأنت في الناس تسمع وترى؟ قال: بأبي وأمي أواري نفسي عنك، وأسمع وأرى ولا تراني. فصعد الحسن (عليه السلام) المنبر، فحمد الله بمحامد بليغة شريفة، وصلى على النبي وآله صلاة موجزة، ثم قال: أيها الناس، سمعت جدي رسول الله (صلى الله عليه وآله) يقول: أنا مدينة العلم وعلي بابها، وهل تدخل المدينة إلا من بابها، ثم نزل، فوثب إليه علي (عليه السلام) فتحمله، وضمه إلى صدره. ثم قال للحسين (عليه السلام): يا بني، قم فاصعد فتكلم بكلام لا تجهلك قريش من بعدي، فيقولون: إن الحسين بن علي لا يبصر شيئا، وليكن كلامك تبعا لكلام أخيك، فصعد الحسين (عليه السلام)، فحمد الله وأثنى عليه، وصلى على نبيه وآله صلاة موجزة، ثم قال: معاشر الناس، سمعت رسول الله (صلى الله عليه وآله) وهو يقول: إن عليا مدينة هدى، فمن دخلها نجا، ومن تخلف عنها هلك. فوثب علي (عليه السلام) فضمه إلى صدره وقبله، ثم قال: معاشر الناس، اشهدوا أنهما فرخا رسول الله (صلى الله عليه وآله) ووديعته التي استودعنيها، وأنا استودعكموها. معاشر الناس، ورسول الله (صلى الله عليه وآله) سائلكم عنهما (1).",
          "English Text": "Abu Ja`far Muhammad b. `Ali b. al-Husayn b. Musa b. Babuwayh al-Qummi  narrated to us. He said: Ahmad b. al-Hasan al-Qattan and `Ali b. Ahmad b. Musa al-Daqqaq and Muhammad b. Ahmad al-Sinani  narrated to us. They said: Abu’l `Abbas Ahmad b. Yahya b. Zakariyya al-Qattan narrated to us. He said: Muhammad b. al-`Abbas narrated to us. He said: Muhammad b. Abi al-Sirri narrated to me. He said: Ahmad b. `Abdullah b. Yunus narrated to us from Sa`d b. Turayf al-Kinani from al-Asbagh b. Nubata. He said: When `Ali  assumed the Caliphate and the people pledged their allegiance to him, he went out to the Mosque turbaned in the turban of the Messenger of Allah (s), cloaked in the cloak of the Messenger of Allah (s), wearing the sandals of the Messenger of Allah (s), and equipped with the sword of the Messenger of Allah (s). So, he climbed the pulpit and sat upon it masterfully. Then, he folded his hands and placed them under his stomach. Then, he said: O people! Ask me before you lose me. This is the vessel of knowledge. This is the saliva of the Messenger of Allah (s). This is the sustenance that the Messenger of Allah (s) has sustained me with. Ask me, for I have the knowledge of the former and latter peoples. By Allah, if a cushion were folded for me, I could give judgments to the people of the Torah with their Torah until the Torah is made to say: “`Ali has spoken the truth and he has not lied. He has given you judgments by that which Allah has revealed”; and I could give judgments to the people of the Gospel with their Gospel until the Gospel is made to say: “`Ali has spoken the truth and he has not lied. He has given you judgments by that which Allah has revealed”; and I could give judgments to the people of the Quran with their Quran until the Quran is made to say: “`Ali has spoken the truth and he has not lied. He has given you judgments by that which Allah has revealed.” You recite the Quran night and day, so, is there one of you who knows what was revealed in it? If it were not for one verse in the Book of Allah, I could have informed you of what was, what will be, and what is, until the Day of Resurrection; and it is this verse, “Allah erases what He wishes and confirms, and with Him is the Mother of the Book.” (13:39) Then, he  said: Ask me before you lose me, for by Him who split the seed and gave life, if you were to ask me about any verse – whether it were revealed in the night or revealed in the day, in Mecca or in Medina, while travelling or while present; whether it is abrogating or abrogated, decisive or allegorical; or about its interpretation or its exegesis – I would have informed you of it.  So, a man named Dha`lab, who had a sharp tongue, who was eloquent in speech, and who had a bold heart, said: Ibn Abi Talib has risen to a difficult station, so I will embarrass him today in my questions posed to him. So, he said: O Amir al-Mu’minin! Have you seen your Lord? So, he said: Woe to you, Dha`lab, I am not one who would worship a Lord that I haven not seen. He said: So, how did you see Him? Describe Him to us. He said: Woe to you! Eyes do not see Him by way of sight, but rather, hearts see Him by the realities of faith. Woe to you, Dha`lab, surely, my Lord is not described with proximity, nor with movement, nor with stillness, nor with standing – standing physically – nor with coming, nor with going. He is the Most Subtle of the subtle, but He is not described with subtlety. He is the Most Great of the great, but He is not described with greatness. He is the Most Grand of the grand, but He is not described with grandness. He is the Most Majestic of the majestic, but He is not described with difficulty. He is kind in mercy, but He is not described with gentleness; the Protector, but not [gained] through worship. He perceives, but not through touching. He speaks, but not through pronouncement. He is in the things, but not interwoven, and He is outside of them, but not contrasting. He is above everything, and nothing is to be said to be above Him. He is in front of everything, but He is not to be said to be in front. He is inside the things, but not like a thing inside another thing. He is outside the things, but not like a thing outside another thing. So, Dha`lab fell unconscious. Then, [he awoke] and said: By Allah, I have never heard an answer like this. By Allah, I will not repeat [a question] like it. Then, he  said: Ask me before you lose me. So, al-Ash`ath b. Qays went to him and said: O Amir al-Mu’minin! Why is the jizya taken from the Zoroastrians when no Book was revealed to them and no prophet was sent to them? So, he said: O Ash`ath! Allah revealed a Book to them and sent a prophet to them. They had a king who was drunk one night. He called his daughter to his bed and had intercourse with her. When he awoke, his people had heard what had happened and had gathered at his door. So, they said: “O king! You have dirtied our religion and you have destroyed it. Get out, so that we may purify you by establishing the penalty on you.” So, he said to them: “Gather and listen to my words. If there is no way out for me, then do as you wish.” So, they gathered. So, he said to them: “Do you know that Allah did not create a creation more noble than our father Adam and our mother Hawwa’?” They said: “You have spoken the truth, king.” He said: “Did he not marry his sons to his daughters, and his daughters to his sons?” They said: “You have spoken the truth. This is the religion.” So, they contracted [marriages] based on that. So, Allah erased knowledge from their hearts and raised the Book from them, so they became disbelievers who enter the Fire without judgment – and the hypocrites are in a more severe condition than them. So, al-Ash`ath said: By Allah, I have never heard an answer like this. By Allah, I will not repeat [a question] like it.  Then, he  said: Ask me before you lose me. So, a man from the furthest end of the Mosque came to him, leaning on a staff. He did not stop surpassing the people until he came close to him and said: O Amir al-Mu’minin! Lead me to a practice which, if I did it, Allah would deliver me from the Fire. So, he said to him: Listen, so-and-so, then understand, then ascertain. The world is upheld by three: a speaking scholar whose knowledge is acted upon, a wealthy person who is not stingy in his wealth with the people of the religion of Allah, and patient poor person. If the scholar hides his knowledge, and the wealthy becomes stingy, and the poor person is not patient, then at that will be woe and devastation. At that, those that know Allah will know that the abode will revert to its incipience – meaning, to disbelief after faith. O asker! Do not be deceived by the number of mosques, nor by the gatherings of people who are united in their bodies but disunited in their hearts. O people! Surely, there are only three types of people: the ascetic, the hedonist, and the patient. As for the ascetic, he is not gladdened by anything of the world that comes to him, nor is he saddened by anything of the world that misses him. As for the patient, he wishes for it (the world) in his heart, but when he comes by anything of it, he avoids it because he knows its evil consequences. As for the hedonist, he does not mind taking it lawfully or unlawfully.  He said: O Amir al-Mu’minin! What is the sign of the believer in that time? He said: He looks to what Allah has obliged him and he fulfills it, and he looks to what is contrary to it and dissociates from it, even if it is beloved and near to him. He said: You have spoken the truth, by Allah, O Amir al-Mu’minin. Then, the man disappeared, and we did not see him. The people went out looking for him, but they did not see him. So, `Ali  smiled on the pulpit and said: What are you doing? This is my brother al-Khidr . Then, he  said: Ask me before you lose me. So, no one went to him. So, he praised Allah and commended Him, blessed His Prophet (s), then said to al-Hasan : O Hasan! Stand, climb the pulpit, and speak, so that Quraysh are not ignorant of you after me, lest they say: “Al-Hasan has not beautified (yuhsin) anything.” Al-Hasan  said: O father! How can I climb [the pulpit] and speak when you are among the people listening and watching? He said: May my mother and my father be your sacrifice! I will hide myself from you, so you will neither hear nor see me. So, al-Hasan  climbed the pulpit, praised Allah in an eloquent and honourable way, blessed the Prophet and his Family briefly, then said: O people! I heard my grandfather the Messenger of Allah (s) say: “I am the City of Knowledge and `Ali is its Gate. A city can only be entered by its gate.” Then, he descended; and `Ali  leapt toward him, embraced him, and held him to his chest. Then, he said to al-Husayn : O my son! Stand, climb the pulpit, and speak, so that the Quraysh are not ignorant of you after me, lest they say: “Al-Husayn b. `Ali has no insight in anything”, and so that your words may follow your brother’s. So, al-Husayn climbed, praised Allah and commended Him, blessed His Prophet and his Family briefly, then said: O people! I heard the Messenger of Allah (s) say: “Surely, `Ali is the City of Guidance. Whoever enters it is saved, and whoever turns away from it is destroyed.” So, `Ali  leapt toward him, embraced him, and held him to his chest. Then, he said: O people! Bear witness that these two are the younglings of the Messenger of Allah (s) whom he entrusted to me, and I am entrusting them to you. O people! The Messenger of Allah (s) will question you regarding them.",
          "Grading": [
            {
              "English Grade": "Acceptable",
              "Arabic Grade": "",
              "Scholar": null,
              "Book": null
            },
            {
              "English Grade": "Acceptable",
              "Arabic Grade": "",
              "Scholar": null,
              "Book": null
            },
            {
              "English Grade": "Acceptable",
              "Arabic Grade": "",
              "Scholar": null,
              "Book": null
            }
          ]
        }
      },
      "Chapter #67": {
        "Hadith #2": {
          "Title": "Al-Amali: The Sixty-Seventh Assembly, the Assembly of Friday, the Sixteenth of Jumada al-Ula, 368 AH.",
          "Link": "https://thaqalayn.net/hadith/29/1/67/2",
          "Arabic Text": "2 - حدثنا أحمد بن الحسن القطان، وعلي بن أحمد بن موسى الدقاق، ومحمد بن أحمد السناني، وعبد الله بن محمد الصائغ (رضي الله عنهم)، قالوا: حدثنا أبو العباس أحمد بن يحيى بن زكريا القطان، قال: حدثنا أبو محمد بكر بن عبد الله بن حبيب، قال: حدثني علي بن محمد، قال: حدثنا الفضل بن العباس، قال: حدثنا عبد القدوس الوراق، قال: حدثنا محمد بن كثير، عن الاعمش. وحدثنا الحسين بن إبراهيم بن أحمد المكتب (رضي الله عنه)، قال: حدثنا أحمد بن يحيى القطان، قال: حدثنا بكر بن عبد الله بن حبيب، قال: حدثني عبد الله بن محمد ابن باطويه، قال: حدثنا محمد بن كثير، عن الاعمش. وأخبرنا سليمان بن أحمد بن أيوب اللخمي، فيما كتب إلينا من أصبهان، قال: حدثنا أحمد بن القاسم بن مساور الجوهري سنة ست وثمانين ومائتين، قال: حدثنا الوليد بن الفضل العنزي، قال: حدثنا مندل بن علي العنزي، عن الاعمش.  وحدثنا محمد بن إبراهيم بن إسحاق الطالقاني (رضي الله عنه)، قال: حدثني أبو سعيد الحسن بن علي العدوي، قال: حدثنا علي بن عيسى الكوفي، قال: حدثنا جرير ابن عبد الحميد، عن الاعمش، وزاد بعضهم على بعض في اللفظ، وقال بعضهم ما لم يقل بعض، وسياق الحديث لمندل بن علي العنزي، عن الاعمش، قال: بعث إلي أبو جعفر الدوانيقي في جوف الليل أن أجب، قال: فبقيت متفكرا فيما بيني وبين نفسي، وقلت: ما بعث إلي أمير المؤمنين في هذه الساعة إلا ليسألني عن فضائل علي (عليه السلام)، ولعلي إن أخبرته قتلني، قال: فكتبت وصيتي، ولبست كفني، ودخلت عليه، فقال: ادن، فدنوت وعنده عمرو بن عبيد، فلما رأيته طابت نفسي شيئا، ثم قال: ادن، فدنوت حتى كادت تمس ركبتي ركبته، قال: فوجد مني رائحة الحنوط، فقال: والله لتصدقني أو لاصلبنك. قلت: ما حاجتك، يا أمير المؤمنين؟ قال: ما شأنك متحنطا؟ قلت: أتاني رسولك في جوف الليل أن أجب، فقلت: عسى أن يكون أمير المؤمنين بعث إلي في هذه الساعة ليسأنلي عن فضائل علي (عليه السلام) فلعلي إن أخبرته قتلني، فكتبت وصيتي، ولبست كفني. قال: وكان متكئا، فاستوى قاعدا، فقال: لا حول ولا قوة إلا بالله، سألتك بالله يا سليمان كم حديثا ترويه في فضائل علي؟ قال: فقلت: يسيرا، يا أمير المؤمنين. قال: كم؟ قلت: عشرة آلاف حديث، وما زاد. فقال: يا سليمان، والله لاحدثنك بحديث في فضائل علي (عليه السلام) تنسى كل حديث سمعته، قال: قلت: حدثني، يا أمير المؤمنين. قال: نعم، كنت هاربا من بني أمية، وكنت أتردد في البلدان، فأتقرب إلى الناس بفضائل علي، وكانوا يطعموني ويزودوني حتى وردت بلاد الشام، وإني لفي كساء خلق ما علي غيره، فسمعت الاقامة وأنا جائع، فدخلت المسجد لاصلي، وفي نفسي أن أكلم الناس في عشاء يعشوني، فلما سلم الامام دخل المسجد صبيان، فالتفت الامام إليهما، وقال: مرحبا بكما، ومرحبا بمن اسمكما على اسمهما، فكان إلى جنبي شاب، فقلت: يا شاب، ما الصبيان من الشيخ؟ قال: هو جدهما، وليس بالمدينة أحد يحب عليا غير هذا الشيخ،  فلذلك سمى أحدهما الحسن، والآخر الحسين، فقمت فرحا، فقلت للشيخ: هل لك في حديث أقر به عينك؟ قال: إن أقررت عيني أقررت عينك. قال: فقلت: حدثني والدي، عن أبيه، عن جده، قال: قعودا عند رسول الله (صلى الله عليه وآله)، إذا جاءت فاطمة (عليها السلام) تبكي، فقال لها النبي (صلى الله عليه وآله): ما يبكيك، يا فاطمة؟ قالت: يا أبه، خرج الحسن والحسين، فما أدري أين باتا؟ فقال لها النبي (صلى الله عليه وآله) يا فاطمة، لا تبكي، فالله الذي خلقهما هو ألطف بهما منك. ورفع النبي (صلى الله عليه وآله) يده إلى السماء، فقال: اللهم إن كانا أخذا برا أو بحرا فاحفظهما وسلمهما، فنزل جبرئيل (عليه السلام) من السماء، فقال: يا محمد، إن الله يقرئك السلام، وهو يقول: لا تحزن ولا تغتم لهما، فإنهما فاضلان في الدنيا، فاضلان في الآخرة، وأبوهما أفضل منهما، هما نائمان في حظيرة بني النجار، وقد وكل الله بهما ملكا. قال: فقام النبي (صلى الله عليه وآله) فرحا ومعه أصحابه حتى أتوا حظيرة بني النجار، فإذا هم بالحسن معانقا للحسين (عليهما السلام)، وإذا الملك الموكل بهما قد افترش أحد جناحيه تحتهما وغطاهما بالآخر، قال: فمكث النبي (صلى الله عليه وآله) يقبلهما حتى انتبها، فلما استيقظا حمل النبي (صلى الله عليه وآله) الحسن، وحمل جبرئيل الحسين فخرج من الحظيرة وهو يقول: والله لا شرفنكما كما شرفكم الله عزوجل. فقال له أبو بكر: ناولني أحد الصبيين أخفف عنك. فقال: يا أبا بكر، نعم الحاملان، ونعم الراكبان، وأبوهما أفضل منهما. فخرج حتى أتى باب المسجد، فقال: يا بلال، هلم علي بالناس، فنادى منادي رسول الله (صلى الله عليه وآله) في المدينة، فاجتمع الناس عند رسول الله (صلى الله عليه وآله) في المسجد، فقام على قدميه، فقال: يا معشر الناس، ألا أدلكم على خير الناس جدا وجدة؟ قالوا: بلى يا رسول الله. قال: الحسن والحسين، فإن جدهما محمد، وجدتهما خديجة بنت خويلد. يا معشر الناس، ألا أدلكم على خير الناس أبا وأما؟ فقالوا: بلى يا رسول الله. قال: الحسن والحسين، فإن أباهما علي يحب الله ورسوله ويحبه الله ورسوله، وأمهما  فاطمة بنت رسول الله. يا معشر الناس، ألا أدلكم على خير الناس عما وعمة؟ قالوا: بلى يا رسول الله. قال: الحسن والحسين، فإن عمهما جعفر بن أبي طالب الطيار في الجنة مع الملائكة، وعمتهما أم هانئ بنت أبي طالب. يا معشر الناس، ألا أدلكم على خير الناس خالا وخالة؟ قالوا: بلى يا رسول الله. قال: الحسن والحسين، فإن خالهما القاسم بن رسول الله، وخالتهما زينب بنت رسول الله، ثم قال (1) بيده هكذا يحشرنا الله. ثم قال: اللهم إنك تعلم أن الحسن في الجنة، والحسين في الجنة، وجدهما في الجنة، وجدتهما في الجنة، وأباهما في الجنة، وأمهما في الجنة، وعمهما في الجنة، وعمتهما في الجنة، وخالهما في الجنة، وخالتهما في الجنة، اللهم إنك تعلم أن من يحبهما في الجنة، ومن يبغضهما في النار. قال: فلما قلت ذلك للشيخ، قال: من أنت يا فتى؟ قلت: من أهل الكوفة. قال: أعربي أنت، أم مولى؟ قال: قلت: بل عربي. قال: فأنت تحدث بهذا الحديث وأنت في هذا الكساء! فكساني خلعته، وحملني على بغلته - فبعتهما بمائة دينار - فقال: يا شاب، أقررت عيني، فوالله لاقرن عينك، ولارشدنك إلى شاب يقر عينك اليوم، قال: فقلت: أرشدني. قال: لي أخوان، أحدهما إمام، والآخر مؤذن، أما الامام فإنه يحب عليا (عليه السلام) منذ خرج من بطن أمه، وأما المؤذن فإنه يبغض عليا (عليه السلام) منذ خرج من بطن أمه. قال: قلت: أرشدني، فأخذ بيدي حتى أتى باب الامام، فإذا أنا برجل قد خرج إلي، فقال: أما البغلة والكسوة فأعرفهما، والله ما كان فلان يحملك ويكسوك إلا أنك تحب الله عزوجل ورسوله (صلى الله عليه وآله)، فحدثني بحديث في فضائل علي بن أبي طالب (عليه السلام).  قال: فقلت: أخبرني أبي، عن أبيه، عن جده، قال: كنا قعودا عند النبي (صلى الله عليه وآله)، إذا جاءت فاطمة (عليها السلام) تبكي بكاء شديدا، فقال لها رسول الله (صلى الله عليه وآله): ما يبكيك، يا فاطمة؟ قالت: يا أبه، عيرتني نساء القريش، وقلن: إن أباك زوجك من معدم (1) لا مال له. فقال لها النبي (صلى الله عليه وآله): لا تبكي، فوالله ما زوجتك حتى زوجك الله من فوق عرشه، وأشهد بذلك جبرئيل وميكائيل، وإن الله عزوجل اطلع على أهل الدنيا فاختار من الخلائق أباك فبعثه نبيا، ثم اطلع الثانية فاختار من الخلائق عليا، فزوجك إياه، واتخذه وصيا، فعلي أشجع الناس قلبا، وأحلم الناس حلما، وأسمح الناس كفا، وأقدم الناس سلما، وأعلم الناس علما، والحسن والحسين ابناه، وهما سيدا شباب أهل الجنة، واسمهما في التوراة شبر وشبير لكرامتهما على الله عزوجل. يا فاطمة لا تبكين، فوالله انه إذا كان يوم القيامة يكسى أبوك حلتين، وعلي حلتين، ولواء الحمد بيدي، فأناوله عليا لكرامته على الله عزوجل. يا فاطمة لا تبكين، فإني إذا دعيت إلى رب العالمين يجئ علي معي، وإذا شفعني الله عزوجل شفع عليا معي. يا فاطمة لا تبكين، إذا كان يوم القيامة ينادي مناد في أهوال ذلك اليوم: يا محمد، نعم الجد جدك إبراهيم خليل الرحمن، ونعم الاخ أخوك علي بن أبي طالب. يا فاطمة، علي يعينني على مفاتيح الجنة، وشيعته هم الفائزون يوم القيامة غدا في الجنة. فلما قلت ذلك، قال: يا بني، ممن أنت؟ قلت: من أهل الكوفة. قال: أعربي أنت، أم مولى؟ قلت: بل عربي. قال: فكساني ثلاثين ثوبا، وأعطاني عشرة آلاف درهم. ثم قال: يا شباب، قد أقررت عيني، ولي إليك حاجة. قلت: قضيت إن شاء الله. قال: فإذا كان غدا فأت مسجد آل فلان كيما ترى أخي المبغض لعلي (عليه السلام). قال: فطالت علي تلك الليلة، فلما أصبحت أتيت المسجد الذي وصف لي، فقمت في الصف، فإذا إلى جانبي شاب متعمم، فذهب ليركع، فسقطت عمامته،  فنظرت في وجهه، فإذا رأسه رأس خنزير، ووجهه وجه خنزير، فوالله ما علمت ما تكلمت به في صلاتي حتى سلم الامام، فقلت: يا ويحك، ما الذي أرى بك؟ فبكى وقال لي: انظر إلى هذه الدار. فنظرت، فقال لي: ادخل. فدخلت، فقال لي كنت مؤذنا لآل فلان، كلما أصبحت لعنت عليا ألف مرة بين الاذان والاقامة، وكلما كان يوم الجمعة لعنته أربعة آلاف مرة، فخرجت من منزلي فأتيت داري، فأتكأت على هذا الدكان الذي ترى، فرأيت في منامي كأني بالجنة وفيها رسول الله (صلى الله عليه وآله) وعلي (عليه السلام) فرحين، ورأيت كأن النبي (صلى الله عليه وآله) عن يمينه الحسن، وعن يساره الحسين، ومعه كأس، فقال: يا حسن، اسقني. فسقاه، ثم قال: أسق الجماعة فشربوا، ثم رأيته كأنه قال: اسق المتكئ على هذا الدكان. فقال له الحسن (عليه السلام): يا جد، أتأمرني أن أسقي هذا وهو يلعن والدي في كل يوم ألف مرة بين الاذان والاقامة، وقد لعنه في هذا اليوم أربعة آلاف مرة بين الاذان والاقامة! فأتاني النبي (صلى الله عليه وآله) فقال لي: مالك - عليك لعنة الله - تلعن عليا، وعلي مني، وتشتم عليا، وعلي مني، فرأيته كأنه تفل في وجهي، وضربني برجله، وقال: قم غير الله ما بك من نعمة. فانتهبت من نومي فإذا رأسي رأس خنزير، ووجهي وجه خنزير. ثم قال لي أبو جعفر أمير المؤمنين: أهذان الحديثان في يدك؟ فقلت: لا. فقال: يا سليمان حب علي إيمان، وبغضه نفاق، والله لا يحبه إلا مؤمن، ولا يبغضه إلا منافق. قال: قلت: الامان يا أمير المؤمنين. قال: لك الامان. قلت: فما تقول في قاتل الحسين (عليه السلام) قال: إلى النار وفي النار. قلت: وكذلك من يقتل ولد رسول الله (صلى الله عليه وآله) إلى النار وفي النار. قال: الملك عقيم يا سليمان، أخرج فحدث بما سمعت (1).",
          "English Text": "Ahmad b. al-Hasan al-Qattan, `Ali b. Ahmad b. Musa al-Daqqaq, Muhammad b. Ahmad al-Sinani, and `Abdullah b. Muhammad al-Sa’igh  narrated to us. They said: Abu’l `Abbas Ahmad b. Yahya b. Zakariyya al-Qattan narrated to us. He said: Abu Muhammad Bakr b. `Abdullah b. Habib narrated to us. He said: `Ali b. Muhammad narrated to me. He said: Al-Fadl b. al-`Abbas narrated to us. He said: `Abd al-Qudus al-Warith narrated to us. He said: Muhammad b. Kathir narrated to us from al-A`mash. Al-Husayn b. Ibrahim b. Ahmad al-Mukattib  narrated to us. He said: Ahmad b. Yahya al-Qattan narrated to us. He said: Bakr b. `Abdullah b. Habib narrated to us. He said: `Abdullah b. Muhammad b. Batuwayh narrated to me. He said: Muhammad b. Kathir narrated to us from al-A`mash. Sulayman b. Ahmad b. Ayyub al-Lakhmi informed us in what he wrote to us from Isfahan. He said: Ahmad b. al-Qasim b. Masruq al-Jawhari narrated to us in 286 AH. He said: Al-Walid b. al-Fadl al-Ghanzi narrated to us. He said: Mundal b. `Ali al-`Anzi narrated to us from al-A`mash. Muhammad b. Ibrahim b. Ishaq al-Talaqani  narrated to us. He said: Abu Sa`id al-Hasan b. `Ali al-`Adwi narrated to me. He said: `Ali b. `Isa al-Kufi narrated to us. He said: Jarir b. `Abd al-Hamid narrated to us from al-A`mash. Some added in diction (lafth) what others did not have, and some said what others did not say. The subsequent [version of the] hadith is that of Mundal b. `Ali al-`Anzi from al-A`mash. He said: [The caliph] Abu Ja`far al-Dawaniqi [al-Mansur] sent for me in the middle of the night so that I may answer. He said: I remained thinking to myself, and I said: “The commander of the faithful has not sent for me in this hour except to ask me about the virtues of `Ali ; and perhaps if I inform him, he will kill me.” He said: So, I wrote my will, I wore my shroud, and I visited him. So, he said: Come closer. So, I came closer, and `Amr b. `Ubayd [the Mu`tazili theologian] was with him. When I saw him, my heart was comforted. Then, he said: Come closer. So, I came closer until my knees almost touched his knees. He said: He smelled the aroma of embalmment from me, so he said: By Allah, you must be honest with me, or I will crucify you. I said: What do you need, O commander of the faithful? He said: Why are you embalmed? I said: Your messenger came to me in the middle of the night so that I may answer. So, I said: “Perhaps the commander of the faithful has sent for me at this hour to ask me about the virtues of `Ali , and perhaps if I inform him [of them], he will kill me.” So, I wrote my will, and I wore my shroud. He said: He was reclining, and he sat up and said: There is no ability nor power except by Allah. I ask you by Allah, how many hadith do you narrate on the virtues of `Ali? He said: So, I said: Easy, O commander of the faithful. He said: How many? I said: Ten thousand hadith or more. So, he said: O Sulayman! I will inform you of a hadith on the virtues of `Ali  that will cause you to forget all the hadith that you have heard. He said: I said: Narrate to me, O commander of the faithful. He said: Yes. I was fleeing from Bani Umayya, and I was frequenting the towns. I would get closer to the people through the virtues of `Ali. They would then feed me and provide for me until I started visiting the Levant. I was only covered in a cloak and I had nothing else with me. I heard the iqama and I went toward it. Then, I entered the mosque to pray, and in my heart, I wanted to speak to the people about my livelihood. When the imam ended the prayer, two boys entered the mosque. The imam turned to them and said: “Greetings to you two. Greetings to you two whose names are like the names of the two of them.” Beside me there was a young man, so I said: “O young man! Who are these two boys to this shaykh?” He said: “He is their grandfather, and there is no one in this city who loves `Ali except for this shaykh. For that reason, he called one of them al-Hasan and the other al-Husayn.” So, I stood joyfully, and I said to the shaykh: “May I narrate a hadith to you that will bring joy to your eye?” He said: “If you bring joy to my eye, I will bring joy to your eye.” He said: So, I said: My father narrated to me from his father from his grandfather. He said: The Messenger of Allah (s) was sitting when Fatima  came weeping to him. So, the Prophet (s) said to her: “Why do you weep, Fatima?” She said: “O father! Al-Hasan and al-Husayn went out, and I do not know where they went to sleep.” So, the Prophet (s) said to her: “O Fatima! Do not weep, for Allah who created the two of them is gentler with them than you are.” So, the Prophet (s) raised his hand toward the sky and said: “O Allah! Whether they are on the land or at sea, protect them and safeguard them.” So, Gabriel  descended from heaven and said: “O Muhammad! Surely, Allah recites the salaam to you, and He says: ‘Do not be sad and do not grieve over them, for they are favoured in this world and in the Hereafter, and their father is more favoured than them. They are both sleeping in the pen of Bani Najjar. Allah has assigned an angel to them.’” So, the Prophet (s) stood happily while his companions were with him; until they went to the pen of Bani Najjar. He found al-Hasan is embracing al-Husayn, and the angel assigned to them comforted them with one wing beneath them and one wing above them. So, the Prophet (s) kissed them until they awoke. When they got up, the Prophet (s) held al-Hasan, and Gabriel held al-Husayn. He left the pen saying: “By Allah, you have not been honoured in the way that Allah honoured you.” So, Abu Bakr said to him: “Give me one of the two boys so that I may lighten [the load] for you.” So, he said: “O Aba Bakr! They are the best two things that can be carried, and they are the best of riders [on my back], and their father is more favoured than them.” So, he went until he reached the gate of the Mosque. So, he said: “O Bilal! Bring the people.” So, the caller of the Messenger of Allah (s) called in Medina. So, the people gathered to the Messenger of Allah (s) in the Mosque. Then, he stood on his feet and said: “O people! Shall I lead you to the ones with the greatest grandfather and grandmother out of all the people?” They said: “Of course, O Messenger of Allah.” He said: “Al-Hasan and al-Husayn, for their grandfather is Muhammad, and their grandmother is Khadija bt. Khuwalid. O people! Shall I lead you to the ones with the greatest parents out of all the people?” They said: Of course, O Messenger of Allah.” He said: “Al-Hasan and al-Husayn, for their father loves Allah and His Messenger and Allah and His Messenger love him, and their mother is Fatima the daughter of the Messenger of Allah. O people! Shall I lead you to the ones with the greatest paternal uncle and paternal aunt out of all the people?” They said: “Of course, O Messenger of Allah.” He said: “Al-Hasan and al-Husayn, for their uncle is Ja`far b. Abi Talib, who flies in Paradise with the angels, and their aunt is Umm Hani’ bt. Abi Talib. O people! Shall I lead you to the ones with the people maternal uncle and maternal aunt out of all the people?” They said: “Of course, O Messenger of Allah.” He said: “Al-Hasan and al-Husayn, for their maternal uncle is al-Qasim the son of the Messenger of Allah, and their aunt is Zaynab the daughter of the Messenger of Allah. Like this, Allah will resurrect us.” Then, he said: “O Allah! Surely, You know that al-Hasan is in Paradise, al-Husayn is in Paradise, their grandfather is in Paradise, their grandmother is in Paradise, their father is in Paradise, their mother is in Paradise, their paternal uncle is in Paradise, their paternal aunt is in Paradise, their maternal uncle is in Paradise, their maternal aunt is in Paradise. O Allah! You know that those who love them are in Paradise and those who hate them are in the Fire.” He said: When I said that to the shaykh, he said: “Who are you, young man?” I said: “I am from the people of Kufa.” He said: “Are you an Arab or a client (non-Arab)?” He said: I said: “Rather, I am an Arab.” He said: “You narrate this hadith, yet you are [only clothed] in this cloak?!” So, he clothed me in some of his clothes, and mounted me on his beast – and its price was one hundred gold coins – and he said: “O youth! You have brought joy to my eye, so I will bring joy to your eye, and I will guide you to a youth who will bring joy to your eye today.” He said: So, I said: “Guide me.” He said: “I have two brothers: one is an imam, and the other is a mu’adhin. As for the imam, then surely, he loved `Ali  from when his mother gave birth to him. As for the mu’adhin, he hated `Ali  from when his mother gave birth to him.” He said: I said: “Guide me.” So, he took me by the hand until we reached the door of the imam. A man came out to me and said: “I recognize the beast and the cloak. By Allah, so-and-so would not have mounted you and cloaked you unless you loved Allah and His Messenger (s). So, narrate a hadith about the virtues of `Ali b. Abi Talib  to me.” He said: So, I said: My father informed me from his father from his grandfather. He said: We were sitting with the Prophet (s) when Fatima  came weeping intensely. So, the Messenger of Allah (s) said to her: “Why do you weep, Fatima?” She said: “O father! The women of Quraysh have embarrassed me, and they say: ‘your father has married you to a por man with no wealth.’” So, the Prophet (s) said to her: “Do not weep, for by Allah, I did not marry him to you until Allah married you [to him] above His Throne. Gabriel and Michael bore witness to it. Surely, Allah looked at the people of this world, and He chose your father from the creatures and made him a prophet. Then, He looked a second time and chose `Ali from the creatures and married you to him and took him as a deputy. So, `Ali is the boldest of people in heart, the most forbearing of people, the most open-handed of the people; exceeding the people in tranquility, and the most knowledgeable of the people. Al-Hasan and al-Husayn are his sons, and they are the Masters of the Youth of the People of Paradise. Their names in the Torah are Shubar and Shubayr in the Torah due to their dignity with Allah. O Fatima! Do not weep, for by Allah, on the Day of Resurrection, Allah will gown your father in two garments and `Ali in two garments. The Banner of Praise will be in my hand and I will give it to `Ali due to his dignity with Allah. O Fatima! Do not weep, for if I pray to the Lord of the Worlds, `Ali will come with me, and if Allah accepts my intercession, then Allah will accept the intercession of `Ali with me. O Fatima! Do not weep, for on the Day of Resurrection, a caller will caller during the horrors of that day: ‘O Muhammad! The best of grandfathers is your grandfather Ibrahim the Friend of the Merciful, and the best of brothers is your brother `Ali b. Abi Talib. O Fatima! `Ali will assist me with the keys of Paradise, and his Shi`a are the winners in Paradise anon on the Day of Resurrection.” When I said that, he said: “O my son! Where are you from?” I said: “From the people of Kufa.” He said: “Are you an Arab or are you a client?” I said: “Rather, I am an Arab.” He said: So, he gowned me in thirty robes, and he gave me ten thousand silver coins. Then, he said: “O youth! You have brought joy to my eye, and I need something from you.” I said: “I will fulfill it, God-willingly.” He said: “Tomorrow morning, go to the mosque of the family of so-and-so, and you will see my brother who hates `Ali .” He said: That night was long for me. When I awoke, I went to the mosque that he described to me, and I stood in the row. Then, I saw a turbaned youth. He went to bow, and the turban fell. So, I looked at his face, and his head looked like the head of a pig, and his face looked like the face of a pig. By Allah, I did not know what was said in my prayer until the imam finished. So, I said: “Woe to you! What is that which I see in you?” So, he wept and said to me: “Look at this house.” So, I looked, and he said to me: “Enter it.” So, I entered it. Then, he said to me: “I was a mu’adhin for the so-and-so family. Whenever I awoke, I would curse `Ali one thousand times between the call to prayer and the iqama. On Fridays, I would curse him four thousand times. I left my place and went to my house and I reclined on this bench that you see. Then, I saw in my dream that I was in Paradise. Therein were the Messenger of Allah (s) and `Ali , and they were happy. I saw as though to the right of the Prophet (s) was al-Hasan and to his left was al-Husayn. With him was a vessel, so, he said: ‘O Hasan! Pour for me.’ So, he poured for him. Then, he said: ‘Drink’ to the group, so they drank from it. Then, I saw that it was as though he had said: ‘Give drink to the one who is reclining on this bench.’ So, al-Hasan  said to him: ‘O grandfather! You have ordered me to give drink to this one when he would curse my father one thousand times every day between the call to prayer and the iqama and curse him on this day four thousand times between the call to prayer and the iqama!’ So, the Prophet (S) came to me and said to me: ‘Malik – may Allah curse you – you curse `Ali even though `Ali is from me, and you insult `Ali even though `Ali is from me.’ I saw as though he had spat in my face. He struck me with his leg, and he said: ‘Stand up. May Allah change His blessing in you.’ So, I awoke from my sleep, and my head was like the head of a pig, and my face was like the face of a pig.’” Then, Abu Ja`far the commander of the faithful said to me: Is this hadith in your possession? So, I said: No. So, he said: O Sulayman! Love for `Ali is faith and hatred for him is hypocrisy. By Allah, none love him except a believer, and none hate him except a hypocrite. He said: I said: Do you promise me safety, O commander of the faithful? He said: You are safe. I said: So, what do you say about the killer of al-Husayn ? He said: He is going to the Fire and he is in the Fire. I said: It is the same for one who kills a descendant of the Messenger of Allah (s) – he is going to the Fire and he is in the Fire. He said: Rulership has no blood-bonds. Go and narrate what you have heard.",
          "Grading": [
            {
              "English Grade": "Acceptable",
              "Arabic Grade": "",
              "Scholar": null,
              "Book": null
            },
            {
              "English Grade": "Acceptable",
              "Arabic Grade": "",
              "Scholar": null,
              "Book": null
            },
            {
              "English Grade": "Acceptable",
              "Arabic Grade": "",
              "Scholar": null,
              "Book": null
            },
            {
              "English Grade": "Acceptable",
              "Arabic Grade": "",
              "Scholar": null,
              "Book": null
            }
          ]
        }
      }
    }
  }
}